Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/imagej.po
Languages: de, es

source: I know I'm not alone in being confused, since this has been the subject of a [long discussion on the image.sc forum](https://forum.image.sc/t/auto-threshold-calculation-and-bright-and-contrast-auto-adjust-issue/19301). So the main message is: be aware that binning happens, and keep on the lookout for any unexpected effects that the brightness/contrast sliders might sneakily have on thresholding.
de: Ich weiß, dass ich nicht der Einzige bin, der verwirrt ist, denn dies war das Thema einer [langen Diskussion im image.sc-Forum] (https://forum.image.sc/t/auto-threshold-calculation-and-bright-and-contrast-auto-adjust-issue/19301). Die wichtigste Botschaft lautet also: Seien Sie sich bewusst, dass Binning stattfindet, und halten Sie Ausschau nach unerwarteten Auswirkungen, die die Helligkeits-/Kontrastregler heimlich auf die Schwellenwertbildung haben könnten.
es: Sé que no soy el único que está confundido, ya que este ha sido el tema de una [larga discusión en el foro image.sc](https://forum.image.sc/t/auto-threshold-calculation-and-bright-and-contrast-auto-adjust-issue/19301). Entonces, el mensaje principal es: ten en cuenta que se produce binning y esta atento a cualquier efecto inesperado que los controles deslizantes de brillo/contraste puedan tener furtivamente en el umbral.

source: Explore setting thresholds with and without {guilabel}`Don't reset range` selected for the image {menuselection}`File --> Open Samples --> M51 Galaxy (16-bits)`, and pressing the {guilabel}`Auto` button to determine a threshold.
de: Untersuchen Sie die Einstellung von Schwellenwerten mit und ohne {guilabel}"Bereich nicht zurücksetzen" für das Bild {menuselection}"Datei --&gt; Samples öffnen --&gt; M51 Galaxy (16-Bit)", und drücken Sie die Taste {guilabel}"Auto", um einen Schwellenwert zu bestimmen.
es: Explora configurar los umbrales con y sin {guilabel}`Don't reset range` seleccionado para la imagen {menuselection}`File --> Open Samples --> M51 Galaxy (16-bits)`, y presionando el botón {guilabel}`Auto` para determinar un umbral.

source: Keep {menuselection}`Image --> Adjust --> Brightness/Contrast...` open as you explore, so you can make adjustments before calculating the thresholds.
de: Lassen Sie {menuselection}`Bild --&gt; Anpassen --&gt; Helligkeit/Kontrast...` während der Untersuchung geöffnet, damit Sie Anpassungen vornehmen können, bevor Sie die Schwellenwerte berechnen.
es: Manten {menuselection}`Image --> Adjust --> Brightness/Contrast...` abierto mientras exploras, para que puedas realizar ajustes antes de calcular los umbrales.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/c5d2075777c458c70c69a1f2c8b37391)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/c5d2075777c458c70c69a1f2c8b37391)

source: This image shows a potential use of the {guilabel}`Don't reset range` option -- used cautiously.
de: Dieses Bild zeigt eine mögliche Verwendung der Option {guilabel}"Bereich nicht zurücksetzen", die mit Bedacht eingesetzt wird.
es: Esta imagen muestra un uso potencial de la opción {guilabel}`Don't reset range`: usada con precaución.

source: Thresholding a 16-bit image with and without 'Don't reset range' selected.
de: Schwellenwertbildung eines 16-Bit-Bildes mit und ohne die Option "Bereich nicht zurücksetzen".
es: Umbral de una imagen de 16 bits con y sin 'Don't reset range' seleccionado.

source: What are the implications of using a 256-bin histogram for thresholding a 32-bit image?
de: Welche Auswirkungen hat die Verwendung eines 256-Bin-Histogramms für das Thresholding eines 32-Bit-Bildes?
es: ¿Cuáles son las implicaciones de utilizar un histograma de 256 bins para establecer el umbral de una imagen de 32 bits?

source: In particular, how might any outlier pixels affect the accuracy with which you can define a threshold -- automatically or manually?
de: Wie könnten sich insbesondere Ausreißerpixel auf die Genauigkeit auswirken, mit der Sie einen Schwellenwert definieren können - automatisch oder manuell?
es: En particular, ¿cómo podrían los píxeles atípicos afectar la precisión con la que se puede definir un umbral, automática o manualmente?

source: To explore this, you can use the extreme example of *cell_outlier.tif* along with the {menuselection}`Image --> Adjust --> Threshold...` command.
de: Um dies zu erkunden, können Sie das extreme Beispiel *cell_outlier.tif* zusammen mit dem Befehl {menuselection}`Bild --&gt; Anpassen --&gt; Schwellenwert...` verwenden.
es: Para explorar esto, puedes usar el ejemplo extremo de *cell_outlier.tif* junto con el comando {menuselection}`Image --> Adjust --> Threshold...`.

source: How could you (manually) reduce the impact of any problems you find?
de: Wie könnten Sie (manuell) die Auswirkungen der von Ihnen gefundenen Probleme verringern?
es: ¿Cómo podrías reducir (manualmente) el impacto de cualquier problema que encuentres?

source: **Note:** {menuselection}`Analyze --> Histogram` lets you investigate the image histogram with different numbers of bins -- but any changes you make here will not be reflected in the histogram actually used for thresholding.
de: **Hinweis:** {menuselection}"Analysieren --&gt; Histogramm" ermöglicht es Ihnen, das Bildhistogramm mit einer unterschiedlichen Anzahl von Bins zu untersuchen - aber alle Änderungen, die Sie hier vornehmen, spiegeln sich nicht im Histogramm wider, das tatsächlich für das Thresholding verwendet wird.
es: **Nota:** {menuselection}`Analyze --> Histogram` te permite investigar el histograma de la imagen con diferentes números de contenedores, pero cualquier cambio que realices aquí no se reflejará en el histograma realmente utilizado para el umbral.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/cell_outlier.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/cell_outlier.tif)

source: First, a positive implication of using a 256-bit histogram for thresholding is that it can be fast: more bins add to the computations involved. Also, creating too many bins has the result of making most of them zero -- potentially causing some automated threshold-determination algorithms to fail.
de: Eine positive Auswirkung der Verwendung eines 256-Bit-Histogramms für die Schwellenwertberechnung ist, dass es schnell sein kann: mehr Bins erhöhen den Berechnungsaufwand. Die Erstellung zu vieler Bins hat außerdem zur Folge, dass die meisten Bins auf Null gesetzt werden, was dazu führen kann, dass einige automatische Algorithmen zur Bestimmung von Schwellenwerten fehlschlagen.
es: Primero, una implicación positiva del uso de un histograma de 256 bits para el umbral es que puede ser rápido: se agregan más contenedores o bins a los cálculos involucrados. Además, crear demasiados contenedores tiene como resultado que la mayoría de ellos sean cero, lo que podría causar que algunos algoritmos automatizados de determinación de umbrales fallen.

source: A negative implication is that using 256 bins means that only 256 different thresholds are possible: that is, if your image range is 0–25500, then the thresholds you could get are 0, 100, 200, ... 25500. If the optimal threshold is really 150, this will not be found. But usually if your range of pixel values is this large, you do not need a very fine-grained threshold for acceptable results anyway.
de: Eine negative Auswirkung ist, dass die Verwendung von 256 Bins bedeutet, dass nur 256 verschiedene Schwellenwerte möglich sind: Das heißt, wenn Ihr Bildbereich 0-25500 ist, dann sind die möglichen Schwellenwerte 0, 100, 200, ... 25500. Wenn der optimale Schwellenwert wirklich 150 ist, wird er nicht gefunden. Aber wenn der Bereich der Pixelwerte so groß ist, brauchen Sie in der Regel keinen sehr feinkörnigen Schwellenwert für akzeptable Ergebnisse.
es: Una implicación negativa es que usar 256 contenedores significa que sólo son posibles 256 umbrales diferentes: es decir, si el rango de tu imagen es 0–25500, entonces los umbrales que podrías obtener son 0, 100, 200, ... 25500. Si el umbral óptimo es realmente 150, esto no se encontrará. Pero, por lo general, si tu rango de valores de píxeles es tan grande, de todos modos no necesitas un umbral muy detallado para obtener resultados aceptables.

source: This changes if you have outliers. A single extreme pixel -- which might occur when a pixel in a CCD camera is somehow 'broken' -- can cause most other pixels in the image to be squeezed into only a few bins. Then the histogram resolution might really be too small for reasonable thresholding.
de: Dies ändert sich, wenn es Ausreißer gibt. Ein einzelnes extremes Pixel - das z. B. auftreten kann, wenn ein Pixel in einer CCD-Kamera irgendwie "kaputt" ist - kann dazu führen, dass die meisten anderen Pixel im Bild in nur ein paar Bins gequetscht werden. In diesem Fall ist die Auflösung des Histogramms möglicherweise wirklich zu gering für eine vernünftige Schwellenwertbildung.
es: Esto cambia si tienes valores atípicos. Un solo píxel extremo, que puede ocurrir cuando un píxel de una cámara CCD está de alguna manera "roto", puede causar que la mayoría de los demás píxeles de la imagen queden comprimidos en sólo unos pocos contenedores. Entonces, la resolución del histograma podría ser demasiado pequeña para establecer un umbral razonable.

source: It's a sufficiently obscure problem that hopefully it won't bother you. However, if you do experience the issue then two possible ways to overcome it are:
de: Es handelt sich um ein hinreichend obskures Problem, das Sie hoffentlich nicht stören wird. Falls das Problem dennoch auftritt, gibt es zwei Möglichkeiten, es zu lösen:
es: Es un problema suficientemente 'oscuro' que, con suerte, no te molestará. Sin embargo, si te encuentras con el problema, hay dos formas posibles de solucionarlo:

source: Adjust the brightness/contrast sliders and ensure that {guilabel}`Don't reset range` **is** selected. This is the benefit of the option existing.
de: Stellen Sie die Schieberegler für Helligkeit/Kontrast ein und vergewissern Sie sich, dass {guilabel}"Bereich nicht zurücksetzen" **ausgewählt ist**. Dies ist der Vorteil der vorhandenen Option.
es: Ajusta los controles deslizantes de brillo/contraste y asegúrate de que {guilabel}`Don't reset range` ** esté** seleccionado. Este es el beneficio de la opción existente.

source: Convert the image to 8-bit manually yourself. This allows you to effectively choose the range of the histogram bins (using {menuselection}`Brightness/Contrast...`; see {ref}`Types & bit-depths<sec_bit_depths_converting>`) Since the threshold is made using 256 bins, you are not really losing any information that was not going to be lost anyway.
de: Wandeln Sie das Bild selbst manuell in 8-Bit um. Auf diese Weise können Sie den Bereich der Histogramm-Bins effektiv auswählen (mit {menuselection}`Helligkeit/Kontrast...`; siehe {ref}`Typen &amp; Bittiefen<sec_bit_depths_converting>`) Da der Schwellenwert mit 256 Bins erstellt wird, gehen keine Informationen verloren, die ohnehin nicht verloren gehen würden.
es: Convierte la imagen a 8 bits manualmente tu mismo/a. Esto te permite elegir efectivamente el rango de los contenedores de histograma (usando {menuselection}`Brightness/Contrast...`; ver {ref}`Types & bit-depths<sec_bit_depths_converting>`) Dado que el umbral se establece utilizando 256 contenedores, en realidad no se está perdiendo ninguna información que no se iba a perder de todos modos.
