Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/imagej.po
Languages: de, es

source: ImageJ: Thresholding
de: ImageJ: Schwellenwertbildung

source: Introduction
de: Einführung
es: Introducción

source: Here, we will explore some ImageJ's methods to apply thresholds to images, generating binary images, labeled images and ROIs. We will also confront some of the associated complications.
de: Hier werden wir einige ImageJ-Methoden zur Anwendung von Schwellenwerten auf Bilder erkunden und binäre Bilder, beschriftete Bilder und ROIs erzeugen. Wir werden uns auch mit einigen der damit verbundenen Komplikationen auseinandersetzen.
es: Aquí, exploraremos algunos métodos de ImageJ para aplicar umbrales a imágenes, generando imágenes binarias, imágenes etiquetadas y ROI. También afrontaremos algunas de las complicaciones asociadas.

source: Global thresholding
de: Globale Schwellenwertbildung
es: Umbral global

source: The main thresholding command in ImageJ is {menuselection}`Image --> Adjust --> Threshold...`, with the shortcut {kbd}`Shift+T`.
de: Der Hauptbefehl für die Schwellenwertberechnung in ImageJ ist {menuselection}"Bild --&gt; Anpassen --&gt; Schwellenwert...", mit dem Tastaturkürzel {kbd}"Umschalt+T".
es: El comando de umbral principal en ImageJ es {menuselection}`Image --> Adjust --> Threshold...`, con el atajo {kbd}`Shift+T`.

source: This opens a *Threshold* dialog that allows you to identify pixels above a threshold, below a threshold, or falling between two thresholds. These options are controlled using a combination of the threshold sliders and the {guilabel}`Dark background` checkbox. There is also a drop-down menu allowing you to select from a list of automated thresholding methods.
de: Es öffnet sich ein Dialogfeld *Schwellenwert*, in dem Sie Pixel identifizieren können, die über einem Schwellenwert, unter einem Schwellenwert oder zwischen zwei Schwellenwerten liegen. Diese Optionen werden durch eine Kombination aus den Schwellenwert-Schiebereglern und dem Kontrollkästchen {guilabel}"Dunkler Hintergrund" gesteuert. Es gibt auch ein Dropdown-Menü, mit dem Sie aus einer Liste automatischer Schwellenwertmethoden auswählen können.
es: Esto abre un cuadro de diálogo *Threshold* o *Umbral* que le permite identificar píxeles por encima de un umbral, por debajo de un umbral o que se encuentran entre dos umbrales. Estas opciones se controlan mediante una combinación de los controles deslizantes de umbral y la casilla de verificación {guilabel}`Dark background`. También hay un menú desplegable que te permite seleccionar de una lista de métodos de umbral automatizados.

source: During preview, the pixels that are considered foreground are shown in red by default (it's possible to change this, but I never do). After choosing suitable thresholds, pressing {guilabel}`Apply` produces a binary image. This replaces the original, so it may be wise to duplicate the image first.
de: Während der Vorschau werden die Pixel, die als Vordergrund betrachtet werden, standardmäßig in Rot angezeigt (es ist möglich, dies zu ändern, aber ich tue es nie). Nach der Auswahl geeigneter Schwellenwerte wird durch Drücken von {guilabel}"Anwenden" ein Binärbild erzeugt. Dieses ersetzt das Original, weshalb es ratsam sein kann, das Bild zunächst zu duplizieren.
es: Durante la vista previa, los píxeles que se consideran en primer plano se muestran en rojo de forma predeterminada (es posible cambiar esto, pero yo nunca lo hago). Después de elegir los umbrales adecuados, presionar {guilabel}`Apply` produce una imagen binaria. Esto reemplaza el original, por lo que es conveniente duplicar la imagen primero.

source: Binary images in ImageJ
de: Binäre Bilder in ImageJ
es: Imágenes binarias en ImageJ

source: Although only one 1 bit is really needed for each pixel in a binary image, the implementation in ImageJ currently uses 8 bits -- and so the actual pixel values allowed are 0 and 255. To complicate matters, ImageJ also permits _either_ of these to represent the foreground, with the choice hidden away under {menuselection}`Process --> Binary --> Options...`, and 0 taken to be 'black' and 255 'white'. Personally, I prefer for white to represent the foreground (i.e. the interesting things we have detected), and so I will assume that the {guilabel}`Black background` option has been checked.
de: Obwohl für jedes Pixel in einem binären Bild eigentlich nur ein 1-Bit benötigt wird, verwendet die Implementierung in ImageJ derzeit 8 Bits - und so sind die tatsächlich zulässigen Pixelwerte 0 und 255. Um die Sache zu verkomplizieren, erlaubt ImageJ auch _beide_ dieser Werte, um den Vordergrund darzustellen, wobei die Auswahl unter {menuselection}`Process --&gt; Binary --&gt; Options...` versteckt ist, und 0 als "schwarz" und 255 als "weiß" angesehen wird. Ich persönlich ziehe es vor, dass Weiß den Vordergrund darstellt (d.h. die interessanten Dinge, die wir entdeckt haben), und nehme daher an, dass die Option {guilabel}`Schwarzer Hintergrund` aktiviert wurde.
es: Aunque realmente solo se necesita un bit para cada píxel en una imagen binaria, la implementación en ImageJ actualmente usa 8 bits, por lo que los valores de píxeles reales permitidos son 0 y 255. Para complicar las cosas, ImageJ también permite que cualquiera de estos represente en primer plano, con la opción oculta en {menuselection}`Process --> Binary --> Options...`, y 0 se considera 'negro' y 255 'blanco' . Personalmente, prefiero que el blanco represente el primer plano (es decir, las cosas interesantes que hemos detectado), por lo que asumiré que la opción {guilabel}`Black background` ha sido marcada.

source: Nevertheless, you should be aware that this convention is not adopted universally. Furthermore, if you choose {guilabel}`Invert LUT` then the colors are flipped anyway – so yet more confusion arises. Therefore if you find that any processing of binary images gives odd results, be sure to check the binary options and LUT status.
de: Sie sollten sich jedoch darüber im Klaren sein, dass diese Konvention nicht überall angewendet wird. Wenn Sie {guilabel}"LUT invertieren" wählen, werden die Farben sowieso gespiegelt, was noch mehr Verwirrung stiftet. Wenn Sie also feststellen, dass die Verarbeitung von Binärbildern seltsame Ergebnisse liefert, sollten Sie die Binäroptionen und den LUT-Status überprüfen.
es: Sin embargo, debes tener en cuenta que esta convención no se adopta universalmente. Además, si eliges {guilabel}`Invert LUT`, los colores se invierten de todos modos, por lo que surge aún más confusión. Por lo tanto, si descubre que cualquier procesamiento de imágenes binarias produce resultados extraños, asegúrese de verificar las opciones binarias y el estado de LUT.

source: The *Threshold* dialog is good for interactively exploring different automated thresholding methods, but it can be hard to systematically compare them. {menuselection}`Image --> Adjust --> Auto Threshold...` helps with this, by providing an option to try *all* of the methods.
de: Das Dialogfeld *Schwellenwert* ist gut geeignet, um verschiedene automatische Schwellenwertmethoden interaktiv zu erkunden, aber es kann schwierig sein, sie systematisch zu vergleichen. {menuselection} Die Funktion "Bild --&gt; Anpassen --&gt; Automatischer Schwellenwert" hilft dabei, indem sie eine Option zum Ausprobieren *aller* Methoden bietet.
es: El cuadro de diálogo *Umbral* es bueno para explorar interactivamente diferentes métodos de umbralización automatizados, pero puede resultar difícil compararlos sistemáticamente. {menuselection}`Image --> Adjust --> Auto Threshold...` ayuda con esto, proporcionando una opción para probar *todos* los métodos.

source: Applying this to ImageJ's famous *blobs.gif* reveals that not all methods work equally well:
de: Die Anwendung dieses Verfahrens auf das berühmte *blobs.gif* von ImageJ zeigt, dass nicht alle Methoden gleich gut funktionieren:
es: Aplicar esto al famoso *blobs.gif* de ImageJ revela que no todos los métodos funcionan igual de bien:

source: Automated threshold methods
de: Automatisierte Schwellenwertverfahren
es: Métodos de umbral automatizados

source: The various automated thresholds are described at https://imagej.net/Auto_Threshold, often with references to the original published papers upon which they are based.
de: Die verschiedenen automatischen Schwellenwerte werden unter https://imagej.net/Auto_Threshold beschrieben, oft mit Verweisen auf die veröffentlichten Originalarbeiten, auf denen sie beruhen.
es: Los diversos umbrales automatizados se describen en https://imagej.net/Auto_Threshold, a menudo con referencias a los artículos originales publicados en los que se basan.

source: Creating objects
de: Objekte erstellen
es: Creando objetos

source: Once we have a binary image, the next step is to identify objects for further exploration.
de: Sobald wir ein binäres Bild haben, besteht der nächste Schritt darin, Objekte für die weitere Untersuchung zu identifizieren.
es: Una vez que tenemos una imagen binaria, el siguiente paso es identificar objetos para una mayor exploración.

source: Generating & measuring ROIs
de: Generierung und Messung von ROIs
es: Generar y medir ROIs

source: ROIs are a good way to represent objects in ImageJ, because they are easy to measure. In 2D, there are several options to generate ROIs from a thresholded image, each with slightly different applications:
de: ROIs sind eine gute Möglichkeit, Objekte in ImageJ darzustellen, da sie leicht zu messen sind. In 2D gibt es mehrere Optionen zur Erzeugung von ROIs aus einem mit Schwellenwerten versehenen Bild, die jeweils leicht unterschiedliche Anwendungen haben:
es: Los ROIs son una buena forma de representar objetos en ImageJ porque son fáciles de medir. En 2D, existen varias opciones para generar ROIs a partir de una imagen con umbral, cada una con aplicaciones ligeramente diferentes:

source: Click on an object with the *Wand tool* <img src="../../../images/imagej/icons/wand.png" /> -- this is good for interactively choosing one connected region.
de: Klicken Sie mit dem *Werkzeug* <img src="../../../images/imagej/icons/wand.png" /> auf ein Objekt, um interaktiv einen zusammenhängenden Bereich auszuwählen.
es: Haz clic en un objeto con la *Wand tool* <img src="../../../images/imagej/icons/wand.png" />; esto es bueno para elegir interactivamente una región conectada.

source: {menuselection}`Edit --> Selection --> Create Selection` -- this makes a single ROI containing all the foreground pixels. Disconnected regions can be separated by adding the ROI to the *ROI Manager* and choosing {guilabel}`More >> Split`.
de: {menuselection}Bearbeiten --&gt; Auswahl --&gt; Auswahl erstellen" - dies erzeugt eine einzelne ROI, die alle Vordergrundpixel enthält. Getrennte Regionen können getrennt werden, indem die ROI zum *ROI-Manager* hinzugefügt und {guilabel}"Mehr &gt;&gt; Teilen" gewählt wird.
es: {menuselection}`Edit --> Selection --> Create Selection`: esto crea un único retorno de la inversión que contiene todos los píxeles de primer plano. Las regiones desconectadas se pueden separar agregando el ROI al *Administrador de ROI* y eligiendo {guilabel}`More >> Split`.

source: {menuselection}`Analyze --> Analyze Particles...` -- this detects and measures all the foreground regions as individual objects, optionally filtering out objects based on shape or area.
de: {menuselection}Analysieren --&gt; Partikel analysieren..." - dies erkennt und misst alle Vordergrundregionen als einzelne Objekte und filtert optional Objekte aufgrund ihrer Form oder Fläche heraus.
es: {menuselection}`Analyze --> Analyze Particles...`: esto detecta y mide todas las regiones de primer plano como objetos individuales, opcionalmente filtrando objetos según su forma o área.

source: Creating ROIs without applying a threshold
de: Erstellen von ROIs ohne Anwendung eines Schwellenwerts
es: Crear ROIs sin aplicar un umbral

source: The *Wand tool* <img src="../../../images/imagej/icons/wand.png" />, {menuselection}`Edit --> Selection --> Create Selection` & {menuselection}`Analyze --> Analyze Particles...` can also be used when a threshold is being previewed on an image, but it has not yet been converted to binary. Therefore you may not need to press {guilabel}`Apply` in the *Threshold* dialog at all.
de: Das *Werkzeug* <img src="../../../images/imagej/icons/wand.png" />, {menuselection}`Bearbeiten --&gt; Auswahl --&gt; Auswahl erstellen` &amp; {menuselection}`Analysieren --&gt; Partikel analysieren...` kann auch verwendet werden, wenn ein Schwellenwert für ein Bild in der Vorschau angezeigt wird, aber noch nicht in das Binärformat konvertiert wurde. Daher müssen Sie im Dialogfeld *Schwellenwert* möglicherweise gar nicht auf {guilabel}"Anwenden" drücken.
es: La *Wand tool* <img src="../../../images/imagej/icons/wand.png" />, {menuselection}`Edit --> Selection --> Create Selection` & {menuselection}`Analyze --> Analyze Particles...` también se puede utilizar cuando se obtiene una vista previa de un umbral en una imagen, pero aún no se ha convertido a binario. Por lo tanto, es posible que no necesite presionar {guilabel}`Apply` en el cuadro de diálogo *Threshold*.

source: In fact, because it's not 100% clear whether black or white pixels represent the foreground in an ImageJ binary image, I tend to set a threshold even on an image that *is* already binary. That way I can visualize what any of these commands will treat as foreground: with the default thresholding display, the foreground is highlighted in red.
de: Da es nicht zu 100 % klar ist, ob schwarze oder weiße Pixel den Vordergrund in einem binären ImageJ-Bild darstellen, neige ich dazu, einen Schwellenwert festzulegen, selbst bei einem Bild, das bereits binär *ist*. Auf diese Weise kann ich visualisieren, was jeder dieser Befehle als Vordergrund behandelt: Bei der Standardschwellenwertanzeige wird der Vordergrund rot hervorgehoben.
es: De hecho, debido a que no está 100% claro si los píxeles blancos o negros representan el primer plano en una imagen binaria de ImageJ, tiendo a establecer un umbral incluso en una imagen que *es* ya binaria. De esa manera puedo visualizar lo que cualquiera de estos comandos tratará como primer plano: con la visualización de umbral predeterminada, el primer plano está resaltado en rojo.

source: I like the fact that {menuselection}`Edit --> Selection --> Create Selection` provides a very quick way to convert a thresholded region to a single ROI. I most often use it in combination with {menuselection}`Edit --> Selection --> Restore Selection` to visualize what has been detected on top of another image. I might not necessarily *use* the single ROI for measurements in the end, but it can be very good for orientation.
de: Mir gefällt die Tatsache, dass {menuselection}`Bearbeiten --&gt; Auswahl --&gt; Auswahl erstellen` eine sehr schnelle Möglichkeit bietet, eine mit Schwellenwerten versehene Region in eine einzelne ROI umzuwandeln. Ich verwende es meistens in Kombination mit {menuselection}`Bearbeiten --&gt; Auswahl --&gt; Auswahl wiederherstellen`, um zu visualisieren, was über einem anderen Bild erkannt wurde. Ich muss die einzelne ROI nicht unbedingt für Messungen *verwenden*, aber sie kann sehr gut zur Orientierung dienen.
es: Me gusta el hecho de que {menuselection}`Edit --> Selection --> Create Selection` proporciona una forma muy rápida de convertir una región con umbral en un único retorno de la inversión. Lo uso más a menudo en combinación con {menuselection}`Edit --> Selection --> Restore Selection` para visualizar lo que se ha detectado encima de otra imagen. Puede que al final no necesariamente *use* el ROI único para las mediciones, pero puede ser muy bueno para orientarme.

source: When you want to measure multiple objects quickly, {menuselection}`Analyze --> Analyze Particles...` is arguably the most automated and versatile option. Its various options also make it possible to ignore regions that are particularly small or large, straight or round (using a {guilabel}`Circularity` metric). It can output summary results and add ROIs for each region to the *ROI Manager*.
de: Wenn Sie mehrere Objekte schnell messen wollen, ist {menuselection}"Analysieren --&gt; Partikel analysieren" die wohl automatisierteste und vielseitigste Option. Die verschiedenen Optionen ermöglichen es auch, Regionen zu ignorieren, die besonders klein oder groß, gerade oder rund sind (unter Verwendung einer {guilabel}`Circularity`-Metrik). Sie kann zusammenfassende Ergebnisse ausgeben und ROIs für jede Region in den *ROI Manager* einfügen.
es: Cuando desees medir varios objetos rápidamente, {menuselection}`Analyze --> Analyze Particles...` es posiblemente la opción más automatizada y versátil. Sus diversas opciones también permiten ignorar regiones que son particularmente pequeñas o grandes, rectas o redondas (usando una métrica {guilabel} `Circularity`). Puedes generar resultados resumidos y agregar ROIs para cada región al *ROI Manager*.

source: Redirecting measurements
de: Umleitung von Messungen
es: Redirigir medidas

source: Although binary images can show the shapes of things to be measured, pixel intensity measurements made on a binary image are not very helpful. You could use the above techniques to make ROIs from binary images, then apply those to the original image to get meaningful measurements.
de: Obwohl Binärbilder die Formen der zu messenden Dinge zeigen können, sind Messungen der Pixelintensität auf einem Binärbild nicht sehr hilfreich. Sie können die oben genannten Techniken verwenden, um ROIs aus Binärbildern zu erstellen und diese dann auf das Originalbild anzuwenden, um aussagekräftige Messungen zu erhalten.
es: Aunque las imágenes binarias pueden mostrar las formas de los objetos que se van a medir, las mediciones de intensidad de píxeles realizadas en una imagen binaria no son muy útiles. Puedes utilizar las técnicas anteriores para crear ROIs a partir de imágenes binarias y luego aplicarlas a la imagen original para obtener mediciones significativas.

source: It's possible to do this by changing the {guilabel}`Redirect to:` option under {menuselection}`Analyze --> Set Measurements...`, which redirects measurements to be made on a specific image. Setting a redirection image before running {menuselection}`Analyze --> Analyze Particles...` means that the ROI 'particles' can be detected on one image and measured on a different image
de: Es ist möglich, dies zu tun, indem man die Option {guilabel}`Umleiten zu:` unter {menuselection}`Analysieren --&gt; Messungen einstellen...` ändert, die die Messungen auf ein bestimmtes Bild umleitet. Die Einstellung eines Umleitungsbildes vor der Ausführung von {menuselection}`Analyze --&gt; Analyze Particles...` bedeutet, dass die ROI 'Partikel' auf einem Bild erkannt und auf einem anderen Bild gemessen werden können.
es: Es posible hacer esto cambiando la opción {guilabel}`Redirect to:` en {menuselection}`Analyze --> Set Measurements. .`, que redirige las mediciones a realizar sobre una imagen específica. Configurar una imagen de redirección antes de ejecutar {menuselection}`Analyze --> Analyze Particles...` significa que las 'partículas' de ROI se pueden detectar en una imagen y medir en una imagen diferente.

source: I don't usually recommend this, since I imagine I might forget to reset the {guilabel}`Redirect to:` option when I am done. I'd rather add my ROIs to the *ROI Manager* and transfer them that way.
de: Normalerweise empfehle ich dies nicht, da ich mir vorstellen kann, dass ich vergessen könnte, die Option {guilabel}`Umleiten nach:` zurückzusetzen, wenn ich fertig bin. Ich füge meine ROIs lieber dem *ROI Manager* hinzu und übertrage sie auf diese Weise.
es: Normalmente no recomiendo esto, ya que imagino que podría olvidarme de restablecer la opción {guilabel}`Redirect to:` cuando termine. Prefiero agregar mis ROIs al *ROI Manager* y transferirlos de esa manera.

source: Caution with holey ROIs
de: Vorsicht bei löchrigen ROIs
es: Precaución con ROIs con agujeros

source: Historically, there has been a problem with my preferred approach to use the *ROI Manager* output from {menuselection}`Analyze --> Analyze Particles...`.
de: In der Vergangenheit gab es ein Problem mit dem von mir bevorzugten Ansatz, die *ROI Manager*-Ausgabe von {menuselection}`Analysieren --&gt; Partikel analysieren...` zu verwenden.
es: Históricamente, ha habido un problema con mi enfoque preferido para usar la salida del *ROI Manager* de {menuselection}`Analyze --> Analyze Particles...`.

source: It seems that {menuselection}`Analyze Particles...` handles holes correctly when making measurements by itself, but by default it would generate ROIs that lacked holes. This meant that if you would measure the ROIs later you could get different results, because the ROIs included extra pixels that were actually excluded (as holes) in the thresholded image.
de: Es scheint, dass {menuselection}`Analyze Particles...` Löcher korrekt behandelt, wenn es selbst Messungen durchführt, aber standardmäßig würde es ROIs erzeugen, die keine Löcher enthielten. Dies bedeutete, dass man bei einer späteren Messung der ROIs andere Ergebnisse erhalten konnte, weil die ROIs zusätzliche Pixel enthielten, die im mit Schwellenwerten versehenen Bild eigentlich ausgeschlossen waren (als Löcher).
es: Parece que {menuselection}`Analyze Particles...` maneja los agujeros correctamente al realizar mediciones por sí solo, pero de forma predeterminada generaría ROIs que carecían de agujeros. Esto significaba que si midiera los ROIs más adelante podría obtener resultados diferentes, porque los ROIs incluían píxeles adicionales que en realidad estaban excluidos (como agujeros) en la imagen con umbral.

source: Different results when using {menuselection}`Analyze --> Analyze Particles...` directly, and then subsequently measuring the ROI that it generated. The image is binary, so the mean value should be 255 if only the above-threshold pixels are measured.
de: Unterschiedliche Ergebnisse bei direkter Verwendung von {menuselection}`Analyze --&gt; Analyze Particles...` und anschließender Messung der dadurch erzeugten ROI. Das Bild ist binär, daher sollte der Mittelwert 255 sein, wenn nur die Pixel oberhalb des Schwellenwerts gemessen werden.
es: Resultados diferentes al usar {menuselection}`Analyze --> Analyze Particles...` directamente y luego medir el ROI que generó. La imagen es binaria, por lo que el valor medio debe ser 255 si solo se miden los píxeles por encima del umbral.

source: **However**, there is a solution -- which I only learned when writing about it here. Since ImageJ v1.53g, there is a {guilabel}`Composite ROIs` checkbox when using {menuselection}`Analyze Particles...`. If this is turned **on**, then ROIs with holes are generated as expected.
de: **Es gibt jedoch eine Lösung, die ich erst erfuhr, als ich hier darüber schrieb. Seit ImageJ v1.53g gibt es ein {guilabel}"Composite ROIs" Kontrollkästchen, wenn man {menuselection}"Analyze Particles..." benutzt. Wenn diese Option **eingeschaltet** ist, werden wie erwartet ROIs mit Löchern erzeugt.
es: **Sin embargo**, hay una solución, que solo descubrí cuando escribí sobre ella aquí. Desde ImageJ v1.53g, hay una casilla de verificación {guilabel}`Composite ROIs` cuando se utiliza {menuselection}`Analyze Particles...`. Si esto está activado **, las ROIs con agujeros se generan como se esperaba.

source: Fixing the problem with holey regions by using {guilabel}`Composite ROIs`.
de: Behebung des Problems löchriger Regionen durch Verwendung von {guilabel}`Composite ROIs`.
es: Solucionar el problema con las regiones con agujeros mediante el uso de {guilabel}`Composite ROIs`.
