Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/imagej.po
Languages: de, es

source: This demonstrates the need to be cautious with any image analysis software, and to check out the various options associated with even common commands. They aren't *always* doing what you might expect.
de: Dies zeigt, dass man bei jeder Bildanalysesoftware vorsichtig sein muss und die verschiedenen Optionen, die sogar mit den üblichen Befehlen verbunden sind, überprüfen sollte. Sie tun *nicht* immer das, was man erwartet.
es: Esto demuestra la necesidad de tener cuidado con cualquier software de análisis de imágenes y de comprobar las diversas opciones asociadas incluso con los comandos más comunes. No *siempre* están haciendo lo que cabría esperar.

source: Generating labeled images
de: Generierung beschrifteter Bilder
es: Generando imágenes etiquetadas

source: ROIs are not the only way to represent image objects: sometimes labeled images are more useful.
de: ROIs sind nicht die einzige Möglichkeit, Bildobjekte darzustellen: Manchmal sind beschriftete Bilder nützlicher.
es: Los ROI no son la única forma de representar objetos de imagen: a veces las imágenes etiquetadas son más útiles.

source: {menuselection}`Analyze --> Analyze Particles...` can generate labeled images by using the {guilabel}`Show: Count Masks` option. This will generate a new image in which each pixel has a unique integer value indicating the number of the object it is part of -- or zero if it is in the background. With a suitably colorful LUT (often {menuselection}`Image --> Lookup Tables --> Glasbey`), this can create a helpful and cheerful display of objects ({numref}`fig-blobs_binary_label`).
de: {menuselection}Analysieren --&gt; Partikel analysieren..." kann beschriftete Bilder erzeugen, indem man die {guilabel}"Show: Count Masks` Option. Dies erzeugt ein neues Bild, in dem jedes Pixel einen eindeutigen ganzzahligen Wert hat, der die Nummer des Objekts angibt, zu dem es gehört - oder Null, wenn es sich im Hintergrund befindet. Mit einer entsprechend farbigen LUT (oft {menuselection}`Image --&gt; Lookup Tables --&gt; Glasbey`) kann dies eine hilfreiche und fröhliche Anzeige von Objekten erzeugen ({numref}`fig-blobs_binary_label`).
es: {menuselection}`Analyze --> Analyze Particles...` puede generar imágenes etiquetadas usando la opción {guilabel}`Show: Count Masks`. Esto generará una nueva imagen en la que cada píxel tiene un valor entero único que indica el número del objeto del que forma parte, o cero si está en segundo plano. Con una LUT adecuadamente colorida (a menudo {menuselection}`Image --> Lookup Tables --> Glasbey`), esto puede crear una exhibición útil y alegre de objetos ({numref}`fig-blobs_binary_label`).

source: Creating a labeled image with {menuselection}`Analyze --> Analyze Particles`.
de: Erstellen eines beschrifteten Bildes mit {menuselection}`Analysieren --&gt; Partikel analysieren`.
es: Creando una imagen etiquetada con {menuselection}`Analyze --> Analyze Particles`.

source: Practical
de: Praktisch
es: Práctico

source: [Connectivity](sec_thresholds_connectivity) (4 or 8) is an important consideration when converting a binary image to objects, since it can have a major impact on the number and size of objects.
de: [Connectivity](sec_thresholds_connectivity) (4 oder 8) ist ein wichtiger Faktor bei der Konvertierung eines Binärbildes in Objekte, da er sich stark auf die Anzahl und Größe der Objekte auswirken kann.
es: [Conectividad](sec_thresholds_connectivity) (4 u 8) es una consideración importante al convertir una imagen binaria en objetos, ya que puede tener un impacto importante en la cantidad y el tamaño de los objetos.

source: Work out what kind of connectivity is used by
de: Finden Sie heraus, welche Art von Konnektivität verwendet wird von
es: Averigüe qué tipo de conectividad utilizan

source: {menuselection}`Analyze --> Analyze Particles...`
de: {menuselection}Analysieren --&gt; Partikel analysieren...`

source: the *Wand tool* <img src="../../../images/imagej/icons/wand.png" />
de: das *Werkzeug * <img src="../../../images/imagej/icons/wand.png" />
es: la *Wand tool* <img src="../../../images/imagej/icons/wand.png" />

source: **Note:** You can investigate this by applying the commands/tools to a binary image that has some diagonally connected pixels. One way to do this is by thresholding a suitable image, another is to use the *Brush tool* <img src="../../../images/imagej/icons/brush.png" /> to draw your own pixels in the binary image.
de: **Hinweis:** Sie können dies untersuchen, indem Sie die Befehle/Werkzeuge auf ein Binärbild anwenden, das einige diagonal verbundene Pixel enthält. Eine Möglichkeit besteht darin, ein geeignetes Bild mit einem Schwellenwert zu versehen, eine andere darin, mit dem *Brush-Werkzeug* <img src="../../../images/imagej/icons/brush.png" /> eigene Pixel in das Binärbild zu zeichnen.
es: **Nota:** Puedes investigar esto aplicando los comandos/herramientas a una imagen binaria que tenga algunos píxeles conectados diagonalmente. Una forma de hacerlo es establecer un umbral en una imagen adecuada; otra es utilizar la *Brush tool* <img src="../../../images/imagej/icons/brush.png" /> para dibujar sus propios píxeles en la imagen binaria.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/)

source: launch ImageJ.JS
de: ImageJ.JS starten
es: lanzar ImageJ.JS

source: Solution
de: Lösung
es: Solución

source: At the time of writing, {menuselection}`Analyze --> Analyze Particles...` uses 8-connectivity.
de: Zum Zeitpunkt der Erstellung dieses Dokuments verwendet {menuselection}`Analyze --&gt; Analyze Particles...` eine 8-fache Konnektivität.
es: Al momento de escribir este artículo, {menuselection}`Analyze --> Analyze Particles...` usa conectividad 8.

source: For the *Wand tool* the right answer will depend upon the setting you see if you double-click the tool. There are three options: 4-connectivity, 8-connectivity and 'legacy' (where 'legacy' seems to behave a bit like 8-connectivity).
de: Für das *Werkzeug* hängt die richtige Antwort von der Einstellung ab, die Sie sehen, wenn Sie auf das Werkzeug doppelklicken. Es gibt drei Optionen: 4-Verbindung, 8-Verbindung und 'legacy' (wobei sich 'legacy' ein wenig wie 8-Verbindung zu verhalten scheint).
es: Para la *Wand tool* la respuesta correcta dependerá de la configuración que vea si hace doble clic en la herramienta. Hay tres opciones: 4 conectividades, 8 conectividades y "heredado" (donde "heredado" parece comportarse un poco como 8 conectividades).

source: Local thresholding
de: Lokale Schwellenwertbildung
es: Umbral local

source: A few methods to perform local thresholding can be found under {menuselection}`Image --> Adjust --> Auto Local Threshold`. The dialog again provides the option to try all of them.
de: Unter {menuselection}`Bild --&gt; Anpassen --&gt; Automatischer lokaler Schwellenwert` finden Sie einige Methoden zur Durchführung der lokalen Schwellenwertbildung. Das Dialogfeld bietet wiederum die Möglichkeit, alle diese Methoden auszuprobieren.
es: Se pueden encontrar algunos métodos para realizar umbrales locales en {menuselection}`Image --> Adjust --> Auto Local Threshold`. El cuadro de diálogo nuevamente ofrece la opción de probarlos todos.

source: Using automated local filters is complicated by the fact that window sizes and parameters need to be tuned. What these mean in each case is described at https://imagej.net/Auto_Local_Threshold
de: Die Verwendung automatischer lokaler Filter wird durch die Tatsache erschwert, dass die Fenstergrößen und Parameter angepasst werden müssen. Was dies im Einzelfall bedeutet, ist unter https://imagej.net/Auto_Local_Threshold beschrieben.
es: El uso de filtros locales automatizados es complicado por el hecho de que es necesario ajustar los tamaños y parámetros de las ventanas. Lo que esto significa en cada caso se describe en https://imagej.net/Auto_Local_Threshold

source: Currently, ImageJ's local thresholding also requires that the image is converted to 8-bit. This should be done with some caution, since it can involve surreptitiously incorporating the [brightness & contrast settings](sec_bit_depths_converting) into the thresholding.
de: Derzeit erfordert die lokale Schwellenwertberechnung von ImageJ auch, dass das Bild in 8-Bit konvertiert wird. Dies sollte mit einer gewissen Vorsicht geschehen, da dabei die [Helligkeits- und Kontrasteinstellungen] (sec_bit_depths_converting) heimlich in die Schwellenwertberechnung einbezogen werden können.
es: Actualmente, el umbral local de ImageJ también requiere que la imagen se convierta a 8 bits. Esto debe hacerse con cierta precaución, ya que puede implicar incorporar subrepticiamente la [configuración de brillo y contraste] (sec_bit_ depths_converting) en el umbral.

source: For these reasons, I tend to avoid local thresholding.
de: Aus diesen Gründen neige ich dazu, lokale Schwellenwerte zu vermeiden.
es: Por estas razones, tiendo a evitar los umbrales locales.

source: Explore several automated methods of thresholding the different channels of {menuselection}`File --> Open samples --> HeLa Cells`, using both local and global automated thresholds, to draw your own conclusions about which methods you might prefer for different images.
de: Untersuchen Sie verschiedene automatische Methoden zur Schwellenwertbildung für die verschiedenen Kanäle von {menuselection}"Datei --&gt; Proben öffnen --&gt; HeLa-Zellen", wobei Sie sowohl lokale als auch globale automatische Schwellenwerte verwenden, um Ihre eigenen Schlussfolgerungen darüber zu ziehen, welche Methoden Sie für verschiedene Bilder bevorzugen würden.
es: Explora varios métodos automatizados para establecer umbrales en los diferentes canales de {menuselection}`File --> Open samples --> HeLa Cells`, utilizando umbrales automatizados locales y globales, para sacar sus propias conclusiones. sobre qué métodos podrías preferir para diferentes imágenes.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)

source: Addendum: Practical issues
de: Nachtrag: Praktische Fragen
es: Anexo: Cuestiones prácticas

source: We end this section with a brief discussion of a few non-obvious practical issues that impact thresholding, related to bit-depths and image types.
de: Wir schließen diesen Abschnitt mit einer kurzen Erörterung einiger nicht offensichtlicher praktischer Probleme, die sich auf die Schwellenwertbildung auswirken und mit Bittiefen und Bildtypen zusammenhängen.
es: Terminamos esta sección con una breve discusión de algunas cuestiones prácticas no obvias que afectan el umbral, relacionadas con las profundidades de bits y los tipos de imágenes.

source: Using NaNs
de: Verwendung von NaNs
es: Usando NaNs

source: The first issue appears when you click {guilabel}`Apply` in the {menuselection}`Image --> Adjust --> Threshold...` dialog box for a 32-bit image. This leads to a prompt asking whether to {guilabel}`Set Background Pixels to NaN`.
de: Das erste Problem tritt auf, wenn Sie im Dialogfeld {menuselection}"Bild --&gt; Anpassen --&gt; Schwellenwert..." für ein 32-Bit-Bild auf {guilabel}"Anwenden" klicken. Dies führt zu einer Eingabeaufforderung mit der Frage, ob Sie {guilabel}"Hintergrundpixel auf NaN setzen" möchten.
es: El primer problema aparece al hacer clic en {guilabel}`Apply` en el cuadro de diálogo {menuselection}`Image --> Adjust --> Threshold...` para una imagen de 32 bits. Esto lleva a un mensaje que pregunta si se debe {guilabel}`Set Background Pixels to NaN`.

source: If this is chosen, a binary image is no longer created. Instead, thresholding results in an image in which the foreground pixels retain their original values, while background pixels are **_NaN_**, or **_Not A Number_**.
de: Wenn diese Option gewählt wird, wird kein binäres Bild mehr erstellt. Stattdessen ergibt die Schwellenwertbildung ein Bild, in dem die Vordergrundpixel ihre ursprünglichen Werte behalten, während die Hintergrundpixel **_NaN_** oder **_Nicht eine Zahl_** sind.
es: Si se elige esta opción, ya no se crea una imagen binaria. En cambio, el umbral da como resultado una imagen en la que los píxeles de primer plano conservan sus valores originales, mientras que los píxeles de fondo son **_NaN_** o **_Not A Number_**.

source: *NaN* is a special value that can only be stored in floating point images, which ImageJ ignores when making measurements later. It is therefore used to mask out regions, while preserving meaningful pixel values elsewhere.
de: *NaN* ist ein spezieller Wert, der nur in Fließkomma-Bildern gespeichert werden kann und den ImageJ bei späteren Messungen ignoriert. Er wird daher verwendet, um Regionen auszublenden, während an anderer Stelle sinnvolle Pixelwerte erhalten bleiben.
es: *NaN* es un valor especial que solo se puede almacenar en imágenes de punto flotante, que ImageJ ignora al realizar mediciones posteriores. Por lo tanto, se utiliza para enmascarar regiones y al mismo tiempo preservar valores de píxeles significativos en otros lugares.

source: This is an advanced option that is *potentially* useful, but can be a bit challenging to work with. You have to be extra cautious when using an image containing NaNs, since some commands might behave in surprising ways.
de: Dies ist eine fortgeschrittene Option, die *potentiell* nützlich ist, aber etwas schwierig zu handhaben sein kann. Sie müssen besonders vorsichtig sein, wenn Sie ein Bild verwenden, das NaNs enthält, da sich einige Befehle auf überraschende Weise verhalten können.
es: Esta es una opción avanzada que es *potencialmente* útil, pero puede resultar un poco difícil trabajar con ella. Debe tener mucho cuidado al utilizar una imagen que contenga NaN, ya que algunos comandos pueden comportarse de manera sorprendente.

source: Create an image including NaN pixels, then measure some ROIs drawn on it. Are area measurements affected by whether NaNs are present or not?
de: Erstellen Sie ein Bild mit NaN-Pixeln und messen Sie dann einige darauf gezeichnete ROIs. Werden die Flächenmessungen davon beeinflusst, ob NaNs vorhanden sind oder nicht?
es: Crea una imagen que incluya píxeles NaN y luego mide algunos ROIs dibujados en ella. ¿Las mediciones de área se ven afectadas por la presencia o no de NaN?

source: They are! If you measure the area of an image containing NaNs, the result is less than if you measure the area of the same image converted to 8-bit -- since only the non-NaN parts are included. If you measure a region containing NaNs only, the area is 0.
de: Sie sind es! Wenn Sie die Fläche eines Bildes messen, das NaNs enthält, ist das Ergebnis kleiner, als wenn Sie die Fläche desselben Bildes, das in 8-Bit konvertiert wurde, messen - da nur die Nicht-NaN-Teile berücksichtigt werden. Wenn Sie eine Region messen, die nur NaNs enthält, ist die Fläche 0.
es: ¡Si lo son! Si mides el área de una imagen que contiene NaN, el resultado es menor que si mides el área de la misma imagen convertida a 8 bits, ya que solo se incluyen las partes que no son NaN. Si mides una región que contiene solo NaN, el área es 0.

source: Question
de: Frage
es: Pregunta

source: Through experiment or guesswork, what do you suppose happens to NaNs with a 32-bit image is converted to 8-bit or 16-bit?
de: Was glauben Sie, was mit NaNs passiert, wenn ein 32-Bit-Bild in ein 8-Bit- oder 16-Bit-Bild umgewandelt wird (durch Experiment oder Vermutung)?
es: A través de experimentos o conjeturas, ¿qué supones que les sucede a los NaNs con una imagen de 32 bits convertida a 8 o 16 bits?

source: Answer
de: Antwort
es: Respuesta

source: Since NaN is not an integer, it cannot be stored in an 8-bit or 16-bit unsigned integer image. Instead, all NaNs simply become zero.
de: Da NaN keine ganze Zahl ist, kann es nicht in einem 8-Bit- oder 16-Bit-Ganzzahlbild ohne Vorzeichen gespeichert werden. Stattdessen werden alle NaNs einfach zu Null.
es: Dado que NaN no es un número entero, no se puede almacenar en una imagen de entero sin signo de 8 o 16 bits. En cambio, todos los NaN simplemente se vuelven cero.

source: Histogram binning
de: Histogramm-Binning
es: Binning de histogramas

source: The second way in which bit-depths and types matter is that histograms of images > 8-bit involve _binning_ the data. For example, with a 32-bit image it would probably not make sense to create a histogram that has separate counts for all possible pixel values: in addition to counts for pixels with exact values 1 and 2, we would have thousands of counts for pixels with fractions in between and most of these counts would be 0.
de: Die zweite Art und Weise, in der Bittiefen und -typen eine Rolle spielen, ist, dass Histogramme von Bildern &gt; 8-Bit eine _Binning_ der Daten beinhalten. Bei einem 32-Bit-Bild wäre es zum Beispiel wahrscheinlich nicht sinnvoll, ein Histogramm mit separaten Werten für alle möglichen Pixelwerte zu erstellen: Zusätzlich zu den Werten für Pixel mit den exakten Werten 1 und 2 würden wir Tausende von Werten für Pixel mit Bruchteilen dazwischen haben, und die meisten dieser Werte wären 0.
es: La segunda forma en que importan las profundidades de bits y los tipos es que los histogramas de imágenes > 8 bits implican agrupar (o hacer binning de) los datos. Por ejemplo, con una imagen de 32 bits probablemente no tendría sentido crear un histograma que tenga recuentos separados para todos los valores de píxeles posibles: además de recuentos para píxeles con valores exactos 1 y 2, tendríamos miles de recuentos para píxeles con fracciones intermedias y la mayoría de estos recuentos serían 0.

source: Instead, the histogram is generated by dividing the total data range (maximum – minimum pixel values) into 256 separate _bins_ with equal widths, and counting how many pixels have values falling into the range of each bin. It's therefore like a subtle conversion to 8-bit precision for the threshold calculation, but without actually changing the original data. The same type of conversion is used for 16-bit images -- _unless_ you use the {menuselection}`Image --> Adjust --> Auto Threshold` command, which can use a full 16-bit histogram with 65536 bins.
de: Stattdessen wird das Histogramm erzeugt, indem der gesamte Datenbereich (maximale - minimale Pixelwerte) in 256 separate _Bins_ mit gleicher Breite unterteilt wird und gezählt wird, wie viele Pixel Werte haben, die in den Bereich jedes Bins fallen. Es handelt sich also um eine subtile Umwandlung in 8-Bit-Präzision für die Schwellenwertberechnung, ohne dass die Originaldaten tatsächlich verändert werden. Die gleiche Art der Konvertierung wird für 16-Bit-Bilder verwendet - es sei denn, Sie verwenden den Befehl {menuselection}`Bild --&gt; Anpassen --&gt; Automatischer Schwellenwert`, der ein vollständiges 16-Bit-Histogramm mit 65536 Bins verwenden kann.
es: En cambio, el histograma se genera dividiendo el rango total de datos (valores máximos y mínimos de píxeles) en 256 _bins_ o contenedores, separados con anchos iguales, y contando cuántos píxeles tienen valores que caen en el rango de cada bin. Por lo tanto, es como una conversión sutil a una precisión de 8 bits para el cálculo del umbral, pero sin cambiar realmente los datos originales. El mismo tipo de conversión se utiliza para imágenes de 16 bits, _a menos_ que utilices el comando {menuselection}`Image --> Adjust --> Auto Threshold`, que puede usar un Histograma de 16 bits con 65536 contenedores.

source: This is where the {guilabel}`Don't reset range` option in ImageJ's thresholding dialog becomes relevant for 16-bit or 32-bit images, when used in combination with the {guilabel}`Auto` button.
de: Hier wird die Option {guilabel}"Bereich nicht zurücksetzen" im Schwellenwert-Dialog von ImageJ für 16- oder 32-Bit-Bilder relevant, wenn sie in Kombination mit der Schaltfläche {guilabel}"Auto" verwendet wird.
es: Aquí es donde la opción {guilabel}`Don't reset range` en el cuadro de diálogo de umbral de ImageJ se vuelve relevante para imágenes de 16 o 32 bits, cuando se usa en combinación con el boton {guilabel}`Auto`.

source: If {guilabel}`Don't reset range` **is selected**, then the binning uses the current minimum and maximum values in the brightness/contrast dialog
de: Wenn {guilabel}"Bereich nicht zurücksetzen" **ausgewählt ist**, dann verwendet das Binning die aktuellen Minimal- und Maximalwerte im Helligkeits-/Kontrastdialog
es: Si {guilabel}`Don't reset range` **está seleccionado**, entonces la agrupación utiliza los valores mínimo y máximo actuales en el cuadro de diálogo de brillo/contraste.

source: If {guilabel}`Don't reset range` **is *not* selected**, then the binning *resets* the minimum and maximum values in the brightness/contrast dialog before using them
de: Wenn {guilabel}"Bereich nicht zurücksetzen" **nicht** ausgewählt ist, werden die Minimal- und Maximalwerte im Helligkeits-/Kontrastdialog vor der Verwendung durch das Binning *zurückgesetzt*.
es: Si {guilabel}`Don't reset range` ***no* está seleccionado**, entonces la opcion de binning *restablece* los valores mínimo y máximo en el cuadro de diálogo de brillo/contraste antes de usarlos.

source: Personally, I find this confusing; I don't like the brighness/contrast impacting thresholds, and my poor brain even struggles to process the negative in the {guilabel}`Don't reset range` to get an intuitive feeling for what effect the option will really have. And what makes things worse is that ImageJ's behavior in this regard has changed across versions, so there's a chance that any specific advice I give here won't match the version you're using anyway.
de: Ich persönlich finde das verwirrend; ich mag es nicht, wenn Helligkeit/Kontrast die Schwellenwerte beeinflussen, und mein armes Gehirn hat sogar Mühe, das Negativ in {guilabel}"Bereich nicht zurücksetzen" zu verarbeiten, um ein intuitives Gefühl dafür zu bekommen, welche Auswirkungen die Option wirklich hat. Und was die Sache noch schlimmer macht, ist, dass sich das Verhalten von ImageJ in dieser Hinsicht von Version zu Version geändert hat, so dass die Chance besteht, dass alle spezifischen Ratschläge, die ich hier gebe, nicht zu der Version passen, die Sie ohnehin verwenden.
es: Personalmente, esto me parece confuso; No me gustan los umbrales que afectan el brillo/contraste, y mi pobre cerebro incluso tiene dificultades para procesar lo negativo en {guilabel}`Don't reset range` para tener una sensación intuitiva de qué efecto tendrá realmente la opción. Y lo que empeora las cosas es que el comportamiento de ImageJ en este sentido ha cambiado entre las versiones, por lo que existe la posibilidad de que cualquier consejo específico que dé aquí no coincida con la versión que estás usando de todos modos.
