Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/thresholding.po
Languages: de, es, pt_br

source: This could potentially be an advantage: it may be better to return no threshold than to return a really bad one. However, in most real images we cannot count on the method not converging: it often *does* converge, even if it does not necessarily converge to any desirable value.
de: Dies könnte möglicherweise ein Vorteil sein: Es ist möglicherweise besser, keinen Schwellenwert zurückzugeben, als einen wirklich schlechten. Bei den meisten realen Bildern können wir jedoch nicht damit rechnen, dass die Methode nicht konvergiert: Sie konvergiert oft *konvergiert*, auch wenn sie nicht unbedingt zu einem gewünschten Wert konvergiert.
es: Esto podría ser potencialmente una ventaja: puede ser mejor no devolver ningún umbral que devolver uno realmente malo. Sin embargo, en la mayoría de las imágenes reales no podemos contar con que el método no converja: a menudo *converge*, incluso si no necesariamente converge a ningún valor deseable.
pt_br: Isto poderia ser potencialmente uma vantagem: pode ser melhor não retornar nenhum limite do que retornar um limite realmente ruim. No entanto, na maioria das imagens reais não podemos contar com a não convergência do método: muitas vezes ele *converge*, mesmo que não convirja necessariamente para qualquer valor desejável.

source: Triangle method
de: Dreiecksmethode
es: Método del triángulo
pt_br: Método do triângulo

source: The 'triangle method' is a popular approach to determining a threshold that works especially well in images where there is one dominant background peak, and the ideal threshold should be at the base of that peak.
de: Die „Dreiecksmethode“ ist ein beliebter Ansatz zur Bestimmung eines Schwellenwerts, der besonders gut bei Bildern funktioniert, bei denen es einen dominanten Hintergrundpeak gibt und der ideale Schwellenwert an der Basis dieses Peaks liegen sollte.
es: El 'método del triángulo' es un enfoque popular para determinar un umbral que funciona particularmente bien en imágenes donde hay un pico de fondo dominante, y el umbral ideal debería estar en la base de ese pico.
pt_br: O 'método do triângulo' é uma abordagem popular para determinar um limite que funciona especialmente bem em imagens onde há um pico de fundo dominante, e o limite ideal deve estar na base desse pico.

source: The general idea is that a a line is drawn from the peak of the histogram to the last bin that contains any pixels. Then a perpendicular line is plotted to the histogram itself, and the distance to the histogram maximized. The direction of the line depends upon whether the peak is toward the left or the right of the histogram; all counts on the other side are ignored.
de: Die allgemeine Idee besteht darin, dass eine Linie von der Spitze des Histogramms bis zum letzten Bin gezogen wird, der Pixel enthält. Dann wird eine senkrechte Linie zum Histogramm selbst gezeichnet und der Abstand zum Histogramm maximiert. Die Richtung der Linie hängt davon ab, ob sich der Peak links oder rechts vom Histogramm befindet. Alle Zählungen auf der anderen Seite werden ignoriert.
es: La idea general es que se dibuja una línea desde el pico del histograma hasta el último contenedor que contiene píxeles. Luego se traza una línea perpendicular al histograma y se maximiza la distancia al histograma. La dirección de la línea depende de si el pico está hacia la izquierda o hacia la derecha del histograma; Se ignoran todos los recuentos del otro lado.
pt_br: A ideia geral é que uma linha a seja desenhada do pico do histograma até o último compartimento que contém pixels. Em seguida, uma linha perpendicular é traçada ao próprio histograma e a distância ao histograma é maximizada. A direção da linha depende se o pico está à esquerda ou à direita do histograma; todas as contagens do outro lado são ignoradas.

source: The width and height of the histogram are normalized to deal with the fact that pixel values and intensity counts are in completely different units, and therefore in completely different scales.
de: Die Breite und Höhe des Histogramms werden normalisiert, um der Tatsache Rechnung zu tragen, dass Pixelwerte und Intensitätszahlen in völlig unterschiedlichen Einheiten und daher in völlig unterschiedlichen Maßstäben vorliegen.
es: El ancho y el alto del histograma están normalizados para abordar el hecho de que los valores de píxeles y los recuentos de intensidad están en unidades completamente diferentes y, por lo tanto, en escalas completamente diferentes.
pt_br: A largura e a altura do histograma são normalizadas para lidar com o fato de que os valores dos pixels e as contagens de intensidade estão em unidades completamente diferentes e, portanto, em escalas completamente diferentes.

source: The explanation is confusing, but hopefully {numref}`fig-thresholds_method_triangle` depicts it more clearly -- and provides an intuition for when and why it might be appropriate.
de: Die Erklärung ist verwirrend, aber {numref}`fig-thresholds_method_triangle` stellt sie hoffentlich klarer dar – und vermittelt eine Vorstellung davon, wann und warum sie angemessen sein könnte.
es: La explicación es confusa, pero esperamos que {numref}`fig-thresholds_method_triangle` la represente más claramente y proporcione una intuición de cuándo y por qué podría ser apropiado.
pt_br: A explicação é confusa, mas espero que {numref}`fig-thresholds_method_triangle` a descreva mais claramente - e forneça uma intuição de quando e por que pode ser apropriado.

source: Thresholding using the Triangle method. Because all example histograms have a dominant peak, this performs quite well in all cases -- although tends to detect more foreground pixels in the cell image than other methods (because the threshold is at the base of the peak rather than between the two modes). <br/> The histograms depict the triangles that give the method its name. They have been normalized and truncated to include only the relevant part.
de: Schwellenwertermittlung mit der Dreiecksmethode. Da alle Beispielhistogramme einen dominanten Peak aufweisen, funktioniert dies in allen Fällen recht gut – obwohl tendenziell mehr Vordergrundpixel im Zellbild erkannt werden als bei anderen Methoden (da der Schwellenwert an der Basis des Peaks und nicht zwischen den beiden Modi liegt). . <br/> Die Histogramme stellen die Dreiecke dar, die der Methode ihren Namen geben. Sie wurden normalisiert und gekürzt, um nur den relevanten Teil einzuschließen.
es: Umbralización mediante el método del Triángulo. Debido a que todos los histogramas de ejemplo tienen un pico dominante, este funciona bastante bien en todos los casos, aunque tiende a detectar más píxeles de primer plano en la imagen de la célula que otros métodos (porque el umbral está en la base del pico en lugar de entre los dos modos). . <br/> Los histogramas representan los triángulos que dan nombre al método. Se han normalizado y truncado para incluir sólo la parte relevante.
pt_br: Limiar usando o método Triângulo. Como todos os histogramas de exemplo têm um pico dominante, este funciona muito bem em todos os casos - embora tenda a detectar mais pixels de primeiro plano na imagem da célula do que outros métodos (porque o limite está na base do pico e não entre os dois modos) . <br/> Os histogramas representam os triângulos que dão nome ao método. Eles foram normalizados e truncados para incluir apenas a parte relevante.

source: Mean method
de: Mittlere Methode
es: Método de promedio
pt_br: Método médio

source: An alternative simple approach is to skip the histogram altogether, and just use the mean of all pixel values.
de: Ein alternativer einfacher Ansatz besteht darin, das Histogramm ganz zu überspringen und einfach den Mittelwert aller Pixelwerte zu verwenden.
es: Un enfoque alternativo simple es omitir el histograma por completo y simplemente usar la media de todos los valores de píxeles.
pt_br: Uma abordagem alternativa simples é ignorar completamente o histograma e usar apenas a média de todos os valores de pixel.

source: This can actually give quite good reasons on many real-world images -- although this may be more through luck than design. It's not a method I typically use myself.
de: Dies kann bei vielen realen Bildern tatsächlich recht gute Gründe liefern – obwohl dies möglicherweise eher auf Glück als auf Design zurückzuführen ist. Es ist keine Methode, die ich normalerweise selbst verwende.
es: En realidad, esto puede dar muy buenas razones en muchas imágenes del mundo real, aunque esto puede deberse más a la suerte que al diseño. No es un método que yo suelo utilizar.
pt_br: Na verdade, isso pode fornecer boas razões para muitas imagens do mundo real - embora isso possa ser mais por sorte do que por design. Não é um método que eu normalmente uso.

source: Thresholding using the Mean method.
de: Schwellenwertbestimmung mit der Mittelwertmethode.
es: Umbral utilizando el método del promedio o media.
pt_br: Limiar usando o método Mean.

source: Mean & Standard deviation
de: Mittelwert und Standardabweichung
es: Media y desviación estándar
pt_br: Média e desvio padrão

source: We can add a bit more to the *Mean method* by incorporating the standard deviation, scaled by a constant. The threshold becomes *mean + k x standard.deviation*, where we can adjust *k* based upon our attitude towards sensitivity vs. specificity.
de: Wir können der *Mittelwertmethode* etwas mehr hinzufügen, indem wir die Standardabweichung, skaliert durch eine Konstante, einbeziehen. Der Schwellenwert wird zu *Mittelwert + k x Standardabweichung*, wobei wir *k* basierend auf unserer Einstellung zu Sensitivität vs. Spezifität anpassen können.
es: Podemos agregar un poco más al *método de la media* incorporando la desviación estándar, escalada por una constante. El umbral se convierte en *media + k x desviación estándar*, donde podemos ajustar *k* en función de nuestra actitud hacia la sensibilidad frente a la especificidad.
pt_br: Podemos acrescentar um pouco mais ao *método da média* incorporando o desvio padrão, escalonado por uma constante. O limite torna-se *média + k x desvio padrão*, onde podemos ajustar *k* com base em nossa atitude em relação à sensibilidade versus especificidade.

source: The main advantage of this approach is that it should not fail catastropically in cases where we have an image that is mostly just noise (assuming *k* is large enough), unlike methods that require a bimodal histogram. However the disadvantage is that it is not robust: the threshold can be pulled higher or lower by outliers, or by foreground values being very different from background values.
de: Der Hauptvorteil dieses Ansatzes besteht darin, dass er im Gegensatz zu Methoden, die ein bimodales Histogramm erfordern, nicht katastrophal scheitern sollte, wenn wir ein Bild haben, das größtenteils nur aus Rauschen besteht (vorausgesetzt, *k* ist groß genug). Der Nachteil besteht jedoch darin, dass es nicht robust ist: Der Schwellenwert kann durch Ausreißer oder durch stark von den Hintergrundwerten abweichende Vordergrundwerte nach oben oder unten gezogen werden.
es: La principal ventaja de este enfoque es que no debería fallar catastróficamente en casos en los que tengamos una imagen que sea principalmente ruido (suponiendo que *k* sea lo suficientemente grande), a diferencia de los métodos que requieren un histograma bimodal. Sin embargo, la desventaja es que no es robusto: el umbral puede aumentar o disminuir debido a valores atípicos o a valores de primer plano que son muy diferentes de los valores de fondo.
pt_br: A principal vantagem desta abordagem é que ela não deve falhar catastroficamente nos casos em que temos uma imagem que é principalmente apenas ruído (assumindo que *k* é grande o suficiente), ao contrário dos métodos que requerem um histograma bimodal. No entanto, a desvantagem é que não é robusto: o limite pode ser aumentado ou reduzido por valores discrepantes ou por valores de primeiro plano serem muito diferentes dos valores de fundo.

source: Thresholding using the Mean + k x std.dev. method, with k = 3.
de: Schwellenwert unter Verwendung des Mittelwerts + k x std.dev. Methode, mit k = 3.
es: Umbral utilizando la media + k x std.dev. método, con k = 3.
pt_br: Limiar usando Média + k x std.dev. método, com k = 3.

source: Median & Median Absolute Deviation
de: Median und mittlere absolute Abweichung
es: Mediana y desviación absoluta mediana
pt_br: Mediana e Desvio Absoluto Mediano

source: A more robust alternative to using the mean and standard deviation is to use the **median and median absolute deviation (MAD)** to determine a threshold.
de: Eine robustere Alternative zur Verwendung des Mittelwerts und der Standardabweichung besteht darin, den **Median und die mittlere absolute Abweichung (MAD)** zur Bestimmung eines Schwellenwerts zu verwenden.
es: Una alternativa más sólida al uso de la media y la desviación estándar es utilizar la **mediana y la desviación absoluta de la mediana (MAD)** para determinar un umbral.
pt_br: Uma alternativa mais robusta ao uso da média e do desvio padrão é usar a **mediana e o desvio absoluto da mediana (MAD)** para determinar um limite.

source: If the pixel values of an image were to be sorted, the **median** is the value that would be in the middle. The **MAD** is calculated as follows:
de: Wenn die Pixelwerte eines Bildes sortiert werden würden, ist der **Median** der Wert, der in der Mitte liegen würde. Der **MAD** wird wie folgt berechnet:
es: Si se ordenaran los valores de píxeles de una imagen, la **mediana** es el valor que estaría en el medio. El **MAD** se calcula de la siguiente manera:
pt_br: Se os valores de pixel de uma imagem fossem classificados, a **mediana** é o valor que estaria no meio. O **MAD** é calculado da seguinte forma:

source: Subtract the median from all pixels
de: Subtrahieren Sie den Median von allen Pixeln
es: Resta la mediana de todos los píxeles
pt_br: Subtraia a mediana de todos os pixels

source: Compute the absolute value of the result of (1) (i.e. flip the sign of negative values, so that all are positive)
de: Berechnen Sie den absoluten Wert des Ergebnisses von (1) (d. h. kehren Sie das Vorzeichen negativer Werte um, sodass alle positiv sind)
es: Calcula el valor absoluto del resultado de (1) (es decir, invierte el signo de los valores negativos, para que todos sean positivos)
pt_br: Calcule o valor absoluto do resultado de (1) (ou seja, inverta o sinal dos valores negativos, para que todos sejam positivos)

source: Compute the median of the result of (2)
de: Berechnen Sie den Median des Ergebnisses von (2)
es: Calcula la mediana del resultado de (2)
pt_br: Calcule a mediana do resultado de (2)

source: An intriguingly useful property of the MAD is that it can be scaled by 1.482 to resemble a (more robust) standard deviation. The [Wikipedia article](https://en.wikipedia.org/wiki/Median_absolute_deviation) explains this in more detail.
de: Eine faszinierend nützliche Eigenschaft des MAD besteht darin, dass er um 1,482 skaliert werden kann, um einer (robusteren) Standardabweichung zu ähneln. Der [Wikipedia-Artikel](https://en.wikipedia.org/wiki/Median_absolute_deviation) erklärt dies ausführlicher.
es: Una propiedad intrigantemente útil de la MAD es que se puede escalar en 1,482 para parecerse a una desviación estándar (más robusta). El [artículo de Wikipedia](https://en.wikipedia.org/wiki/Median_absolute_deviation) explica esto con más detalle.
pt_br: Uma propriedade intrigantemente útil do MAD é que ele pode ser dimensionado em 1,482 para se assemelhar a um desvio padrão (mais robusto). O [artigo da Wikipedia](https://en.wikipedia.org/wiki/Median_absolute_deviation) explica isso com mais detalhes.

source: Typically, we would use the *median + k x MAD x 1.482*, where we can adjust *k* as if it was used to scale a standard deviation. This is helpful because standard deviations are easier for (most of) us to tune.
de: Normalerweise würden wir den *Median + k x MAD x 1,482* verwenden, wobei wir *k* anpassen können, als ob es zur Skalierung einer Standardabweichung verwendet würde. Dies ist hilfreich, da Standardabweichungen für (die meisten) von uns einfacher zu optimieren sind.
es: Normalmente, usaríamos la *mediana + k x MAD x 1.482*, donde podemos ajustar *k* como si se usara para escalar una desviación estándar. Esto es útil porque las desviaciones estándar son más fáciles de ajustar para (la mayoría de) nosotros.
pt_br: Normalmente, usaríamos *mediana + k x MAD x 1,482*, onde podemos ajustar *k* como se fosse usado para dimensionar um desvio padrão. Isso é útil porque os desvios padrão são mais fáceis para (a maioria) ajustar.

source: Using the MAD to define a threshold remains fairly uncommon, but I personally like the method a lot when working with very noisy fluorescence images. The three main requirements for this method to work are:
de: Die Verwendung des MAD zum Definieren eines Schwellenwerts bleibt eher ungewöhnlich, aber mir persönlich gefällt die Methode sehr gut, wenn ich mit sehr verrauschten Fluoreszenzbildern arbeite. Die drei Hauptvoraussetzungen für das Funktionieren dieser Methode sind:
es: Usar el MAD para definir un umbral sigue siendo bastante poco común, pero personalmente me gusta mucho el método cuando trabajo con imágenes de fluorescencia muy ruidosas. Los tres requisitos principales para que este método funcione son:
pt_br: Usar o MAD para definir um limite permanece bastante incomum, mas eu pessoalmente gosto muito do método quando trabalho com imagens de fluorescência muito barulhentas. Os três requisitos principais para que este método funcione são:

source: Most of the image should be background, and noisy (a completely constant background will give a MAD of 0, and a bad threshold)
de: Der größte Teil des Bildes sollte im Hintergrund liegen und verrauscht sein (ein völlig konstanter Hintergrund ergibt einen MAD von 0 und einen schlechten Schwellenwert).
es: La mayor parte de la imagen debe ser de fondo y ruidosa (un fondo completamente constante dará un MAD de 0 y un umbral incorrecto)
pt_br: A maior parte da imagem deve ser de fundo e com ruído (um fundo completamente constante dará um MAD de 0 e um limite ruim)

source: The noise should (more or less) follow a normal distribution
de: Das Rauschen sollte (mehr oder weniger) einer Normalverteilung folgen
es: El ruido debe (más o menos) seguir una distribución normal.
pt_br: O ruído deve (mais ou menos) seguir uma distribuição normal

source: The image shouldn't be too large, because calculating the median exactly is slow
de: Das Bild sollte nicht zu groß sein, da die genaue Berechnung des Medians langsam ist
es: La imagen no debe ser demasiado grande, porque calcular exactamente la mediana es lento.
pt_br: A imagem não deve ser muito grande, pois calcular a mediana com exatidão é lento

source: The last point is not always an issue: we can calculate the median much more quickly if we use a histogram, although we may lose some precision due to the binning required when building the histogram.
de: Der letzte Punkt ist nicht immer ein Problem: Wir können den Median viel schneller berechnen, wenn wir ein Histogramm verwenden, obwohl wir aufgrund der beim Erstellen des Histogramms erforderlichen Binning möglicherweise an Präzision verlieren.
es: El último punto no siempre es un problema: podemos calcular la mediana mucho más rápidamente si usamos un histograma, aunque podemos perder algo de precisión debido al binning necesario al construir el histograma.
pt_br: O último ponto nem sempre é um problema: podemos calcular a mediana muito mais rapidamente se utilizarmos um histograma, embora possamos perder alguma precisão devido ao binning necessário ao construir o histograma.

source: Thresholding using the MAD method, with *k = 3*. This is a strong candiate to be my preferred method for the 'spots' image, because it is effective when looking for small signals buried in noise.
de: Schwellenwertbestimmung mit der MAD-Methode, mit *k = 3*. Dies ist ein starker Kandidat für meine bevorzugte Methode für das „Spots“-Bild, da es bei der Suche nach kleinen, im Rauschen verborgenen Signalen effektiv ist.
es: Umbral mediante el método MAD, con *k = 3*. Este es un fuerte candidato a ser mi método preferido para la imagen de 'manchas', porque es efectivo cuando se buscan pequeñas señales enterradas en ruido.
pt_br: Limiar usando o método MAD, com *k = 3*. Este é um forte candidato para ser meu método preferido para imagens de 'pontos', porque é eficaz ao procurar pequenos sinais enterrados em ruído.

source: Clipping confounds automated thresholds
de: Durch Clipping werden automatisierte Schwellenwerte durcheinander gebracht
es: El recorte (clipping) confunde los umbrales automatizados
pt_br: Clipping confunde limites automatizados

source: If the data is [clipped](chap_bit_depths), then the statistics of the pixel values and shape of the image histogram are changed. This means that the theory underlying why an automated threshold should work might well no longer apply.
de: Wenn die Daten [beschnitten] sind (chap_bit_ Depths), werden die Statistiken der Pixelwerte und die Form des Bildhistogramms geändert. Das bedeutet, dass die Theorie, warum ein automatisierter Schwellenwert funktionieren sollte, möglicherweise nicht mehr zutrifft.
es: Si los datos están [recortados] (chap_bit_depths), entonces cambian las estadísticas de los valores de píxeles y la forma del histograma de la imagen. Esto significa que la teoría que subyace a por qué debería funcionar un umbral automatizado bien podría ya no aplicar.
pt_br: Se os dados forem [cortados](chap_bit_profundidades), então as estatísticas dos valores de pixel e a forma do histograma da imagem são alteradas. Isto significa que a teoria subjacente à razão pela qual um limiar automatizado deveria funcionar poderá já não se aplicar.

source: *This is another reason why clipping should always be avoided!*
de: *Dies ist ein weiterer Grund, warum Clipping immer vermieden werden sollte!*
es: *¡Esta es otra razón por la que siempre se debe evitar el recorte!*
pt_br: *Esta é outra razão pela qual o recorte deve sempre ser evitado!*

source: Are automated thresholds less biased?
de: Sind automatisierte Schwellenwerte weniger voreingenommen?
es: ¿Los umbrales automatizados están menos sesgados?
pt_br: Os limites automatizados são menos tendenciosos?

source: I sometimes see the use of automated thresholding methods justified because they are *'less biased than manual thresholds'*.
de: Manchmal halte ich den Einsatz automatisierter Schwellenwertmethoden für gerechtfertigt, weil sie „weniger voreingenommen sind als manuelle Schwellenwerte“*.
es: A veces veo justificado el uso de métodos de umbralización automatizados porque son *'menos sesgados que los umbrales manuales'*.
pt_br: Às vezes vejo o uso de métodos de limiares automatizados justificados porque eles são *'menos tendenciosos que os limiares manuais'*.

source: I am unconvinced.
de: Ich bin nicht überzeugt.
es: No estoy convencido.
pt_br: Não estou convencido.
