Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/thresholding.po
Languages: de, es, pt_br

source: Image overlays are often a good way to do this: for each image you analyze, create an RGB copy that outlines everything that was detected and measured. Ideally, this would have brightness and contrast settings defined in such a way that you can see at a glance when something has gone wrong. You might only look at each image for a fraction of a second through *Windows Explorer* or *Mac Finder*, but that can be enough to spot issues that would otherwise be missed.
de: Bildüberlagerungen sind oft eine gute Möglichkeit, dies zu tun: Erstellen Sie für jedes Bild, das Sie analysieren, eine RGB-Kopie, die alles umreißt, was erkannt und gemessen wurde. Im Idealfall sind Helligkeits- und Kontrasteinstellungen so definiert, dass Sie auf einen Blick erkennen können, wenn etwas schief gelaufen ist. Möglicherweise betrachten Sie jedes Bild nur für den Bruchteil einer Sekunde im *Windows Explorer* oder *Mac Finder*, aber das kann ausreichen, um Probleme zu erkennen, die sonst übersehen würden.
es: Las superposiciones de imágenes suelen ser una buena manera de hacer esto: para cada imagen que analices, crea una copia RGB que describa todo lo que se detectó y midió. Idealmente, esto tendría ajustes de brillo y contraste definidos de tal manera que puedas ver de un vistazo cuando algo salió mal. Es posible que solo mires cada imagen durante una fracción de segundo a través del *Explorador de Windows* o el *Finder de Mac*, pero eso puede ser suficiente para detectar problemas que de otro modo pasarían desapercibidos.
pt_br: As sobreposições de imagens costumam ser uma boa maneira de fazer isso: para cada imagem analisada, crie uma cópia RGB que descreva tudo o que foi detectado e medido. Idealmente, isso teria configurações de brilho e contraste definidas de forma que você pudesse ver rapidamente quando algo deu errado. Você pode olhar cada imagem apenas por uma fração de segundo através do *Windows Explorer* ou do *Mac Finder*, mas isso pode ser suficiente para detectar problemas que de outra forma passariam despercebidos.

source: In [the last section](sec_thresholding_difficult) we'll see how applying preprocessing steps to the image can allow us to reduce the proportion of spots that are merged or missed. But first we'll consider how to automate the threshold choice.
de: Im [letzten Abschnitt](sec_thresholding_difficult) werden wir sehen, wie wir durch die Anwendung von Vorverarbeitungsschritten auf das Bild den Anteil der zusammengeführten oder übersehenen Punkte reduzieren können. Aber zuerst überlegen wir, wie wir die Schwellenwertauswahl automatisieren können.
es: En la última sección [the last section](sec_thresholding_difficult) veremos cómo aplicar pasos de pre-procesamiento a la imagen puede permitirnos reducir la proporción de puntos que se fusionan o se pierden. Pero primero consideraremos cómo automatizar la elección del umbral.
pt_br: Na [última seção](sec_thresholding_difficult) veremos como a aplicação de etapas de pré-processamento à imagem pode nos permitir reduzir a proporção de pontos mesclados ou perdidos. Mas primeiro consideraremos como automatizar a escolha do limite.

source: Automated thresholds
de: Automatisierte Schwellenwerte
es: Umbrales automatizados
pt_br: Limites automatizados

source: We don't want to choose thresholds manually if we can avoid it, because it affords so much room for bias. On the other hand, there's no always-applicable strategy to determine a threshold automatically; images vary too much.
de: Wir möchten Schwellenwerte nicht manuell auswählen, wenn wir dies vermeiden können, da dies viel Raum für Verzerrungen bietet. Andererseits gibt es keine immer anwendbare Strategie zur automatischen Bestimmung eines Schwellenwerts. Bilder variieren zu stark.
es: No queremos elegir umbrales manualmente si podemos evitarlo, porque deja mucho espacio para el sesgo. Por otro lado, no existe una estrategia aplicable siempre para determinar un umbral automáticamente. Las imágenes varían demasiado.
pt_br: Não queremos escolher limites manualmente se pudermos evitá-lo, porque isso abre muito espaço para preconceitos. Por outro lado, não existe uma estratégia sempre aplicável para determinar um limite automaticamente; as imagens variam muito.

source: Nevertheless, there are some widely-used techniques capable of determining reasonable thresholds for many images based upon the histogram. Each one is based upon some underlying assumptions about the histogram shape or image statistics. If these assumptions are met, the method often performs well; if not, it may perform well *sometimes* and disastrously at other times.
de: Dennoch gibt es einige weit verbreitete Techniken, mit denen sich anhand des Histogramms sinnvolle Schwellenwerte für viele Bilder bestimmen lassen. Jede davon basiert auf einigen zugrunde liegenden Annahmen über die Form des Histogramms oder die Bildstatistik. Wenn diese Annahmen erfüllt sind, funktioniert die Methode oft gut; Wenn nicht, kann die Leistung *manchmal* gut und zu anderen Zeiten katastrophal sein.
es: Sin embargo, existen algunas técnicas ampliamente utilizadas capaces de determinar umbrales razonables para muchas imágenes basándose en el histograma. Cada uno se basa en algunas suposiciones subyacentes sobre la forma del histograma o las estadísticas de la imagen. Si se cumplen estos supuestos, el método suele funcionar bien; si no, puede funcionar bien *a veces* y de manera desastrosa en otras ocasiones.
pt_br: No entanto, existem algumas técnicas amplamente utilizadas capazes de determinar limites razoáveis para muitas imagens com base no histograma. Cada um é baseado em algumas suposições subjacentes sobre o formato do histograma ou estatísticas da imagem. Se essas suposições forem atendidas, o método geralmente funciona bem; caso contrário, pode funcionar bem *às vezes* e desastrosamente em outras ocasiões.

source: In this section, we'll look at several of the most common automated thresholding methods using three images. Each image exhibits a different kind of histogram that is commonly found in bioimages:
de: In diesem Abschnitt betrachten wir einige der gängigsten automatisierten Schwellenwertmethoden unter Verwendung von drei Bildern. Jedes Bild weist eine andere Art von Histogramm auf, die häufig in Biobildern zu finden ist:
es: En esta sección, veremos varios de los métodos de umbralización automatizados más comunes utilizando tres imágenes. Cada imagen muestra un tipo diferente de histograma que se encuentra comúnmente en las bioimágenes:
pt_br: Nesta seção, veremos vários dos métodos de limiar automatizados mais comuns usando três imagens. Cada imagem exibe um tipo diferente de histograma que é comumente encontrado em bioimagens:

source: **Bimodal:** with two distinct peaks, corresponding to foreground and background
de: **Bimodal:** mit zwei unterschiedlichen Spitzen, entsprechend Vordergrund und Hintergrund
es: **Bimodal:** con dos picos distintos, correspondientes al primer plano y al fondo
pt_br: **Bimodal:** com dois picos distintos, correspondentes ao primeiro plano e ao fundo

source: **Unimodal:** mostly background noise, with some interesting signal at one end
de: **Unimodal:** Hauptsächlich Hintergrundrauschen, mit einem interessanten Signal an einem Ende
es: **Unimodal:** principalmente ruido de fondo, con alguna señal interesante en un extremo
pt_br: **Unimodal:** principalmente ruído de fundo, com algum sinal interessante em uma extremidade

source: **Dominant background:** one large background peak, with a long tail of foreground pixels
de: **Dominanter Hintergrund:** eine große Hintergrundspitze mit einem langen Schwanz aus Vordergrundpixeln
es: **Fondo dominante:** un pico de fondo grande, con una larga cola de píxeles en primer plano
pt_br: **Plano de fundo dominante:** um grande pico de fundo, com uma longa cauda de pixels de primeiro plano

source: Images with three different types of histogram.
de: Bilder mit drei verschiedenen Histogrammtypen.
es: Imágenes con tres tipos diferentes de histograma.
pt_br: Imagens com três tipos diferentes de histograma.

source: Otsu's method
de: Otsus Methode
es: El método de Otsu
pt_br: Método de Otsu

source: By its nature, global thresholding assumes that there are two classes of pixel in the image -- those that belong to interesting objects, and those that do not -- and pixels in each class have different intensity values [^fn_2]. In principle, if we could identify the pixels for each of the two classes, we could calculate statistics such as the mean and variance (i.e. standard deviation squared) for them both separately.
de: Bei der globalen Schwellenwertberechnung wird naturgemäß davon ausgegangen, dass es im Bild zwei Klassen von Pixeln gibt – solche, die zu interessanten Objekten gehören, und solche, die nicht dazu gehören – und dass die Pixel in jeder Klasse unterschiedliche Intensitätswerte haben [^fn_2]. Wenn wir im Prinzip die Pixel für jede der beiden Klassen identifizieren könnten, könnten wir Statistiken wie den Mittelwert und die Varianz (d. h. die Standardabweichung im Quadrat) für beide separat berechnen.
es: Por su naturaleza, el umbral global supone que hay dos clases de píxeles en la imagen (los que pertenecen a objetos interesantes y los que no) y los píxeles de cada clase tienen diferentes valores de intensidad [^fn_2]. En principio, si pudiéramos identificar los píxeles de cada una de las dos clases, podríamos calcular estadísticas como la media y la varianza (es decir, la desviación estándar al cuadrado) para ambas por separado.
pt_br: Pela sua natureza, o limiar global assume que existem duas classes de pixels na imagem - aqueles que pertencem a objetos interessantes e aqueles que não pertencem - e os pixels em cada classe têm valores de intensidade diferentes [^fn_2]. Em princípio, se pudéssemos identificar os pixels para cada uma das duas classes, poderíamos calcular estatísticas como a média e a variância (ou seja, o desvio padrão ao quadrado) para ambas separadamente.

source: Nobuyuki Otsu (1979). "A threshold selection method from gray-level histograms". *IEEE Trans. Sys. Man. Cyber.* 9 (1): 62–66. https://doi.org/10.1109/TSMC.1979.4310076
de: Nobuyuki Otsu (1979). „Eine Schwellenwertauswahlmethode aus Graustufenhistogrammen“. *IEEE Trans. Sys. Mann. Cyber.* 9 (1): 62–66. https://doi.org/10.1109/TSMC.1979.4310076
es: Nobuyuki Otsu (1979). "A threshold selection method from gray-level histograms". *Transmisión IEEE. Sistema Hombre. Cibernético.* 9 (1): 62–66. https://doi.org/10.1109/TSMC.1979.4310076
pt_br: Nobuyuki Otsu (1979). "Um método de seleção de limite a partir de histogramas de nível de cinza". *IEEE Trans. Sistema. Homem. Cibernético.* 9 (1): 62–66. https://doi.org/10.1109/TSMC.1979.4310076

source: **Otsu's method**, introduced in 1979, has become an extremely popular approach to determining a threshold. It's commonly described, somewhat intimidatingly, as *'minimizing the intra-class intensity variance'*. In essence, calculating a threshold using Otsu's method involves adding the variance of the background pixels to the variance of the foreground pixels, for all possible thresholds. The threshold that is selected is the one for which the sum of the variances is smallest.
de: Die 1979 eingeführte **Otsu-Methode** hat sich zu einem äußerst beliebten Ansatz zur Bestimmung eines Schwellenwerts entwickelt. Es wird allgemein, etwas einschüchternd, als „Minimierung der Intensitätsvarianz innerhalb der Klasse“ beschrieben*. Im Wesentlichen umfasst die Berechnung eines Schwellenwerts mit der Methode von Otsu das Addieren der Varianz der Hintergrundpixel zur Varianz der Vordergrundpixel für alle möglichen Schwellenwerte. Der ausgewählte Schwellenwert ist derjenige, bei dem die Summe der Varianzen am kleinsten ist.
es: **El método de Otsu**, introducido en 1979, se ha convertido en un método extremadamente popular para determinar un umbral. Se describe comúnmente, de manera un tanto intimidante, como *'minimizar la variación de intensidad dentro de la clase'*. En esencia, calcular un umbral utilizando el método de Otsu implica sumar la varianza de los píxeles de fondo a la varianza de los píxeles de primer plano, para todos los umbrales posibles. El umbral que se selecciona es aquel para el cual la suma de las varianzas es menor.
pt_br: **O método de Otsu**, introduzido em 1979, tornou-se uma abordagem extremamente popular para determinar um limite. É comumente descrito, de forma um tanto intimidante, como “minimizar a variação de intensidade intraclasse”*. Em essência, calcular um limite usando o método de Otsu envolve adicionar a variância dos pixels de fundo à variância dos pixels de primeiro plano, para todos os limites possíveis. O limite selecionado é aquele para o qual a soma das variâncias é menor.

source: We can think of this as trying to keep the distributions of foreground and background pixels 'compact': two peaks that spread as little as possible.
de: Wir können uns das so vorstellen, dass wir versuchen, die Verteilungen der Vordergrund- und Hintergrundpixel „kompakt“ zu halten: zwei Spitzen, die sich so wenig wie möglich ausbreiten.
es: Podemos pensar en esto como intentar mantener "compactas" las distribuciones de píxeles de primer plano y de fondo: dos picos que se extienden lo menos posible.
pt_br: Podemos pensar nisso como uma tentativa de manter 'compactas' as distribuições dos pixels de primeiro plano e de fundo: dois picos que se espalham o menos possível.

source: Otsu's method performs very well on data with a bimodal histogram, with a deep valley in between. Unfortunately, a lot of microscopy images don't have clearly bimodal histograms, and so the method may not be such a good choice.
de: Die Methode von Otsu eignet sich sehr gut für Daten mit einem bimodalen Histogramm und einem tiefen Tal dazwischen. Leider weisen viele Mikroskopiebilder keine eindeutig bimodalen Histogramme auf, sodass die Methode möglicherweise keine so gute Wahl ist.
es: El método de Otsu funciona muy bien con datos con un histograma bimodal, con un valle profundo en el medio. Desafortunadamente, muchas imágenes de microscopía no tienen histogramas claramente bimodales, por lo que el método puede no ser una buena opción.
pt_br: O método de Otsu funciona muito bem em dados com histograma bimodal, com um vale profundo entre eles. Infelizmente, muitas imagens de microscopia não possuem histogramas claramente bimodais e, portanto, o método pode não ser uma escolha tão boa.

source: Thresholding using Otsu's method. This performs best on the cell image with a bimodal histogram. For the spots image, there is no separation between peaks to find; as a result, approximately half the pixels are identified as foreground. The method also performs quite poorly for the nucleus image, despite this previously being identified as an 'easier' image for thresholding.
de: Schwellenwertbestimmung mit der Methode von Otsu. Dies funktioniert am besten auf dem Zellbild mit einem bimodalen Histogramm. Für das Spotbild gibt es keine Trennung zwischen Peaks; Dadurch wird etwa die Hälfte der Pixel als Vordergrundpixel erkannt. Auch für das Kernbild schneidet die Methode recht schlecht ab, obwohl dieses zuvor als „einfacheres“ Bild für die Schwellenwertermittlung identifiziert wurde.
es: Umbral utilizando el método de Otsu. Esto funciona mejor en la imagen de la célula con un histograma bimodal. Para la imagen de puntos, no se encuentra la separación entre los picos; como resultado, aproximadamente la mitad de los píxeles se identifican como primer plano. El método también funciona bastante mal para la imagen del núcleo, a pesar de que previamente se había identificado como una imagen "más fácil" en la cual establecer umbrales.
pt_br: Limiarização usando o método de Otsu. Isso funciona melhor na imagem da célula com um histograma bimodal. Para a imagem de manchas, não há separação entre picos a serem encontradas; como resultado, aproximadamente metade dos pixels são identificados como primeiro plano. O método também tem um desempenho bastante fraco para a imagem do núcleo, apesar de esta ter sido previamente identificada como uma imagem “mais fácil” para limiarização.

source: Minimum method
de: Minimale Methode
es: Método mínimo
pt_br: Método mínimo

source: The **Minimum method** provides an alternative threshold that also assumes a bimodal histogram.
de: Die **Minimum-Methode** bietet einen alternativen Schwellenwert, der ebenfalls ein bimodales Histogramm annimmt.
es: El **método mínimo** proporciona un umbral alternativo que también supone un histograma bimodal.
pt_br: O **Método Mínimo** fornece um limite alternativo que também assume um histograma bimodal.

source: The starting point is the image histogram. As can be seen in {numref}`fig-thresholds_histogram_types`, the counts tend to be somewhat 'noisy' with lots of tiny spurious peaks. The Minimum method operates by smoothing the histogram, replacing each count value with the average of itself and the neighboring counts. By repeating this process, eventually the spurious peaks are removed until (hopefully) precisely two peaks remain. The threshold is then the location of the deepest point in the valley between those peaks.
de: Ausgangspunkt ist das Bildhistogramm. Wie in {numref}`fig-thresholds_histogram_types` zu sehen ist, sind die Zählungen tendenziell etwas „verrauscht“ mit vielen kleinen Störspitzen. Bei der Minimum-Methode wird das Histogramm geglättet, indem jeder Zählwert durch den Durchschnitt seiner selbst und der benachbarten Zählwerte ersetzt wird. Durch Wiederholen dieses Vorgangs werden schließlich die Störpeaks entfernt, bis (hoffentlich) genau zwei Peaks übrig bleiben. Die Schwelle ist dann der Ort des tiefsten Punktes im Tal zwischen diesen Gipfeln.
es: El punto de partida es el histograma de la imagen. Como se puede ver en {numref}`fig-thresholds_histogram_types`, los recuentos tienden a ser algo "ruidosos" con muchos pequeños picos espurios. El método Mínimo opera suavizando el histograma, reemplazando cada valor de conteo con el promedio de sí mismo y los conteos vecinos. Al repetir este proceso, eventualmente los picos espurios se eliminan hasta que (con suerte) queden exactamente dos picos. El umbral es entonces la ubicación del punto más profundo del valle entre esos picos.
pt_br: O ponto de partida é o histograma da imagem. Como pode ser visto em {numref}`fig-thresholds_histogram_types`, as contagens tendem a ser um tanto 'ruidosas' com muitos pequenos picos espúrios. O método Mínimo opera suavizando o histograma, substituindo cada valor de contagem pela média dele mesmo e das contagens vizinhas. Ao repetir este processo, eventualmente os picos espúrios são removidos até (esperançosamente) restarem precisamente dois picos. O limiar é então a localização do ponto mais profundo do vale entre esses picos.

source: The result of this process is illustrated in {numref}`fig-thresholds_method_minimum`.
de: Das Ergebnis dieses Prozesses ist in {numref}`fig-thresholds_method_minimum` dargestellt.
es: El resultado de este proceso se ilustra en {numref}`fig-thresholds_method_minimum`.
pt_br: O resultado deste processo é ilustrado em {numref}`fig-thresholds_method_minimum`.

source: Thresholding using the Minimum method. The smoothed histograms used in the calculation are shown in red, with the original histograms shown (faintly) in gray. A line connecting the two final peaks is also included, and the threshold marked with a dot. <br/> This works well on the cells image and quite well on the nuclei image. However it fails badly on the spots image, where almost everything is detected as foreground. This is a case where the method converges (due to the image being noisy, so having lots of small peaks in the histogram) even though we might prefer it had not.
de: Schwellenwert mit der Minimum-Methode. Die in der Berechnung verwendeten geglätteten Histogramme werden in Rot angezeigt, während die ursprünglichen Histogramme (schwach) in Grau angezeigt werden. Außerdem ist eine Linie enthalten, die die beiden Endspitzen verbindet, und der Schwellenwert ist mit einem Punkt markiert. <br/> Dies funktioniert gut auf dem Zellbild und ganz gut auf dem Kernbild. Bei dem Spotbild, bei dem fast alles als Vordergrund erkannt wird, schlägt es jedoch gravierend fehl. Dies ist ein Fall, in dem die Methode konvergiert (weil das Bild verrauscht ist und daher viele kleine Spitzen im Histogramm aufweist), auch wenn wir es lieber nicht hätten.
es: Umbral utilizando el método Mínimo. Los histogramas suavizados utilizados en el cálculo se muestran en rojo, y los histogramas originales se muestran (débilmente) en gris. También se incluye una línea que conecta los dos picos finales y el umbral marcado con un punto. <br/> Esto funciona bien en la imagen de las células y bastante bien en la imagen de los núcleos. Sin embargo, falla mucho en la imagen de los puntos, donde casi todo se detecta en primer plano. Este es un caso en el que el método converge (debido a que la imagen es ruidosa y, por lo tanto, tiene muchos picos pequeños en el histograma), aunque preferiríamos que no fuera así.
pt_br: Limiar usando o método Mínimo. Os histogramas suavizados usados no cálculo são mostrados em vermelho, com os histogramas originais mostrados (fracamente) em cinza. Uma linha conectando os dois picos finais também está incluída e o limite é marcado com um ponto. <br/> Isso funciona bem na imagem das células e muito bem na imagem dos núcleos. Porém falha muito na imagem dos spots, onde quase tudo é detectado em primeiro plano. Este é um caso em que o método converge (devido à imagem ser ruidosa, portanto, ter muitos pequenos picos no histograma), embora possamos preferir que não.

source: One 'feature' of the Minimum method is that *it is not guaranteed to converge*. It is entirely possible that no amount of smoothing will result in a histogram with 2 peaks: perhaps there is only 1 peak, or none at all if all pixels are just a constant value.
de: Ein „Merkmal“ der Minimum-Methode ist, dass *keine Konvergenzgarantie gegeben ist*. Es ist durchaus möglich, dass keine noch so große Glättung zu einem Histogramm mit zwei Spitzen führt: Vielleicht gibt es nur eine Spitze oder gar keine, wenn alle Pixel nur einen konstanten Wert haben.
es: Una 'característica' del método Mínimo es que *no se garantiza que converja*. Es muy posible que ninguna cantidad de suavizado dé como resultado un histograma con 2 picos: tal vez solo haya 1 pico, o ninguno en absoluto si todos los píxeles son solo un valor constante.
pt_br: Uma 'característica' do método Mínimo é que *não há garantia de convergência*. É perfeitamente possível que nenhuma suavização resulte em um histograma com 2 picos: talvez haja apenas 1 pico, ou nenhum, se todos os pixels forem apenas um valor constante.
