Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/thresholding.po
Languages: de, es, pt_br

source: I *do* agree that automated thresholds are strongly preferable to subjectively picking a threshold by eye -- but only if they can be shown to work reliably for a particular dataset. A bad automated threshold can easily introduce a systematic bias that is much worse than manually setting a threshold for each image.
de: Ich *stimme* zu, dass automatisierte Schwellenwerte der subjektiven Auswahl eines Schwellenwerts nach Augenmaß deutlich vorzuziehen sind – aber nur, wenn nachgewiesen werden kann, dass sie für einen bestimmten Datensatz zuverlässig funktionieren. Ein schlechter automatisierter Schwellenwert kann leicht zu einer systematischen Verzerrung führen, die viel schlimmer ist als die manuelle Festlegung eines Schwellenwerts für jedes Bild.
es: *Estoy* de acuerdo en que los umbrales automatizados son muy preferibles a elegir subjetivamente un umbral a simple vista, pero solo si se puede demostrar que funcionan de manera confiable para un conjunto de datos en particular. Un umbral automatizado incorrecto puede introducir fácilmente un sesgo sistemático que es mucho peor que establecer manualmente un umbral para cada imagen.
pt_br: Eu *concordo* que limites automatizados são fortemente preferíveis a escolher subjetivamente um limite a olho nu - mas apenas se for possível demonstrar que funcionam de maneira confiável para um conjunto de dados específico. Um limite automatizado incorreto pode facilmente introduzir um viés sistemático que é muito pior do que definir manualmente um limite para cada imagem.

source: Thresholding difficult data
de: Schwellenwert für schwierige Daten
es: Estableciendo umbrales en datos difíciles
pt_br: Limitando dados difíceis

source: Applying global thresholds is all well and good in easy images for which a threshold clearly exists, but in practice things are rarely so straightforward – and often no threshold, manual or automatic, produces useable results. This section anticipates the next chapter on filters by showing that, with some extra processing, thresholding can be redeemed even if it initially seems to perform badly.
de: Die Anwendung globaler Schwellenwerte ist bei einfachen Bildern, für die es eindeutig einen Schwellenwert gibt, schön und gut, aber in der Praxis sind die Dinge selten so einfach – und oft führt kein Schwellenwert, weder manuell noch automatisch, zu brauchbaren Ergebnissen. In diesem Abschnitt wird das nächste Kapitel über Filter vorweggenommen, indem gezeigt wird, dass die Schwellenwertbestimmung mit etwas zusätzlicher Verarbeitung behoben werden kann, selbst wenn sie zunächst eine schlechte Leistung zu erbringen scheint.
es: Aplicar umbrales globales está muy bien en imágenes sencillas para las que existe claramente un umbral, pero en la práctica las cosas rara vez son tan sencillas y, a menudo, ningún umbral, manual o automático, produce resultados utilizables. Esta sección anticipa temas del próximo capítulo sobre filtros al mostrar que, con algo de procesamiento adicional, el umbral se puede rescatar incluso si inicialmente parece funcionar mal.
pt_br: Aplicar limites globais é muito bom em imagens fáceis para as quais existe claramente um limite, mas na prática as coisas raramente são tão simples – e muitas vezes nenhum limite, manual ou automático, produz resultados utilizáveis. Esta seção antecipa o próximo capítulo sobre filtros, mostrando que, com algum processamento extra, o limiar pode ser resgatado mesmo que inicialmente pareça ter um desempenho ruim.

source: Thresholding noisy data
de: Schwellenwert für verrauschte Daten
es: Encontrando el umbral en datos ruidosos
pt_br: Limitando dados ruidosos

source: Noise is one problem that affects thresholds, especially in live cell imaging.
de: Rauschen ist ein Problem, das die Schwellenwerte beeinflusst, insbesondere bei der Bildgebung lebender Zellen.
es: El ruido es un problema que afecta los umbrales, especialmente en las imágenes de células vivas.
pt_br: O ruído é um problema que afeta os limiares, especialmente em imagens de células vivas.

source: The top half of {numref}`fig-thresholds_noisy` reproduces the nuclei from {numref}`fig-thresholds_nuclei_histogram` but with extra noise added to simulate less than ideal imaging conditions. Although the nuclei are still clearly visible in the image (A), the two classes of pixels (which were previously easy to separate) have now been merged together in the histogram (B). The triangle threshold method, which had performed well before, now gives less attractive results \(C), because the noise has caused the ranges of background and nuclei pixels to overlap.
de: Die obere Hälfte von {numref}`fig-thresholds_noisy` reproduziert die Kerne aus {numref}`fig-thresholds_nuclei_histogram`, jedoch mit zusätzlichem Rauschen nicht ideale Bildbedingungen simulieren. Obwohl die Kerne im Bild (A) immer noch deutlich sichtbar sind, wurden die beiden Pixelklassen (die zuvor leicht zu trennen waren) jetzt im Histogramm (B) zusammengeführt. Die Dreiecksschwellenwertmethode, die zuvor gut funktionierte, liefert nun weniger attraktive Ergebnisse \(C), da das Rauschen dazu geführt hat, dass sich die Bereiche der Hintergrund- und Kernpixel überlappen.
es: La mitad superior de {numref}`fig-thresholds_noisy` reproduce los núcleos de {numref}`fig-thresholds_nuclei_histogram` pero con ruido adicional agregado, simulando condiciones de imagen sub-optimas. Aunque los núcleos todavía son claramente visibles en la imagen (A), las dos clases de píxeles (que antes eran fáciles de separar) ahora se han fusionado en el histograma (B). El método del umbral triangular, que había funcionado bien antes, ahora da resultados menos atractivos \(C), porque el ruido ha provocado que los rangos de píxeles del fondo y del núcleo se superpongan.
pt_br: A metade superior de {numref}`fig-thresholds_noisy` reproduz os núcleos de {numref}`fig-thresholds_nuclei_histogram` mas com ruído extra adicionado a simular condições de imagem abaixo das ideais. Embora os núcleos ainda sejam claramente visíveis na imagem (A), as duas classes de pixels (que antes eram fáceis de separar) foram agora fundidas no histograma (B). O método do limiar do triângulo, que tinha um bom desempenho antes, agora fornece resultados menos atraentes \(C), porque o ruído fez com que as faixas de pixels de fundo e de núcleo se sobrepusessem.

source: *However,* if we apply a Gaussian filter to smooth the image, a lot of the the random noise is reduced (see {ref}`chap_filters`). This results in a histogram dramatically more similar to that in the original, (almost) noise-free image, and the threshold is again quite successful (F).
de: *Wenn wir jedoch einen Gaußschen Filter anwenden, um das Bild zu glätten, wird ein Großteil des zufälligen Rauschens reduziert (siehe {ref}`chap_filters`). Dies führt zu einem Histogramm, das dem des ursprünglichen, (fast) rauschfreien Bildes deutlich ähnlicher ist, und der Schwellenwert ist wiederum recht erfolgreich (F).
es: *Sin embargo,* si aplicamos un filtro Gaussiano para suavizar la imagen, gran parte del ruido aleatorio se reduce (consulte {ref}`chap_filters`). Esto da como resultado un histograma dramáticamente más similar al de la imagen original, (casi) libre de ruido, y el umbral nuevamente es bastante exitoso (F).
pt_br: *No entanto,* se aplicarmos um filtro gaussiano para suavizar a imagem, grande parte do ruído aleatório será reduzido (veja {ref}`chap_filters`). Isso resulta em um histograma dramaticamente mais semelhante ao da imagem original, (quase) sem ruído, e o limite é novamente bastante bem-sucedido (F).

source: Noise can affect thresholding. After the addition of simulated noise to the image in {numref}`fig-thresholds_nuclei_histogram`, the distinction between nuclei and non-nuclei pixels is much harder to identify in the histogram (B). Any threshold would result in a large number of incorrectly-identified pixels. However, applying a Gaussian filter (here, $\sigma = 2$) to reduce noise can dramatically improve the situation (E). Thresholds in \(C) and (F) were computed using the triangle method.
de: Rauschen kann die Schwellenwertermittlung beeinträchtigen. Nach dem Hinzufügen von simuliertem Rauschen zum Bild in {numref}`fig-thresholds_nuclei_histogram` ist die Unterscheidung zwischen Kern- und Nicht-Kernpixeln im Histogramm (B) viel schwieriger zu erkennen. Jeder Schwellenwert würde zu einer großen Anzahl falsch identifizierter Pixel führen. Allerdings kann die Anwendung eines Gaußschen Filters (hier $\sigma = 2$) zur Reduzierung des Rauschens die Situation dramatisch verbessern (E). Die Schwellenwerte in \(C) und (F) wurden mit der Dreiecksmethode berechnet.
es: El ruido puede afectar el umbral. Después de agregar ruido simulado a la imagen en {numref}`fig-thresholds_nuclei_histogram`, la distinción entre píxeles con y sin núcleos es mucho más difícil de identificar en el histograma (B). Cualquier umbral daría como resultado una gran cantidad de píxeles identificados incorrectamente. Sin embargo, aplicar un filtro Gaussiano (aquí, $\sigma = 2$) para reducir el ruido puede mejorar drásticamente la situación (E). Los umbrales en \(C) y (F) se calcularon utilizando el método del triángulo.
pt_br: O ruído pode afetar o limiar. Após a adição de ruído simulado à imagem em {numref}`fig-thresholds_nuclei_histogram`, a distinção entre pixels núcleos e não-núcleos é muito mais difícil de identificar no histograma (B). Qualquer limite resultaria em um grande número de pixels identificados incorretamente. No entanto, aplicar um filtro gaussiano (aqui, $\sigma = 2$) para reduzir o ruído pode melhorar drasticamente a situação (E). Os limites em \(C) e (F) foram calculados usando o método do triângulo.

source: Local thresholding
de: Lokale Schwellenwertbildung
es: Umbral local
pt_br: Limite local

source: Another common problem is that the structures that should be detected appear on top of a background that itself varies in brightness. This was the reason no threshold performed very well in {numref}`fig-thresholds_manual`.
de: Ein weiteres häufiges Problem besteht darin, dass die zu erkennenden Strukturen auf einem Hintergrund erscheinen, dessen Helligkeit selbst variiert. Dies war der Grund dafür, dass kein Schwellenwert in {numref}`fig-thresholds_manual` sehr gut abschnitt.
es: Otro problema común es que las estructuras que deberían detectarse aparecen sobre un fondo que a su vez varía en brillo. Esta fue la razón por la que ningún umbral funcionó muy bien en {numref}`fig-thresholds_manual`.
pt_br: Outro problema comum é que as estruturas que deveriam ser detectadas aparecem sobre um fundo que varia em brilho. Esta foi a razão pela qual nenhum limite teve um desempenho muito bom em {numref}`fig-thresholds_manual`.

source: Ideally, we would like to apply a threshold that varies relative to the local background.
de: Idealerweise möchten wir einen Schwellenwert anwenden, der im Verhältnis zum lokalen Hintergrund variiert.
es: Idealmente, nos gustaría aplicar un umbral que varíe en relación con el entorno local.
pt_br: Idealmente, gostaríamos de aplicar um limite que variasse em relação ao contexto local.

source: W. Niblack, An introduction to Digital Image Processing, Prentice-Hall, 1986.
de: W. Niblack, Eine Einführung in die digitale Bildverarbeitung, Prentice-Hall, 1986.
es: W. Niblack, Introducción al procesamiento de imágenes digitales, Prentice-Hall, 1986.
pt_br: W. Niblack, Uma introdução ao processamento digital de imagens, Prentice-Hall, 1986.

source: There are a variety of **local thresholding** methods available, many of which are variations on the **Niblack method**. This calculates the mean and standard deviation of pixels *in a local window around each pixel*, for example a square of 25 x 25 pixels.
de: Es stehen verschiedene **lokale Schwellenwertmethoden** zur Verfügung, von denen viele Variationen der **Niblack-Methode** sind. Dadurch werden der Mittelwert und die Standardabweichung der Pixel *in einem lokalen Fenster um jedes Pixel* berechnet, beispielsweise ein Quadrat von 25 x 25 Pixeln.
es: Hay una variedad de métodos de **umbral local** disponibles, muchos de los cuales son variaciones del **método Niblack**. Esto calcula la media y la desviación estándar de los píxeles *en una ventana local alrededor de cada píxel*, por ejemplo, un cuadrado de 25 x 25 píxeles.
pt_br: Há uma variedade de métodos de **limiarização local** disponíveis, muitos dos quais são variações do método **Niblack**. Isso calcula a média e o desvio padrão de pixels *em uma janela local ao redor de cada pixel*, por exemplo, um quadrado de 25 x 25 pixels.

source: A separate threshold is then generated for every pixel,defined as *local_mean - k x local_std.dev*. Note the sign: *-k* is used, because the original definition was focussed on recognizing dark text on a light background, but *k* itself can be a negative number if needed.
de: Anschließend wird für jedes Pixel ein separater Schwellenwert generiert, der als *local_mean - k x local_std.dev* definiert ist. Beachten Sie das Zeichen: *-k* wird verwendet, da die ursprüngliche Definition auf die Erkennung von dunklem Text auf hellem Hintergrund ausgerichtet war, *k* selbst kann jedoch bei Bedarf eine negative Zahl sein.
es: Luego se genera un umbral separado para cada píxel, definido como *local_mean - k x local_std.dev*. Ten en cuenta el signo: se utiliza *-k* porque la definición original se centró en reconocer texto oscuro sobre un fondo claro, pero *k* en sí mismo puede ser un número negativo si es necesario.
pt_br: Um limite separado é então gerado para cada pixel, definido como *local_mean - k x local_std.dev*. Observe o sinal: *-k* é usado porque a definição original se concentrava no reconhecimento de texto escuro em um fundo claro, mas o próprio *k* pode ser um número negativo, se necessário.

source: An example is shown in {numref}`fig-thresholds_local_niblack`.
de: Ein Beispiel finden Sie in {numref}`fig-thresholds_local_niblack`.
es: Se muestra un ejemplo en {numref}`fig-thresholds_local_niblack`.
pt_br: Um exemplo é mostrado em {numref}`fig-thresholds_local_niblack`.

source: Local thresholding to detect spots using Niblack's method.
de: Lokale Schwellenwertbestimmung zur Erkennung von Flecken mithilfe der Niblack-Methode.
es: Umbral local para detectar manchas utilizando el método de Niblack.
pt_br: Limiarização local para detecção de manchas usando o método de Niblack.

source: To be honest, I don't tend to use this approach for bioimages. I find the window size and *k* parameters difficult to tune, and it suffers the problem of the mean and standard deviation not being robust.
de: Ehrlich gesagt verwende ich diesen Ansatz nicht für Biobilder. Ich finde es schwierig, die Fenstergröße und die *k*-Parameter anzupassen, und es besteht das Problem, dass der Mittelwert und die Standardabweichung nicht robust sind.
es: Para ser honesto, no suelo utilizar este enfoque para bioimágenes. Me parece que el tamaño de la ventana y los parámetros *k* son difíciles de ajustar, y sufre el problema de que la media y la desviación estándar no son robustas.
pt_br: Para ser honesto, não costumo usar essa abordagem para bioimagens. Acho o tamanho da janela e os parâmetros *k* difíceis de ajustar e há o problema de a média e o desvio padrão não serem robustos.

source: However, local thresholding becomes more interesting and powerful if we take matters into our own hands by thinking about the problem from a slightly different angle.
de: Die lokale Schwellenwertermittlung wird jedoch interessanter und wirkungsvoller, wenn wir die Sache selbst in die Hand nehmen und das Problem aus einem etwas anderen Blickwinkel betrachten.
es: Sin embargo, el establecimiento de umbrales locales se vuelve más interesante y poderoso si tomamos el asunto en nuestras propias manos y pensamos en el problema desde un ángulo ligeramente diferente.
pt_br: No entanto, a limiarização local torna-se mais interessante e poderosa se resolvermos o problema com as nossas próprias mãos, pensando no problema de um ângulo ligeiramente diferente.

source: Suppose we had a second image that contained values equal to the thresholds we want to apply at each pixel. If we simply *subtract* this second image from the first, we can then apply a global threshold of 0 to detect what we want.
de: Angenommen, wir hätten ein zweites Bild, das Werte enthält, die den Schwellenwerten entsprechen, die wir auf jedes Pixel anwenden möchten. Wenn wir dieses zweite Bild einfach vom ersten *subtrahieren*, können wir einen globalen Schwellenwert von 0 anwenden, um zu erkennen, was wir wollen.
es: Supongamos que tenemos una segunda imagen que contiene valores iguales a los umbrales que queremos aplicar en cada píxel. Si simplemente *restamos* esta segunda imagen de la primera, podemos aplicar un umbral global de 0 para detectar lo que queremos.
pt_br: Suponha que tenhamos uma segunda imagem que contenha valores iguais aos limites que queremos aplicar em cada pixel. Se simplesmente *subtrairmos* esta segunda imagem da primeira, poderemos então aplicar um limite global de 0 para detectar o que queremos.

source: Alternatively, we could subtract an image with values that aren't exactly equal to the local thresholds, but similar enough to effectively flatten out the background so that a global threshold can be applied. This then provides us access to all global automated thresholding methods, and an intuition of how the histograms ought to look for the methods to be appropriate. {numref}`fig-thresholds_local` shows this in action.
de: Alternativ könnten wir ein Bild mit Werten subtrahieren, die nicht genau den lokalen Schwellenwerten entsprechen, aber ähnlich genug sind, um den Hintergrund effektiv zu glätten, sodass ein globaler Schwellenwert angewendet werden kann. Dies verschafft uns dann Zugriff auf alle globalen automatisierten Schwellenwertmethoden und eine Vorstellung davon, wie die Histogramme aussehen sollten, damit die Methoden geeignet sind. {numref}`fig-thresholds_local` zeigt dies in Aktion.
es: Alternativamente, podríamos restar una imagen con valores que no sean exactamente iguales a los umbrales locales, pero que sean lo suficientemente similares como para aplanar efectivamente el fondo y poder aplicar un umbral global. Esto luego nos proporciona acceso a todos los métodos globales de umbralización automatizada y una intuición de cómo deben verse los histogramas para que los métodos sean apropiados. {numref}`fig-thresholds_local` muestra esto en acción.
pt_br: Alternativamente, poderíamos subtrair uma imagem com valores que não são exatamente iguais aos limites locais, mas semelhantes o suficiente para nivelar efetivamente o fundo, de modo que um limite global possa ser aplicado. Isso nos fornece acesso a todos os métodos globais de limiar automatizado e uma intuição de como os histogramas devem parecer para que os métodos sejam apropriados. {numref}`fig-thresholds_local` mostra isso em ação.

source: Thresholding to detect structures appearing on a varying background. No global threshold may be sufficiently selective _(top row)_. However, if a 'background image' can be created, (here using a large median filter), and then subtracted, a single threshold can give much better results _(bottom row)_. This is equivalent to applying a varying threshold to the original image.
de: Schwellenwert zur Erkennung von Strukturen, die auf einem unterschiedlichen Hintergrund erscheinen. Kein globaler Schwellenwert ist möglicherweise ausreichend selektiv _(obere Reihe)_. Wenn jedoch ein „Hintergrundbild“ erstellt (hier unter Verwendung eines großen Medianfilters) und dann subtrahiert werden kann, kann ein einzelner Schwellenwert viel bessere Ergebnisse liefern _(untere Zeile)_. Dies entspricht der Anwendung eines unterschiedlichen Schwellenwerts auf das Originalbild.
es: Umbral para detectar estructuras que aparecen sobre un fondo variable. Ningún umbral global puede ser suficientemente selectivo _(fila superior)_. Sin embargo, si se puede crear una 'imagen de fondo' (aquí usando un filtro mediano grande) y luego restarla, un único umbral puede dar resultados mucho mejores _(fila inferior)_. Esto equivale a aplicar un umbral variable a la imagen original.
pt_br: Limiar para detectar estruturas que aparecem em um fundo variável. Nenhum limite global pode ser suficientemente seletivo _(linha superior)_. No entanto, se uma 'imagem de fundo' puder ser criada (aqui usando um filtro mediano grande) e depois subtraída, um único limite pode fornecer resultados muito melhores _(linha inferior)_. Isto equivale a aplicar um limite variável à imagem original.

source: The difficult part is creating the second image. Filters are the key, and the subject of the [next chapter](chap_filters).
de: Der schwierige Teil besteht darin, das zweite Bild zu erstellen. Filter sind der Schlüssel und das Thema des [nächsten Kapitels](chap_filters).
es: La parte difícil es crear la segunda imagen. Los filtros son la clave y el tema del próximo capítulo [next chapter] (chap_filters).
pt_br: A parte difícil é criar a segunda imagem. Os filtros são a chave e o assunto do [próximo capítulo](chap_filters).

source: Of course there may be multiple classes for different kinds of objects, and perhaps multiple thresholds would make more sense. There is a variation of Otsu's method for identifying multiple thresholds.
de: Natürlich kann es mehrere Klassen für verschiedene Arten von Objekten geben, und möglicherweise wären mehrere Schwellenwerte sinnvoller. Es gibt eine Variation der Methode von Otsu zur Identifizierung mehrerer Schwellenwerte.
es: Por supuesto, puede haber múltiples clases para diferentes tipos de objetos, y quizás tener múltiples umbrales haría más sentido. Existe una variación del método de Otsu para identificar múltiples umbrales.
pt_br: É claro que pode haver múltiplas classes para diferentes tipos de objetos, e talvez múltiplos limites fizessem mais sentido. Existe uma variação do método de Otsu para identificar múltiplos limites.
