Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/thresholding.po
Languages: de, es, pt_br

source: Firstly, there is a large peak to the left and a much shallower peak to the right. This suggests that there are at least two distinct regions in the image. Since the background of an image tends to contain many pixes with similar values, I would guess that we might have an image with a dark background.
de: Erstens gibt es links einen großen Gipfel und rechts einen viel flacheren Gipfel. Dies deutet darauf hin, dass das Bild mindestens zwei unterschiedliche Bereiche enthält. Da der Hintergrund eines Bildes in der Regel viele Pixel mit ähnlichen Werten enthält, vermute ich, dass es sich um ein Bild mit dunklem Hintergrund handelt.
es: En primer lugar, hay un pico grande a la izquierda y otro mucho menos profundo a la derecha. Esto sugiere que hay al menos dos regiones distintas en la imagen. Dado que el fondo de una imagen tiende a contener muchos píxeles con valores similares, supongo que podríamos tener una imagen con un fondo oscuro.
pt_br: Em primeiro lugar, há um pico grande à esquerda e um pico muito mais raso à direita. Isto sugere que existem pelo menos duas regiões distintas na imagem. Como o fundo de uma imagem tende a conter muitos pixels com valores semelhantes, imagino que poderíamos ter uma imagem com fundo escuro.

source: In any case, a threshold around 20-25 looks like it would be a good choice to separate the regions... whatever they may be.
de: Auf jeden Fall scheint ein Schwellenwert von etwa 20–25 eine gute Wahl zu sein, um die Regionen zu trennen … was auch immer sie sein mögen.
es: En cualquier caso, un umbral de alrededor de 20-25 parece ser una buena opción para separar las regiones... sean cuales sean.
pt_br: Em qualquer caso, um limiar em torno de 20-25 parece ser uma boa escolha para separar as regiões... sejam elas quais forem.

source: If we then look at the image, we can see that we have in fact got a fluorescence image depicting two nuclei. Applying a threshold of 20 does achieve a good separation of the nuclei from the background: a successful segmentation.
de: Wenn wir uns dann das Bild ansehen, können wir erkennen, dass wir tatsächlich ein Fluoreszenzbild erhalten haben, das zwei Kerne zeigt. Durch die Anwendung eines Schwellenwerts von 20 wird eine gute Trennung der Kerne vom Hintergrund erreicht: eine erfolgreiche Segmentierung.
es: Si luego miramos la imagen, podemos ver que, de hecho, tenemos una imagen de fluorescencia que representa dos núcleos. Aplicando un umbral de 20 sí se consigue una buena separación de los núcleos del fondo: una segmentación exitosa.
pt_br: Se olharmos então para a imagem, podemos ver que de facto obtivemos uma imagem de fluorescência representando dois núcleos. A aplicação de um limite de 20 consegue uma boa separação dos núcleos do fundo: uma segmentação bem-sucedida.

source: A simple fluorescence image containing two nuclei. We could determine a potentially useful threshold based only on looking at the histogram.
de: Ein einfaches Fluoreszenzbild mit zwei Kernen. Wir könnten einen potenziell nützlichen Schwellenwert allein anhand der Betrachtung des Histogramms ermitteln.
es: Una imagen de fluorescencia simple que contiene dos núcleos. Podríamos determinar un umbral potencialmente útil basándonos únicamente en mirar el histograma.
pt_br: Uma imagem de fluorescência simples contendo dois núcleos. Poderíamos determinar um limite potencialmente útil com base apenas na observação do histograma.

source: Admittedly, that was a particularly easy example. We should try a slightly harder one.
de: Zugegebenermaßen war das ein besonders einfaches Beispiel. Wir sollten es mit einer etwas härteren Variante versuchen.
es: Es cierto que se trata de un ejemplo particularmente sencillo. Deberíamos intentar uno un poco más difícil.
pt_br: É certo que esse foi um exemplo particularmente fácil. Devíamos tentar um pouco mais difícil.

source: We still have a large peak, but this time it is towards the right. So I would guess a light background rather than a dark one.
de: Wir haben immer noch einen großen Gipfel, aber dieses Mal geht er nach rechts. Daher würde ich eher auf einen hellen als auf einen dunklen Hintergrund tippen.
es: Todavía tenemos un pico grande, pero esta vez es hacia la derecha. Así que yo diría que es un fondo claro en lugar de uno oscuro.
pt_br: Ainda temos um pico grande, mas desta vez é para a direita. Então, eu acho que um fundo claro em vez de escuro.

source: But the problem is that we seem to have *two* shallower peaks to the left. That suggests at least three different classes of pixels in the image.
de: Aber das Problem ist, dass wir scheinbar *zwei* flachere Gipfel auf der linken Seite haben. Das deutet auf mindestens drei verschiedene Pixelklassen im Bild hin.
es: Pero el problema es que parece que tenemos *dos* picos menos profundos a la izquierda. Eso sugiere al menos tres clases diferentes de píxeles en la imagen.
pt_br: Mas o problema é que parecemos ter *dois* picos mais rasos à esquerda. Isso sugere pelo menos três classes diferentes de pixels na imagem.

source: From visual inspection, we might suppose a threshold of 140 would make sense. Or perhaps around 220. It isn't clear.
de: Aufgrund der visuellen Betrachtung könnten wir annehmen, dass ein Schwellenwert von 140 sinnvoll wäre. Oder vielleicht um die 220. Es ist nicht klar.
es: A partir de una inspección visual, podríamos suponer que un umbral de 140 tendría sentido. O quizás alrededor de 220. No está claro.
pt_br: A partir da inspeção visual, poderíamos supor que um limite de 140 faria sentido. Ou talvez por volta de 220. Não está claro.

source: This time, we *do* need to look at the image to decide. Even then, there is no unambiguously 'correct' threshold. Rather, the one we choose depends upon whether our goal is to identify the entire leaf or rather just the darkest region.
de: Dieses Mal müssen wir uns das Bild ansehen, um eine Entscheidung zu treffen. Selbst dann gibt es keinen eindeutig „richtigen“ Schwellenwert. Die Wahl hängt vielmehr davon ab, ob es unser Ziel ist, das gesamte Blatt oder nur den dunkelsten Bereich zu identifizieren.
es: Esta vez, *sí* necesitamos mirar la imagen para decidir. Incluso entonces, no existe un umbral inequívocamente "correcto". Más bien, el que elijamos depende de si nuestro objetivo es identificar la hoja completa o sólo la región más oscura.
pt_br: Desta vez, precisamos *precisar* olhar a imagem para decidir. Mesmo assim, não existe um limite inequivocamente “correto”. Em vez disso, o que escolhemos depende se o nosso objetivo é identificar a folha inteira ou apenas a região mais escura.

source: An image where evaluating the histogram suggests two candidate thresholds. The 'correct' threshold depends upon the desired outcome. Note that here we identify pixels *below* the threshold value, rather than above, because the background is ligher.
de: Ein Bild, bei dem die Auswertung des Histogramms zwei mögliche Schwellenwerte nahelegt. Der „richtige“ Schwellenwert hängt vom gewünschten Ergebnis ab. Beachten Sie, dass wir hier Pixel *unterhalb* des Schwellenwerts identifizieren und nicht darüber, da der Hintergrund heller ist.
es: Una imagen donde la evaluación del histograma sugiere dos posibles umbrales. El umbral "correcto" depende del resultado deseado. Ten en cuenta que aquí identificamos píxeles *por debajo* del valor umbral, en lugar de por encima, porque el fondo es más claro.
pt_br: Uma imagem onde a avaliação do histograma sugere dois limites candidatos. O limite “correto” depende do resultado desejado. Observe que aqui identificamos pixels *abaixo* do valor limite, e não acima, porque o fundo é mais claro.

source: Histograms can help us choose thresholds
de: Histogramme können uns bei der Auswahl von Schwellenwerten helfen
es: Los histogramas pueden ayudarnos a elegir umbrales
pt_br: Os histogramas podem nos ajudar a escolher limites

source: Histograms can be really useful when choosing threshold values -- but we need to also incorporate knowledge of *why* we are thresholding.
de: Histogramme können bei der Auswahl von Schwellenwerten sehr nützlich sein – aber wir müssen auch das Wissen darüber einbeziehen, *warum* wir Schwellenwerte festlegen.
es: Los histogramas pueden ser realmente útiles a la hora de elegir valores de umbral, pero también debemos incorporar conocimiento de *por qué* estamos estableciendo umbrales.
pt_br: Os histogramas podem ser realmente úteis na escolha de valores limite - mas precisamos também incorporar o conhecimento do *porquê* estamos estabelecendo limites.

source: The importance of the threshold choice
de: Die Bedeutung der Schwellenwertwahl
es: La importancia de la elección del umbral
pt_br: A importância da escolha do limite

source: We've seen that histograms can help us identify suitable thresholds, but they don't absolve us of the need to think. This is particularly evident when objects are not very distinct. The exact choice of threshold can then be crucial.
de: Wir haben gesehen, dass Histogramme uns dabei helfen können, geeignete Schwellenwerte zu identifizieren, aber sie befreien uns nicht von der Notwendigkeit, darüber nachzudenken. Dies wird besonders deutlich, wenn Objekte nicht sehr deutlich erkennbar sind. Die genaue Wahl der Schwelle kann dann entscheidend sein.
es: Hemos visto que los histogramas pueden ayudarnos a identificar umbrales adecuados, pero no nos eximen de la necesidad de pensar. Esto es particularmente evidente cuando los objetos no son muy distintos. La elección exacta del umbral puede ser entonces crucial.
pt_br: Vimos que os histogramas podem nos ajudar a identificar limites adequados, mas não nos isentam da necessidade de pensar. Isto é particularmente evidente quando os objetos não são muito distintos. A escolha exata do limite pode então ser crucial.

source: {numref}`fig-thresholds_manual` shows an example where the goal is to detect the bright spots (lysosomes). No single global threshold can give us perfect results, but at first glance many different thresholds can appear to give *somewhat* sensible results. The histogram gives, at best, a vague hint where a good threshold may lurk.
de: {numref}`fig-thresholds_manual` zeigt ein Beispiel, bei dem das Ziel darin besteht, die hellen Flecken (Lysosomen) zu erkennen. Kein einzelner globaler Schwellenwert kann uns perfekte Ergebnisse liefern, aber auf den ersten Blick können viele verschiedene Schwellenwerte * einigermaßen * sinnvolle Ergebnisse liefern. Das Histogramm gibt bestenfalls einen vagen Hinweis darauf, wo ein guter Schwellenwert lauern könnte.
es: {numref}`fig-thresholds_manual` muestra un ejemplo donde el objetivo es detectar los puntos brillantes (lisosomas). Ningún umbral global puede darnos resultados perfectos, pero a primera vista muchos umbrales diferentes parecen dar resultados *algo* sensatos. El histograma da, en el mejor de los casos, una vaga pista de dónde puede esconderse un buen umbral.
pt_br: {numref}`fig-thresholds_manual` mostra um exemplo onde o objetivo é detectar os pontos brilhantes (lisossomos). Nenhum limite global pode nos dar resultados perfeitos, mas à primeira vista muitos limites diferentes podem parecer fornecer resultados *um tanto* sensatos. O histograma dá, na melhor das hipóteses, uma vaga dica de onde pode estar um bom limite.

source: Applying different manually-chosen thresholds to the same image can give quite different results.
de: Das Anwenden verschiedener manuell ausgewählter Schwellenwerte auf dasselbe Bild kann zu ganz unterschiedlichen Ergebnissen führen.
es: Aplicar diferentes umbrales elegidos manualmente a la misma imagen puede dar resultados bastante diferentes.
pt_br: Aplicar diferentes limites escolhidos manualmente à mesma imagem pode fornecer resultados bastante diferentes.

source: I would like to convey three main messages from {numref}`fig-thresholds_manual`:
de: Ich möchte drei Hauptbotschaften von {numref}`fig-thresholds_manual` übermitteln:
es: Me gustaría transmitir tres mensajes principales de {numref}`fig-thresholds_manual`:
pt_br: Gostaria de transmitir três mensagens principais de {numref}`fig-thresholds_manual`:

source: The **choice of threshold is crucial**, influencing the numbers *and* areas of spots
de: Die **Wahl des Schwellenwerts ist entscheidend** und beeinflusst die Anzahl *und* Flächen der Flecken
es: La **elección del umbral es crucial**, ya que influye en los números *y* las áreas de las manchas.
pt_br: A **escolha do limite é crucial**, influenciando os números *e* áreas dos pontos

source: A **threshold that is too low** tends to **make structures bigger & merge some together**
de: Ein **zu niedriger Schwellenwert** neigt dazu, **Strukturen größer zu machen und einige miteinander zu verschmelzen**
es: Un **umbral demasiado bajo** tiende a **agrandar las estructuras y fusionar algunas**
pt_br: Um **limiar muito baixo** tende a **tornar as estruturas maiores e fundir algumas delas**

source: A **threshold that is too high** tends to **make structures smaller & miss some**
de: Ein **zu hoher Schwellenwert** neigt dazu, **Strukturen kleiner zu machen und einige zu übersehen**
es: Un **umbral demasiado alto** tiende a **hacer que las estructuras sean más pequeñas y a perder algunas**
pt_br: Um **limiar muito alto** tende a **tornar as estruturas menores e perder algumas**

source: Choosing a threshold manually gives a **huge opportunity to introduce bias**
de: Die manuelle Auswahl eines Schwellenwerts bietet **eine große Chance, Voreingenommenheit einzuführen**
es: Elegir un umbral manualmente brinda una **gran oportunidad de introducir sesgos**
pt_br: Escolher um limite manualmente oferece uma **grande oportunidade de introduzir preconceitos**

source: We should **consider our errors when selecting output metrics**. For example, if we needed to estimate the size of a spot from any of these results then the median is likely to be preferable, because it is less impacted by artificially large spots caused by merging.
de: Wir sollten **unsere Fehler bei der Auswahl der Ausgabemetriken berücksichtigen**. Wenn wir beispielsweise die Größe eines Flecks anhand eines dieser Ergebnisse schätzen müssen, ist der Median wahrscheinlich vorzuziehen, da er weniger von künstlich großen Flecken beeinflusst wird, die durch die Verschmelzung entstehen.
es: Deberíamos **considerar nuestros errores al seleccionar métricas de salida**. Por ejemplo, si necesitáramos estimar el tamaño de una mancha a partir de cualquiera de estos resultados, entonces es probable que sea preferible la mediana, porque se ve menos afectada por manchas artificialmente grandes causadas por la fusión.
pt_br: Devemos **considerar nossos erros ao selecionar métricas de saída**. Por exemplo, se precisássemos estimar o tamanho de uma mancha a partir de qualquer um destes resultados, então a mediana seria provavelmente preferível, porque é menos impactada por manchas artificialmente grandes causadas pela fusão.

source: A fourth point I would like to make is that **visualization matters too**. Looking only at the binary images, it is difficult to really evaluate *any* of the results. It helps enormously to overlay the detected regions on top of the original image ({numref}`fig-thresholds_manual_overlays`). From this we can see much more clearly that none of the results are terribly good: every threshold we tried misses some spots and merges others.
de: Ein vierter Punkt, den ich ansprechen möchte, ist, dass **auch die Visualisierung wichtig ist**. Wenn man nur die Binärbilder betrachtet, ist es schwierig, *irgendeines* der Ergebnisse wirklich zu bewerten. Es hilft enorm, die erkannten Regionen über das Originalbild zu legen ({numref}`fig-thresholds_manual_overlays`). Daraus können wir viel klarer erkennen, dass keines der Ergebnisse besonders gut ist: Bei jedem Schwellenwert, den wir ausprobiert haben, fehlen einige Stellen und andere werden zusammengeführt.
es: Un cuarto punto que me gustaría destacar es que **la visualización también importa**. Mirando sólo las imágenes binarias, es difícil evaluar realmente *cualquiera* de los resultados. Es de gran ayuda superponer las regiones detectadas encima de la imagen original ({numref}`fig-thresholds_manual_overlays`). A partir de esto podemos ver mucho más claramente que ninguno de los resultados es particularmente bueno: cada umbral que probamos omite algunos puntos y fusiona otros.
pt_br: Um quarto ponto que gostaria de salientar é que **a visualização também é importante**. Olhando apenas para as imagens binárias, é difícil avaliar realmente *qualquer* dos resultados. Ajuda enormemente sobrepor as regiões detectadas sobre a imagem original ({numref}`fig-thresholds_manual_overlays`). A partir disso, podemos ver com muito mais clareza que nenhum dos resultados é terrivelmente bom: cada limite que tentamos perde alguns pontos e mescla outros.

source: The binary images of {numref}`fig-thresholds_manual` viewed as overlays instead.
de: Stattdessen werden die Binärbilder von {numref}`fig-thresholds_manual` als Overlays angezeigt.
es: Las imágenes binarias de {numref}`fig-thresholds_manual` se ven como superposiciones.
pt_br: As imagens binárias de {numref}`fig-thresholds_manual` são vistas como sobreposições.

source: Beware summary plots!
de: Vorsicht vor zusammenfassenden Plots!
es: ¡Cuidado con las gráficas que resumen datos!
pt_br: Cuidado com gráficos resumidos!

source: I sometimes sit in lab meetings where people discuss their image analysis results without showing a single image. I don't approve of this at all.
de: Manchmal sitze ich in Laborbesprechungen, bei denen die Leute ihre Bildanalyseergebnisse diskutieren, ohne ein einziges Bild zu zeigen. Ich bin damit überhaupt nicht einverstanden.
es: A veces me siento en reuniones de laboratorio donde la gente discute los resultados de sus análisis de imágenes sin mostrar una sola imagen. No apruebo esto en absoluto.
pt_br: Às vezes participo de reuniões de laboratório onde as pessoas discutem os resultados de suas análises de imagens sem mostrar uma única imagem. Eu não aprovo isso de forma alguma.

source: It's easy to generate summary data with image analysis. In fact, it's disturbingly easy to generate vastly different -- even conflicting -- summary data by analyzing the same images in different ways. But, most worryingly of all, one can often concoct a biologically-plausible-sounding story around almost any results.
de: Mit der Bildanalyse ist es einfach, zusammenfassende Daten zu generieren. Tatsächlich ist es beunruhigend einfach, sehr unterschiedliche – sogar widersprüchliche – zusammenfassende Daten zu generieren, indem man dieselben Bilder auf unterschiedliche Weise analysiert. Am besorgniserregendsten ist jedoch, dass man aus fast allen Ergebnissen oft eine biologisch plausibel klingende Geschichte erfinden kann.
es: Es fácil generar datos resumidos con análisis de imágenes. De hecho, es inquietantemente fácil generar datos resumidos muy diferentes, incluso contradictorios, analizando las mismas imágenes de diferentes maneras. Pero lo más preocupante de todo es que a menudo se puede inventar una historia que parezca biológicamente plausible en torno a casi cualquier resultado.
pt_br: É fácil gerar dados resumidos com análise de imagens. Na verdade, é perturbadoramente fácil gerar dados resumidos muito diferentes – até mesmo conflitantes – analisando as mesmas imagens de maneiras diferentes. Mas, o mais preocupante de tudo, muitas vezes é possível inventar uma história que pareça biologicamente plausível em torno de quase todos os resultados.

source: It's crucial to visualize *what* is being detected and measured in each image, not just a spreadsheet or plot of the results. This is especially important when applying batch processing to many images at once. It's tempting to check a few images and then trust the summary spreadsheet for the next 10,000, but I think there is no substitute for visualizing all (or at least a large proportion) of the images themselves.
de: Es ist wichtig, in jedem Bild zu visualisieren, *was* erkannt und gemessen wird, und nicht nur in einer Tabelle oder einem Diagramm der Ergebnisse. Dies ist besonders wichtig, wenn Sie die Stapelverarbeitung auf viele Bilder gleichzeitig anwenden. Es ist verlockend, ein paar Bilder zu überprüfen und sich dann für die nächsten 10.000 auf die Übersichtstabelle zu verlassen, aber ich denke, es gibt keinen Ersatz dafür, alle (oder zumindest einen großen Teil) der Bilder selbst zu visualisieren.
es: Es crucial visualizar *qué* se detecta y mide en cada imagen, no solo una hoja de cálculo o un gráfico de los resultados. Esto es especialmente importante cuando se aplica el procesamiento por lotes a muchas imágenes a la vez. Es tentador comprobar algunas imágenes y luego confiar en la hoja de cálculo de resumen para las siguientes 10.000, pero creo que no hay sustituto para visualizar todas (o al menos una gran proporción) de las imágenes en sí.
pt_br: É crucial visualizar *o que* está sendo detectado e medido em cada imagem, e não apenas uma planilha ou gráfico dos resultados. Isto é especialmente importante ao aplicar o processamento em lote a muitas imagens de uma só vez. É tentador verificar algumas imagens e depois confiar na planilha de resumo para as próximas 10.000, mas acho que não há substituto para a visualização de todas (ou pelo menos uma grande proporção) das próprias imagens.

source: **For that reason, I would argue that devising an efficient visualization strategy is every bit as important as devising an analysis strategy.**
de: **Aus diesem Grund würde ich behaupten, dass die Entwicklung einer effizienten Visualisierungsstrategie genauso wichtig ist wie die Entwicklung einer Analysestrategie.**
es: **Por esa razón, yo diría que diseñar una estrategia de visualización eficiente es tan importante como diseñar una estrategia de análisis.**
pt_br: **Por esse motivo, eu diria que conceber uma estratégia de visualização eficiente é tão importante quanto conceber uma estratégia de análise.**
