Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/3-thresholding/thresholding.po
Languages: de, es, pt_br

source: Default Caption
de: Standardbeschriftung
es: Título predeterminado
pt_br: Legenda padrão

source: Thresholding
de: Schwellenwert
es: Umbral
pt_br: Limiar

source: Chapter outline
de: Kapitelüberblick
es: Bosquejo del capítulo
pt_br: Esboço do capítulo

source: **Image segmentation** is the process of detecting **objects** in an image
de: **Bildsegmentierung** ist der Prozess der Erkennung von **Objekten** in einem Bild
es: **Segmentación de imágenes** es el proceso de detectar **objetos** en una imagen.
pt_br: **Segmentação de imagem** é o processo de detecção de **objetos** em uma imagem

source: **Global thresholding** identifies pixel values above or below a particular threshold
de: **Globales Schwellenwertverfahren** identifiziert Pixelwerte über oder unter einem bestimmten Schwellenwert
es: **Umbral global** identifica valores de píxeles por encima o por debajo de un umbral particular
pt_br: **Limite global** identifica valores de pixels acima ou abaixo de um limite específico

source: The choice of threshold can introduce **bias**
de: Die Wahl des Schwellenwerts kann zu **Verzerrungen** führen
es: La elección del umbral puede introducir **bias**
pt_br: A escolha do limite pode introduzir **viés**

source: **Automated thresholding methods** can often determine a good threshold based upon the **image histogram** and **statistics** -- but only if certain assumptions are met
de: **Automatisierte Schwellenwertmethoden** können oft einen guten Schwellenwert basierend auf dem **Bildhistogramm** und **Statistiken** ermitteln – allerdings nur, wenn bestimmte Annahmen erfüllt sind
es: **Los métodos de umbral automatizados** a menudo pueden determinar un buen umbral basándose en el **histograma de la imagen** y las **estadísticas**, pero solo si se cumplen algunas suposiciones.
pt_br: **Métodos automatizados de limite** muitas vezes podem determinar um bom limite com base no **histograma da imagem** e nas **estatísticas**, mas somente se certas suposições forem atendidas

source: Thresholding is more powerful when combined with **filtering & subtraction**
de: Der Schwellenwert ist in Kombination mit **Filterung und Subtraktion** leistungsfähiger.
es: El umbral es más poderoso cuando se combina con **filtrado y resta**
pt_br: O limite é mais poderoso quando combinado com **filtragem e subtração**

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: Before we can measure anything in an image, we first need to detect it.
de: Bevor wir etwas in einem Bild messen können, müssen wir es zunächst erkennen.
es: Antes de que podamos medir algo en una imagen, primero debemos detectarlo.
pt_br: Antes de podermos medir qualquer coisa em uma imagem, primeiro precisamos detectá-la.

source: Sometimes, 'detection' might involve [manually drawing regions of interest (ROIs)](chap_rois). However, this laborious process does not scale very well. It can also be rather subjective.
de: Manchmal kann die „Erkennung“ das manuelle Zeichnen von Regionen von Interesse (ROIs) umfassen (chap_rois). Dieser mühsame Prozess lässt sich jedoch nicht sehr gut skalieren. Es kann auch eher subjektiv sein.
es: A veces, la 'detección' puede implicar [dibujar manualmente regiones de interés (ROI)] (chap_rois). Sin embargo, este laborioso proceso no escala muy bien. También puede ser bastante subjetivo.
pt_br: Às vezes, a 'detecção' pode envolver [desenhar manualmente regiões de interesse (ROIs)](chap_rois). No entanto, este processo trabalhoso não é muito bem dimensionado. Também pode ser bastante subjetivo.

source: In this chapter, we will begin to explore alternative ways to identify **objects** within images. An 'object' is something we want to detect; depending upon the application, an object might be a nucleus, a cell, a vessel, a person, a bird, a car, a helicopter... more or less anything we might find in an image.
de: In diesem Kapitel beginnen wir mit der Erforschung alternativer Möglichkeiten zur Identifizierung von **Objekten** in Bildern. Ein „Objekt“ ist etwas, das wir erkennen wollen; Abhängig von der Anwendung kann ein Objekt ein Kern, eine Zelle, ein Gefäß, eine Person, ein Vogel, ein Auto, ein Hubschrauber usw. sein – mehr oder weniger alles, was wir auf einem Bild finden.
es: En este capítulo, comenzaremos a explorar formas alternativas de identificar **objetos** dentro de imágenes. Un 'objeto' es algo que queremos detectar. Dependiendo de la aplicación, un objeto puede ser un núcleo, una célula, un vaso, una persona, un pájaro, un coche, un helicóptero... más o menos cualquier cosa que podamos encontrar en una imagen.
pt_br: Neste capítulo, começaremos a explorar formas alternativas de identificar **objetos** em imagens. Um 'objeto' é algo que queremos detectar; dependendo da aplicação, um objeto pode ser um núcleo, uma célula, um recipiente, uma pessoa, um pássaro, um carro, um helicóptero... mais ou menos qualquer coisa que possamos encontrar numa imagem.

source: This process of detecting objects is called **image segmentation**. If we can automate image segmentation, this is not only likely to be much faster than manually annotating regions but should also give more reproducible results.
de: Dieser Prozess der Objekterkennung wird **Bildsegmentierung** genannt. Wenn wir die Bildsegmentierung automatisieren können, ist dies wahrscheinlich nicht nur viel schneller als das manuelle Kommentieren von Regionen, sondern sollte auch besser reproduzierbare Ergebnisse liefern.
es: Este proceso de detección de objetos se llama **segmentación de imágenes**. Si podemos automatizar la segmentación de imágenes, esto no sólo será mucho más rápido que anotar regiones manualmente, sino que también debería dar resultados más reproducibles.
pt_br: Este processo de detecção de objetos é chamado de **segmentação de imagens**. Se pudermos automatizar a segmentação de imagens, isso provavelmente não será apenas muito mais rápido do que anotar regiões manualmente, mas também fornecerá resultados mais reproduzíveis.

source: Binary & labeled images
de: Binäre und beschriftete Bilder
es: Imágenes binarias y etiquetadas
pt_br: Imagens binárias e rotuladas

source: Image objects are commonly represented using **binary images**.
de: Bildobjekte werden üblicherweise durch **Binärbilder** dargestellt.
es: Los objetos de imagen se representan comúnmente mediante **imágenes binarias**.
pt_br: Objetos de imagem são comumente representados usando **imagens binárias**.

source: Each pixel in a binary image can have one of two values. Usually, these values are 0 and 1. In some software (including ImageJ) a binary image has the values 0 and 255, but this doesn't really make any difference to how it is used: the key point for our purposes is that one of the values represents the foreground (i.e. pixels that are part of an object), and the other value represents the background.
de: Jedes Pixel in einem Binärbild kann einen von zwei Werten haben. Normalerweise sind diese Werte 0 und 1. In manchen Programmen (einschließlich ImageJ) hat ein Binärbild die Werte 0 und 255, aber das macht keinen großen Unterschied für die Art und Weise, wie es verwendet wird: Der entscheidende Punkt für unsere Zwecke ist dieser Einer der Werte stellt den Vordergrund dar (d. h. Pixel, die Teil eines Objekts sind), und der andere Wert stellt den Hintergrund dar.
es: Cada píxel de una imagen binaria puede tener uno de dos valores. Normalmente, estos valores son 0 y 1. En algunos programas (incluido ImageJ), una imagen binaria tiene los valores 0 y 255, pero esto realmente no supone ninguna diferencia en cómo se utiliza: el punto clave para nuestros propósitos es que uno de los valores representa el primer plano (es decir, píxeles que forman parte de un objeto) y el otro valor representa el fondo.
pt_br: Cada pixel em uma imagem binária pode ter um de dois valores. Normalmente, esses valores são 0 e 1. Em alguns softwares (incluindo ImageJ) uma imagem binária tem os valores 0 e 255, mas isso realmente não faz nenhuma diferença em como ela é usada: o ponto chave para nossos propósitos é que um dos valores representa o primeiro plano (ou seja, pixels que fazem parte de um objeto) e o outro valor representa o plano de fundo.

source: For the rest of this chapter, we will assume that our binary images use 0 for the background (shown as black) and 1 for the foreground (shown as white).
de: Für den Rest dieses Kapitels gehen wir davon aus, dass unsere Binärbilder 0 für den Hintergrund (dargestellt als Schwarz) und 1 für den Vordergrund (dargestellt als Weiß) verwenden.
es: Durante el resto de este capítulo, asumiremos que nuestras imágenes binarias usan 0 para el fondo (que se muestra en negro) y 1 para el primer plano (que se muestra en blanco).
pt_br: No restante deste capítulo, assumiremos que nossas imagens binárias usam 0 para o fundo (mostrado em preto) e 1 para o primeiro plano (mostrado em branco).

source: This is important: if we can generate a binary image in which all our objects of interest are in the foreground, we can then use this binary image to help us make measurements of those objects.
de: Das ist wichtig: Wenn wir ein Binärbild erzeugen können, in dem alle unsere interessierenden Objekte im Vordergrund stehen, können wir dieses Binärbild dann verwenden, um Messungen an diesen Objekten durchzuführen.
es: Esto es importante: si podemos generar una imagen binaria en la que todos nuestros objetos de interés están en primer plano, podemos usar esta imagen binaria para ayudarnos a tomar medidas de esos objetos.
pt_br: Isto é importante: se pudermos gerar uma imagem binária na qual todos os nossos objetos de interesse estejam em primeiro plano, poderemos então utilizar esta imagem binária para nos ajudar a fazer medições desses objetos.

source: One way to do this involves identifying individual objects in the binary image by labeling **connected components**. A connected component is really just a connected group of foreground pixels, which together represent a distinct object. By labeling connected components, we get a **labeled image** in which the pixels belonging to each object have a unique integer value. All the pixels with the same value belong either to the background (if the value is 0) or to the same object.
de: Eine Möglichkeit hierfür besteht darin, einzelne Objekte im Binärbild durch die Kennzeichnung von **verbundenen Komponenten** zu identifizieren. Eine verbundene Komponente ist eigentlich nur eine verbundene Gruppe von Vordergrundpixeln, die zusammen ein bestimmtes Objekt darstellen. Durch die Beschriftung verbundener Komponenten erhalten wir ein **beschriftetes Bild**, in dem die zu jedem Objekt gehörenden Pixel einen eindeutigen ganzzahligen Wert haben. Alle Pixel mit demselben Wert gehören entweder zum Hintergrund (wenn der Wert 0 ist) oder zum selben Objekt.
es: Una forma de hacerlo implica identificar objetos individuales en la imagen binaria etiquetando **componentes conectados**. Un componente conectado es en realidad solo un grupo conectado de píxeles de primer plano, que juntos representan un objeto especifico. Al etiquetar los componentes conectados, obtenemos una **imagen etiquetada** en la que los píxeles que pertenecen a cada objeto tienen un valor entero único. Todos los píxeles con el mismo valor pertenecen al fondo (si el valor es 0) o al mismo objeto.
pt_br: Uma maneira de fazer isso envolve identificar objetos individuais na imagem binária rotulando **componentes conectados**. Um componente conectado é, na verdade, apenas um grupo conectado de pixels de primeiro plano, que juntos representam um objeto distinto. Ao rotular os componentes conectados, obtemos uma **imagem rotulada** na qual os pixels pertencentes a cada objeto possuem um valor inteiro único. Todos os pixels com o mesmo valor pertencem ao fundo (se o valor for 0) ou ao mesmo objeto.

source: If required, we can then trace the boundaries of each labeled object to create **regions of interest (ROIs)**, such as those used to make measurement in ImageJ and other software.
de: Bei Bedarf können wir dann die Grenzen jedes beschrifteten Objekts verfolgen, um **Regions of Interest (ROIs)** zu erstellen, wie sie beispielsweise für Messungen in ImageJ und anderer Software verwendet werden.
es: Si es necesario, podemos trazar los límites de cada objeto etiquetado para crear **regiones de interés (ROI)**, como las que se utilizan para realizar mediciones en ImageJ y otros tipos de software.
pt_br: Se necessário, podemos traçar os limites de cada objeto rotulado para criar **regiões de interesse (ROIs)**, como aquelas usadas para fazer medições no ImageJ e outros softwares.

source: Examples of a grayscale (blobs.gif), binary and labelled image. In (C), each label has been assigned a unique color for display. In (D), ROIs have been generated from (C) and superimposed on top of (A). It is common to use a LUT for labeled images that assigns a different color to each pixel value.
de: Beispiele für ein Graustufenbild (blobs.gif), ein Binärbild und ein beschriftetes Bild. In (C) wurde jedem Etikett eine eindeutige Farbe zur Anzeige zugewiesen. In (D) wurden ROIs aus (C) generiert und über (A) überlagert. Es ist üblich, für beschriftete Bilder eine LUT zu verwenden, die jedem Pixelwert eine andere Farbe zuweist.
es: Ejemplos de imagen en escala de grises (blobs.gif), binaria y etiquetada. En (C), a cada etiqueta se le ha asignado un color único para su visualización. En (D), los ROIs se generaron a partir de (C) y se superpusieron sobre (A). Es común utilizar una LUT para imágenes etiquetadas que asigna un color diferente a cada valor de píxel.
pt_br: Exemplos de imagens em tons de cinza (blobs.gif), binárias e rotuladas. Em (C), cada etiqueta recebeu uma cor exclusiva para exibição. Em (D), os ROIs foram gerados a partir de (C) e sobrepostos em (A). É comum usar uma LUT para imagens rotuladas que atribui uma cor diferente a cada valor de pixel.

source: For that reason, a lot of image analysis workflows involve binary images along the way. Most of this chapter will explore the most common way of generating a binary image: **thresholding**.
de: Aus diesem Grund beinhalten viele Bildanalyse-Workflows unterwegs Binärbilder. Der größte Teil dieses Kapitels befasst sich mit der gebräuchlichsten Methode zum Generieren eines Binärbilds: **Schwellenwert**.
es: Por ese motivo, muchos flujos de trabajo de análisis de imágenes involucran imágenes binarias a lo largo del camino. La mayor parte de este capítulo explorará la forma más común de generar una imagen binaria: **umbral** o thresholding.
pt_br: Por esse motivo, muitos fluxos de trabalho de análise de imagens envolvem imagens binárias ao longo do caminho. A maior parte deste capítulo explorará a maneira mais comum de gerar uma imagem binária: **limiar**.

source: Connectivity
de: Konnektivität
es: Conectividad
pt_br: Conectividade

source: Identifying multiple objects in a binary image involves separating distinct groups of pixels that are considered 'connected' to one another, and then creating a ROI or label for each group. Connectivity in this sense can be defined in different ways. For example, if two pixels have the same value and are immediately beside one another (above, below, to the left or right, or diagonally adjacent) then they are said to be _8-connected_, because there are 8 different neighboring locations involved. Pixels are _4-connected_ if they are horizontally or vertically adjacent, but _not_ only diagonally.
de: Um mehrere Objekte in einem Binärbild zu identifizieren, müssen bestimmte Gruppen von Pixeln, die als „miteinander verbunden“ gelten, getrennt und anschließend ein ROI oder eine Beschriftung für jede Gruppe erstellt werden. Konnektivität in diesem Sinne kann auf unterschiedliche Weise definiert werden. Wenn beispielsweise zwei Pixel den gleichen Wert haben und unmittelbar nebeneinander liegen (oben, unten, links oder rechts oder diagonal benachbart), dann spricht man von 8-fach zusammenhängenden Pixeln, da es sich um 8 verschiedene benachbarte Orte handelt. Pixel sind _vierfach verbunden_, wenn sie horizontal oder vertikal benachbart sind, aber _nicht_ nur diagonal.
es: Identificar múltiples objetos en una imagen binaria implica separar distintos grupos de píxeles que se consideran "conectados" entre sí y luego crear un ROI o etiqueta para cada grupo. La conectividad en este sentido se puede definir de diferentes maneras. Por ejemplo, si dos píxeles tienen el mismo valor y están inmediatamente uno al lado del otro (arriba, abajo, a la izquierda o a la derecha, o diagonalmente adyacentes), entonces se dice que están _conectados en 8_, porque hay 8 diferentes ubicaciones vecinas involucradas. Los píxeles están _conectados en 4_ si son adyacentes horizontal o verticalmente, pero _no_ solo en diagonal.
pt_br: A identificação de vários objetos em uma imagem binária envolve a separação de grupos distintos de pixels que são considerados “conectados” entre si e, em seguida, a criação de um ROI ou rótulo para cada grupo. A conectividade, neste sentido, pode ser definida de diferentes maneiras. Por exemplo, se dois pixels têm o mesmo valor e estão imediatamente um ao lado do outro (acima, abaixo, à esquerda ou à direita, ou diagonalmente adjacentes), então eles são considerados _8-conectados_, porque há 8 locais vizinhos diferentes envolvidos. Os pixels são _4-conectados_ se forem adjacentes horizontal ou verticalmente, mas _não_ apenas na diagonal.

source: The choice of connectivity can make a big difference in the number and sizes of objects found, as the example on the right shows (distinct objects are shown in different colors).
de: Die Wahl der Konnektivität kann einen großen Unterschied in der Anzahl und Größe der gefundenen Objekte machen, wie das Beispiel rechts zeigt (eindeutige Objekte werden in unterschiedlichen Farben dargestellt).
es: La elección de la conectividad puede marcar una gran diferencia en la cantidad y el tamaño de los objetos encontrados, como muestra el ejemplo de la derecha (los distintos objetos se muestran en diferentes colores).
pt_br: A escolha da conectividade pode fazer uma grande diferença na quantidade e no tamanho dos objetos encontrados, como mostra o exemplo à direita (objetos distintos são mostrados em cores diferentes).

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: What do you suppose _6-connectivity_ and _26-connectivity_ refer to?
de: Worauf beziehen sich Ihrer Meinung nach _6-Konnektivität_ und _26-Konnektivität_?
es: ¿A qué crees que se refieren _6-conectividad_ y _26-conectividad_?
pt_br: A que você acha que _6-conectividade_ e _26-conectividade_ se referem?

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: 6-connectivity is similar to 4-connectivity, but in 3D. If all 3D diagonals are considered, we end up with each pixel having 26 neighbors.
de: Die 6er-Konnektivität ähnelt der 4er-Konnektivität, jedoch in 3D. Wenn alle 3D-Diagonalen berücksichtigt werden, hat jedes Pixel 26 Nachbarn.
es: La conectividad 6 es similar a la conectividad 4, pero en 3D. Si se consideran todas las diagonales 3D, terminamos con cada píxel teniendo 26 vecinos.
pt_br: A conectividade 6 é semelhante à conectividade 4, mas em 3D. Se todas as diagonais 3D forem consideradas, cada pixel terá 26 vizinhos.

source: Global thresholding
de: Globale Schwellenwerte
es: Umbral global
pt_br: Limite global

source: The easiest way to segment an image is by applying a **global threshold**. This identifies pixels that are above or below a fixed threshold value, giving a binary image as the output.
de: Der einfachste Weg, ein Bild zu segmentieren, ist die Anwendung eines **globalen Schwellenwerts**. Dadurch werden Pixel identifiziert, die über oder unter einem festen Schwellenwert liegen, und als Ausgabe wird ein Binärbild ausgegeben.
es: La forma más sencilla de segmentar una imagen es aplicando un **umbral global**. Esto identifica los píxeles que están por encima o por debajo de un valor de umbral fijo, dando como resultado una imagen binaria.
pt_br: A maneira mais fácil de segmentar uma imagem é aplicando um **limite global**. Isso identifica pixels que estão acima ou abaixo de um valor limite fixo, fornecendo uma imagem binária como saída.

source: Global thresholding can be thought of as a [point operation](chap_point_operations) because the output is based solely on the value of each pixel, and not its location or its neighbors. For a global threshold to work, the pixels inside objects need to have higher or lower values than the other pixels. We will look at image processing tricks to overcome this limitation later, but for now we will focus on examples where we want to detect objects have values that are clearly distinct from the background -- and so global thresholding could potentially work.
de: Globale Schwellenwerte können als [Punktoperation] (chap_point_operations) betrachtet werden, da die Ausgabe ausschließlich auf dem Wert jedes Pixels und nicht auf seiner Position oder seinen Nachbarn basiert. Damit ein globaler Schwellenwert funktioniert, müssen die Pixel innerhalb von Objekten höhere oder niedrigere Werte als die anderen Pixel haben. Wir werden uns später mit Bildverarbeitungstricks befassen, um diese Einschränkung zu überwinden. Zunächst konzentrieren wir uns jedoch auf Beispiele, bei denen wir erkennen möchten, dass Objekte Werte haben, die sich deutlich vom Hintergrund unterscheiden – und daher könnte globales Schwellenwertverfahren möglicherweise funktionieren.
es: El umbral global se puede considerar como una [operación puntual](chap_point_operations) porque la salida se basa únicamente en el valor de cada píxel, y no en su ubicación o sus vecinos. Para que funcione un umbral global, los píxeles dentro de los objetos deben tener valores más altos o más bajos que los demás píxeles. Veremos trucos de procesamiento de imágenes para superar esta limitación más adelante, pero por ahora nos centraremos en ejemplos en los que queremos detectar objetos que tienen valores que son claramente distintos del fondo, por lo que el umbral global podría funcionar.
pt_br: O limite global pode ser pensado como uma [operação pontual](chap_point_operações) porque a saída é baseada unicamente no valor de cada pixel, e não em sua localização ou em seus vizinhos. Para que um limite global funcione, os pixels dentro dos objetos precisam ter valores maiores ou menores que os outros pixels. Veremos truques de processamento de imagem para superar essa limitação mais tarde, mas por enquanto nos concentraremos em exemplos em que queremos detectar objetos com valores claramente distintos do fundo - e assim o limite global poderia funcionar.

source: Thresholding using histograms
de: Schwellenwertbestimmung mithilfe von Histogrammen
es: Hacer thresholding usando histogramas
pt_br: Limiar usando histogramas

source: It's possible to tell quite a lot about an image just by looking at its histogram.
de: Es ist möglich, eine ganze Menge über ein Bild zu sagen, indem man sich nur das Histogramm ansieht.
es: Es posible saber mucho sobre una imagen con sólo mirar su histograma.
pt_br: É possível saber muita coisa sobre uma imagem apenas olhando seu histograma.

source: Take the following example:
de: Nehmen Sie das folgende Beispiel:
es: Tomemos el siguiente ejemplo:
pt_br: Veja o seguinte exemplo:

source: Even without seeing the image, we can make some educated guesses about its contents.
de: Auch ohne das Bild zu sehen, können wir fundierte Vermutungen über seinen Inhalt anstellen.
es: Incluso sin ver la imagen, podemos hacer algunas conjeturas sobre su contenido.
pt_br: Mesmo sem ver a imagem, podemos fazer algumas suposições fundamentadas sobre seu conteúdo.
