Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/6-transforms/imagej.po
Languages: es, pt_br

source: ImageJ: Image transforms
es: ImageJ: Transformada de imágenes
pt_br: ImageJ: transformações de imagem

source: Introduction
es: Introducción
pt_br: Introdução

source: ImageJ has excellent 2D distance and watershed transforms... although not necessarily everything about them is quite what you might expect.
es: ImageJ dispone de excelentes transformadas de distancia 2D y watershed... aunque no todo en ellas es necesariamente lo que cabría esperar.
pt_br: ImageJ tem excelentes distâncias 2D e transformações de bacias hidrográficas... embora nem necessariamente tudo sobre eles seja exatamente o que você poderia esperar.

source: Distance transform
es: Transformada de distancia
pt_br: Transformação de distância

source: A 2D distance transform can be calculated in ImageJ using the {menuselection}`Process --> Binary --> Distance Map` command.
es: Se puede calcular una transformada de distancia 2D en ImageJ utilizando el comando {menuselection}`Process --> Binary --> Distance Map`.
pt_br: Uma transformação de distância 2D pode ser calculada no ImageJ usando o comando {menuselection}`Process --> Binary --> Distance Map`.

source: A non-obvious feature of this is that the type of output given is determined by the {guilabel}`EDM output` option tucked away under {menuselection}`Process --> Binary --> Options...` (where EDM stands for 'Euclidean Distance Map'). This makes a difference, because the distance between two diagonal pixels is considered $\sqrt{2} \approx 1.414$ (by Pythagoras' theorem) -- which means that a 32-bit output can give more exact straight-line distances without rounding.
es: Una característica no obvia de esto es que el tipo de output dado está determinado por la opción {guilabel}`EDM output` escondida en {menuselection}`Process --> Binary --> Options...` (donde EDM significa 'Euclidean Distance Map'). Esto supone una diferencia, porque la distancia entre dos píxeles diagonales se considera $\sqrt{2} \approx 1.414$ (por el teorema de Pitágoras) -- lo que significa que una salida de 32 bits puede dar distancias en línea recta más exactas sin redondear.
pt_br: Uma característica não óbvia disso é que o tipo de saída fornecida é determinado pela opção {guilabel}`saída EDM` escondida em {menuselection}`Processo --> Binário --> Opções...` (onde EDM significa 'Mapa de Distância Euclidiana'). Isso faz diferença, porque a distância entre dois pixels diagonais é considerada $\sqrt{2} \approx 1.414$ (pelo teorema de Pitágoras) - o que significa que uma saída de 32 bits pode fornecer distâncias em linha reta mais exatas sem arredondamento.

source: Outputs from several distance transform-related commands in ImageJ.
es: Outputs de varios comandos relacionados con la transformación de distancia en ImageJ.
pt_br: Saídas de vários comandos relacionados à transformação de distância no ImageJ.

source: Ultimate points
es: Puntos máximos
pt_br: Pontos finais

source: {menuselection}`Process --> Binary --> Ultimate Points` is a related command. It uses the distance transform to identify the last points that would be removed if the objects would be eroded until they disappear. In other words, it identifies centers. But these are not simply single center points for each object; rather, they are maximum points in the distance map, and therefore the pixels furthest away from the boundary.
es: {menuselection}`Process --> Binary --> Ultimate Points` es un comando relacionado. Utiliza la transformación de distancia para identificar los últimos puntos que se eliminarían si los objetos se erosionaran hasta desaparecer. En otras palabras, identifica los centros. Pero no se trata simplemente de puntos centrales únicos para cada objeto, sino que son puntos máximos en el mapa de distancias y, por tanto, los píxeles más alejados del límite.
pt_br: {menuselection}`Process --> Binary --> Ultimate Points` é um comando relacionado. Ele usa a transformação de distância para identificar os últimos pontos que seriam removidos se os objetos fossem erodidos até desaparecerem. Em outras palavras, identifica centros. Mas estes não são simplesmente pontos centrais únicos para cada objeto; em vez disso, são pontos máximos no mapa de distância e, portanto, os pixels mais distantes do limite.

source: This means that if a structure has several 'bulges', then an ultimate point exists _at the center of each of them_. If segmentation has resulted in structures being merged together, then each distinct bulge could actually correspond to something interesting -- and the number of bulges actually means more than the number of separated objects in the binary image.
es: Esto significa que si una estructura tiene varias "protuberancias", entonces existe un punto final _en el centro de cada una de ellas_. Si la segmentación ha dado lugar a la fusión de estructuras, cada protuberancia distinta podría corresponder a algo interesante, y el número de protuberancias significa más que el número de objetos separados en la imagen binaria.
pt_br: Isto significa que se uma estrutura tem várias 'protuberâncias', então existe um ponto último _no centro de cada uma delas_. Se a segmentação resultou na fusão de estruturas, então cada protuberância distinta poderia na verdade corresponder a algo interessante - e o número de protuberâncias na verdade significa mais do que o número de objetos separados na imagem binária.

source: Although conceptually straightforward, and easy to use in ImageJ, implementing 'Ultimate points' in other software can be tricky. Here, I've tried to replicate it in Python. The results aren't necessarily identical to ImageJ's implementation, but should be pretty close.
es: Aunque conceptualmente sencillo, y fácil de usar en ImageJ, la implementación de 'Ultimate points' en otro software puede ser complicado. Aquí he intentado replicarlo en Python. Los resultados no son necesariamente idénticos a la implementación de ImageJ, pero deberían ser bastante parecidos.
pt_br: Embora conceitualmente simples e fácil de usar no ImageJ, implementar 'Pontos finais' em outro software pode ser complicado. Aqui, tentei replicá-lo em Python. Os resultados não são necessariamente idênticos à implementação do ImageJ, mas devem ser bem próximos.

source: Select to {guilabel}`Show code cell contents` above to see how it works.
es: Seleccione {guilabel}`Show code cell contents` arriba para ver cómo funciona.
pt_br: Selecione {guilabel}`Mostrar conteúdo da célula de código` acima para ver como funciona.

source: Computing the ultimate points from a binary image can be an effective step towards counting the objects in the image -- even if these have been merged. It works best when the true objects are round in shape.
es: Calcular los puntos de interés a partir de una imagen binaria puede ser un paso eficaz para contar los objetos de la imagen, incluso si éstos se han fusionado. Funciona mejor cuando los objetos reales tienen forma redonda.
pt_br: Calcular os pontos finais de uma imagem binária pode ser um passo eficaz para contar os objetos na imagem - mesmo que estes tenham sido mesclados. Funciona melhor quando os objetos verdadeiros têm formato redondo.

source: Watershed (after distance transform)
es: Watershed (tras la transformación de distancia)
pt_br: Bacia hidrográfica (após transformação de distância)

source: As the name suggests, ImageJ's {menuselection}`Process --> Binary --> Watershed` command applies a watershed transform.
es: Como su nombre indica, el comando `Process --> Binary --> Watershed` de ImageJ {menuselection} aplica una transformación watershed.
pt_br: Como o nome sugere, o comando {menuselection}`Process --> Binary --> Watershed` do ImageJ aplica uma transformação de bacia hidrográfica.

source: However, as the name conceals, the watershed transform is always applied to a distance map -- which is calculated automatically in the background.
es: Sin embargo, como su nombre lo dice, la transformación de watershed se aplica siempre a un mapa de distancias, que se calcula automáticamente en segundo plano.
pt_br: No entanto, como o nome indica, a transformação da bacia hidrográfica é sempre aplicada a um mapa de distância – que é calculado automaticamente em segundo plano.

source: The clue to this is only that it appears in a {menuselection}`Process --> Binary` submenu, and therefore requires a binary image as input; a 'regular' watershed transform isn't normally applied to a binary image.
es: La única pista es que aparece en el submenú `Process --> Binary` de {menuselection} y, por lo tanto, requiere una imagen binaria como entrada; una transformación watershed `normal` no se aplica normalmente a una imagen binaria.
pt_br: A pista para isso é apenas que ele aparece em um submenu {menuselection}`Process --> Binary` e, portanto, requer uma imagem binária como entrada; uma transformação de bacia hidrográfica 'regular' normalmente não é aplicada a uma imagem binária.

source: Effectively, the seeds of the watershed transform are the 'ultimate points' described above. The effect of the command is therefore to split 'roundish' objects.
es: En efecto, las semillas de la transformación de watershed son los "puntos de interés" descritos anteriormente. El efecto del comando es, por tanto, dividir los objetos "redondeados".
pt_br: Efetivamente, as sementes da transformação da bacia hidrográfica são os “pontos finais” descritos acima. O efeito do comando é, portanto, dividir objetos 'arredondados'.

source: Watching the distance transform
es: Observar cómo se transforma la distancia
pt_br: Observando a distância se transformar

source: If you click the {guilabel}`Dev` toolbar button and select {menuselection}`Debug Mode` from the drop-down menu, then running {menuselection}`Process --> Binary --> Watershed` will generate an image stack that visualizes how the seeds expanded during the watershed processing.
es: Si haces click en el botón de la barra de herramientas {guilabel}`Dev` y seleccionas {menuselection}`Debug Mode` en el menú desplegable, al ejecutar {menuselection}`Process --> Binary --> Watershed` se generará una pila de imágenes que visualiza cómo se expandieron las semillas durante el procesamiento del watershed.
pt_br: Se você clicar no botão {guilabel}`Dev` da barra de ferramentas e selecionar {menuselection}`Debug Mode` no menu suspenso, então execute {menuselection}`Process --> Binary --> Watershed` irá gerar uma pilha de imagens que visualiza como as sementes se expandiram durante o processamento da bacia hidrográfica.

source: {menuselection}`Process --> Binary --> Voronoi` is another distance-and-watershed-based command for binary images.
es: {menuselection}`Process --> Binary --> Voronoi` es otro comando basado en distancias y watershed para imágenes binarias.
pt_br: {menuselection}`Process --> Binary --> Voronoi` é outro comando baseado em distância e bacia hidrográfica para imagens binárias.

source: It will partition the image into different regions so that the separation lines have an equal distance to the nearest foreground objects.
es: Hara la partición en la imagen en distintas regiones, de modo que las líneas de separación tengan la misma distancia a los objetos en primer plano más cercanos.
pt_br: Ele irá particionar a imagem em diferentes regiões para que as linhas de separação tenham uma distância igual dos objetos mais próximos do primeiro plano.

source: Question
es: Pregunta
pt_br: Pergunta

source: Imagine you have created a binary image containing detected cells, but you are only interested in the region inside the cell that is close to the membrane, i.e. within 5 pixels of the edge of each detected object. Any pixels outside the objects or closer to their centers do not matter.
es: Imagina que has creado una imagen binaria que contiene células detectadas, pero sólo te interesa la región del interior de la célula que está cerca de la membrana, es decir, dentro de los 5 píxeles del borde de cada objeto detectado. Los píxeles situados fuera de los objetos o más cerca de sus centros no importan.
pt_br: Imagine que você criou uma imagem binária contendo células detectadas, mas está interessado apenas na região dentro da célula que está próxima à membrana, ou seja, dentro de 5 pixels da borda de cada objeto detectado. Quaisquer pixels fora dos objetos ou mais próximos de seus centros não importam.

source: How would you go about finding these regions using ImageJ and the distance transform?
es: ¿Cómo encontrarías estas regiones utilizando ImageJ y la transformación de distancia?
pt_br: Como você encontraria essas regiões usando ImageJ e a transformação de distância?

source: **Note:** There other ways to do this using techniques we've discussed, although these don't necessarily give identical results.
es: **Nota:** Hay otras formas de hacerlo utilizando las técnicas que hemos comentado, aunque no necesariamente dan resultados idénticos.
pt_br: **Nota:** Existem outras maneiras de fazer isso usando as técnicas que discutimos, embora elas não forneçam necessariamente resultados idênticos.

source: Answer
es: Respuesta
pt_br: Responder

source: This is the approach I was thinking of:
es: Este es el enfoque en el que estaba pensando:
pt_br: Esta é a abordagem que eu estava pensando:

source: Run {menuselection}`Edit --> Invert`
es: Ejecutar {menuselection}`Edit --> Invert`
pt_br: Execute {menuselection}`Editar --> Inverter`

source: Run {menuselection}`Process --> Binary --> Distance Map`
es: Ejecutar {menuselection}`Process --> Binary --> Distance Map`
pt_br: Execute {menuselection}`Processo --> Binário --> Mapa de Distância`

source: Run {menuselection}`Image --> Adjust --> Threshold...`
es: Ejecutar {menuselection}`Image --> Adjust --> Threshold...`
pt_br: Execute {menuselection}`Imagem --> Ajustar --> Limite...`

source: Choose {guilabel}`Set` and enter *Lower Threshold Level: 1* and *Higher Threshold Level: 5*.
es: Elige {guilabel}`Set` e introduce *Lower Threshold Level: 1* y *Higher Threshold Level: 5*.
pt_br: Escolha {guilabel}`Set` e insira *Nível de limite inferior: 1* e *Nível de limite superior: 5*.

source: There are more possible ways, such as applying a maximum filter and subtracting the original binary image -- but I think the distance transform is more elegant. The distance transform is also likely to be much faster for large distances, and more precise (assuming you use a 32-bit output).
es: Hay más formas posibles, como aplicar un filtro máximo y restar la imagen binaria original -- pero creo que la transformación de distancia es más elegante. La transformación de distancia también es probable que sea un proceso mucho más rápido para grandes distancias, y más preciso (suponiendo que utilices un output de 32 bits).
pt_br: Existem mais maneiras possíveis, como aplicar um filtro máximo e subtrair a imagem binária original - mas acho que a transformação de distância é mais elegante. A transformação de distância provavelmente também será muito mais rápida para grandes distâncias e mais precisa (supondo que você use uma saída de 32 bits).

source: Watershed transform
es: Transformación de watershed
pt_br: Transformação de bacia hidrográfica

source: So if ImageJ has a watershed transform, but it's not the command called {menuselection}`Watershed`, then where is it?
es: Entonces, si ImageJ tiene una transformación de watershed, pero no es el comando llamado {menuselection}`Watershed`, ¿dónde está?
pt_br: Portanto, se ImageJ tem uma transformação de divisor de águas, mas não é o comando chamado {menuselection}`Watershed`, então onde está?

source: The answer is that it's hidden in the phenomenally useful {menuselection}`Process --> Find maxima` command.
es: La respuesta es que está oculto en el fenomenalmente útil comando {menuselection}`Process --> Find maxima`.
pt_br: A resposta é que ele está oculto no comando {menuselection}`Process --> Find maxima` fenomenalmente útil.

source: I say 'hidden', because you specifically have to choose the output {guilabel}`Segmented Particles` to use it. And you'll need to flip your expectations: unlike most watershed transforms, it will start at the *intensity peaks* of the image (i.e. the maxima) and expand outwards, rather than starting at minima.
es: Digo 'oculta', porque tienes que elegir específicamente el output {guilabel}`Segmented Particles` para usarla. Y tendrás que cambiar tus expectativas: a diferencia de la mayoría de las transformaciones de cuenca, empezará en los *picos de intensidad* de la imagen (es decir, los máximos) y se expandirá hacia fuera, en lugar de empezar en los mínimos.
pt_br: Eu digo 'oculto', porque você precisa escolher especificamente a saída {guilabel}`Segmented Particles` para usá-lo. E você precisará inverter suas expectativas: diferentemente da maioria das transformações de bacias hidrográficas, ela começará nos *picos de intensidade* da imagem (ou seja, os máximos) e se expandirá para fora, em vez de começar nos mínimos.

source: But don't let those things discourage you: I highly recommend exploring the various options of {menuselection}`Process --> Find maxima` to see what all it can do. Depending upon which options are selected, this includes finding structures using a global threshold, a local threshold, generating point ROIs and generating binary regions.
es: Pero no dejes que esas cosas te desanimen: Recomiendo encarecidamente explorar las distintas opciones de {menuselection}`Process --> Find maxima` para ver todo lo que puede hacer. Dependiendo de las opciones seleccionadas, esto incluye encontrar estructuras usando un umbral global, un umbral local, generando ROIs de puntos y generando regiones binarias.
pt_br: Mas não deixe que essas coisas o desencorajem: eu recomendo explorar as diversas opções de {menuselection}`Process --> Find maxima` para ver tudo o que ele pode fazer. Dependendo das opções selecionadas, isso inclui encontrar estruturas usando um limite global, um limite local, gerar ROIs pontuais e gerar regiões binárias.

source: Check out MorphoLibJ
es: Echa un vistazo a MorphoLibJ
pt_br: Confira MorphoLibJ

source: Echoing my recommendation at the end of the last chapter, you should check out **MorphoLibJ** if you would like more transform options -- particularly when it comes to watersheds of various kinds.
es: Haciendo eco de mi recomendación al final del último capítulo, deberías echar un vistazo a **MorphoLibJ** si quieres más opciones de transformación -- particularmente cuando se trata de watersheds de varios tipos.
pt_br: Ecoando minha recomendação no final do último capítulo, você deve verificar **MorphoLibJ** se quiser mais opções de transformação - especialmente quando se trata de bacias hidrográficas de vários tipos.

source: See https://imagej.net/plugins/morpholibj for more details.
es: Consulta https://imagej.net/plugins/morpholibj para más detalles.
pt_br: Consulte https://imagej.net/plugins/morpholibj para obter mais detalhes.
