Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/6-transforms/transforms.po
Languages: de, es, pt_br

source: Using distance and watershed transforms to expand regions by a fixed distance, without overlap. The final output (F) is obtained using information from all images (A) - (E).
de: Verwenden Sie Entfernungs- und Wasserscheidentransformationen, um Regionen ohne Überlappung um eine feste Entfernung zu erweitern. Die endgültige Ausgabe (F) wird anhand der Informationen aller Bilder (A) bis (E) ermittelt.
es: Usar transformaciones de distancia y watershed para expandir regiones en una distancia fija, sin superposición. El resultado final (F) se obtiene utilizando información de todas las imágenes (A) - (E).
pt_br: Usando transformações de distância e bacia hidrográfica para expandir regiões em uma distância fixa, sem sobreposição. O resultado final (F) é obtido a partir das informações de todas as imagens (A) - (E).
