Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/6-transforms/transforms.po
Languages: de, es, pt_br

source: Default Caption
de: Standardbeschriftung
es: Leyenda predeterminada
pt_br: Legenda padrão

source: Image transforms
de: Bild verwandelt sich
es: Transformaciones de imagen
pt_br: Transformações de imagem

source: Chapter outline
de: Kapitelüberblick
es: Outline del capítulo
pt_br: Esboço do capítulo

source: The **watershed transform** can be used to split structures using intensity values
de: Die **Watershed-Transformation** kann verwendet werden, um Strukturen anhand von Intensitätswerten aufzuteilen
es: La **transformada de watershed** se puede utilizar para dividir estructuras usando valores de intensidad
pt_br: A **transformada de bacia hidrográfica** pode ser usada para dividir estruturas usando valores de intensidade

source: The **distance transform** calculates the distance between foreground and background pixels in a binary image
de: Die **Abstandstransformation** berechnet den Abstand zwischen Vordergrund- und Hintergrundpixeln in einem Binärbild
es: La **transformada de distancia** calcula la distancia entre los píxeles de primer plano y de fondo en una imagen binaria.
pt_br: A **transformação de distância** calcula a distância entre os pixels do primeiro plano e do fundo em uma imagem binária

source: The **distance & watershed transforms** can be combined to separate round structures
de: Die **Distanz- und Wasserscheidentransformationen** können kombiniert werden, um runde Strukturen zu trennen
es: Las **transformadas de distancia y watershed** se pueden combinar para separar estructuras redondas
pt_br: As **transformadas de distância e bacia hidrográfica** podem ser combinadas para separar estruturas redondas

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: An **image transform** converts an image into some other form, in which the pixel values can have a (sometimes very) different interpretation.
de: Eine **Bildtransformation** wandelt ein Bild in eine andere Form um, in der die Pixelwerte eine (manchmal sehr) andere Interpretation haben können.
es: Una **transformada de imagen** convierte una imagen en alguna otra forma, en la que los valores de píxeles pueden tener una interpretación (a veces muy) diferente.
pt_br: Uma **transformação de imagem** converte uma imagem em alguma outra forma, na qual os valores dos pixels podem ter uma interpretação (às vezes muito) diferente.

source: There are lots of ways to transform an image. We will focus on two that are especially useful for bioimage segmentation and analysis: the distance transform and the watershed transform. We will briefly introduce both, before then showing how they can be used in combination.
de: Es gibt viele Möglichkeiten, ein Bild zu transformieren. Wir werden uns auf zwei konzentrieren, die für die Segmentierung und Analyse von Biobildern besonders nützlich sind: die Distanztransformation und die Wassereinzugsgebietstransformation. Wir stellen beide kurz vor und zeigen dann, wie sie in Kombination verwendet werden können.
es: Hay muchas formas de transformar una imagen. Nos centraremos en dos que son especialmente útiles para la segmentación y el análisis de bioimágenes: la transformada de distancia y la transformada de watershed. Presentaremos ambas brevemente, antes de mostrar cómo se pueden usar en combinación.
pt_br: Existem muitas maneiras de transformar uma imagem. Vamos nos concentrar em duas que são especialmente úteis para segmentação e análise de bioimagens: a transformada de distância e a transformada de bacia hidrográfica. Apresentaremos brevemente ambos, antes de mostrar como eles podem ser usados em combinação.

source: The distance transform
de: Die Distanztransformation
es: La transformada de distancia
pt_br: A transformação de distância

source: The **distance transform** (sometimes called the **Euclidean distance transform**) replaces each pixel of a binary image with the distance to the closest background pixel. If the pixel itself is already part of the background then this is zero. The result is an image called a **distance map**.
de: Die **Distanztransformation** (manchmal auch als **Euklidische Distanztransformation** bezeichnet) ersetzt jedes Pixel eines Binärbilds durch den Abstand zum nächstgelegenen Hintergrundpixel. Wenn das Pixel selbst bereits Teil des Hintergrunds ist, ist dieser Null. Das Ergebnis ist ein Bild, das als **Entfernungskarte** bezeichnet wird.
es: La **transformada de distancia** (a veces llamada **transformada de distancia Euclidiana**) reemplaza cada píxel de una imagen binaria con la distancia al píxel de fondo más cercano. Si el píxel en sí ya forma parte del fondo, entonces esto es cero. El resultado es una imagen llamada **mapa de distancia**.
pt_br: A **transformada de distância** (às vezes chamada de **transformada de distância euclidiana**) substitui cada pixel de uma imagem binária pela distância até o pixel de fundo mais próximo. Se o próprio pixel já fizer parte do plano de fundo, isso será zero. O resultado é uma imagem chamada **mapa de distância**.

source: A binary image and its corresponding distance map, including pixel values as an overlay.
de: Ein Binärbild und die entsprechende Entfernungskarte, einschließlich Pixelwerten als Überlagerung.
es: Una imagen binaria y su correspondiente mapa de distancia, incluyendo los valores de píxeles como superposición.
pt_br: Uma imagem binária e seu mapa de distância correspondente, incluindo valores de pixel como sobreposição.

source: A natural question when considering the distance transform is: *why*?
de: Eine natürliche Frage bei der Betrachtung der Distanztransformation ist: *Warum*?
es: Una pregunta natural al considerar la transformada de distancia es: *¿por qué*?
pt_br: Uma pergunta natural ao considerar a transformação de distância é: *por quê*?

source: Although its importance may not be initially obvious, we will see that creative uses of the distance transform can help solve some other problems rather elegantly.
de: Obwohl ihre Bedeutung zunächst vielleicht nicht offensichtlich ist, werden wir sehen, dass der kreative Einsatz der Distanztransformation dazu beitragen kann, einige andere Probleme recht elegant zu lösen.
es: Aunque su importancia puede no ser obvia inicialmente, veremos que los usos creativos de la transformada de distancia pueden ayudar a resolver algunos otros problemas de manera bastante elegante.
pt_br: Embora a sua importância possa não ser inicialmente óbvia, veremos que usos criativos da transformada de distância podem ajudar a resolver alguns outros problemas de forma bastante elegante.

source: For example, eroding or dilating binary images by a large amount can be very slow, because we have to use large maximum or minimum filters. However, erosion and dilation can be computed from a distance map very efficiently simply by applying a global threshold. This can be much faster in practice.
de: Beispielsweise kann das Erodieren oder Erweitern von Binärbildern um einen großen Betrag sehr langsam sein, da wir große Maximal- oder Minimalfilter verwenden müssen. Erosion und Dilatation können jedoch sehr effizient aus einer Entfernungskarte berechnet werden, indem einfach ein globaler Schwellenwert angewendet wird. Dies kann in der Praxis deutlich schneller gehen.
es: Por ejemplo, erosionar o dilatar imágenes binarias en gran medida puede ser muy lento, porque tenemos que usar filtros máximos o mínimos grandes. Sin embargo, la erosión y la dilatación se pueden calcular a partir de un mapa de distancias de manera muy eficiente simplemente aplicando un umbral global. Esto puede ser mucho más rápido en la práctica.
pt_br: Por exemplo, a erosão ou dilatação de imagens binárias em grande quantidade pode ser muito lenta, porque temos que usar grandes filtros máximos ou mínimos. No entanto, a erosão e a dilatação podem ser calculadas a partir de um mapa de distância de forma muito eficiente, simplesmente aplicando um limiar global. Isso pode ser muito mais rápido na prática.

source: Implementing erosion (C) and dilation (F) of binary images by thresholding distance maps.
de: Implementierung der Erosion (C) und Dilatation (F) von Binärbildern durch Schwellenwert-Entfernungskarten.
es: Implementación de erosión (C) y dilatación (F) de imágenes binarias mediante umbrales de mapas de distancia.
pt_br: Implementando erosão (C) e dilatação (F) de imagens binárias por meio de limites de mapas de distância.

source: But the distance map contains useful information that we can use in other ways.
de: Aber die Entfernungskarte enthält nützliche Informationen, die wir auf andere Weise nutzen können.
es: Pero el mapa de distancias contiene información útil que podemos utilizar de otras formas.
pt_br: Mas o mapa de distância contém informações úteis que podemos usar de outras maneiras.

source: For example, we can also use distance maps to estimate the **local thickness** of a structure. An application of this would be to assess blood vessel diameters. If we have a binary image representing a vessel, we can generate both a distance map and a thinned binary image. The distance map values corresponding to foreground pixels in the thinned image provide a local estimate of the vessel radius at that pixel, because the distance map gives the distance to the nearest background pixel -- and thinned pixels occur at the vessel center.
de: Beispielsweise können wir Distanzkarten auch verwenden, um die **lokale Dicke** einer Struktur abzuschätzen. Eine Anwendung hierfür wäre die Beurteilung von Blutgefäßdurchmessern. Wenn wir ein Binärbild haben, das ein Schiff darstellt, können wir sowohl eine Entfernungskarte als auch ein ausgedünntes Binärbild erstellen. Die Distanzkartenwerte, die den Vordergrundpixeln im ausgedünnten Bild entsprechen, liefern eine lokale Schätzung des Gefäßradius an diesem Pixel, da die Distanzkarte den Abstand zum nächsten Hintergrundpixel angibt – und ausgedünnte Pixel in der Gefäßmitte auftreten.
es: Por ejemplo, también podemos usar mapas de distancia para estimar el **espesor local** de una estructura. Una aplicación de esto sería evaluar los diámetros de los vasos sanguíneos. Si tenemos una imagen binaria que representa un vaso sanguíneo, podemos generar tanto un mapa de distancias como una imagen binaria adelgazada. Los valores del mapa de distancia correspondientes a los píxeles de primer plano en la imagen adelgazada proporcionan una estimación local del radio del vaso sanguíneo en ese píxel, porque el mapa de distancia proporciona la distancia al píxel de fondo más cercano y los píxeles adelgazados se producen en el centro del vaso sanguíneo.
pt_br: Por exemplo, também podemos usar mapas de distância para estimar a **espessura local** de uma estrutura. Uma aplicação disso seria avaliar os diâmetros dos vasos sanguíneos. Se tivermos uma imagem binária representando uma embarcação, podemos gerar um mapa de distância e uma imagem binária reduzida. Os valores do mapa de distância correspondentes aos pixels de primeiro plano na imagem reduzida fornecem uma estimativa local do raio da embarcação naquele pixel, porque o mapa de distância fornece a distância até o pixel de fundo mais próximo - e os pixels reduzidos ocorrem no centro da embarcação.

source: However, the distance transform can become even more useful if we combine it with other transforms.
de: Allerdings kann die Distanztransformation noch nützlicher werden, wenn wir sie mit anderen Transformationen kombinieren.
es: Sin embargo, la transformada de distancia puede resultar aún más útil si la combinamos con otras transformaciones.
pt_br: No entanto, a transformada de distância pode tornar-se ainda mais útil se a combinarmos com outras transformadas.

source: The watershed transform
de: Die Wendepunkt-Transformation
es: La transformada de watershed
pt_br: A transformação da bacia hidrográfica

source: The **watershed transform** is an example of a **region growing** method: beginning from some **seed regions**, the seeds are progressively expanded into larger regions until all the pixels of the image have been processed. This provides an alternative to straightforward thresholding, which can be *extremely* useful when need to partition an image into many different objects.
de: Die **Watershed-Transformation** ist ein Beispiel für eine **Region-Growing-Methode**: Ausgehend von einigen **Seed-Regionen** werden die Seeds nach und nach in größere Regionen erweitert, bis alle Pixel des Bildes verarbeitet wurden. Dies stellt eine Alternative zur einfachen Schwellenwertberechnung dar, die *äußerst* nützlich sein kann, wenn ein Bild in viele verschiedene Objekte aufgeteilt werden muss.
es: La **transformada de watershed** es un ejemplo de un método de **crecimiento de región**: comenzando desde algunas **regiones semilla**, las semillas se expanden progresivamente a regiones más grandes hasta que se hayan procesado todos los píxeles de la imagen. Esto proporciona una alternativa al umbral sencillo, que puede ser *extremadamente* útil cuando es necesario dividir una imagen en muchos objetos diferentes.
pt_br: A **transformação de bacia hidrográfica** é um exemplo de método de **crescimento de região**: começando em algumas **regiões de sementes**, as sementes são progressivamente expandidas em regiões maiores até que todos os pixels da imagem tenham sido processados. Isso fornece uma alternativa ao limite direto, que pode ser extremamente útil quando é necessário particionar uma imagem em muitos objetos diferentes.

source: To understand how the watershed transform works, picture the image as an uneven landscape in which the value of each pixel corresponds to a height.
de: Um zu verstehen, wie die Wassereinzugsgebietstransformation funktioniert, stellen Sie sich das Bild als eine unebene Landschaft vor, in der der Wert jedes Pixels einer Höhe entspricht.
es: Para comprender cómo funciona la transformada de watershed, imagina la imagen como un paisaje irregular en el que el valor de cada píxel corresponde a una altura.
pt_br: Para entender como funciona a transformação da bacia hidrográfica, imagine a imagem como uma paisagem irregular na qual o valor de cada pixel corresponde a uma altura.

source: Visualizing an image as a landscape, using surface plots. Higher pixel values are generally viewed as peaks, although can easily switched to become valleys by inverting the image before plotting. This may be useful when providing input to the watershed transform.
de: Visualisieren eines Bildes als Landschaft mithilfe von Oberflächendiagrammen. Höhere Pixelwerte werden im Allgemeinen als Spitzen angesehen, können jedoch leicht in Täler umgewandelt werden, indem das Bild vor dem Plotten invertiert wird. Dies kann nützlich sein, wenn Sie Eingaben für die Wassereinzugsgebietstransformation bereitstellen.
es: Visualizar una imagen como un paisaje, utilizando gráficos de superficie. Los valores de píxeles más altos generalmente se ven como picos, aunque pueden cambiarse fácilmente para convertirse en valles invirtiendo la imagen antes de producir el gráfico. Esto puede resultar útil a la hora de proporcionar información para la transformada de watershed.
pt_br: Visualizando uma imagem como uma paisagem, usando plotagens de superfície. Valores de pixel mais altos são geralmente vistos como picos, embora possam facilmente mudar para vales invertendo a imagem antes de plotar. Isto pode ser útil ao fornecer dados para a transformação da bacia hidrográfica.

source: Now imagine water falling evenly upon this surface and slowly flooding it. The water gathers first in the deepest parts; that is, in the places where pixels have values lower than all their neighbors. These define the **seeds** of the watershed transform; we can think of them as separate water basins.
de: Stellen Sie sich nun vor, dass Wasser gleichmäßig auf diese Oberfläche fällt und sie langsam überflutet. Das Wasser sammelt sich zuerst an den tiefsten Stellen; Das heißt, an den Stellen, an denen Pixel niedrigere Werte als alle ihre Nachbarn haben. Diese definieren die **Keime** der Watershed-Transformation; wir können sie uns als separate Wasserbecken vorstellen.
es: Ahora imaginemos que el agua cae uniformemente sobre esta superficie y la inunda lentamente. El agua se acumula primero en las partes más profundas; es decir, en los lugares donde los píxeles tienen valores inferiores a todos sus vecinos. Estos definen las **semillas** de la transformada de watershed; podemos pensar en ellos como cuencas de agua separadas.
pt_br: Agora imagine a água caindo uniformemente sobre esta superfície e inundando-a lentamente. A água se acumula primeiro nas partes mais profundas; isto é, nos locais onde os pixels possuem valores inferiores a todos os seus vizinhos. Eles definem as **sementes** da transformação da bacia hidrográfica; podemos considerá-los como bacias hidrográficas separadas.

source: As the water level rises across the image, occasionally it will reach a ridge between two basins -- and, in reality, water could spill from one basin into the other. However, in the watershed transform this is not permitted; rather a dam is constructed at such ridges. The water then continues to rise, with dams being built as needed, until in the end every pixel is either part of a basin or a ridge, and there are exactly the same number of basins afterwards as there were at first.
de: Wenn der Wasserspiegel im Bild ansteigt, erreicht er gelegentlich einen Grat zwischen zwei Becken – und in Wirklichkeit könnte Wasser von einem Becken in das andere überlaufen. In der Watershed-Transformation ist dies jedoch nicht zulässig; Vielmehr wird an solchen Graten ein Damm errichtet. Dann steigt das Wasser weiter an, je nach Bedarf werden Dämme gebaut, bis am Ende jedes Pixel entweder Teil eines Beckens oder eines Bergrückens ist und es danach genau so viele Becken gibt wie am Anfang.
es: A medida que el nivel del agua aumenta a lo largo de la imagen, ocasionalmente llegará a una cresta entre dos cuencas y, en realidad, el agua podría derramarse de una cuenca a la otra. Sin embargo, en la transformada de watershed esto no está permitido; más bien se construye una presa en esas crestas. Luego, el agua sigue subiendo y se construyen presas según sea necesario, hasta que al final cada píxel forma parte de una cuenca o de una cresta, y después hay exactamente el mismo número de cuencas que al principio.
pt_br: À medida que o nível da água sobe na imagem, ocasionalmente atingirá uma crista entre duas bacias - e, na realidade, a água poderá transbordar de uma bacia para a outra. Porém, na transformação da bacia hidrográfica isso não é permitido; em vez disso, uma barragem é construída nessas cristas. A água então continua a subir, com barragens sendo construídas conforme necessário, até que no final cada pixel seja parte de uma bacia ou de uma crista, e depois haja exatamente o mesmo número de bacias que havia no início.

source: The operation of the watershed transform is illustrated in the video below and example output shown in {numref}`fig-transform_surface_watershed`.
de: Die Funktionsweise der Watershed-Transformation wird im Video unten und in der Beispielausgabe in {numref}`fig-transform_surface_watershed` veranschaulicht.
es: El funcionamiento de la transformada de watershed se ilustra en el siguiente vídeo y en el resultado de ejemplo que se muestra en {numref}`fig-transform_surface_watershed`.
pt_br: A operação da transformação da bacia hidrográfica é ilustrada no vídeo abaixo e no exemplo de saída mostrado em {numref}`fig-transform_surface_watershed`.

source: Applying the watershed transform to an image. Here, we passed the inverted image to the watershed transform because we want to identify bright spots rather than dark ones. The full watershed transform will expand the seeds to create a labeled image including all pixels, but we can optionally mask the expansion to prevent it filling the background. Here, we defined the mask by applying a global threshold using the triangle method. Note that the masked watershed segmentation is able to split some spots that were merged using the global threshold alone.
de: Anwenden der Watershed-Transformation auf ein Bild. Hier haben wir das invertierte Bild an die Wassereinzugsgebietstransformation übergeben, weil wir helle statt dunkle Flecken identifizieren möchten. Bei der vollständigen Wassereinzugsgebietstransformation werden die Ausgangswerte erweitert, um ein beschriftetes Bild mit allen Pixeln zu erstellen. Wir können die Erweiterung jedoch optional maskieren, um zu verhindern, dass sie den Hintergrund ausfüllt. Hier haben wir die Maske definiert, indem wir mithilfe der Dreiecksmethode einen globalen Schwellenwert angewendet haben. Beachten Sie, dass die maskierte Wassereinzugsgebietssegmentierung einige Punkte aufteilen kann, die allein mithilfe des globalen Schwellenwerts zusammengeführt wurden.
es: Aplicar la transformada de watershed a una imagen. Aquí, pasamos la imagen invertida a la transformada de watershed porque queremos identificar puntos brillantes en lugar de oscuros. La transformada de watershed completa expandirá las semillas para crear una imagen etiquetada que incluya todos los píxeles, pero opcionalmente podemos enmascarar la expansión para evitar que llene el fondo. Aquí, definimos la máscara aplicando un umbral global usando el método del triángulo. Ten en cuenta que la segmentación de watershed enmascarada puede dividir algunos puntos que se fusionaron utilizando únicamente el umbral global.
pt_br: Aplicando a transformação da bacia hidrográfica a uma imagem. Aqui, passamos a imagem invertida para a transformação da bacia hidrográfica porque queremos identificar pontos brilhantes em vez de escuros. A transformação completa da bacia hidrográfica expandirá as sementes para criar uma imagem rotulada incluindo todos os pixels, mas podemos opcionalmente mascarar a expansão para evitar que ela preencha o fundo. Aqui, definimos a máscara aplicando um limite global usando o método do triângulo. Observe que a segmentação mascarada da bacia hidrográfica é capaz de dividir alguns pontos que foram mesclados usando apenas o limite global.

source: Crucially, as the seeds are expanded during the watershed transform, regions are not allowed to overlap. Furthermore, once a pixel has been assigned to a region then it cannot be moved to become part of any other region.
de: Entscheidend ist, dass sich die Regionen nicht überlappen dürfen, da die Samen während der Wassereinzugsgebietstransformation erweitert werden. Darüber hinaus kann ein Pixel, sobald es einer Region zugewiesen wurde, nicht verschoben werden, um Teil einer anderen Region zu werden.
es: Fundamentalmente, a medida que las semillas se expanden durante la transformada de watershed, no se permite que las regiones se superpongan. Además, una vez que se ha asignado un píxel a una región, no se puede mover para formar parte de ninguna otra región.
pt_br: Crucialmente, à medida que as sementes são expandidas durante a transformação da bacia hidrográfica, as regiões não podem se sobrepor. Além disso, uma vez atribuído um pixel a uma região, ele não poderá ser movido para se tornar parte de qualquer outra região.
