Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/6-transforms/transforms.po
Languages: de, es, pt_br

source: Using the 'rain falling on a surface' analogy, the seeds would be **regional minima** in an image, i.e. pixels with values that are lower than all neighboring pixels. This is where the water would gather first.
de: Unter Verwendung der Analogie „Regen fällt auf eine Oberfläche“ wären die Keime **regionale Minima** in einem Bild, d. h. Pixel mit Werten, die niedriger sind als alle benachbarten Pixel. Hier würde sich das Wasser zuerst sammeln.
es: Usando la analogía de la 'lluvia cayendo sobre una superficie', las semillas serían **mínimos regionales** en una imagen, es decir, píxeles con valores inferiores a todos los píxeles vecinos. Aquí es donde el agua se acumularía primero.
pt_br: Usando a analogia da 'chuva caindo sobre uma superfície', as sementes seriam **mínimos regionais** em uma imagem, ou seja, pixels com valores inferiores a todos os pixels vizinhos. É aqui que a água se acumularia primeiro.

source: In practice, we often need to have more control over the seeds rather than accepting all regional minima (to see why too many local minima could be a problem, observe that {numref}`fig-transform_surface_watershed` contains more regions that we probably would want). This variation is called the **seeded watershed transform**: the idea is the same, but we simply provide the seeds explicitly in the form of a labeled image, and the regions grow from these. We can generate seeds using other processing steps, such as by identifying [H-minima](sec_h_extrema).
de: In der Praxis müssen wir oft mehr Kontrolle über die Samen haben, anstatt alle regionalen Minima zu akzeptieren (um zu sehen, warum zu viele lokale Minima ein Problem darstellen könnten, beachten Sie, dass {numref}`fig- transform_surface_watershed` enthält mehr Regionen, die wir wahrscheinlich wollen würden). Diese Variante wird **Seed Watershed Transformation** genannt: Die Idee ist dieselbe, aber wir stellen die Seeds einfach explizit in Form eines beschrifteten Bildes bereit und die Regionen wachsen daraus. Wir können Seeds mithilfe anderer Verarbeitungsschritte generieren, beispielsweise durch die Identifizierung von [H-Minima](sec_h_extrema).
es: En la práctica, a menudo necesitamos tener más control sobre las semillas en lugar de aceptar todos los mínimos regionales (para ver por qué demasiados mínimos locales podrían ser un problema, observa que {numref}`fig-transform_surface_watershed` contiene más regiones que probablemente querríamos). Esta variación se llama **transformación de watershed con semillas**: la idea es la misma, pero simplemente proporcionamos las semillas explícitamente en forma de una imagen etiquetada, y las regiones crecen a partir de ellas. Podemos generar semillas utilizando otros pasos de procesamiento, como identificando [H-minima](sec_h_extrema).
pt_br: Na prática, muitas vezes precisamos ter mais controle sobre as sementes em vez de aceitar todos os mínimos regionais (para ver por que muitos mínimos locais podem ser um problema, observe que {numref}`fig- transform_surface_watershed` contém mais regiões do que provavelmente desejaríamos). Essa variação é chamada de **transformada de bacia hidrográfica semeada**: a ideia é a mesma, mas simplesmente fornecemos as sementes explicitamente na forma de uma imagem rotulada, e as regiões crescem a partir delas. Podemos gerar sementes usando outras etapas de processamento, como identificando [H-mínimos](sec_h_extrema).

source: Combining transforms
de: Transformationen kombinieren
es: Combinando transformadas
pt_br: Combinando transformações

source: The watershed transform can be applied to any image, but it has some particularly interesting applications when it is applied to an image that is a distance map.
de: Die Wassereinzugsgebietstransformation kann auf jedes Bild angewendet werden, bietet jedoch einige besonders interessante Anwendungen, wenn sie auf ein Bild angewendet wird, bei dem es sich um eine Entfernungskarte handelt.
es: La transformada de cuenca se puede aplicar a cualquier imagen, pero tiene algunas aplicaciones particularmente interesantes cuando se aplica a una imagen que es un mapa de distancias.
pt_br: A transformada de bacia hidrográfica pode ser aplicada a qualquer imagem, mas tem algumas aplicações particularmente interessantes quando aplicada a uma imagem que é um mapa de distância.

source: Splitting round objects
de: Runde Gegenstände spalten
es: Dividir objetos redondos
pt_br: Dividindo objetos redondos

source: A distance map has regional maxima whenever a foreground pixel is further from the background than any of its neighbors.
de: Eine Distanzkarte weist regionale Maxima auf, wenn ein Vordergrundpixel weiter vom Hintergrund entfernt ist als einer seiner Nachbarn.
es: Un mapa de distancia tiene máximos regionales siempre que un píxel de primer plano esté más lejos del fondo que cualquiera de sus vecinos.
pt_br: Um mapa de distância tem máximos regionais sempre que um pixel do primeiro plano está mais distante do fundo do que qualquer um dos seus vizinhos.

source: This tends to occur towards the center of objects: particularly round objects that don't contain any holes. Importantly, regional maxima can still be present even if the 'round objects' are connected to one another in the binary image used to generate the distance map originally.
de: Dies tritt tendenziell in der Mitte von Objekten auf: insbesondere bei runden Objekten, die keine Löcher enthalten. Wichtig ist, dass regionale Maxima auch dann noch vorhanden sein können, wenn die „runden Objekte“ in dem Binärbild, das ursprünglich zur Erstellung der Entfernungskarte verwendet wurde, miteinander verbunden sind.
es: Esto tiende a ocurrir hacia el centro de los objetos: particularmente objetos redondos que no contienen agujeros. Es importante destacar que los máximos regionales aún pueden estar presentes incluso si los 'objetos redondos' están conectados entre sí en la imagen binaria utilizada para generar el mapa de distancia originalmente.
pt_br: Isso tende a ocorrer em direção ao centro dos objetos: principalmente objetos redondos que não contêm furos. É importante ressaltar que os máximos regionais ainda podem estar presentes mesmo se os 'objetos redondos' estiverem conectados uns aos outros na imagem binária usada para gerar o mapa de distância originalmente.

source: This means that by applying a watershed transform to a distance map, we are able to split 'roundish' structures in binary images. The process is as follows:
de: Das bedeutet, dass wir durch die Anwendung einer Wassereinzugsgebietstransformation auf eine Distanzkarte in der Lage sind, „rundliche“ Strukturen in Binärbildern aufzuteilen. Der Prozess ist wie folgt:
es: Esto significa que al aplicar una transformada de watershed a un mapa de distancias, podemos dividir estructuras "redondeadas" en imágenes binarias. El proceso es el siguiente:
pt_br: Isto significa que, ao aplicar uma transformação de bacia hidrográfica a um mapa de distância, somos capazes de dividir estruturas 'arredondadas' em imagens binárias. O processo é como se segue:

source: Compute the distance map of the image
de: Berechnen Sie die Entfernungskarte des Bildes
es: Calcular el mapa de distancia de la imagen.
pt_br: Calcule o mapa de distância da imagem

source: Invert the distance map (e.g. multiply by -1), so that peaks become valleys
de: Kehren Sie die Entfernungskarte um (z. B. multiplizieren Sie sie mit -1), sodass aus Spitzen Täler werden
es: Invierte el mapa de distancias (por ejemplo, multiplícalo por -1), de modo que los picos se conviertan en valles.
pt_br: Inverta o mapa de distância (por exemplo, multiplique por -1), para que os picos se tornem vales

source: Apply the watershed transform, starting from the regional minima of the inverted distance map
de: Wenden Sie die Wassereinzugsgebietstransformation an, beginnend mit den regionalen Minima der invertierten Entfernungskarte
es: Aplicar la transformación de watershed, a partir de los mínimos regionales del mapa de distancia invertido
pt_br: Aplique a transformação da bacia hidrográfica, começando pelos mínimos regionais do mapa de distância invertido

source: Splitting round objects using the distance and watershed transforms.
de: Aufteilen runder Objekte mithilfe der Abstands- und Wasserscheidentransformationen.
es: Dividir objetos redondos usando las transformadas de distancia y watershed.
pt_br: Divisão de objetos redondos usando as transformações de distância e bacia hidrográfica.

source: The objects to be split do not have to be perfectly round. The only requirement is that there are clearly distinct regional maxima in the distance transform -- or, alternatively, we can define suitable seeds using other processing steps.
de: Die zu teilenden Objekte müssen nicht perfekt rund sein. Die einzige Voraussetzung ist, dass es in der Distanztransformation klar unterschiedliche regionale Maxima gibt – alternativ können wir mithilfe anderer Verarbeitungsschritte geeignete Seeds definieren.
es: Los objetos a dividir no tienen por qué ser perfectamente redondos. El único requisito es que haya máximos regionales claramente distintos en la transformada de distancia o, alternativamente, podemos definir semillas adecuadas utilizando otros pasos de procesamiento.
pt_br: Os objetos a serem divididos não precisam ser perfeitamente redondos. O único requisito é que existam máximos regionais claramente distintos na transformada de distância - ou, alternativamente, podemos definir sementes adequadas utilizando outras etapas de processamento.

source: Splitting merged blobs based on 'roundness' using the distance and watershed transforms. Because there are many small regional maxima in the distance transform, here we define seeds using H-maxima followed by a 3×3 dilation to avoid excessive splitting.
de: Aufteilen zusammengeführter Blobs basierend auf der „Rundheit“ mithilfe der Abstands- und Wassereinzugsgebietstransformationen. Da es in der Distanztransformation viele kleine regionale Maxima gibt, definieren wir hier Seeds mithilfe von H-Maxima, gefolgt von einer 3×3-Dilatation, um eine übermäßige Aufspaltung zu vermeiden.
es: División de manchas fusionadas en función de la "redondez" utilizando las transformadas de distancia y watershed. Debido a que hay muchos máximos regionales pequeños en la transformada de distancia, aquí definimos semillas usando máximos H seguidos de una dilatación de 3 × 3 para evitar una división excesiva.
pt_br: Divisão de blobs mesclados com base na 'redondeza' usando as transformações de distância e bacia hidrográfica. Como existem muitos máximos regionais pequenos na transformada de distância, aqui definimos sementes usando máximos H seguidos por uma dilatação 3×3 para evitar divisão excessiva.

source: Watershed lines
de: Wasserscheidelinien
es: Líneas de watershed
pt_br: Linhas de bacia hidrográfica

source: When applying a watershed transform, it is often possible to specify whether the separations between regions are assigned one of the region labels, or are left as background pixels.
de: Beim Anwenden einer Wassereinzugsgebietstransformation ist es oft möglich, anzugeben, ob den Abständen zwischen Regionen eine der Regionsbezeichnungen zugewiesen wird oder als Hintergrundpixel belassen wird.
es: Al aplicar una transformada de watershed, a menudo es posible especificar si a las separaciones entre regiones se les asigna una de las etiquetas de región o se dejan como píxeles de fondo.
pt_br: Ao aplicar uma transformação de bacia hidrográfica, muitas vezes é possível especificar se as separações entre regiões recebem um dos rótulos de região ou são deixadas como pixels de fundo.

source: Here, we have shown the separations as background pixels. This is consistent with how ImageJ's default watershed command works, and also makes the splits clearer in the figures shown here. In Python code using scikit-image, that means we are using the `watershed_lines=True` option.
de: Hier haben wir die Auszüge als Hintergrundpixel dargestellt. Dies steht im Einklang mit der Funktionsweise des Standard-Watershed-Befehls von ImageJ und macht auch die Aufteilungen in den hier gezeigten Abbildungen deutlicher. Im Python-Code mit scikit-image bedeutet das, dass wir die Option „watershed_lines=True“ verwenden.
es: Aquí hemos mostrado las separaciones como píxeles de fondo. Esto es consistente con cómo funciona el comando de watershed predeterminado de ImageJ y también aclara las divisiones en las figuras que se muestran aquí. En el código Python que usa scikit-image, eso significa que estamos usando la opción `watershed_lines=True`.
pt_br: Aqui, mostramos as separações como pixels de fundo. Isso é consistente com o funcionamento do comando watershed padrão do ImageJ e também torna as divisões mais claras nas figuras mostradas aqui. No código Python usando scikit-image, isso significa que estamos usando a opção `watershed_lines=True`.

source: Partitioning images with Voronoi
de: Partitionieren von Bildern mit Voronoi
es: Partición de imágenes con Voronoi
pt_br: Particionando imagens com Voronoi

source: Calculating the distance transform of an *inverted* binary image gives a distance map in which each pixel gives the distance to the closest foreground object.
de: Die Berechnung der Distanztransformation eines *invertierten* Binärbilds ergibt eine Distanzkarte, in der jedes Pixel die Distanz zum nächstgelegenen Vordergrundobjekt angibt.
es: Al calcular la transformación de distancia de una imagen binaria *invertida* se obtiene un mapa de distancia en el que cada píxel indica la distancia al objeto en primer plano más cercano.
pt_br: O cálculo da transformação de distância de uma imagem binária *invertida* fornece um mapa de distância no qual cada pixel fornece a distância até o objeto em primeiro plano mais próximo.

source: If we apply a watershed transform to this distance map, using the objects in the binary image as seeds, we effectively partition the image into different regions according to the closest object in the binary image.
de: Wenn wir auf diese Distanzkarte eine Wasserscheidentransformation anwenden und dabei die Objekte im Binärbild als Ausgangspunkte verwenden, unterteilen wir das Bild effektiv in verschiedene Regionen entsprechend dem nächstgelegenen Objekt im Binärbild.
es: Si aplicamos una transformación de cuenca a este mapa de distancia, utilizando los objetos en la imagen binaria como semillas, efectivamente dividimos la imagen en diferentes regiones según el objeto más cercano en la imagen binaria.
pt_br: Se aplicarmos uma transformação de bacia hidrográfica a este mapa de distância, usando os objetos na imagem binária como sementes, particionaremos efetivamente a imagem em diferentes regiões de acordo com o objeto mais próximo na imagem binária.

source: This is sometimes called the **Voronoi transform** of the image.
de: Dies wird manchmal als **Voronoi-Transformation** des Bildes bezeichnet.
es: A esto a veces se le llama **transformación de Voronoi** de la imagen.
pt_br: Isso às vezes é chamado de **transformada de Voronoi** da imagem.

source: Expanding blobs to compute the Voronoi transform of a labeled image, partitioning it into different regions according to the closest seed object.
de: Erweitern von Blobs, um die Voronoi-Transformation eines beschrifteten Bildes zu berechnen und es entsprechend dem nächstgelegenen Startobjekt in verschiedene Regionen zu unterteilen.
es: Expandir blobs para calcular la transformada de Voronoi de una imagen etiquetada, dividiéndola en diferentes regiones según el objeto semilla más cercano.
pt_br: Expandir blobs para calcular a transformada de Voronoi de uma imagem rotulada, particionando-a em diferentes regiões de acordo com o objeto inicial mais próximo.

source: Expanding without overlaps
de: Erweitern ohne Überschneidungen
es: Ampliando sin superposiciones
pt_br: Expandindo sem sobreposições

source: Building upon the Vononoi idea in the last section, we can expand the objects themselves in such a way that they don't overlap.
de: Aufbauend auf der Vononoi-Idee im letzten Abschnitt können wir die Objekte selbst so erweitern, dass sie sich nicht überlappen.
es: Basándonos en la idea de Vononoi de la última sección, podemos expandir los objetos mismos de tal manera que no se superpongan.
pt_br: Com base na ideia de Vononoi da última seção, podemos expandir os próprios objetos de forma que não se sobreponham.

source: QuPath's cell detection, based upon nucleus detection + watershed expansion.
de: Die Zellerkennung von QuPath basiert auf der Kernerkennung + Wassereinzugsgebietserweiterung.
es: Detección de células de QuPath, basada en la detección de núcleos + expansión de watershed.
pt_br: Detecção de células do QuPath, baseada na detecção de núcleo + expansão da bacia hidrográfica.

source: Our goal is to dilate each object in the image by 10 pixels, but without merging. If seed objects are closer than 20 pixels apart, they each expand the same amount -- until they meet in the middle. This technique may be used to approximate a cell boundary based upon detected nuclei by expansion using a fixed distance.
de: Unser Ziel ist es, jedes Objekt im Bild um 10 Pixel zu erweitern, jedoch ohne es zu verschmelzen. Wenn die Startobjekte weniger als 20 Pixel voneinander entfernt sind, dehnen sie sich jeweils um den gleichen Betrag aus – bis sie sich in der Mitte treffen. Diese Technik kann verwendet werden, um eine Zellgrenze basierend auf erkannten Kernen durch Expansion unter Verwendung eines festen Abstands anzunähern.
es: Nuestro objetivo es dilatar cada objeto de la imagen 10 píxeles, pero sin fusionarlos. Si los objetos semilla están a menos de 20 píxeles de distancia, cada uno de ellos se expande la misma cantidad, hasta que se encuentran en el medio. Esta técnica se puede utilizar para aproximar un límite celular en función de los núcleos detectados mediante expansión utilizando una distancia fija.
pt_br: Nosso objetivo é dilatar cada objeto da imagem em 10 pixels, mas sem mesclar. Se os objetos originais estiverem a menos de 20 pixels de distância, cada um deles se expandirá na mesma proporção - até se encontrarem no meio. Esta técnica pode ser usada para aproximar um limite celular com base nos núcleos detectados por expansão usando uma distância fixa.

source: Firstly, we look at what *won't* work. We can't simply dilate a labeled image with a maximum filter, because there's nothing to prevent regions merging into one another. When seeds are close together, the higher label will 'win' the expansion race in every case, dominating the output.
de: Zuerst schauen wir uns an, was *nicht* funktionieren wird. Wir können ein beschriftetes Bild nicht einfach mit einem maximalen Filter erweitern, da nichts dagegen spricht, dass Regionen ineinander übergehen. Wenn die Samen nahe beieinander liegen, „gewinnt“ in jedem Fall die höhere Bezeichnung den Expansionswettlauf und dominiert die Produktion.
es: En primer lugar, analizamos lo que *no* funciona. No podemos simplemente dilatar una imagen etiquetada con un filtro máximo, porque no hay nada que impida que las regiones se fusionen entre sí. Cuando las semillas están muy juntas, la etiqueta más alta "ganará" la carrera de expansión en todos los casos, dominando la producción.
pt_br: Em primeiro lugar, analisamos o que *não* funciona. Não podemos simplesmente dilatar uma imagem rotulada com um filtro máximo, porque não há nada que impeça a fusão de regiões. Quando as sementes estão próximas, o rótulo mais elevado “ganhará” a corrida de expansão em todos os casos, dominando a produção.

source: Expanding blobs using a maximum filter only. This approach is too simple; it results in overlapping labels and a lot of confusion.
de: Erweitern von Blobs nur mit einem Maximalfilter. Dieser Ansatz ist zu einfach; Dies führt zu überlappenden Beschriftungen und großer Verwirrung.
es: Expandir blobs usando solo un filtro máximo. Este enfoque es demasiado simple; da como resultado etiquetas superpuestas y mucha confusión.
pt_br: Expandindo blobs usando apenas um filtro máximo. Esta abordagem é muito simples; isso resulta em rótulos sobrepostos e muita confusão.

source: Instead, we need to build upon the Voronoi approach shown in {numref}`fig-morph_voronoi_expand`. The only difference we need to incorporate is that we prevent the watershed expansion from growing beyond 10 pixels.
de: Stattdessen müssen wir auf dem Voronoi-Ansatz aufbauen, der in {numref}`fig-morph_voronoi_expand` gezeigt wird. Der einzige Unterschied, den wir berücksichtigen müssen, besteht darin, dass wir verhindern, dass die Ausdehnung des Wassereinzugsgebiets über 10 Pixel hinaus anwächst.
es: En lugar de ello, debemos basarnos en el enfoque de Voronoi que se muestra en {numref}`fig-morph_voronoi_expand`. La única diferencia que debemos incorporar es que evitamos que la expansión de la cuenca crezca más allá de los 10 píxeles.
pt_br: Em vez disso, precisamos desenvolver a abordagem Voronoi mostrada em {numref}`fig-morph_voronoi_expand`. A única diferença que precisamos incorporar é que evitamos que a expansão da bacia hidrográfica cresça além de 10 pixels.

source: Fortunately, this criterion is easy to set: our distance map already gives us the distance to every seed object. We can threshold that to define a binary mask that indicates where regions should no longer expand. If we update our watershed output to have background pixels at the same locations where our binary mask has background pixels, we have achieved a constrained expansion of 10 pixels without overlap.
de: Glücklicherweise ist dieses Kriterium einfach festzulegen: Unsere Entfernungskarte gibt uns bereits die Entfernung zu jedem Startobjekt an. Wir können dies als Schwellenwert festlegen, um eine Binärmaske zu definieren, die angibt, wo Regionen nicht mehr erweitert werden sollen. Wenn wir unsere Wassereinzugsgebietsausgabe so aktualisieren, dass sie Hintergrundpixel an denselben Stellen hat, an denen unsere Binärmaske Hintergrundpixel hat, haben wir eine eingeschränkte Erweiterung von 10 Pixeln ohne Überlappung erreicht.
es: Afortunadamente, este criterio es fácil de establecer: nuestro mapa de distancias ya nos da la distancia a cada objeto semilla. Podemos establecer un umbral para definir una máscara binaria que indique dónde las regiones ya no deberían expandirse. Si actualizamos nuestra salida de cuenca para tener píxeles de fondo en las mismas ubicaciones donde nuestra máscara binaria tiene píxeles de fondo, habremos logrado una expansión restringida de 10 píxeles sin superposición.
pt_br: Felizmente, este critério é fácil de definir: nosso mapa de distância já nos dá a distância até cada objeto semente. Podemos limitar isso para definir uma máscara binária que indique onde as regiões não devem mais se expandir. Se atualizarmos nossa saída da bacia hidrográfica para ter pixels de fundo nos mesmos locais onde nossa máscara binária possui pixels de fundo, alcançaremos uma expansão restrita de 10 pixels sem sobreposição.
