Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/macros/macro_simulating.po
Languages: de, pt_br

source: Simulating image formation
de: Bildentstehung simulieren
pt_br: Simulando a formação de imagens

source: Introduction
de: Einführung
pt_br: Introdução

source: The Difference of Gaussians macro developed in {ref}`chap_macro_intro` was useful, but quite simple. This section contains an extended practical, the goal of which is to develop a somewhat more sophisticated macro that takes an 'ideal' image, and then simulates how it would look after being recorded by a fluorescence microscope. It can be used not only to get a better understanding of the image formation process, but also to generate test data for analysis algorithms. By creating simulations with different settings, we can investigate how our results might be affected by changes in image acquisition and quality.
de: Das in {ref}`chap_macro_intro` entwickelte Makro „Unterschied von Gaußschen“ war nützlich, aber recht einfach. Dieser Abschnitt enthält ein erweitertes Praktikum, dessen Ziel darin besteht, ein etwas ausgefeilteres Makro zu entwickeln, das ein „ideales“ Bild aufnimmt und dann simuliert, wie es nach der Aufnahme durch ein Fluoreszenzmikroskop aussehen würde. Damit lässt sich nicht nur ein besseres Verständnis des Bildentstehungsprozesses erlangen, sondern auch Testdaten für Analysealgorithmen generieren. Indem wir Simulationen mit unterschiedlichen Einstellungen erstellen, können wir untersuchen, wie unsere Ergebnisse durch Änderungen in der Bildaufnahme und -qualität beeinflusst werden könnten.
pt_br: A macro Diferença de Gaussianas desenvolvida em {ref}`chap_macro_intro` foi útil, mas bastante simples. Esta seção contém uma prática estendida, cujo objetivo é desenvolver uma macro um pouco mais sofisticada que obtenha uma imagem “ideal” e depois simule como ela ficaria depois de ser registrada por um microscópio de fluorescência. Ele pode ser usado não apenas para entender melhor o processo de formação de imagens, mas também para gerar dados de teste para algoritmos de análise. Ao criar simulações com configurações diferentes, podemos investigar como nossos resultados podem ser afetados por mudanças na aquisição e qualidade da imagem.

source: Image formation summary
de: Zusammenfassung der Bildentstehung
pt_br: Resumo da formação da imagem

source: The following is a summary of the aspects of image formation discussed in this book:
de: Im Folgenden finden Sie eine Zusammenfassung der in diesem Buch behandelten Aspekte der Bilderzeugung:
pt_br: A seguir está um resumo dos aspectos da formação de imagens discutidos neste livro:

source: Images are composed of pixels, each of which has a **single numeric value** (not a color!).
de: Bilder bestehen aus Pixeln, von denen jedes einen **einzelnen numerischen Wert** hat (keine Farbe!).
pt_br: As imagens são compostas de pixels, cada um com um **único valor numérico** (não uma cor!).

source: The value of a pixel in fluorescence microscopy relates to a number of detected **photons** -- or, more technically, the charge of the electrons produced by the photons striking a detector.
de: Der Wert eines Pixels in der Fluoreszenzmikroskopie bezieht sich auf die Anzahl der detektierten **Photonen** – oder, technischer ausgedrückt, auf die Ladung der Elektronen, die von den Photonen erzeugt werden, die auf einen Detektor treffen.
pt_br: O valor de um pixel na microscopia de fluorescência está relacionado a um número de **fótons** detectados - ou, mais tecnicamente, à carga dos elétrons produzidos pelos fótons que atingem um detector.

source: Images can have many **dimensions**. The number of dimensions is essentially the number of things you need to know to identify each pixel (e.g. time point, channel number, _x_ coordinate, _y_ coordinate, _z_ slice).
de: Bilder können viele **Dimensionen** haben. Die Anzahl der Dimensionen ist im Wesentlichen die Anzahl der Dinge, die Sie wissen müssen, um jedes Pixel zu identifizieren (z. B. Zeitpunkt, Kanalnummer, _x_-Koordinate, _y_-Koordinate, _z_-Slice).
pt_br: As imagens podem ter muitas **dimensões**. O número de dimensões é essencialmente o número de coisas que você precisa saber para identificar cada pixel (por exemplo, ponto no tempo, número do canal, coordenada _x_, coordenada _y_, fatia _z_).

source: The two main factors that limit image quality are **blur** and **noise**. Both are inevitable, and neither can be completely overcome.
de: Die beiden Hauptfaktoren, die die Bildqualität einschränken, sind **Unschärfe** und **Rauschen**. Beides ist unvermeidlich und keines kann vollständig überwunden werden.
pt_br: Os dois principais fatores que limitam a qualidade da imagem são **desfoque** e **ruído**. Ambos são inevitáveis e nenhum deles pode ser completamente superado.

source: Blur is characterized by the **point spread function (PSF)** of the microscope, which is the 3D volume that would be the result of imaging a single light-emitting point. It acts as a **convolution**.
de: Unschärfe wird durch die **Punktverteilungsfunktion (PSF)** des Mikroskops charakterisiert, bei der es sich um das 3D-Volumen handelt, das sich bei der Abbildung eines einzelnen lichtemittierenden Punktes ergeben würde. Es fungiert als **Faltung**.
pt_br: O desfoque é caracterizado pela **função de dispersão de pontos (PSF)** do microscópio, que é o volume 3D que seria o resultado da imagem de um único ponto emissor de luz. Ele atua como uma **convolução**.

source: In the focal plane, the image of a point is an **Airy pattern**. Most of the light is contained within a central region, the **Airy disk**.
de: In der Brennebene ist das Bild eines Punktes ein **Luftiges Muster**. Der größte Teil des Lichts ist in einem zentralen Bereich, der **Luftscheibe**, enthalten.
pt_br: No plano focal, a imagem de um ponto é um **padrão aéreo**. A maior parte da luz está contida em uma região central, o **disco aéreo**.

source: The **spatial resolution** is a measure of the separation that must exist between structures before they can adequately be distinguished as separate, and relates to the size of the PSF (or Airy disk in 2D).
de: Die **räumliche Auflösung** ist ein Maß für den Abstand, der zwischen Strukturen bestehen muss, bevor sie angemessen als getrennt unterschieden werden können, und bezieht sich auf die Größe des PSF (oder der Airy-Scheibe in 2D).
pt_br: A **resolução espacial** é uma medida da separação que deve existir entre as estruturas antes que elas possam ser adequadamente distinguidas como separadas e está relacionada ao tamanho do PSF (ou disco Airy em 2D).

source: The two main types of noise are **photon noise** and **read noise**. The former is caused by the randomness of photon emission, while the latter arises from imprecisions in quantifying numbers of detected photons.
de: Die beiden Hauptarten von Rauschen sind **Photonenrauschen** und **Leserauschen**. Ersteres wird durch die Zufälligkeit der Photonenemission verursacht, während letzteres auf Ungenauigkeiten bei der Quantifizierung der Anzahl detektierter Photonen zurückzuführen ist.
pt_br: Os dois principais tipos de ruído são **ruído de fóton** e **ruído de leitura**. O primeiro é causado pela aleatoriedade da emissão de fótons, enquanto o último surge de imprecisões na quantificação do número de fótons detectados.

source: **Detecting more photons** helps to overcome the problems caused by _both_ types of noise.
de: **Die Erkennung von mehr Photonen** hilft, die durch beide Arten von Rauschen verursachten Probleme zu überwinden.
pt_br: **Detectar mais fótons** ajuda a superar os problemas causados por _ambos_ os tipos de ruído.

source: Different types of microscope have different advantages and costs in terms of **spatial information**, **temporal resolution** and **noise**.
de: Verschiedene Mikroskoptypen bieten unterschiedliche Vorteile und Kosten im Hinblick auf **räumliche Informationen**, **zeitliche Auflösung** und **Rauschen**.
pt_br: Diferentes tipos de microscópio têm diferentes vantagens e custos em termos de **informações espaciais**, **resolução temporal** e **ruído**.

source: **PMTs** are used to detect photons for single pixels, while **CCDs** and **EMCCDs** are used to detect photons for many pixels in parallel.
de: **PMTs** werden verwendet, um Photonen für einzelne Pixel zu erkennen, während **CCDs** und **EMCCDs** verwendet werden, um Photonen für viele Pixel parallel zu erkennen.
pt_br: **PMTs** são usados para detectar fótons de pixels únicos, enquanto **CCDs** e **EMCCDs** são usados para detectar fótons de muitos pixels em paralelo.

source: The macro in this chapter will work for 2D images, and simulate the three main components:
de: Das Makro in diesem Kapitel funktioniert für 2D-Bilder und simuliert die drei Hauptkomponenten:
pt_br: A macro neste capítulo funcionará para imagens 2D e simulará os três componentes principais:

source: the blur of the PSF
de: die Unschärfe der PSF
pt_br: o borrão do PSF

source: photon noise
de: Photonenrauschen
pt_br: ruído de fóton

source: read noise
de: Lärm lesen
pt_br: ler ruído

source: Furthermore, the macro will ultimately be written in such a way that allows us to investigate the effects of changing some additional parameters:
de: Darüber hinaus wird das Makro letztendlich so geschrieben, dass wir die Auswirkungen der Änderung einiger zusätzlicher Parameter untersuchen können:
pt_br: Além disso, a macro será finalmente escrita de uma forma que nos permita investigar os efeitos da alteração de alguns parâmetros adicionais:

source: the size of the PSF (related to the objective lens NA and microscope type)
de: die Größe des PSF (bezogen auf die NA des Objektivs und den Mikroskoptyp)
pt_br: o tamanho do PSF (relacionado à lente objetiva NA e ao tipo de microscópio)

source: the amount of fluorescence being emitted from the brightest region
de: die Menge an Fluoreszenz, die von der hellsten Region emittiert wird
pt_br: a quantidade de fluorescência emitida pela região mais brilhante

source: the amount of background (from stray light and other sources)
de: die Menge des Hintergrunds (von Streulicht und anderen Quellen)
pt_br: a quantidade de fundo (de luz difusa e outras fontes)

source: the exposure time (and therefore number of detected photons)
de: die Belichtungszeit (und damit die Anzahl der detektierten Photonen)
pt_br: o tempo de exposição (e, portanto, o número de fótons detectados)

source: the detector's offset
de: der Offset des Detektors
pt_br: o deslocamento do detector

source: the detector's gain
de: die Verstärkung des Detektors
pt_br: o ganho do detector

source: the detector's read noise
de: das Leserauschen des Detektors
pt_br: o ruído de leitura do detector

source: camera binning
de: Kamera-Binning
pt_br: armazenamento de câmera

source: bit-depth
de: Bittiefe
pt_br: profundidade de bits

source: Recording the main steps
de: Aufzeichnen der wichtigsten Schritte
pt_br: Registrando as principais etapas

source: It doesn't really matter which image you use for this, but I recommend a single-channel 2D image that starts out without any obvious noise (e.g. the *Happy cell.tif* image). After starting the macro recorder, complete the following steps to create the main structure for the macro:
de: Es spielt keine Rolle, welches Bild Sie dafür verwenden, ich empfehle jedoch ein einkanaliges 2D-Bild, das zunächst ohne offensichtliches Rauschen beginnt (z. B. das Bild *Happy cell.tif*). Führen Sie nach dem Starten des Makrorekorders die folgenden Schritte aus, um die Hauptstruktur für das Makro zu erstellen:
pt_br: Realmente não importa qual imagem você usa para isso, mas eu recomendo uma imagem 2D de canal único que comece sem nenhum ruído óbvio (por exemplo, a imagem *Happy cell.tif*). Após iniciar o gravador de macro, conclua as etapas a seguir para criar a estrutura principal da macro:

source: Example input image
de: Beispiel-Eingabebild
pt_br: Exemplo de imagem de entrada

source: Example output image
de: Beispiel-Ausgabebild
pt_br: Exemplo de imagem de saída

source: Ensure the starting image is 32-bit.
de: Stellen Sie sicher, dass das Startbild 32-Bit ist.
pt_br: Certifique-se de que a imagem inicial seja de 32 bits.

source: Run {menuselection}`Process --> Filters --> Gaussian Blur...` using a sigma value of 2 to simulate the convolution with the PSF.
de: Führen Sie {menuselection}`Process --> Filters --> Gaussian Blur...` mit einem Sigma-Wert von 2 aus, um die Faltung mit der PSF zu simulieren.
pt_br: Execute {menuselection}`Process --> Filters --> Gaussian Blur...` usando um valor sigma de 2 para simular a convolução com o PSF.

source: Here, we will assume that there are some background photons from other sources, but around the same number at every pixel in the image. So we can simply add a constant to this image using {menuselection}`Add...`. The value should be small, perhaps 10.
de: Hier gehen wir davon aus, dass es einige Hintergrundphotonen von anderen Quellen gibt, jedoch in etwa der gleichen Anzahl an jedem Pixel im Bild. Wir können diesem Bild also einfach eine Konstante hinzufügen, indem wir {menuselection}`Add...` verwenden. Der Wert sollte klein sein, vielleicht 10.
pt_br: Aqui, assumiremos que existem alguns fótons de fundo de outras fontes, mas aproximadamente o mesmo número em cada pixel da imagem. Portanto, podemos simplesmente adicionar uma constante a esta imagem usando {menuselection}`Add...`. O valor deve ser pequeno, talvez 10.

source: The image now contains the 'average rates of photon emission' that we would normally like to have for one particular exposure time (i.e. it is noise-free). If we change the exposure time, we should change the pixel values similarly so that the rates remain the same. Because adjusting the exposure works like a multiplication, we can use the {menuselection}`Process --> Math --> Multiply...` command. Set it to a 'default' value of 1 for now.
de: Das Bild enthält nun die „durchschnittlichen Photonenemissionsraten“, die wir normalerweise für eine bestimmte Belichtungszeit haben möchten (d. h. es ist rauschfrei). Wenn wir die Belichtungszeit ändern, sollten wir die Pixelwerte entsprechend ändern, damit die Raten gleich bleiben. Da das Anpassen der Belichtung wie eine Multiplikation funktioniert, können wir den Befehl {menuselection}`Process --> Math --> Multiply...` verwenden. Stellen Sie es vorerst auf den Standardwert 1 ein.
pt_br: A imagem agora contém as 'taxas médias de emissão de fótons' que normalmente gostaríamos de ter para um determinado tempo de exposição (ou seja, é livre de ruído). Se alterarmos o tempo de exposição, devemos alterar os valores dos pixels de forma semelhante para que as taxas permaneçam as mesmas. Como o ajuste da exposição funciona como uma multiplicação, podemos usar o comando {menuselection}`Process --> Math --> Multiply...`. Defina-o para um valor 'padrão' de 1 por enquanto.

source: To convert the photon emission rates into actual photon counts that we could potentially detect, we need to simulate photon noise by replacing each pixel by a random value from a Poisson distribution that that has the same $\lambda$ as the rate itself. At the time of writing, there's no built-in command in ImageJ or Fiji to simulate Poisson noise but we can install *RandomJ* using the instructions at https://imagescience.org/meijering/software/randomj/. Then add noise by calling {menuselection}`Plugins --> RandomJ --> RandomJ Poisson`, making sure to set the {guilabel}`Insertion:` value to {guilabel}`Modulatory`. The {guilabel}`Mean` value will be ignored, so its setting does not matter.
de: Um die Photonenemissionsraten in tatsächliche Photonenzahlen umzuwandeln, die wir möglicherweise erfassen könnten, müssen wir Photonenrauschen simulieren, indem wir jedes Pixel durch einen Zufallswert aus einer Poisson-Verteilung ersetzen, der den gleichen $\lambda$ wie die Rate selbst hat. Zum Zeitpunkt des Schreibens gibt es in ImageJ oder Fiji keinen integrierten Befehl zur Simulation von Poisson-Rauschen, aber wir können *RandomJ* mithilfe der Anweisungen unter https://imagescience.org/meijering/software/randomj/ installieren. Fügen Sie dann Rauschen hinzu, indem Sie {menuselection}`Plugins --> RandomJ --> RandomJ Poisson` aufrufen und dabei darauf achten, {guilabel}` festzulegen Einfügung:` Wert für {guilabel}`Modulatory`. Der {guilabel}`Mean`-Wert wird ignoriert, daher spielt seine Einstellung keine Rolle.
pt_br: Para converter as taxas de emissão de fótons em contagens reais de fótons que poderíamos potencialmente detectar, precisamos simular o ruído de fótons substituindo cada pixel por um valor aleatório de uma distribuição de Poisson que tenha o mesmo $\lambda$ que a própria taxa. No momento em que este artigo foi escrito, não havia nenhum comando integrado no ImageJ ou Fiji para simular o ruído de Poisson, mas podemos instalar *RandomJ* usando as instruções em https://imagescience.org/meijering/software/randomj/. Em seguida, adicione ruído chamando {menuselection}`Plugins --> RandomJ --> RandomJ Poisson`, certificando-se de definir o {guilabel}` Inserção:` valor para {guilabel}`Modulatory`. O valor {guilabel}`Mean` será ignorado, portanto sua configuração não importa.

source: Notice that all the pixels should now have integer values: you cannot detect parts of photons.
de: Beachten Sie, dass alle Pixel jetzt ganzzahlige Werte haben sollten: Sie können keine Teile von Photonen erkennen.
pt_br: Observe que todos os pixels agora devem ter valores inteiros: você não pode detectar partes de fótons.

source: The detector gain scales up the number of electrons produced by detected photons. Make room for it by including another multiplication, although for now set the value to 1 (i.e. no extra gain).
de: Die Detektorverstärkung erhöht die Anzahl der von den detektierten Photonen erzeugten Elektronen. Schaffen Sie Platz dafür, indem Sie eine weitere Multiplikation einbauen, setzen Sie den Wert jedoch vorerst auf 1 (d. h. keinen zusätzlichen Gewinn).
pt_br: O ganho do detector aumenta o número de elétrons produzidos pelos fótons detectados. Abra espaço para isso incluindo outra multiplicação, embora por enquanto defina o valor como 1 (ou seja, sem ganho extra).

source: Simulate the detector offset by adding another constant, e.g. 100.
de: Simulieren Sie den Detektorversatz, indem Sie eine weitere Konstante hinzufügen, z. B. 100.
pt_br: Simule o deslocamento do detector adicionando outra constante, por ex. 100.

source: Add read noise with {menuselection}`Process --> Noise --> Add Specified Noise...`, setting the standard deviation to 5.
de: Fügen Sie Leserauschen mit {menuselection}`Process --> Noise --> Add Specified Noise...` hinzu und legen Sie die Standardabweichung auf 5 fest.
pt_br: Adicione ruído de leitura com {menuselection}`Process --> Noise --> Add Specified Noise...`, definindo o desvio padrão como 5.

source: Clip any negative values, by running {menuselection}`Process --> Math --> Min...` and setting the value to 0.
de: Schneiden Sie alle negativen Werte ab, indem Sie {menuselection}`Process --> Math --> Min...` ausführen und den Wert auf 0 setzen.
pt_br: Corte quaisquer valores negativos executando {menuselection}`Process --> Math --> Min...` e definindo o valor como 0.

source: Clip any positive values that exceed the bit-depth, by running {menuselection}`Process --> Math --> Max...`. To assume an a 8-bit image, set the value to 255.
de: Schneiden Sie alle positiven Werte ab, die die Bittiefe überschreiten, indem Sie {menuselection}`Process --> Math --> Max...` ausführen. Um von einem 8-Bit-Bild auszugehen, legen Sie den Wert auf 255 fest.
pt_br: Corte quaisquer valores positivos que excedam a profundidade de bits, executando {menuselection}`Process --> Math --> Max...`. Para assumir uma imagem de 8 bits, defina o valor como 255.

source: Now is a good time to clean up the code by removing any unnecessary lines, adding suitable comments, and bringing any interesting variables up to the top of the macro so that they can be easily modified later (as in {ref}`chap_macro_dog`). We should also duplicate the image to avoid accidentally modifying the original. The end result should look something like this:
de: Jetzt ist ein guter Zeitpunkt, den Code zu bereinigen, indem Sie alle unnötigen Zeilen entfernen, geeignete Kommentare hinzufügen und alle interessanten Variablen an den Anfang des Makros bringen, damit sie später leicht geändert werden können (wie in {ref}`chap_macro_dog`). Wir sollten das Bild auch duplizieren, um eine versehentliche Änderung des Originals zu vermeiden. Das Endergebnis sollte etwa so aussehen:
pt_br: Agora é um bom momento para limpar o código, removendo quaisquer linhas desnecessárias, adicionando comentários adequados e trazendo quaisquer variáveis interessantes para o topo da macro para que possam ser facilmente modificadas posteriormente (como em {ref}`chap_macro_dog`). Devemos também duplicar a imagem para evitar modificar acidentalmente o original. O resultado final deve ser algo assim:

source: You would have a perfectly respectable macro if you stopped now, but the following section contains some ways in which it may be improved.
de: Sie hätten ein vollkommen ansehnliches Makro, wenn Sie jetzt damit aufhören würden, aber der folgende Abschnitt enthält einige Möglichkeiten, wie es verbessert werden kann.
pt_br: Você teria uma macro perfeitamente respeitável se parasse agora, mas a seção a seguir contém algumas maneiras pelas quais ela pode ser melhorada.

source: Making improvements
de: Verbesserungen vornehmen
pt_br: Fazendo melhorias

source: Normalizing the image
de: Normalisieren des Bildes
pt_br: Normalizando a imagem

source: The results you get from running the above macro will change depending upon the original range of the image that you use: that is, an image that starts off with high-valued pixels will end up having much less noise. To compensate for this somewhat, we can first normalize the image so that all pixels fall into the range 0–1. To do this, we need to determine the current range of pixel values, which can be found out using the macro function:
de: Die Ergebnisse, die Sie durch die Ausführung des obigen Makros erhalten, variieren je nach dem ursprünglichen Bereich des von Ihnen verwendeten Bildes: Das heißt, ein Bild, das mit hochwertigen Pixeln beginnt, weist am Ende viel weniger Rauschen auf. Um dies etwas auszugleichen, können wir das Bild zunächst so normalisieren, dass alle Pixel in den Bereich 0–1 fallen. Dazu müssen wir den aktuellen Bereich der Pixelwerte ermitteln, der mit der Makrofunktion ermittelt werden kann:
pt_br: Os resultados obtidos ao executar a macro acima mudarão dependendo do intervalo original da imagem usada: ou seja, uma imagem que começa com pixels de alto valor acabará tendo muito menos ruído. Para compensar um pouco isso, podemos primeiro normalizar a imagem para que todos os pixels caiam no intervalo de 0–1. Para fazer isso, precisamos determinar o intervalo atual de valores de pixel, que pode ser descoberto usando a função macro:
