Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/macros/macro_simulating.po
Languages: de, pt_br

source: After running this, four variables are created giving the `mean`, `minimum` and `maximum` pixel values in the image, along with the total image `area`. Normalization is now possible using {menuselection}`Subtract` and {menuselection}`Divide` commands, and adjusting their values. In the end this gives us
de: Nachdem dies ausgeführt wurde, werden vier Variablen erstellt, die die „mittleren“, „minimalen“ und „maximalen“ Pixelwerte im Bild sowie die gesamte „Bildfläche“ angeben. Eine Normalisierung ist jetzt mit den Befehlen {menuselection}„Subtrahieren“ und {menuselection}„Dividieren“ und Anpassen ihrer Werte möglich. Am Ende gibt uns das
pt_br: Depois de executar isso, quatro variáveis são criadas fornecendo os valores `médio`, `mínimo` e `máximo` dos pixels da imagem, junto com a `área` total da imagem. A normalização agora é possível usando os comandos {menuselection}`Subtract` e {menuselection}`Divide` e ajustando seus valores. No final isso nos dá

source: Varying the fluorescence emission rate
de: Variation der Fluoreszenzemissionsrate
pt_br: Variando a taxa de emissão de fluorescência

source: The new problem we will have after normalization is that there will be a maximum photon emission rate of 1 in the brightest part of the image, which will give us a image dominated completely by noise. We can change this by multiplying the pixels again, and so define what we want the emission rate to be in the brightest part of the image. I suggest creating a variable for this, and setting its value to 10. Then add the following line immediately after normalization:
de: Das neue Problem, das wir nach der Normalisierung haben werden, besteht darin, dass es im hellsten Teil des Bildes eine maximale Photonenemissionsrate von 1 gibt, was zu einem Bild führt, das vollständig von Rauschen dominiert wird. Wir können dies ändern, indem wir die Pixel erneut multiplizieren und so definieren, wie hoch die Emissionsrate im hellsten Teil des Bildes sein soll. Ich schlage vor, hierfür eine Variable zu erstellen und ihren Wert auf 10 zu setzen. Fügen Sie dann unmittelbar nach der Normalisierung die folgende Zeile hinzu:
pt_br: O novo problema que teremos após a normalização é que haverá uma taxa máxima de emissão de fótons de 1 na parte mais brilhante da imagem, o que nos dará uma imagem completamente dominada por ruído. Podemos mudar isso multiplicando novamente os pixels, e assim definir qual queremos que seja a taxa de emissão na parte mais brilhante da imagem. Sugiro criar uma variável para isso e definir seu valor como 10. Em seguida, adicione a seguinte linha imediatamente após a normalização:

source: Modifying this value allows you to change between simulating samples that are fluorescing more or less brightly. For a less bright sample, you will most likely need to increase the exposure time to get a similar amount of signal -- but beware that increasing the exposure time also involves collecting more unhelpful background photons, so is not quite so good as having a sample where the important parts are intrinsically brighter.
de: Durch Ändern dieses Werts können Sie zwischen der Simulation von mehr oder weniger hell fluoreszierenden Proben wechseln. Bei einer weniger hellen Probe müssen Sie höchstwahrscheinlich die Belichtungszeit verlängern, um eine ähnliche Signalmenge zu erhalten. Beachten Sie jedoch, dass eine Erhöhung der Belichtungszeit auch das Sammeln weniger hilfreicher Hintergrundphotonen mit sich bringt und daher nicht ganz so gut ist wie eine Probe wo die wichtigen Teile von Natur aus heller sind.
pt_br: A modificação deste valor permite alternar entre a simulação de amostras que apresentam fluorescência mais ou menos intensa. Para uma amostra menos brilhante, você provavelmente precisará aumentar o tempo de exposição para obter uma quantidade semelhante de sinal - mas tenha cuidado, pois aumentar o tempo de exposição também envolve a coleta de mais fótons de fundo inúteis, portanto, não é tão bom quanto ter uma amostra onde as partes importantes são intrinsecamente mais brilhantes.

source: Simulating binning
de: Binning simulieren
pt_br: Simulando compartimentação

source: The main idea of [binning](sec_detectors_binning) is that the electrons from multiple pixels are added together prior to readout, so that the number of electrons being quantified is bigger relative to the read noise. For 2×2 binning this involves splitting the image into distinct 2×2 pixel blocks, and creating another image in which the value of each pixel is the sum of the values within the corresponding block.
de: Die Hauptidee von [binning](sec_detectors_binning) besteht darin, dass die Elektronen mehrerer Pixel vor dem Auslesen addiert werden, sodass die Anzahl der quantifizierten Elektronen im Verhältnis zum Leserauschen größer ist. Beim 2×2-Binning geht es darum, das Bild in verschiedene 2×2-Pixelblöcke aufzuteilen und ein weiteres Bild zu erstellen, in dem der Wert jedes Pixels die Summe der Werte innerhalb des entsprechenden Blocks ist.
pt_br: A ideia principal de [binning](sec_detectors_binning) é que os elétrons de vários pixels sejam somados antes da leitura, de modo que o número de elétrons quantificados seja maior em relação ao ruído de leitura. Para binning 2×2, isso envolve dividir a imagem em blocos distintos de 2×2 pixels e criar outra imagem na qual o valor de cada pixel é a soma dos valores dentro do bloco correspondente.

source: This could be done using the {menuselection}`Image --> Transform --> Bin` command, with a {guilabel}`shrink factor` of 2 and the {guilabel}`Sum` bin method. The macro recorder can again be used to get the main code that is needed. After some modification, this becomes
de: Dies könnte mit dem Befehl {menuselection}`Image --> Transform --> Bin' mit einem {guilabel}`Verkleinerungsfaktor erfolgen ` von 2 und die Bin-Methode {guilabel}`Sum`. Der Makrorecorder kann erneut verwendet werden, um den benötigten Hauptcode abzurufen. Nach einigen Modifikationen wird dies
pt_br: Isso pode ser feito usando o comando {menuselection}`Image --> Transform --> Bin`, com um {guilabel}`fator de redução ` de 2 e o método bin {guilabel}`Sum`. O gravador de macro pode novamente ser usado para obter o código principal necessário. Após algumas modificações, isso se torna

source: By enclosing the line within a _code block_ (limit by the curly brackets) and beginning the block with `if (doBinning)`, it's easy to control whether binning is applied or not. You simply add an extra variable to your list at the start of the macro
de: Indem Sie die Zeile in einen _Codeblock_ einschließen (Begrenzung durch die geschweiften Klammern) und den Block mit „if (doBinning)“ beginnen, können Sie leicht steuern, ob Binning angewendet wird oder nicht. Sie fügen einfach am Anfang des Makros eine zusätzliche Variable zu Ihrer Liste hinzu
pt_br: Ao colocar a linha dentro de um _bloco de código_ (limitado pelas chaves) e iniciar o bloco com `if (doBinning)`, é fácil controlar se o binning é aplicado ou não. Você simplesmente adiciona uma variável extra à sua lista no início da macro

source: to turn binning on, or
de: Binning einschalten, oder
pt_br: para ativar o binning ou

source: to turn it off. The lines of code that perform the binning should be inserted _before_ the addition of read noise.
de: um es auszuschalten. Die Codezeilen, die das Binning durchführen, sollten _vor_ dem Hinzufügen von Leserauschen eingefügt werden.
pt_br: para desligá-lo. As linhas de código que realizam o binning devem ser inseridas _antes_ da adição de ruído de leitura.

source: Varying bit-depths
de: Unterschiedliche Bittiefen
pt_br: Profundidades de bits variáveis

source: Varying the simulated bit-depths by changing the maximum value allowed in the image takes a little work: you need to know that the maximum value in an 8-bit image is 255, while for a 12-bit image it is 4095 and so on. It is more intuitive to just change the image bit-depth and have the macro do the calculation for you. To do this, you can replace the `maxVal = 255;` variable at the start of the macro with `nBits = 8;` and then update the later clipping code to become
de: Das Variieren der simulierten Bittiefen durch Ändern des im Bild zulässigen Maximalwerts erfordert ein wenig Arbeit: Sie müssen wissen, dass der Maximalwert in einem 8-Bit-Bild 255 beträgt, während er bei einem 12-Bit-Bild 4095 beträgt und so weiter . Es ist intuitiver, einfach die Bittiefe des Bildes zu ändern und das Makro die Berechnung für Sie durchführen zu lassen. Dazu können Sie die Variable „maxVal = 255;“ am Anfang des Makros durch „nBits = 8;“ ersetzen und dann den späteren Clipping-Code aktualisieren, um zu werden
pt_br: Variar a profundidade de bits simulada alterando o valor máximo permitido na imagem dá um pouco de trabalho: você precisa saber que o valor máximo em uma imagem de 8 bits é 255, enquanto para uma imagem de 12 bits é 4095 e assim por diante . É mais intuitivo apenas alterar a profundidade de bits da imagem e fazer com que a macro faça o cálculo para você. Para fazer isso, você pode substituir a variável `maxVal = 255;` no início da macro por `nBits = 8;` e então atualizar o código de recorte posterior para se tornar

source: Here, `pow(2, nBits)` is a function that gives you the value of 2<sup>nBits</sup>. Now it's easier to explore the difference between 8-bit, 12-bit and 14-bit images (which are the main bit-depths normally associated with microscope detectors, even if the resulting image is stored as 16-bit).
de: Hier ist „pow(2, nBits)“ eine Funktion, die Ihnen den Wert von 2<sup>nBits</sup> liefert. Jetzt ist es einfacher, den Unterschied zwischen 8-Bit-, 12-Bit- und 14-Bit-Bildern zu untersuchen (das sind die wichtigsten Bittiefen, die normalerweise mit Mikroskopdetektoren verbunden sind, selbst wenn das resultierende Bild als 16-Bit gespeichert wird).
pt_br: Aqui, `pow(2, nBits)` é uma função que fornece o valor de 2<sup>nBits</sup>. Agora é mais fácil explorar a diferença entre imagens de 8, 12 e 14 bits (que são as principais profundidades de bits normalmente associadas aos detectores de microscópio, mesmo que a imagem resultante seja armazenada como 16 bits).

source: Rounding to integer values
de: Auf ganzzahlige Werte runden
pt_br: Arredondamento para valores inteiros

source: The macro has already clipped the image to a specified bit-depth, but it still contains 32-bit data and so potentially has non-integer values that could not be stored in the 8 or 16-bit images a microscope typically provides as output. Therefore it remains to round the values to the nearest integer.
de: Das Makro hat das Bild bereits auf eine bestimmte Bittiefe zugeschnitten, es enthält jedoch immer noch 32-Bit-Daten und verfügt daher möglicherweise über nicht ganzzahlige Werte, die nicht in den 8- oder 16-Bit-Bildern gespeichert werden könnten, die ein Mikroskop normalerweise als Ausgabe bereitstellt. Daher bleibt es, die Werte auf die nächste ganze Zahl zu runden.
pt_br: A macro já cortou a imagem para uma profundidade de bits especificada, mas ainda contém dados de 32 bits e, portanto, possui potencialmente valores não inteiros que não poderiam ser armazenados nas imagens de 8 ou 16 bits que um microscópio normalmente fornece como saída. Portanto resta arredondar os valores para o número inteiro mais próximo.

source: There are a few ways to do this: we can convert the image using {menuselection}`Image --> Type -->` commands, though then we need to be careful about whether there will be any scaling applied. However, we can avoid thinking about this if we just apply the rounding ourselves. To do it we need to visit each pixel, extract its value, round the value to the nearest whole number, and put it back in the image. This requires using **loops**. The code, which should be added at the end of the macro, looks like this:
de: Dafür gibt es mehrere Möglichkeiten: Wir können das Bild mit den Befehlen {menuselection}`Image --> Type -->` konvertieren, allerdings müssen wir dann vorsichtig sein, ob dies der Fall ist Es wird eine beliebige Skalierung angewendet. Wir können jedoch vermeiden, darüber nachzudenken, wenn wir die Rundung einfach selbst anwenden. Dazu müssen wir jedes Pixel besuchen, seinen Wert extrahieren, den Wert auf die nächste ganze Zahl runden und ihn wieder in das Bild einfügen. Dies erfordert die Verwendung von **Schleifen**. Der Code, der am Ende des Makros hinzugefügt werden soll, sieht folgendermaßen aus:
pt_br: Existem algumas maneiras de fazer isso: podemos converter a imagem usando os comandos {menuselection}`Image --> Type -->`, mas precisamos ter cuidado se há será qualquer escala aplicada. No entanto, podemos evitar pensar nisso se apenas aplicarmos nós mesmos o arredondamento. Para isso precisamos visitar cada pixel, extrair seu valor, arredondar o valor para o número inteiro mais próximo e colocá-lo novamente na imagem. Isso requer o uso de **loops**. O código, que deve ser adicionado no final da macro, fica assim:

source: This creates two variables, `x` and `y`, which are used to store the horizontal and vertical coordinates of a pixel. Each starts off set to 0 (so we begin with the pixel at 0,0, i.e. in the top left of the image). The code in the middle is run to set the first pixel value, then the variable `x` is incremented to become 1 -- because `x++` means `add 1 to x`. This process is repeated so long as `x` is less than the image width, `x < width`. When `x` eventually becomes equal to the width, it means that all pixel values on the first row of the image have been rounded. Then `y` is incremented and `x` is reset to zero, before the process repeats and the next row is rounded as well. This continues until `y` is equal to the image height -- at which point the processing is complete [^fn_loops].
de: Dadurch werden zwei Variablen erstellt, „x“ und „y“, die zum Speichern der horizontalen und vertikalen Koordinaten eines Pixels verwendet werden. Jeder beginnt mit 0 (wir beginnen also mit dem Pixel bei 0,0, d. h. oben links im Bild). Der Code in der Mitte wird ausgeführt, um den ersten Pixelwert festzulegen, dann wird die Variable „x“ auf 1 erhöht – denn „x++“ bedeutet „addiere 1 zu x“. Dieser Vorgang wird wiederholt, solange „x“ kleiner als die Bildbreite ist, „x < Breite“. Wenn „x“ schließlich der Breite entspricht, bedeutet dies, dass alle Pixelwerte in der ersten Zeile des Bildes gerundet wurden. Dann wird „y“ erhöht und „x“ auf Null zurückgesetzt, bevor sich der Vorgang wiederholt und auch die nächste Zeile gerundet wird. Dies wird fortgesetzt, bis „y“ der Bildhöhe entspricht – an diesem Punkt ist die Verarbeitung abgeschlossen [^fn_loops].
pt_br: Isso cria duas variáveis, `x` e `y`, que são usadas para armazenar as coordenadas horizontais e verticais de um pixel. Cada um começa definido como 0 (então começamos com o pixel em 0,0, ou seja, no canto superior esquerdo da imagem). O código do meio é executado para definir o primeiro valor de pixel, então a variável `x` é incrementada para se tornar 1 - porque `x++` significa `adicionar 1 a x`. Este processo é repetido desde que `x` seja menor que a largura da imagem, `x <largura`. Quando `x` eventualmente se torna igual à largura, significa que todos os valores de pixel na primeira linha da imagem foram arredondados. Então `y` é incrementado e `x` é zerado, antes que o processo se repita e a próxima linha também seja arredondada. Isso continua até que `y` seja igual à altura da imagem - ponto em que o processamento é concluído [^fn_loops].

source: Final code
de: Endgültiger Code
pt_br: Código final

source: The final code of my version of the macro is given below:
de: Der endgültige Code meiner Version des Makros ist unten angegeben:
pt_br: O código final da minha versão da macro é fornecido abaixo:

source: Uses & limitations
de: Einsatzmöglichkeiten und Einschränkungen
pt_br: Usos e limitações

source: Of course, the above macro is based on some assumptions and simplifications. For example, it treats gain as a simple multiplication of the photon counts -- but the gain amplification process also involves some randomness, which introduces extra noise. Because this noise behaves statistically quite like photon noise, the effect can be thought of as decreasing the number of photons that were detected. Also, we have treated the background as a constant that is the same everywhere in an image. In practice, the background usually consists primarily of out-of-focus light from other image planes, and so really should change in different parts of the image, particularly in the widefield case.
de: Natürlich basiert das obige Makro auf einigen Annahmen und Vereinfachungen. Beispielsweise wird die Verstärkung als einfache Multiplikation der Photonenanzahl behandelt – der Verstärkungsverstärkungsprozess beinhaltet jedoch auch eine gewisse Zufälligkeit, die zusätzliches Rauschen verursacht. Da sich dieses Rauschen statistisch gesehen ähnlich wie Photonenrauschen verhält, kann man sich den Effekt als eine Verringerung der Anzahl der detektierten Photonen vorstellen. Außerdem haben wir den Hintergrund als eine Konstante behandelt, die überall im Bild gleich ist. In der Praxis besteht der Hintergrund meist hauptsächlich aus unscharfem Licht aus anderen Bildebenen und sollte sich daher in verschiedenen Teilen des Bildes ändern, insbesondere im Weitfeldfall.
pt_br: É claro que a macro acima se baseia em algumas suposições e simplificações. Por exemplo, trata o ganho como uma simples multiplicação da contagem de fótons - mas o processo de amplificação do ganho também envolve alguma aleatoriedade, o que introduz ruído extra. Como esse ruído se comporta estatisticamente como o ruído de fótons, o efeito pode ser considerado como uma diminuição do número de fótons detectados. Além disso, tratamos o plano de fundo como uma constante igual em todos os lugares da imagem. Na prática, o fundo geralmente consiste principalmente em luz fora de foco de outros planos da imagem e, portanto, deve mudar em diferentes partes da imagem, especialmente no caso de campo amplo.

source: Nevertheless, quite a lot of factors have been taken into consideration. By exploring different combinations of settings, you can get a feeling for how they affect overall image quality. For example, you could try:
de: Dennoch wurden viele Faktoren berücksichtigt. Indem Sie verschiedene Kombinationen von Einstellungen erkunden, können Sie ein Gefühl dafür bekommen, wie diese sich auf die Gesamtbildqualität auswirken. Sie könnten zum Beispiel Folgendes versuchen:
pt_br: No entanto, muitos fatores foram levados em consideração. Ao explorar diferentes combinações de configurações, você pode ter uma ideia de como elas afetam a qualidade geral da imagem. Por exemplo, você pode tentar:

source: Increasing the background, while keeping the maximum photon emission the same
de: Erhöhung des Hintergrunds bei gleichbleibender maximaler Photonenemission
pt_br: Aumentar o fundo, mantendo a mesma emissão máxima de fótons

source: Removing the detector offset, or setting it to a negative value
de: Entfernen des Detektor-Offsets oder Setzen auf einen negativen Wert
pt_br: Remover o deslocamento do detector ou configurá-lo para um valor negativo

source: Comparing the effects of binning for images with low and high photon counts
de: Vergleich der Effekte des Binnings für Bilder mit niedriger und hoher Photonenzahl
pt_br: Comparando os efeitos do binning para imagens com contagens de fótons baixas e altas

source: Creating multiple images from the same source data, and then averaging them together to see how the noise is changed
de: Erstellen Sie mehrere Bilder aus denselben Quelldaten und mitteln Sie sie dann zusammen, um zu sehen, wie sich das Rauschen verändert
pt_br: Criar várias imagens a partir dos mesmos dados de origem e, em seguida, calcular a média delas para ver como o ruído é alterado

source: When planning to implement some analysis strategy -- particularly if fluorescence intensity measurements are being made -- it may also be useful to test its effectiveness using this macro. To do so, you would need to
de: Wenn Sie die Implementierung einer Analysestrategie planen – insbesondere wenn Fluoreszenzintensitätsmessungen durchgeführt werden – kann es auch nützlich sein, deren Wirksamkeit mithilfe dieses Makros zu testen. Dazu müssten Sie dies tun
pt_br: Ao planejar a implementação de alguma estratégia de análise - especialmente se estiverem sendo feitas medições de intensidade de fluorescência - também pode ser útil testar sua eficácia usando esta macro. Para fazer isso, você precisaria

source: Somehow create a 'perfect', noise and blur-free example image, either manually or by deconvolving a suitably similar sample image
de: Erstellen Sie irgendwie ein „perfektes“, rausch- und verwacklungsfreies Beispielbild, entweder manuell oder durch Entfaltung eines entsprechend ähnlichen Beispielbildes
pt_br: De alguma forma, crie uma imagem de exemplo 'perfeita', sem ruído e sem desfoque, manualmente ou desconvolvendo uma imagem de amostra adequadamente semelhante

source: Apply your algorithm to this perfect image to find out what it detects and what conclusions you could draw
de: Wenden Sie Ihren Algorithmus auf dieses perfekte Bild an, um herauszufinden, was er erkennt und welche Schlussfolgerungen Sie daraus ziehen können
pt_br: Aplique seu algoritmo a esta imagem perfeita para descobrir o que ela detecta e quais conclusões você pode tirar

source: Apply the exact same algorithm to a version of the image that has passed through the simulator, and see how different your measurements and conclusions would be.
de: Wenden Sie genau denselben Algorithmus auf eine Version des Bildes an, das den Simulator durchlaufen hat, und sehen Sie, wie unterschiedlich Ihre Messungen und Schlussfolgerungen wären.
pt_br: Aplique exatamente o mesmo algoritmo a uma versão da imagem que passou pelo simulador e veja quão diferentes seriam suas medições e conclusões.

source: Ideally, the results should be the same in both cases: this would suggest your analysis method is robust and can handle images with different levels of quality. It's more likely that the results are different, however. In that case, the comparison gives you some idea of how affected by the imaging process your measurements are -- and therefore how reliably they relate to the 'real' underlying sample.
de: Im Idealfall sollten die Ergebnisse in beiden Fällen gleich sein: Dies deutet darauf hin, dass Ihre Analysemethode robust ist und Bilder mit unterschiedlichen Qualitätsstufen verarbeiten kann. Es ist jedoch wahrscheinlicher, dass die Ergebnisse unterschiedlich sind. In diesem Fall erhalten Sie durch den Vergleich eine Vorstellung davon, wie stark Ihre Messungen durch den Bildgebungsprozess beeinflusst werden – und wie zuverlässig sie sich daher auf die „echte“ zugrunde liegende Probe beziehen.
pt_br: Idealmente, os resultados devem ser iguais em ambos os casos: isto sugere que o seu método de análise é robusto e pode lidar com imagens com diferentes níveis de qualidade. É mais provável que os resultados sejam diferentes, no entanto. Nesse caso, a comparação dá-lhe uma ideia de quão afetadas pelo processo de imagem são as suas medições - e, portanto, quão fiavelmente se relacionam com a amostra subjacente "real".
