Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/macros/macro_intro.po
Languages: de, es, pt_br

source: Default Caption
de: Standardbeschriftung
es: Título predeterminado
pt_br: Legenda padrão

source: ImageJ: Writing macros
de: ImageJ: Makros schreiben
es: ImageJ: escritura de macros
pt_br: ImageJ: Escrevendo macros

source: Chapter outline
de: Kapitelüberblick
es: Bosquejo del capítulo
pt_br: Esboço do capítulo

source: Processing & analysis steps in ImageJ can be automated by writing **macros**
de: Verarbeitungs- und Analyseschritte in ImageJ können durch das Schreiben von **Makros** automatisiert werden.
es: Los pasos de procesamiento y análisis en ImageJ se pueden automatizar escribiendo **macros**
pt_br: As etapas de processamento e análise no ImageJ podem ser automatizadas escrevendo **macros**

source: Straightforward macros can be produced without any programming using the **Macro Recorder**
de: Einfache Makros können ohne jegliche Programmierung mit dem **Makro-Recorder** erstellt werden.
es: Se pueden producir macros sencillas sin necesidad de programación utilizando **Macro Recorder**
pt_br: Macros simples podem ser produzidas sem qualquer programação usando o **Gravador de Macro**

source: Recorded macros can be modified to make them more robust & suitable for a wider range of images
de: Aufgezeichnete Makros können geändert werden, um sie robuster und für eine größere Auswahl an Bildern geeignet zu machen
es: Las macros grabadas se pueden modificar para hacerlas más robustas y adecuadas para una gama más amplia de imágenes.
pt_br: As macros gravadas podem ser modificadas para torná-las mais robustas e adequadas para uma gama mais ampla de imagens

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: It's one thing to figure out steps that enable you to analyze an image, it's quite another to implement these steps for several -- and perhaps many -- different images. Without automation, the analysis might never happen; all the mouse-moving and clicking would just be too time-consuming, error-prone or boring, and momentarily lapses in concentration could require starting over again.
de: Es ist eine Sache, Schritte zu finden, mit denen Sie ein Bild analysieren können. Eine ganz andere ist es, diese Schritte für mehrere – und vielleicht viele – verschiedene Bilder umzusetzen. Ohne Automatisierung wäre die Analyse möglicherweise nie möglich; Das ganze Bewegen und Klicken mit der Maus wäre einfach zu zeitaufwändig, fehleranfällig oder langweilig, und kurzzeitige Konzentrationsschwächen könnten einen Neuanfang erforderlich machen.
es: Una cosa es descubrir los pasos que le permitan analizar una imagen y otra muy distinta es implementar estos pasos para varias (y quizás muchas) imágenes diferentes. Sin la automatización, es posible que el análisis nunca se realice; todos los movimientos y clics del mouse consumirían demasiado tiempo, serían propensos a errores o aburridos, y las fallas momentáneas en la concentración podrían requerir comenzar de nuevo.
pt_br: Uma coisa é descobrir etapas que permitem analisar uma imagem, outra é implementar essas etapas para várias - e talvez muitas - imagens diferentes. Sem automação, a análise talvez nunca aconteça; todos os movimentos e cliques do mouse seriam muito demorados, propensos a erros ou enfadonhos, e lapsos momentâneos de concentração poderiam exigir começar tudo de novo.

source: Even a brief effort to understand how to automate analysis can produce vast, long-lasting improvements in personal productivity and sanity by reducing the time spent on mind-numbingly repetitive tasks. In some straightforward cases (e.g. converting file formats, applying projections or filters, or making measurements across entire images), this can already be done in ImageJ using the commands in the {menuselection}`Process --> Batch -->` submenu and no programming whatsoever. But it's also very worthwhile to get some experience in producing macros, scripts or plugins, after which you can add your own new commands to the menus and carry out customized algorithms with a single click of a button or press of a key.
de: Selbst ein kurzer Versuch, zu verstehen, wie Analysen automatisiert werden können, kann zu enormen, dauerhaften Verbesserungen der persönlichen Produktivität und geistigen Gesundheit führen, indem der Zeitaufwand für nervenaufreibende, sich wiederholende Aufgaben reduziert wird. In einigen einfachen Fällen (z. B. Konvertieren von Dateiformaten, Anwenden von Projektionen oder Filtern oder Durchführen von Messungen über ganze Bilder) kann dies bereits in ImageJ mithilfe der Befehle im {menuselection}`Prozess erfolgen --> Batch -->` Untermenü und keinerlei Programmierung. Es lohnt sich aber auch, etwas Erfahrung in der Erstellung von Makros, Skripten oder Plugins zu sammeln, um dann eigene neue Befehle in die Menüs einzufügen und individuelle Algorithmen per Knopfdruck oder Tastendruck auszuführen.
es: Incluso un breve esfuerzo por comprender cómo automatizar el análisis puede producir mejoras vastas y duraderas en la productividad y la cordura personal al reducir el tiempo dedicado a tareas abrumadoramente repetitivas. En algunos casos sencillos (por ejemplo, convertir formatos de archivo, aplicar proyecciones o filtros, o realizar mediciones en imágenes completas), esto ya se puede hacer en ImageJ usando los comandos en el {menuselection}`Process --> Lote -->` submenú y sin programación alguna. Pero también vale la pena adquirir algo de experiencia en la producción de macros, scripts o complementos, después de lo cual podrás agregar tus propios comandos nuevos a los menús y ejecutar algoritmos personalizados con un solo clic de un botón o presionar una tecla.
pt_br: Mesmo um breve esforço para compreender como automatizar a análise pode produzir melhorias vastas e duradouras na produtividade e na sanidade pessoal, reduzindo o tempo gasto em tarefas repetitivas e entorpecentes. Em alguns casos simples (por exemplo, converter formatos de arquivo, aplicar projeções ou filtros ou fazer medições em imagens inteiras), isso já pode ser feito no ImageJ usando os comandos no {menuselection}`Process --> Lote -->` submenu e nenhuma programação. Mas também vale muito a pena adquirir alguma experiência na produção de macros, scripts ou plugins, após os quais você pode adicionar seus próprios novos comandos aos menus e realizar algoritmos personalizados com um único clique de um botão ou pressionar uma tecla.

source: What's a macro?
de: Was ist ein Makro?
es: ¿Qué es una macro?
pt_br: O que é uma macro?

source: Macros are basically sequences of commands, written in some programming language (here ImageJ's own macro language), which can be run automatically to make processing faster and easier.
de: Makros sind im Grunde Befehlsfolgen, die in einer Programmiersprache (hier ImageJs eigener Makrosprache) geschrieben sind und automatisch ausgeführt werden können, um die Verarbeitung schneller und einfacher zu machen.
es: Las macros son básicamente secuencias de comandos, escritas en algún lenguaje de programación (en este caso, el propio lenguaje de macros de ImageJ), que se pueden ejecutar automáticamente para hacer que el procesamiento sea más rápido y sencillo.
pt_br: Macros são basicamente sequências de comandos, escritos em alguma linguagem de programação (aqui a linguagem de macro do próprio ImageJ), que podem ser executados automaticamente para tornar o processamento mais rápido e fácil.

source: The following sections are far from an extensive introduction to macro-writing, but rather aim to introduce the main ideas quickly using two worked examples. Should you wish to delve deeper into the subject, there's an [introduction to the language on the ImageJ website](https://imagej.net/developer/macro/macros.html) [^fn_1], and a [very helpful tutorial on the ImageJ wiki](https://imagej.net/Introduction_into_Macro_Programming) [^fn_2], while the list of [built-in macro functions](https://imagej.net/developer/macro/functions.html) is an indispensable reference [^fn_3].
de: Die folgenden Abschnitte sind alles andere als eine ausführliche Einführung in das Makro-Schreiben, sondern zielen eher darauf ab, die wichtigsten Ideen anhand von zwei Beispielen schnell vorzustellen. Wenn Sie tiefer in das Thema eintauchen möchten, gibt es eine [Einführung in die Sprache auf der ImageJ-Website](https://imagej.net/developer/macro/macros.html) [^fn_1] und ein [sehr hilfreiches Tutorial im ImageJ-Wiki](https://imagej.net/Introduction_into_Macro_Programming) [^fn_2], während die Liste der [integrierten Makrofunktionen](https://imagej.net/developer/macro/functions.html) ist eine unverzichtbare Referenz [^fn_3].
es: Las siguientes secciones están lejos de ser una introducción extensa a la macroescritura, sino que pretenden presentar las ideas principales rápidamente utilizando dos ejemplos resueltos. Si desea profundizar en el tema, hay una [introducción al lenguaje en el sitio web de ImageJ](https://imagej.net/developer/macro/macros.html) [^fn_1] y un [tutorial muy útil en la wiki de ImageJ](https://imagej.net/Introduction_into_Macro_Programming) [^fn_2], mientras que la lista de [funciones macro integradas](https://imagej.net/developer/macro/functions.html) es una referencia indispensable [^fn_3].
pt_br: As seções a seguir estão longe de ser uma introdução extensa à escrita macro, mas têm como objetivo apresentar rapidamente as ideias principais usando dois exemplos trabalhados. Caso você queira se aprofundar no assunto, há uma [introdução à linguagem no site do ImageJ](https://imagej.net/developer/macro/macros.html) [^fn_1] e um [tutorial muito útil no wiki do ImageJ](https://imagej.net/Introduction_into_Macro_Programming) [^fn_2], enquanto a lista de [funções macro integradas](https://imagej.net/developer/macro/functions.html) é uma referência indispensável [^fn_3].

source: Use Fiji's 'Script editor'
de: Verwenden Sie den „Skripteditor“ von Fiji
es: Utilice el 'editor de scripts' de Fiji
pt_br: Use o 'editor de script' de Fiji

source: Although it's possible to use ImageJ rather than Fiji to create macros, Fiji's script editor makes the process *much* easier by coloring text according to what it does. I will assume that you are using this.
de: Obwohl es möglich ist, ImageJ anstelle von Fiji zum Erstellen von Makros zu verwenden, macht der Skripteditor von Fiji den Vorgang *viel* einfacher, indem er den Text entsprechend seiner Funktion einfärbt. Ich gehe davon aus, dass Sie dies verwenden.
es: Aunque es posible utilizar ImageJ en lugar de Fiji para crear macros, el editor de scripts de Fiji hace que el proceso sea *mucho* más fácil al colorear el texto según lo que hace. Asumiré que estás usando esto.
pt_br: Embora seja possível usar ImageJ em vez de Fiji para criar macros, o editor de script de Fiji torna o processo *muito* mais fácil, colorindo o texto de acordo com o que ele faz. Presumo que você esteja usando isso.

source: From macros to scripts
de: Von Makros bis hin zu Skripten
es: De macros a scripts
pt_br: De macros a scripts

source: Once confident with macros, the next step would be to enter the world of scripts and plugins. These can be somewhat more difficult to learn, but reward the effort with the ability to do more complicated things. Links to help with this are available at https://imagej.net/Scripting.
de: Sobald Sie mit Makros vertraut sind, besteht der nächste Schritt darin, in die Welt der Skripte und Plugins einzusteigen. Diese können etwas schwieriger zu erlernen sein, belohnen die Mühe jedoch mit der Fähigkeit, kompliziertere Dinge zu erledigen. Links, die dabei helfen, finden Sie unter https://imagej.net/Scripting.
es: Una vez que se sienta seguro con las macros, el siguiente paso sería ingresar al mundo de los scripts y complementos. Estos pueden ser algo más difíciles de aprender, pero recompensan el esfuerzo con la capacidad de hacer cosas más complicadas. Los enlaces para ayudar con esto están disponibles en https://imagej.net/Scripting.
pt_br: Uma vez confiante com as macros, o próximo passo seria entrar no mundo dos scripts e plugins. Podem ser um pouco mais difíceis de aprender, mas recompensam o esforço com a capacidade de fazer coisas mais complicadas. Links para ajudar com isso estão disponíveis em https://imagej.net/Scripting.
