Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/macros/macro_dog.po
Languages: es, pt_br

source: Difference of Gaussians
es: Diferencia de Gaussianos
pt_br: Diferença de Gaussianos

source: Introduction
es: Introducción
pt_br: Introdução

source: [Difference of Gaussians (DoG) filtering](sec_filters_dog) is a very useful technique for enhancing the appearance of small spots and edges in an image. It's quite straightforward, but time consuming to apply manually very often -- and you might need to experiment with different filter sizes to get good results. This makes it an excellent candidate for a macro.
es: El [filtrado de diferencia de Gaussianos (DoG)] (sec_filters_dog) es una técnica muy útil para mejorar la apariencia de pequeños puntos y bordes en una imagen. Es bastante sencillo, pero aplicarlo manualmente con mucha frecuencia lleva mucho tiempo y es posible que tengas que experimentar con diferentes tamaños de filtro para obtener buenos resultados. Esto lo convierte en un excelente candidato para una macro.
pt_br: [Filtragem por diferença de gaussianas (DoG)](sec_filters_dog) é uma técnica muito útil para melhorar a aparência de pequenos pontos e bordas em uma imagem. É bastante simples, mas demorado para aplicar manualmente com muita frequência - e pode ser necessário experimentar diferentes tamanhos de filtro para obter bons resultados. Isso o torna um excelente candidato para uma macro.

source: Recording a macro
es: Grabar una macro
pt_br: Gravando uma macro

source: Example input image
es: Ejemplo de imagen de entrada (input)
pt_br: Exemplo de imagem de entrada

source: Result of DoG filter
es: Resultado del filtro DoG
pt_br: Resultado do filtro DoG

source: Rather than diving into writing the code, the fastest way to get started is to have ImageJ do most of the hard work itself. Then you only need to fix up the result. The procedure is as follows:
es: En lugar de sumergirse en la escritura del código, la forma más rápida de comenzar es dejar que ImageJ haga la mayor parte del trabajo duro por sí mismo. Entonces solo necesitas arreglar el resultado. El procedimiento es el siguiente:
pt_br: Em vez de mergulhar na escrita do código, a maneira mais rápida de começar é fazer com que o ImageJ faça a maior parte do trabalho pesado sozinho. Então você só precisa corrigir o resultado. O procedimento é o seguinte:

source: Open up an example (2D, non-color) image to use, ideally one including small spot-like or otherwise round objects. I have used {menuselection}`File --> Open samples --> HeLa Cells`, after extracting the red channel only.
es: Abre una imagen de ejemplo (2D, sin color) para usar, idealmente una que incluya objetos pequeños con forma de puntos o redondos. He usado {menuselection}`File --> Open samples --> HeLa Cells`, después de extraer solo el canal rojo.
pt_br: Abra um exemplo de imagem (2D, não colorida) para usar, de preferência uma que inclua pequenos objetos semelhantes a pontos ou redondos. Eu usei {menuselection}`File --> Open samples --> HeLa Cells`, depois de extrair apenas o canal vermelho.

source: Start the _Macro Recorder_ by choosing {menuselection}`Plugins --> Macros --> Record`. Make sure that {guilabel}`Record: Macro` appears at the top of this window (see the drop-down list). Every subsequent click you make that has a corresponding macro command will result in the command being added to the window.
es: Inicia _Macro Recorder_ eligiendo {menuselection}`Plugins --> Macros --> Record`. Asegúrate de que {guilabel}`Record: Macro` aparezca en la parte superior de esta ventana (consulta la lista desplegable). De aquí en adelante, cada click que hagas que tenga un comando de macro correspondiente dará como resultado que el comando se agregue a la ventana.
pt_br: Inicie o _Macro Recorder_ escolhendo {menuselection}`Plugins --> Macros --> Record`. Certifique-se de que {guilabel}`Record: Macro` apareça no topo desta janela (veja a lista suspensa). Cada clique subsequente que você fizer com um comando de macro correspondente resultará na adição do comando à janela.

source: Convert your image to 32-bit. This will reduce inaccuracies due to rounding whenever the filtering is applied.
es: Convierte tu imagen a 32 bits. Esto reducirá las imprecisiones debidas al redondeo cada vez que se aplica el filtrado.
pt_br: Converta sua imagem para 32 bits. Isso reduzirá imprecisões devido a arredondamentos sempre que a filtragem for aplicada.

source: Duplicate the image.
es: Duplica la imagen.
pt_br: Duplique a imagem.

source: Apply {menuselection}`Process --> Filters --> Gaussian Blur...` to one of the images (it doesn't matter if it's the original or the duplicate), using a small sigma (e.g. 1) for noise suppression.
es: Aplica {menuselection}`Process --> Filters --> Gaussian Blur...` a una de las imágenes (no importa si es la original o la duplicada), usando una sigma pequeña (por ejemplo, 1) para la supresión de ruido.
pt_br: Aplique {menuselection}`Process --> Filters --> Gaussian Blur...` a uma das imagens (não importa se é original ou duplicada), usando um pequeno sigma (por exemplo, 1) para supressão de ruído.

source: Apply {menuselection}`Process --> Filters --> Gaussian Blur...` to the other image, using a larger sigma (e.g. 2).
es: Aplica {menuselection}`Process --> Filters --> Gaussian Blur...` a la otra imagen, usando una sigma más grande (por ejemplo, 2).
pt_br: Aplique {menuselection}`Process --> Filters --> Gaussian Blur...` à outra imagem, usando um sigma maior (por exemplo, 2).

source: Run {menuselection}`Process --> Image Calculator...` and subtract the second filtered image from the first. This produces the 'difference of Gaussians' filtered image, in which small features should appear prominently and the background is removed.
es: Ejecuta {menuselection}`Process --> Image Calculator...` y resta la segunda imagen filtrada de la primera. Esto produce la "diferencia de la imagen filtrada de los Gaussianos", en la que las pequeñas características deben aparecer de manera destacada y el fondo se elimina.
pt_br: Execute {menuselection}`Process --> Image Calculator...` e subtraia a segunda imagem filtrada da primeira. Isso produz a imagem filtrada da 'diferença de gaussianas', na qual pequenas características devem aparecer com destaque e o fundo é removido.

source: Be careful to choose the correct image titles and subtraction operation in the *Image Calculator*!
es: ¡Ten cuidado de elegir los títulos de imagen correctos y la operación de resta en la *Calculadora de imágenes*!
pt_br: Tenha cuidado ao escolher os títulos de imagem corretos e a operação de subtração na *Calculadora de Imagens*!

source: Press the {guilabel}`Create` button on the macro recorder. This should cause a text file containing the recorded macro to be opened in Fiji's {menuselection}`Script Editor` (which you can find under {menuselection}`File --> New --> Script...`).
es: Presiona el botón {guilabel}`Create` en la grabadora de macros. Esto debería hacer que se abra un archivo de texto que contiene la macro grabada en el {menuselection}`Script Editor` de Fiji (que puedes encontrar en <span class='notranslate'>{menuselection}</span). >`File --> New --> Script...`).
pt_br: Pressione o botão {guilabel}`Criar` no gravador de macro. Isso deve fazer com que um arquivo de texto contendo a macro gravada seja aberto no {menuselection}`Editor de Script` de Fiji (que você pode encontrar em {menuselection}`Arquivo --> Novo --> Script...`).

source: Save the text file. The file name should end with the extension `.ijm` (for 'ImageJ Macro'), and include an underscore character somewhere within it.
es: Guarda el archivo de texto. El nombre del archivo debe terminar con la extensión `.ijm` (para 'ImageJ Macro') e incluir un carácter de guion bajo "_" en algún lugar dentro de él.
pt_br: Salve o arquivo de texto. O nome do arquivo deve terminar com a extensão `.ijm` (para 'ImageJ Macro') e incluir um caractere de sublinhado em algum lugar dentro dele.

source: **Now you have a macro!**
es: **¡Ahora tienes una macro!**
pt_br: **Agora você tem uma macro!**

source: You *could* try it out by pressing the tempting {guilabel}`Run` button, but this isn't guaranteed to work (yet). Our macro remains quite brittle: it depends upon exact image names and might become easily confused. We will fix this soon.
es: *Podrías* probarlo presionando el tentador botón {guilabel}`Run`, pero no se garantiza que funcione (todavía). Nuestra macro sigue siendo bastante frágil: depende de los nombres exactos de las imágenes y puede confundirse fácilmente. Arreglaremos esto pronto.
pt_br: Você *poderia* experimentar pressionando o tentador botão {guilabel}`Executar`, mas não é garantido que isso funcione (ainda). Nossa macro permanece bastante frágil: depende dos nomes exatos das imagens e pode ser facilmente confundida. Vamos consertar isso em breve.

source: As an alternative,
es: Como alternativa,
pt_br: Como uma alternativa,

source: Close Fiji completely (to ensure nothing remains from this session)
es: Cerrar Fiji por completo (para garantizar que no quede nada de esta sesión)
pt_br: Feche Fiji completamente (para garantir que nada resta desta sessão)

source: Reopen Fiji
es: Reabrir Fiji
pt_br: Reabrir Fiji

source: Open the original image you used
es: Abre la imagen original que usaste.
pt_br: Abra a imagem original que você usou

source: Open the macro (you can just drag it onto the ImageJ toolbar)
es: Abre la macro (puedes simplemente arrastrarla a la barra de herramientas de ImageJ)
pt_br: Abra a macro (basta arrastá-la para a barra de ferramentas do ImageJ)

source: Now the {guilabel}`Run` button will hopefully give you the same result as when you applied the commands manually. If not, keep reading anyway and the following steps should fix it.
es: Ahora, con suerte, el botón {guilabel}`Run` te dará el mismo resultado que cuando aplicaste los comandos manualmente. Si no es así, sigue leyendo de todos modos y los siguientes pasos deberían solucionarlo.
pt_br: Agora, o botão {guilabel}`Executar` irá fornecer o mesmo resultado de quando você aplicou os comandos manualmente. Caso contrário, continue lendo mesmo assim e as etapas a seguir deverão resolver o problema.

source: Cleaning up the code
es: Limpiando el código
pt_br: Limpando o código

source: Now reopen your macro in the *Script Editor*. It should look something like mine:
es: Ahora vuelve a abrir tu macro en el *Editor de secuencias de comandos*. Debería parecerse al mío:
pt_br: Agora reabra sua macro no *Editor de Script*. Deve ser algo parecido com o meu:

source: For easier copy-and-paste, the content is below:
es: Para copiar y pegar más fácilmente, el contenido se encuentra a continuación:
pt_br: Para facilitar copiar e colar, o conteúdo está abaixo:

source: Your code is probably not identical, and may well be better. One problem with automatically generated macros is that they contain (almost) _everything_ -- often including a lot of errant clicking, or other non-essential steps. For example, I changed the contrast of an image, but this was only to look at it -- and it does not need to be included in the macro.
es: Probablemente tu código no sea idéntico y puede que sea mejor. Un problema con las macros generadas automáticamente es que contienen (casi) _todo_, incluyendo a menudo muchos clics errantes u otros pasos no esenciales. Por ejemplo, cambié el contraste de una imagen, pero esto fue sólo para mirarla y no es necesario incluirlo en la macro.
pt_br: Seu código provavelmente não é idêntico e pode ser melhor. Um problema com macros geradas automaticamente é que elas contêm (quase) _tudo_ - muitas vezes incluindo muitos cliques errados ou outras etapas não essenciais. Por exemplo, mudei o contraste de uma imagem, mas foi apenas para olhar - e não precisa ser incluído na macro.

source: After deleting the unnecessary lines, I get:
es: Después de eliminar las líneas innecesarias, obtengo:
pt_br: Depois de excluir as linhas desnecessárias, recebo:

source: Understanding the code
es: Entendiendo el código
pt_br: Entendendo o código

source: You can most likely work out what the macro is doing, if not necessarily the terminology, just by looking at it. Taking the first line, `run` is a **function_ that tells ImageJ to execute a command, while `32-bit` is a piece of text (called a **string**) that tells it which command. Functions always tell ImageJ to do something or give you information, and can be recognized because they are normally followed by parentheses. Strings are recognizable both because they are inside double inverted commas and the script editor shows them in a different color. Notice also that each line needs to end with a semicolon so that the macro interpreter knows the line is over.
es: Lo más probable es que puedas descubrir qué está haciendo la macro, si no necesariamente la terminología, con sólo mirarla. Tomando la primera línea, `Run` es una **función_ que le dice a ImageJ que ejecute un comando, mientras que `32 bits` es un fragmento de texto (llamado **cadena**) que le dice qué comando. Las funciones siempre le dicen a ImageJ que haga algo o le brindan información, y pueden reconocerse porque normalmente van seguidas de paréntesis. Las cadenas son reconocibles porque están dentro de comillas dobles y el editor de scripts las muestra en un color diferente. Observa también que cada línea debe terminar con un punto y coma para que el intérprete de macros sepa que la línea ha terminado.
pt_br: Provavelmente você poderá descobrir o que a macro está fazendo, se não necessariamente a terminologia, apenas olhando para ela. Tomando a primeira linha, `run` é uma **função_ que diz ao ImageJ para executar um comando, enquanto `32 bits` é um pedaço de texto (chamado de **string**) que informa qual comando. As funções sempre dizem ao ImageJ para fazer algo ou fornecer informações e podem ser reconhecidas porque normalmente são seguidas por parênteses. As strings são reconhecíveis porque estão entre aspas duplas e o editor de script as mostra em uma cor diferente. Observe também que cada linha precisa terminar com ponto e vírgula para que o interpretador da macro saiba que a linha acabou.

source: Functions can require different numbers of pieces of information to do their work. At a minimum, `run` needs to know the name of the command and the image to which it should be applied -- which here is taken to be whichever image is currently active, i.e. the one that was selected most recently. But if the command being used by `run` requires extra information of its own, then this is included as an extra string. Therefore
es: Las funciones pueden requerir diferentes cantidades de información para realizar su trabajo. Como mínimo, "Run" necesita saber el nombre del comando y la imagen a la que se debe aplicar, que aquí se considera la imagen que esté actualmente activa, es decir, la que se seleccionó más recientemente. Pero si el comando utilizado por "Run" requiere información adicional propia, entonces se incluye como una cadena adicional. Por lo tanto
pt_br: As funções podem exigir diferentes números de informações para realizar seu trabalho. No mínimo, `run` precisa saber o nome do comando e a imagem à qual ele deve ser aplicado - que aqui é considerada qualquer imagem que esteja atualmente ativa, ou seja, aquela que foi selecionada mais recentemente. Mas se o comando usado por `run` exigir informações extras próprias, então isso será incluído como uma string extra. Portanto

source: informs the {menuselection}`Duplicate` command that the image it creates should be called *C1-hela-cells-1.tif*, and
es: informa al comando {menuselection}`Duplicate` que la imagen que crea debe llamarse *C1-hela-cells-1.tif*, y
pt_br: informa ao comando {menuselection}`Duplicate` que a imagem que ele cria deve se chamar *C1-hela-cells-1.tif*, e

source: ensures that {menuselection}`Process --> Filters --> Gaussian Blur...` is executed with a sigma value of 1.
es: garantiza que {menuselection}`Process --> Filters --> Gaussian Blur...` se ejecute con un valor sigma de 1.
pt_br: garante que {menuselection}`Process --> Filters --> Gaussian Blur...` seja executado com um valor sigma de 1.

source: `selectWindow` is another function, added to the macro whenever you click on a particular window to activate it, and which requires the name of the image window to make active. From this you can see that my example file name was *C1-hela-cells.tif*. Without this line, the duplicated image would be filtered twice -- and the original not at all.
es: `selectWindow` es otra función, agregada a la macro cada vez que haces click en una ventana en particular para activarla, y que requiere el nombre de la ventana de imagen para activarse. A partir de esto puedes ver que el nombre de mi archivo de ejemplo era *C1-hela-cells.tif*. Sin esta línea, la imagen duplicada se filtraría dos veces, y la original no se filtraría en absoluto.
pt_br: `selectWindow` é outra função, adicionada à macro sempre que você clica em uma janela específica para ativá-la, e que requer o nome da janela da imagem para torná-la ativa. A partir disso você pode ver que meu nome de arquivo de exemplo era *C1-hela-cells.tif*. Sem esta linha, a imagem duplicada seria filtrada duas vezes – e a original não seria filtrada.

source: Finally, the {menuselection}`Image Calculator` command is special enough to get its own function in the macro language, `imageCalculator`. The first string it is given tells it both what sort of calculation to do, and that it should `create` a new image for the result -- rather than replacing one of the existing images. The next two strings give it the titles of the images needed for the calculation.
es: Finalmente, el comando {menuselection}`Image Calculator` es lo suficientemente especial como para obtener su propia función en el lenguaje de macros, `imageCalculator`. La primera cadena que se le proporciona le indica qué tipo de cálculo hacer y que debe "crear" una nueva imagen para el resultado, en lugar de reemplazar una de las imágenes existentes. Las siguientes dos cadenas le dan los títulos de las imágenes necesarias para el cálculo.
pt_br: Finalmente, o comando {menuselection}`Image Calculator` é especial o suficiente para obter sua própria função na linguagem macro, `imageCalculator`. A primeira string fornecida informa que tipo de cálculo deve ser feito e que ele deve `criar` uma nova imagem para o resultado - em vez de substituir uma das imagens existentes. As próximas duas strings fornecem os títulos das imagens necessárias para o cálculo.

source: Removing title dependancies
es: Eliminar dependencias de títulos
pt_br: Removendo dependências de título

source: The fact that the original image title appears in the above macro is a problem: if you try to run it on another image, you are likely to find that it does not work because `selectWindow` cannot find what it's looking for. So the next step is to remove this title dependency so that the macro can be applied to any (2D) image.
es: El hecho de que el título de la imagen original aparezca en la macro anterior es un problema: si intentas ejecutarlo en otra imagen, es probable que descubras que no funciona porque `selectWindow` no puede encontrar lo que busca. Entonces, el siguiente paso es eliminar esta dependencia del título para que la macro pueda aplicarse a cualquier imagen (2D).
pt_br: O fato do título da imagem original aparecer na macro acima é um problema: se você tentar executá-lo em outra imagem, provavelmente descobrirá que não funciona porque `selectWindow` não consegue encontrar o que está procurando. Portanto, o próximo passo é remover essa dependência de título para que a macro possa ser aplicada a qualquer imagem (2D).

source: There are two ways to go about this. One is to insert a line that tells the macro the title of the image being processed at the start, e.g.
es: Hay dos maneras de hacer esto. Una es insertar una línea que le diga a la macro el título de la imagen que se está procesando al inicio, por ejemplo.
pt_br: Existem duas maneiras de fazer isso. Uma é inserir uma linha que informe à macro o título da imagem que está sendo processada no início, por exemplo.

source: where `getTitle()` is an example of a function that asks for information. The result is then stored as a **variable**, so that any time we type `titleOrig` later this will be replaced by the string corresponding to the original title [^fn_6]. Then we just find anywhere the title appears and replace the text with our new variable name, i.e. in this case by writing
es: donde `getTitle()` es un ejemplo de una función que solicita información. Luego, el resultado se almacena como una **variable**, de modo que cada vez que escribamos `titleOrig` más adelante, será reemplazado por la cadena correspondiente al título original [^fn_6]. Luego simplemente buscamos cualquier lugar donde aparezca el título y reemplazamos el texto con nuestro nuevo nombre de variable, es decir, en este caso escribiendo
pt_br: onde `getTitle()` é um exemplo de função que solicita informações. O resultado é então armazenado como uma **variável**, de modo que sempre que digitarmos `titleOrig` posteriormente, ela será substituída pela string correspondente ao título original [^fn_6]. Em seguida, basta encontrar qualquer lugar onde o título apareça e substituir o texto pelo nosso novo nome de variável, ou seja, neste caso, escrevendo

source: If we do this, the window we want will _probably_ be activated as required. However, there is a subtle potential problem. It's possible that we have two images open at the same time with identical titles -- in which case it's not clear which window should be selected, and so the results could be unpredictable. A safer approach is to get a reference to the **image ID** rather than its title. The ID is a number that should be unique for each image, which is useful for ImageJ internally but which we do not normally care about unless we are programming. Using IDs, the updated macro code then becomes:
es: Si hacemos esto, la ventana que queremos _probablemente_ se activará según sea necesario. Sin embargo, potencialmente existe un sutil problema. Es posible que tengamos dos imágenes abiertas al mismo tiempo con títulos idénticos, en cuyo caso no está claro qué ventana se debe seleccionar y, por lo tanto, los resultados podrían ser impredecibles. Un enfoque más seguro es obtener una referencia al **ID de la imagen** en lugar de su título. El ID es un número que debe ser único para cada imagen, lo cual es útil para ImageJ internamente pero que normalmente no nos importa a menos que estemos programando. Usando ID, el código de macro actualizado se convierte en:
pt_br: Se fizermos isso, a janela que desejamos _provavelmente_ será ativada conforme necessário. No entanto, existe um problema potencial sutil. É possível que tenhamos duas imagens abertas ao mesmo tempo com títulos idênticos - nesse caso não está claro qual janela deve ser selecionada e, portanto, os resultados podem ser imprevisíveis. Uma abordagem mais segura é obter uma referência ao **ID da imagem** em vez de seu título. O ID é um número que deve ser único para cada imagem, o que é útil internamente para o ImageJ, mas com o qual normalmente não nos importamos, a menos que estejamos programando. Usando IDs, o código de macro atualizado se torna:
