Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/macros/macro_dog.po
Languages: es, pt_br

source: We had to change `selectWindow` to `selectImage` for the IDs to work. I also changed the title of the duplicated image to something more meaninglessly general -- which required square brackets, because it includes spaces that would otherwise mess things up [^fn_7]. Also, because the duplicated image will be active immediately after it was created, I ask ImageJ for its ID at that point. This lets me then pass the two IDs (rather than titles) to the `imageCalculator` command when necessary.
es: Tuvimos que cambiar `selectWindow` a `selectImage` para que las ID funcionaran. También cambié el título de la imagen duplicada a algo más general y sin sentido, que requería corchetes, porque incluye espacios que de otra manera estropearían las cosas [^fn_7]. Además, debido a que la imagen duplicada estará activa inmediatamente después de su creación, le solicito a ImageJ su ID en ese momento. Esto me permite pasar las dos ID (en lugar de títulos) al comando `imageCalculator` cuando sea necesario.
pt_br: Tivemos que mudar `selectWindow` para `selectImage` para que os IDs funcionassem. Também mudei o título da imagem duplicada para algo mais geral e sem sentido - o que exigia colchetes, porque inclui espaços que de outra forma bagunçariam as coisas [^fn_7]. Além disso, como a imagem duplicada estará ativa imediatamente após ser criada, peço ao ImageJ seu ID nesse ponto. Isso me permite passar os dois IDs (em vez dos títulos) para o comando `imageCalculator` quando necessário.

source: Adding comments
es: Agregar comentarios
pt_br: Adicionando comentários

source: Whenever macros become more complicated, it can be hard to remember exactly what all the parts do and why. It's then a _very_ good idea to add in some extra notes and explanations. This is done by prefixing a line with `//`, after which we can write whatever we like because the macro interpreter will ignore it. These extra notes are called **comments**, and I will add them from now on.
es: Cada vez que las macros se vuelven más complicadas, puede resultar difícil recordar exactamente qué hacen todas las partes y por qué. Entonces es una muy buena idea agregar algunas notas y explicaciones adicionales. Esto se hace anteponiendo una línea con `//`, después de lo cual podemos escribir lo que queramos porque el intérprete de macros lo ignorará. Estas notas adicionales se llaman **comentarios** y las agregaré de ahora en adelante.
pt_br: Sempre que as macros se tornam mais complicadas, pode ser difícil lembrar exatamente o que todas as partes fazem e por quê. É então uma ideia _muito_ boa adicionar algumas notas e explicações extras. Isso é feito prefixando uma linha com `//`, após o qual podemos escrever o que quisermos porque o interpretador de macro irá ignorá-lo. Essas notas extras são chamadas de **comentários** e irei adicioná-las a partir de agora.

source: Customizing sigma values
es: Personalización de valores sigma
pt_br: Personalizando valores sigma

source: By changing the size of the Gaussian filters, the macro can be tailored to detecting structures of different sizes. It would be relatively easy to find the `Gaussian Blur` lines and change the sigma values accordingly here, but adjusting settings like this in longer, more complex macros can be awkward. In such cases, it's helpful to extract the settings you might wish to change and include them at the start of the macro.
es: Al cambiar el tamaño de los filtros Gaussianos, la macro se puede adaptar para detectar estructuras de diferentes tamaños. Sería relativamente fácil encontrar las líneas de "Desenfoque Gaussiano" y cambiar los valores sigma en consecuencia aquí, pero ajustar configuraciones como esta en macros más largas y complejas puede resultar raro. En tales casos, es útil extraer las configuraciones que desees cambiar e incluirlas al inicio de la macro.
pt_br: Ao alterar o tamanho dos filtros gaussianos, a macro pode ser adaptada para detectar estruturas de diferentes tamanhos. Seria relativamente fácil encontrar as linhas do `Gaussian Blur` e alterar os valores sigma adequadamente aqui, mas ajustar configurações como essa em macros mais longas e complexas pode ser complicado. Nesses casos, é útil extrair as configurações que você deseja alterar e incluí-las no início da macro.

source: To do this here, insert the following lines at the very beginning:
es: Para hacer esto aquí, inserta las siguientes líneas al principio:
pt_br: Para fazer isso aqui, insira as seguintes linhas logo no início:

source: Then, update the later commands to:
es: Luego, actualiza los comandos posteriores a:
pt_br: Em seguida, atualize os comandos posteriores para:

source: This creates two new variables, which represent the sigma values to use. Now any time you want to change `sigma1` or `sigma2` you do not need to hunt through the macro for the correct lines: you can just update the lines at the top [^fn_8].
es: Esto crea dos nuevas variables, que representan los valores sigma a utilizar. Ahora, cada vez que desees cambiar `sigma1` o `sigma2`, no necesitas buscar en la macro las líneas correctas: simplemente puedes actualizar las líneas en la parte superior [^fn_8].
pt_br: Isso cria duas novas variáveis, que representam os valores sigma a serem usados. Agora, sempre que você quiser alterar `sigma1` ou `sigma2` você não precisa procurar as linhas corretas na macro: você pode apenas atualizar as linhas no topo [^fn_8].

source: Adding interactivity
es: Agregando interactividad
pt_br: Adicionando interatividade

source: Usually I would stop at this point. Still, you might wish to share your macro with someone lacking your macro modification skills, in which case it would be useful to give this person a dialog box into which they could type the Gaussian sigma values that they wanted. An easy way to do this is to remove the sigma value information from the `run` command lines, giving
es: Normalmente me detendría en este punto. Aún así, es posible que desees compartir tu macro con alguien que no tenga tus habilidades de modificación de macros, en cuyo caso sería útil darle a esta persona un cuadro de diálogo en el que pueda escribir los valores sigma gaussianos que desee. Una manera fácil de hacer esto es eliminar la información del valor sigma de las líneas de comando "ejecutar", dando
pt_br: Normalmente eu pararia neste ponto. Ainda assim, você pode querer compartilhar sua macro com alguém que não tenha suas habilidades de modificação de macro; nesse caso, seria útil fornecer a essa pessoa uma caixa de diálogo na qual ela pudesse digitar os valores sigma gaussianos desejados. Uma maneira fácil de fazer isso é remover as informações do valor sigma das linhas de comando `run`, fornecendo

source: Since {menuselection}`Process --> Filters --> Gaussian Blur` will not then know what size of filters to use, it will ask. The disadvantage of this is that the user is prompted to enter sigma values at two different times as the macro runs, which is slightly more annoying than necessary.
es: Dado que {menuselection}`Process --> Filters --> Gaussian Blur` no sabrá qué tamaño de filtros usar, preguntará. La desventaja de esto es que se solicita al usuario que ingrese valores sigma en dos momentos diferentes mientras se ejecuta la macro, lo cual es un poco más molesto de lo necesario.
pt_br: Como {menuselection}`Process --> Filters --> Gaussian Blur` não saberá qual tamanho de filtros usar, ele perguntará. A desvantagem disso é que o usuário é solicitado a inserir valores sigma em dois momentos diferentes enquanto a macro é executada, o que é um pouco mais incômodo do que o necessário.

source: The alternative is to create a dialog box that asks for all the required settings in one go. To do this, update the beginning of your macro to include something like the following:
es: La alternativa es crear un cuadro de diálogo que solicite todas las configuraciones necesarias de una sola vez. Para hacer esto, actualiza el comienzo de tu macro para incluir algo como lo siguiente:
pt_br: A alternativa é criar uma caixa de diálogo que solicite todas as configurações necessárias de uma só vez. Para fazer isso, atualize o início da sua macro para incluir algo como o seguinte:

source: The first line generates a dialog box with the title you specify. Each of the next two lines state that the required user input should be a number with the specified prompts and default values. The other lines simply show the dialog box and then read out whatever the user typed and puts it into variables. This is documented in ImageJ's [list of built-in macro functions](https://imagej.nih.gov/ij/developer/macro/functions.html).
es: La primera línea genera un cuadro de diálogo con el título que especifiques. Cada una de las dos líneas siguientes indica que la entrada requerida por el usuario debe ser un número con las indicaciones especificas y los valores predeterminados. Las otras líneas simplemente muestran el cuadro de diálogo y luego leen lo que el usuario escribió y lo colocan en variables. Esto está documentado en la [lista de funciones macro integradas] de ImageJ (https://imagej.nih.gov/ij/developer/macro/functions.html).
pt_br: A primeira linha gera uma caixa de diálogo com o título especificado. Cada uma das próximas duas linhas indica que a entrada necessária do usuário deve ser um número com os prompts e valores padrão especificados. As outras linhas simplesmente mostram a caixa de diálogo e depois leem tudo o que o usuário digitou e colocam em variáveis. Isso está documentado na [lista de funções macro integradas] do ImageJ (https://imagej.nih.gov/ij/developer/macro/functions.html).

source: You can download the complete example macro [here](https://gist.github.com/petebankhead/53c0651dd1ad4f455622fc8eeefdc21e).
es: Puedes descargar la macro de ejemplo completa [aquí](https://gist.github.com/petebankhead/53c0651dd1ad4f455622fc8eeefdc21e).
pt_br: Você pode baixar o exemplo de macro completo [aqui](https://gist.github.com/petebankhead/53c0651dd1ad4f455622fc8eeefdc21e).

source: Installing the macro
es: Instalación de la macro
pt_br: Instalando a macro

source: If you'd like the macro to appear as an entry in ImageJ's menus, you have a couple of options.
es: Si deseas que la macro aparezca como una entrada en los menús de ImageJ, tienes un par de opciones.
pt_br: Se quiser que a macro apareça como uma entrada nos menus do ImageJ, você tem algumas opções.

source: One is the tempting {menuselection}`Plugins --> Macros --> Install...`. This works, but whenever I tested it I found that it only retains the macro until ImageJ is restarted.
es: Uno es el tentador {menuselection}`Plugins --> Macros --> Install...`. Esto funciona, pero cada vez que lo probé descubrí que solo conserva la macro hasta que se reinicia ImageJ.
pt_br: Um deles é o tentador {menuselection}`Plugins --> Macros --> Install...`. Isso funciona, mas sempre que testei descobri que ele só retém a macro até que o ImageJ seja reiniciado.

source: More usefully, {menuselection}`Plugins --> Install...` will prompt you to first select the file containing your macro, and then to save it within the *Plugins* directory of ImageJ itself. As long as the macro file you choose has an underscore in its name, it should appear as its own entry towards the bottom of the {menuselection}`Plugins` menu -- and be retained even when ImageJ is relaunched.
es: Más útilmente, {menuselection}`Plugins --> Install...' te solicitará que primero selecciones el archivo que contiene tu macro y luego lo guardes en el directorio *Plugins* de ImageJ en sí. Siempre que el archivo de macro que elijas tenga un guión bajo en su nombre, debería aparecer como su propia entrada en la parte inferior del menú {menuselection}`Plugins`, y conservarse incluso cuando se reinicia ImageJ.
pt_br: Mais útil, {menuselection}`Plugins --> Install...` solicitará que você primeiro selecione o arquivo que contém sua macro e depois salve-o no diretório *Plugins* do O próprio ImageJ. Contanto que o arquivo de macro escolhido tenha um sublinhado em seu nome, ele deverá aparecer como sua própria entrada na parte inferior do menu {menuselection}`Plugins` -- e ser mantido mesmo quando ImageJ for reiniciado.

source: Suggested improvements
es: Mejoras sugeridas
pt_br: Melhorias sugeridas

source: You should now have a macro that does something vaguely useful, and which will work on most 2D images. It could nevertheless still be enhanced in many ways. For example,
es: Ahora deberías tener una macro que haga algo vagamente útil y que funcione en la mayoría de las imágenes 2D. Sin embargo, aún podría mejorarse de muchas maneras. Por ejemplo,
pt_br: Agora você deve ter uma macro que faça algo vagamente útil e que funcione na maioria das imagens 2D. No entanto, ainda poderia ser melhorado de várias maneiras. Por exemplo,

source: You could close any unwanted images (e.g. the original and its duplicate) by selecting their IDs, and then inserting `close();` commands afterwards.
es: Puedes cerrar cualquier imagen no deseada (por ejemplo, el original y su duplicado) seleccionando sus ID y luego insertando comandos `close();`.
pt_br: Você pode fechar qualquer imagem indesejada (por exemplo, a original e sua duplicata) selecionando seus IDs e, em seguida, inserindo os comandos `close();` posteriormente.

source: You could make the macro work on entire image stacks. If you want it to process each plane separately, this involves only inserting the words `stack` and `duplicate` in several places -- by recording a new macro in the same way, but using a stack as your example image, you can see where to do this. If you want the filtering to be applied in 3D, you can use the {menuselection}`Process --> Filters --> Gaussian Blur 3D...` command instead of {menuselection}`Process --> Filters --> Gaussian Blur...`
es: Podrías hacer que la macro funcione en pilas de imágenes completas. Si deseas que procese cada plano por separado, esto implica solo insertar las palabras "apilar" y "duplicar" en varios lugares; grabando una nueva macro de la misma manera, pero usando una pila como imagen de ejemplo, puedes ver dónde hacer esto. Si deseas que el filtrado se aplique en 3D, puedes utilizar el comando {menuselection}`Process --> Filters --> Gaussian Blur 3D...` en lugar de {menuselection}`Process --> Filters --> Gaussian Blur...`
pt_br: Você poderia fazer a macro funcionar em pilhas inteiras de imagens. Se você quiser processar cada plano separadamente, isso envolve apenas inserir as palavras `stack` e `duplicate` em vários lugares - gravando uma nova macro da mesma maneira, mas usando uma pilha como imagem de exemplo, você pode ver onde fazer isso. Se você deseja que a filtragem seja aplicada em 3D, você pode usar o comando {menuselection}`Process --> Filters --> Gaussian Blur 3D...` em vez de {menuselection}`Processo --> Filtros --> Desfoque Gaussiano...`

source: You could create a log of which images you have processed, possibly including the settings used. The log is output by including a `log(text);` line, where `text` is some string you have created, e.g. `text = Image name: + getTitle()`.
es: Puedes crear un registro de las imágenes que has procesado, posiblemente incluyendo la configuración utilizada. El registro se genera incluyendo una línea `log(text);`, donde `text` es alguna cadena que tu has creado, p.e. `texto = Nombre de la imagen: + getTitle()`.
pt_br: Você pode criar um registro das imagens processadas, possivelmente incluindo as configurações usadas. O log é gerado incluindo uma linha `log(text);`, onde `text` é alguma string que você criou, por exemplo. `texto = Nome da imagem: + getTitle()`.

source: More impressively, you could turn the macro into a full spot-detector by thresholding the DoG filtered image, and then running the {menuselection}`Analyze --> Analyze Particles...` command. If you want to measure original spot intensities, you should remember to go to {menuselection}`Analyze --> Set Measurements...` to make sure the measurements are redirected to the original image -- which you should possibly have duplicated at the beginning. Without the duplication, the original image will have been Gaussian filtered by the time your macro reaches the measurement stage.
es: Lo más impresionante es que puedes convertir la macro en un detector de manchas completo estableciendo un umbral en la imagen filtrada de DoG y luego ejecutando el comando {menuselection}`Analyze --> Analyze Particles...` . Si deseas medir las intensidades de los puntos originales, debes recordar ir a {menuselection}`Analyze --> Set Measurements...` para asegurarte de que las medidas se redirigen a la imagen original - que posiblemente deberías haber duplicado al principio. Sin la duplicación, la imagen original habrá sido procesada con un filtro Gaussiano cuando tu macro alcance la etapa de medición.
pt_br: O mais impressionante é que você pode transformar a macro em um detector de manchas completo limitando a imagem filtrada do DoG e, em seguida, executando o comando {menuselection}`Analyze --> Analyze Particles...` . Se você quiser medir intensidades de pontos originais, lembre-se de ir para {menuselection}`Analyze --> Set Measurements...` para garantir que as medições sejam redirecionadas para a imagem original - que você possivelmente deveria ter duplicado no início. Sem a duplicação, a imagem original terá sido filtrada por Gauss quando sua macro atingir o estágio de medição.

source: In any case, the process of developing a macro is usually the same:
es: En cualquier caso, el proceso de desarrollo de una macro suele ser el mismo:
pt_br: De qualquer forma, o processo de desenvolvimento de uma macro geralmente é o mesmo:

source: Record a macro that does basically the right thing
es: Graba una macro que haga básicamente lo correcto
pt_br: Grave uma macro que faça basicamente a coisa certa

source: Remove all the superfluous lines (contrast adjustment, errant clicking etc.)
es: Elimina todas las líneas superfluas (ajuste de contraste, clicks errantes, etc.)
pt_br: Remova todas as linhas supérfluas (ajuste de contraste, cliques errados, etc.)

source: Replace the image titles with image ID references
es: Reemplaza los títulos de las imágenes con referencias de identificación de imágenes
pt_br: Substitua os títulos das imagens por referências de ID de imagem

source: Add comments to describe what the macro is doing
es: Agrega comentarios para describir lo que está haciendo la macro.
pt_br: Adicione comentários para descrever o que a macro está fazendo

source: Track down bugs and make improvements
es: Localiza errores y realiza mejoras
pt_br: Rastreie bugs e faça melhorias

source: There is nothing special about `titleOrig` -- this text can be changed to any variable name you like, so long as it's one word and does not contain special characters.
es: No hay nada especial en `titleOrig`: este texto se puede cambiar a cualquier nombre de variable que desees, siempre que sea una palabra y no contenga caracteres especiales.
pt_br: Não há nada de especial em `titleOrig` -- este texto pode ser alterado para qualquer nome de variável que você desejar, desde que seja uma palavra e não contenha caracteres especiais.

source: In ImageJ's macro language, spaces in the string telling a command what to do are used to indicate that a separate piece of information is being given. So titles or file names that require spaces need to be put inside square brackets.
es: En el lenguaje de macros de ImageJ, los espacios en la cadena que le dicen a un comando qué hacer se usan para indicar que se está proporcionando una información separada. Por lo tanto, los títulos o nombres de archivos que requieren espacios deben colocarse entre corchetes.
pt_br: Na linguagem macro do ImageJ, espaços na string que informam a um comando o que fazer são usados para indicar que uma informação separada está sendo fornecida. Portanto, títulos ou nomes de arquivos que requerem espaços precisam ser colocados entre colchetes.

source: Note that `+` is used to join multiple strings into one, converting numbers into strings as needed. Therefore in this case the lines `sigma=+2` and `sigma=+sigma2` would each give us the same result: one longer string with the extra part appended at the end, i.e.`sigma=2`.
es: Ten en cuenta que `+` se usa para unir varias cadenas en una, convirtiendo números en cadenas según sea necesario. Por lo tanto, en este caso, las líneas `sigma=+2` y `sigma=+sigma2` nos darían cada una el mismo resultado: una cadena más larga con la parte extra añadida al final, es decir, `sigma=2`.
pt_br: Observe que `+` é usado para unir várias strings em uma, convertendo números em strings conforme necessário. Portanto, neste caso, as linhas `sigma=+2` e `sigma=+sigma2` nos dariam o mesmo resultado: uma string mais longa com a parte extra anexada no final, ou seja,`sigma=2`.
