Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/macros/macro_simulating.po
Languages: de, pt_br

source: If you're unfamiliar with programming, the syntax of loops may look quite strange. Reading through some online tutorials for the ImageJ macro language or for-loops in Java should help demystify what is happening here
de: Wenn Sie mit der Programmierung nicht vertraut sind, sieht die Syntax von Schleifen möglicherweise recht seltsam aus. Das Durchlesen einiger Online-Tutorials für die ImageJ-Makrosprache oder For-Schleifen in Java sollte dabei helfen, zu entmystifizieren, was hier passiert
pt_br: Se você não estiver familiarizado com programação, a sintaxe dos loops pode parecer bastante estranha. A leitura de alguns tutoriais on-line para a linguagem de macro ImageJ ou loops for em Java deve ajudar a desmistificar o que está acontecendo aqui
