Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de

source: Front matter
de: Vordere Angelegenheit

source: Before we begin
de: Bevor wir anfangen

source: Introducing images
de: Vorstellung von Bildern

source: Processing & analysis
de: Verarbeitung & Analyse

source: Fluorescence microscopy
de: Fluoreszenzmikroskopie

source: Appendices
de: Anhänge

source: Introduction to Bioimage Analysis
de: Einführung in die Bioimage-Analyse

source: [![Jupyter Book Badge](https://jupyterbook.org/badge.svg)](https://bioimagebook.github.io) [![License: CC BY 4.0](https://img.shields.io/badge/License-CC_BY_4.0-blue.svg)](https://creativecommons.org/licenses/by/4.0/) [![Twitter](https://img.shields.io/twitter/follow/petebankhead?style=flat)](https://twitter.com/petebankhead)
de: [![Jupyter Book Badge](https://jupyterbook.org/badge.svg)](https://bioimagebook.github.io) [![Lizenz: CC BY 4.0](https://img.shields. io/badge/License-CC_BY_4.0-blue.svg)](https://creativecommons.org/licenses/by/4.0/) [![Twitter](https://img.shields.io/twitter/follow /petebankhead?style=flat)](https://twitter.com/petebankhead)

source: Jupyter Book Badge
de: Jupyter-Buchabzeichen

source: License: CC BY 4.0
de: Lizenz: CC BY 4.0

source: This book tries explain the main ideas of image analysis in a practical and engaging way.
de: Dieses Buch versucht, die Hauptideen der Bildanalyse auf praktische und ansprechende Weise zu erklären.

source: It's written primarily for busy biologists who need to analyze images as part of their work -- but I hope others might find it useful as well.
de: Es ist in erster Linie für vielbeschäftigte Biologen geschrieben, die im Rahmen ihrer Arbeit Bilder analysieren müssen – aber ich hoffe, dass es auch für andere nützlich ist.

source: The core content is based on my earlier handbook *{notranslate}`Analyzing fluorescence microscopy images with ImageJ`* ([PDF](https://www.researchgate.net/publication/260261544_Analyzing_fluorescence_microscopy_images_with_ImageJ), [GitBook](https://petebankhead.gitbooks.io/imagej-intro/)). This has been extensively revised, generalized and expanded; the new title reflects the fact that it's no longer entirely focussed on fluorescence images, nor on ImageJ -- although both still play a big role.
de: Der Kerninhalt basiert auf meinem früheren Handbuch *{notranslate}`Analyzing fluoreszenzmikroskopische Bilder mit ImageJ`* ([PDF](https://www.researchgate.net/publication/260261544_Analyzing_fluoreszenz_microscopy_images_with_ImageJ ), [GitBook](https://petebankhead.gitbooks.io/imagej-intro/)). Dies wurde umfassend überarbeitet, verallgemeinert und erweitert; Der neue Titel spiegelt die Tatsache wider, dass er sich nicht mehr ausschließlich auf Fluoreszenzbilder oder ImageJ konzentriert – obwohl beide immer noch eine große Rolle spielen.

source: The biggest change is that it now exists as an open [Jupyter Book](https://jupyterbook.org). This makes the whole thing more maintainable for me, and interactive for anyone who reads it.
de: Die größte Änderung besteht darin, dass es jetzt als offenes [Jupyter Book](https://jupyterbook.org) existiert. Das macht das Ganze für mich wartbarer und für jeden, der es liest, interaktiv.

source: It's a work in progress, and probably always will be, but I hope you find it useful.
de: Es ist noch in Arbeit und wird es wahrscheinlich auch immer sein, aber ich hoffe, dass Sie es nützlich finden.

source: You can download the images used in the practical exercises [here](https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).
de: Sie können die in den praktischen Übungen verwendeten Bilder [hier] herunterladen (https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).

source: Title image
de: Titelbild
