Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/4-microscope_types/microscope_types.po
Languages: de

source: Previously we explored how CCDs can use 2×2 binning to combine the electrons corresponding to multiple pixels together into a single pixel, which is then 'less noisy'. A similar effect can be achieved by just acquiring an image without binning and applying a 2×2 filter, in which all the coefficients have values of one. Both techniques result in images that have roughly four times as many photons contributing to each pixel, and thus a better SNR.
de: Zuvor haben wir untersucht, wie CCDs mithilfe von 2×2-Binning die Elektronen, die mehreren Pixeln entsprechen, zu einem einzigen Pixel zusammenfassen können, das dann „weniger verrauscht“ ist. Ein ähnlicher Effekt lässt sich erzielen, indem man einfach ein Bild ohne Binning aufnimmt und einen 2×2-Filter anwendet, bei dem alle Koeffizienten Werte von eins haben. Beide Techniken führen zu Bildern, bei denen etwa viermal so viele Photonen zu jedem Pixel beitragen, und somit zu einem besseren SNR.

source: Think of one major advantage and one disadvantage of using filtering _after_ acquisition, rather than binning _during_ acquisition.
de: Denken Sie an einen großen Vorteil und einen Nachteil der Verwendung der Filterung _nach_ der Erfassung, anstatt _während_ der Erfassung zu gruppieren.

source: A 2×2 binned image contains 1/4 the number of pixels of the original image. This represents a considerable loss of spatial information, and you would get a different result if you were to start binning at the first or second row or column, since different pixels would be combined in each case. On the other hand, filtering has the advantage of giving you an image that is exactly the same size as the original. This is like getting all four possible binned images for the price of one (i.e. all four different ways to split the image into 2×2 pixel blocks, instead of just one way), so less spatial information is lost. With filtering you also have much more flexibility: you might choose a 3×3 filter instead, or a Gaussian filter, or a range of different filtering options to see which is best. With binning, you need to choose one option during acquisition and stick with it.
de: Ein 2×2-Binning-Bild enthält 1/4 der Pixelanzahl des Originalbildes. Dies stellt einen erheblichen räumlichen Informationsverlust dar und Sie würden ein anderes Ergebnis erhalten, wenn Sie mit dem Binning in der ersten oder zweiten Zeile oder Spalte beginnen würden, da jeweils unterschiedliche Pixel zusammengefasst würden. Andererseits hat das Filtern den Vorteil, dass Sie ein Bild erhalten, das genau die gleiche Größe wie das Original hat. Das ist so, als ob man alle vier möglichen gruppierten Bilder zum Preis von einem bekommt (d. h. alle vier verschiedenen Möglichkeiten, das Bild in 2×2-Pixel-Blöcke aufzuteilen, statt nur auf eine Art), sodass weniger räumliche Informationen verloren gehen. Beim Filtern haben Sie auch viel mehr Flexibilität: Sie können stattdessen einen 3×3-Filter oder einen Gauß-Filter oder eine Reihe verschiedener Filteroptionen wählen, um herauszufinden, welcher am besten ist. Beim Binning müssen Sie bei der Erfassung eine Option auswählen und dabei bleiben.

source: _However_, if _read noise_ is a major problem then filtering might not be such a good choice. This is because read noise is added to every acquired pixel once, and it does not matter if you have a few photons or many -- its standard deviation remains the same. Therefore, if the electrons from four pixels are combined by binning during acquisition, then only one 'unit' of read noise appears in the image corresponding to those pixels. But an unbinned image would have read noise added four times, and even after 2×2 filtering this is still more read noise than in a comparable binned image. Sometimes this extra noise is too high a cost for the flexibility of filtering, and binning is better. (In this regard, remember that read noise is typically worse for CCD cameras, but not such a problem for EMCCDs or PMTs.)
de: _Allerdings_ wenn _Leserauschen_ ein großes Problem darstellt, ist die Filterung möglicherweise keine so gute Wahl. Dies liegt daran, dass jedem erfassten Pixel einmal Leserauschen hinzugefügt wird, und es spielt keine Rolle, ob Sie ein paar oder viele Photonen haben – die Standardabweichung bleibt gleich. Wenn daher die Elektronen von vier Pixeln während der Erfassung durch Binning kombiniert werden, erscheint nur eine „Einheit“ Leserauschen im Bild, das diesen Pixeln entspricht. Bei einem nicht gruppierten Bild würde das Leserauschen jedoch viermal hinzugefügt, und selbst nach 2×2-Filterung ist dies immer noch mehr Leserauschen als bei einem vergleichbaren gruppierten Bild. Manchmal ist dieses zusätzliche Rauschen ein zu hoher Preis für die Flexibilität der Filterung, und Binning ist besser. (Bedenken Sie in diesem Zusammenhang, dass das Leserauschen bei CCD-Kameras normalerweise stärker ist, bei EMCCDs oder PMTs jedoch kein so großes Problem darstellt.)
