Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/4-microscope_types/microscope_types.po
Languages: de

source: Microscopes & detectors
de: Mikroskope und Detektoren

source: Chapter outline
de: Kapitelüberblick

source: The **choice of microscope** influences the **blur**, **noise** & **temporal resolution** of images
de: Die **Wahl des Mikroskops** beeinflusst die **Unschärfe**, das **Rauschen** und die **zeitliche Auflösung** der Bilder

source: An **ideal detector** would have a high **Quantum Efficiency** & **low read noise**
de: Ein **idealer Detektor** hätte eine hohe **Quanteneffizienz** und **geringes Leserauschen**

source: Introduction
de: Einführung

source: Successfully analyzing an image requires that it actually contains the necessary information in the first place. There are various practical issues related to the biology (e.g. not interfering too much with processes, for example by inadvertently killing things) and data handling (bit-depths, file formats, anything else in Part I of this book). However, assuming that these are in order, there are three other main factors to consider connected to the image contents:
de: Um ein Bild erfolgreich analysieren zu können, muss es überhaupt die notwendigen Informationen enthalten. Es gibt verschiedene praktische Probleme im Zusammenhang mit der Biologie (z. B. nicht zu sehr in Prozesse einzugreifen, beispielsweise durch versehentliches Töten von Dingen) und der Datenverarbeitung (Bittiefen, Dateiformate, alles andere in Teil I dieses Buches). Unter der Annahme, dass diese in Ordnung sind, müssen jedoch drei weitere Hauptfaktoren im Zusammenhang mit den Bildinhalten berücksichtigt werden:

source: **Spatial information**, dependent on the size and shape of the PSF,
de: **Rauminformationen**, abhängig von der Größe und Form des PSF,

source: **Noise**, dependent on the number of photons detected,
de: **Rauschen**, abhängig von der Anzahl der detektierten Photonen,

source: **Temporal resolution**, dependent on the speed at which the microscope can record images.
de: **Zeitliche Auflösung**, abhängig von der Geschwindigkeit, mit der das Mikroskop Bilder aufnehmen kann.

source: No one type of microscope is currently able to optimize all of these simultaneously, and so decisions and compromises need to be made. Temporal resolution and noise have an obvious relationship: a high temporal resolution means that less time is spent detecting photons in the image, leading to more photon noise. However, improving spatial information is also often related to one or both of the other two factors.
de: Derzeit ist kein einziger Mikroskoptyp in der Lage, all dies gleichzeitig zu optimieren, sodass Entscheidungen und Kompromisse getroffen werden müssen. Zwischen zeitlicher Auflösung und Rauschen besteht ein offensichtlicher Zusammenhang: Eine hohe zeitliche Auflösung bedeutet, dass weniger Zeit für die Erkennung von Photonen im Bild aufgewendet wird, was zu mehr Photonenrauschen führt. Die Verbesserung räumlicher Informationen hängt jedoch häufig auch mit einem oder beiden der beiden anderen Faktoren zusammen.

source: This chapter gives a very brief overview of the main features of several fluorescence microscopes from the point of view of how they balance the tradeoffs mentioned.
de: Dieses Kapitel gibt einen sehr kurzen Überblick über die Hauptmerkmale verschiedener Fluoreszenzmikroskope unter dem Gesichtspunkt, wie sie die genannten Kompromisse ausgleichen.

source: **This discussion does _not_ do justice to all the complexities, variations and features of the microscopes it describes!**
de: **Diese Diskussion wird _nicht_ allen Komplexitäten, Variationen und Merkmalen der darin beschriebenen Mikroskope gerecht!**

source: I'm by no means an expert in microscopy: I just analyze the data. But this chapter tries to distil the main things I learned that are relevant for analysis while working in an imaging center. It's a bit dated, but I've kept it anyway in case it might be useful to someone as a starting point.
de: Ich bin kein Experte für Mikroskopie, ich analysiere nur die Daten. In diesem Kapitel wird jedoch versucht, die wichtigsten Dinge zusammenzufassen, die ich während meiner Arbeit in einem Bildgebungszentrum gelernt habe und die für die Analyse relevant sind. Es ist etwas veraltet, aber ich habe es trotzdem behalten, für den Fall, dass es jemandem als Ausgangspunkt nützlich sein könnte.

source: For a more extensive, and authoritative, description of the topics considered here, consider seeking out the _Handbook of Biological Confocal Microscopy_ edited by James Pawley. This contains many excellent chapters, some of which may be available to download from the publisher's website.
de: Für eine ausführlichere und aussagekräftigere Beschreibung der hier behandelten Themen sollten Sie sich das von James Pawley herausgegebene „Handbook of Biological Confocal Microscopy“ ansehen. Es enthält viele hervorragende Kapitel, von denen einige möglicherweise auf der Website des Herausgebers heruntergeladen werden können.

source: Types of microscope
de: Arten von Mikroskopen

source: Schematic diagrams to show the differences in excitation patterns. Here, an inverted microscope is assumed (the cell is resting on a coverslip, and illuminated from below). During the recording of a pixel, light can potentially be detected if it arises from any part of the green-illuminated region, although in the laser scanning and spinning disk confocal cases the pinhole will only permit a fraction of this light to pass through. Note that, for the 2-photon microscope, the excitation is confined to only the small, central region, while the red light above and below is not capable of exciting the fluorophores that have been used.
de: Schematische Diagramme zur Darstellung der Unterschiede in den Anregungsmustern. Dabei wird von einem inversen Mikroskop ausgegangen (die Zelle liegt auf einem Deckglas und wird von unten beleuchtet). Während der Aufzeichnung eines Pixels kann möglicherweise Licht erkannt werden, wenn es aus irgendeinem Teil des grün beleuchteten Bereichs stammt, obwohl die Lochblende bei der Laserabtastung und der konfokalen Rotationsscheibe nur einen Bruchteil dieses Lichts durchlässt. Beachten Sie, dass beim 2-Photonen-Mikroskop die Anregung nur auf den kleinen, zentralen Bereich beschränkt ist, während das rote Licht darüber und darunter nicht in der Lage ist, die verwendeten Fluorophore anzuregen.

source: Widefield
de: Großes Feld

source: So far, our schematic diagrams and PSF discussion have concentrated on **widefield microscopes**. In widefield microscopy, the entire sample is bathed in light, so that many fluorophores throughout the sample can be excited and emit photons simultaneously. All of the light that enters the objective may then be detected and contribute to any image being recorded. Because photons are potentially emitted from everywhere in the sample, there will be a lot of blur present for a thick specimen (for a thin specimen there is not much light from out-of-focus planes because the planes simply do not contain anything that can fluoresce).
de: Bisher haben sich unsere schematischen Diagramme und PSF-Diskussionen auf **Weitfeldmikroskope** konzentriert. Bei der Weitfeldmikroskopie wird die gesamte Probe in Licht getaucht, sodass viele Fluorophore in der gesamten Probe angeregt werden können und gleichzeitig Photonen emittieren. Das gesamte Licht, das in das Objektiv eintritt, kann dann erfasst werden und zur Bildaufzeichnung beitragen. Da Photonen möglicherweise von überall in der Probe emittiert werden, entsteht bei einer dicken Probe eine starke Unschärfe (bei einer dünnen Probe gibt es nicht viel Licht aus unscharfen Ebenen, weil die Ebenen einfach nichts enthalten, was dazu in der Lage wäre). fluoreszieren).

source: What we get in any single recorded image is effectively the sum of the light from the in-focus plane, and every other out-of-focus plane. Viewed in terms of PSFs, we capture part of the hourglass shape produced by every light-emitting point depending upon how in-focus it is in every image.
de: Was wir in jedem einzelnen aufgenommenen Bild erhalten, ist praktisch die Summe des Lichts aus der fokussierten Ebene und allen anderen unscharfen Ebenen. In Form von PSFs betrachtet erfassen wir einen Teil der Sanduhrform, die von jedem lichtemittierenden Punkt erzeugt wird, je nachdem, wie scharf er in jedem Bild ist.

source: This is bad news for spatial information and also for detecting small structures in thick samples, because the out-of-focus light is essentially unhelpful background. On the other hand, widefield images tend to include a lot of photons, which overcomes read noise, even when they are recorded fast.
de: Dies ist eine schlechte Nachricht für räumliche Informationen und auch für die Erkennung kleiner Strukturen in dicken Proben, da das unscharfe Licht im Wesentlichen keinen hilfreichen Hintergrund darstellt. Andererseits enthalten Weitfeldbilder tendenziell viele Photonen, was das Leserauschen überwindet, selbst wenn sie schnell aufgenommen werden.

source: Laser scanning confocal
de: Konfokales Laserscannen

source: **Optical sectioning** is the ability to detect photons only from the plane of focus, rejecting those from elsewhere. This is necessary to look into thick samples without getting lost in the haze of other planes. **Laser Scanning Confocal Microscopy (LSCM)** achieves this by only concentrating on detecting light for one pixel at any time, and using a pinhole to try to only allow light from a corresponding point in the sample to be detected.
de: **Optische Sektionierung** ist die Fähigkeit, Photonen nur aus der Fokusebene zu erkennen und solche von anderswo abzulehnen. Dies ist notwendig, um dicke Proben untersuchen zu können, ohne sich im Dunst anderer Ebenen zu verlieren. **Konfokale Laser-Scanning-Mikroskopie (LSCM)** erreicht dies, indem sie sich immer nur auf die Erkennung von Licht für ein Pixel konzentriert und mithilfe einer Lochblende versucht, nur Licht von einem entsprechenden Punkt in der Probe zu erkennen.

source: Because at most only one pixel is being recorded at any given moment, it does not make sense to illuminate the entire sample at once, which could do unnecessary damage. Rather, a laser illuminates only a small volume. If this would be made small enough, then a pinhole would not actually be needed because we would know that all emitted light _must_ be coming from the illuminated spot; however, the illumination itself is like an hour-glass PSF in the specimen. The pinhole is needed to make sure only the light from the central part reaches the detector. This then causes the final PSF, as it appears _in the image_, to take on more of a rugby-ball (or American football) appearance.
de: Da zu jedem Zeitpunkt höchstens ein Pixel aufgezeichnet wird, ist es nicht sinnvoll, die gesamte Probe auf einmal zu beleuchten, was zu unnötigem Schaden führen könnte. Vielmehr beleuchtet ein Laser nur ein kleines Volumen. Wenn dies klein genug gemacht würde, wäre eine Lochblende eigentlich nicht nötig, weil wir wüssten, dass das gesamte emittierte Licht vom beleuchteten Punkt kommen muss; Allerdings gleicht die Beleuchtung selbst einer Sanduhr-PSF in der Probe. Die Lochblende wird benötigt, um sicherzustellen, dass nur das Licht vom zentralen Teil den Detektor erreicht. Dies führt dann dazu, dass das endgültige PSF, wie es _im Bild_ erscheint, eher ein Rugby-Ball- (oder American-Football-) Aussehen annimmt.

source: The end result is an image that has relatively little out-of-focus light. Compared to widefield microscopy, LSCM provide a significant improvement in what can be seen along the *z*-dimension, although the *xy* resolution is not very different. Also, because single pixels are recorded separately, the image can (potentially) be more or less any size and shape -- rather than limited by the pixel count on a camera.
de: Das Endergebnis ist ein Bild, das relativ wenig unscharfes Licht enthält. Im Vergleich zur Weitfeldmikroskopie bietet LSCM eine deutliche Verbesserung der Sichtbarkeit entlang der *z*-Dimension, obwohl die *xy*-Auflösung nicht sehr unterschiedlich ist. Da einzelne Pixel separat aufgezeichnet werden, kann das Bild (potenziell) mehr oder weniger jede beliebige Größe und Form haben – und ist nicht durch die Pixelanzahl einer Kamera begrenzt.

source: However, these advantages comes with a major drawback. Images usually contain thousands to millions of pixels, and so only a tiny fraction of the time required to record an image is spent detecting photons for any one pixel in a LSCM image -- unlike in the widefield case, where photons can be detected for all pixels over the entire image acquisition time. This can cause LSCM image acquisition to be comparatively slow, noisy (in terms of few detected photons) or both. Spatial information is therefore gained at a cost in noise and/or temporal resolution.
de: Diese Vorteile haben jedoch einen großen Nachteil. Bilder enthalten normalerweise Tausende bis Millionen von Pixeln, und daher wird nur ein winziger Bruchteil der Zeit, die zum Aufzeichnen eines Bildes erforderlich ist, für die Erkennung von Photonen für jedes einzelne Pixel in einem LSCM-Bild aufgewendet – anders als im Weitfeld-Fall, wo Photonen für alle erkannt werden können Pixel über die gesamte Bildaufnahmezeit. Dies kann dazu führen, dass die LSCM-Bilderfassung vergleichsweise langsam, verrauscht (in Bezug auf wenige erfasste Photonen) oder beides ist. Räumliche Informationen werden daher auf Kosten von Rauschen und/oder zeitlicher Auflösung gewonnen.

source: Question
de: Frage

source: Why is it often recommended that the pinhole in LSCM be set to have the same size as one Airy disk? And why is it sometimes better not to strictly follow this recommendation?
de: Warum wird oft empfohlen, die Lochblende in LSCM auf die gleiche Größe wie eine Airy-Scheibe einzustellen? Und warum ist es manchmal besser, dieser Empfehlung nicht strikt zu folgen?

source: Answer
de: Antwort

source: As described in {ref}`chap_formation_spatial`, the vast majority of the light from the in-focus plane falls within the Airy disk. Using a pinhole smaller than this can result in so little light being detected that the image becomes too noisy to be useful. On the other hand, increasing the size of the pinhole will result in some more of the remaining light located in the outer rings of the Airy pattern, but _most_ extra photons will come from out-of-focus planes. This causes a reduction in the effectiveness of the optical sectioning. Therefore, a pinhole diameter of approximately 1 Airy disk provides a reasonable balance between detecting most of the in-focus light and achieving good optical sectioning.
de: Wie in {ref}`chap_formation_spatial` beschrieben, fällt der Großteil des Lichts aus der fokussierten Ebene in die Airy-Scheibe. Die Verwendung einer kleineren Lochblende kann dazu führen, dass so wenig Licht erfasst wird, dass das Bild zu verrauscht wird, um nützlich zu sein. Andererseits führt eine Vergrößerung der Lochblende dazu, dass sich etwas mehr des verbleibenden Lichts in den äußeren Ringen des Airy-Musters befindet, aber die meisten zusätzlichen Photonen kommen aus unscharfen Ebenen. Dies führt zu einer Verringerung der Wirksamkeit der optischen Aufteilung. Daher bietet ein Lochdurchmesser von etwa 1 Airy-Scheibe ein angemessenes Gleichgewicht zwischen der Erfassung des größten Teils des fokussierten Lichts und der Erzielung einer guten optischen Schnittdarstellung.

source: Nevertheless, sometimes a reduction in optical sectioning is a worthwhile cost -- such as when photons are very scarce, and some extra background is tolerable. Also, when recording a multichannel image then you may well have to set the pinhole size according to the Airy disk for one channel. But because the size of the disk depends upon the light wavelength (as described in Equation {eq}`eqn-res_lateral`), the pinhole diameter will differ in terms of Airy disk sizes for other channels.
de: Dennoch ist eine Reduzierung der optischen Schnitte manchmal ein lohnender Kostenfaktor – etwa wenn Photonen sehr knapp sind und etwas zusätzlicher Hintergrund tolerierbar ist. Wenn Sie ein Mehrkanalbild aufnehmen, müssen Sie außerdem möglicherweise die Lochgröße entsprechend der Airy-Scheibe für einen Kanal einstellen. Da die Größe der Scheibe jedoch von der Wellenlänge des Lichts abhängt (wie in Gleichung „eqn-res_lateral“ beschrieben), unterscheidet sich der Lochdurchmesser in Bezug auf die Größe der Airy-Scheibe für andere Kanäle.

source: Spinning disk confocal
de: Konfokale rotierende Scheibe

source: So a widefield system records all pixels at once without blocking the light from reaching the detector anywhere, whereas a LSCM can block out-of-focus light by only recording a single pixel at a time. Both options sound extreme: could there not be a compromise?
de: Ein Weitfeldsystem zeichnet also alle Pixel auf einmal auf, ohne dass das Licht den Detektor irgendwo erreichen kann, während ein LSCM unscharfes Licht blockieren kann, indem es jeweils nur ein einzelnes Pixel aufzeichnet. Beide Optionen klingen extrem: Könnte es da nicht einen Kompromiss geben?

source: **Spinning disk confocal microscopy (SDCM)** implements one such compromise by using a large number of pinholes punched into a disk, so that the fluorophores can be excited and light detected for many different _non-adjacent_ pixels simultaneously. By not trying to record adjacent pixels at the same time, pinholes can be used to block _most_ of the out-of-focus light for each pixel, since this originates close to the region of interest for that pixel (i.e. the PSF becomes very dim at locations far away from its center) -- but sufficiently-spaced pixels can still be recorded simultaneously with little influence on one another.
de: **Konfokale Spinnscheibenmikroskopie (SDCM)** implementiert einen solchen Kompromiss, indem eine große Anzahl von Löchern in eine Scheibe gestanzt wird, sodass die Fluorophore angeregt und Licht für viele verschiedene, nicht benachbarte Pixel gleichzeitig erfasst werden können. Indem nicht versucht wird, benachbarte Pixel gleichzeitig aufzuzeichnen, können Pinholes verwendet werden, um den Großteil des unscharfen Lichts für jedes Pixel zu blockieren, da dieses in der Nähe des interessierenden Bereichs für dieses Pixel entsteht (d. h. die PSF wird sehr schwach). an Orten, die weit von der Mitte entfernt sind) – dennoch können ausreichend weit voneinander entfernte Pixel gleichzeitig und mit geringer gegenseitiger Beeinflussung aufgezeichnet werden.

source: In practice, spinning disk confocal microscopy images are likely to be less sharp than laser scanning confocal images because some light does scatter through other pinholes. Also, the pinhole sizes cannot be adjusted to fine-tune the balance between noise and optical sectioning. However, the optical sectioning offered by SDCM is at least a considerable improvement over the widefield case, and an acceptable SNR can be achieved with much faster frame-rates using SDCM as opposed to LSCM.
de: In der Praxis sind Bilder der konfokalen Rotationsscheibenmikroskopie wahrscheinlich weniger scharf als konfokale Laserscanning-Bilder, da ein Teil des Lichts durch andere Nadellöcher gestreut wird. Außerdem können die Lochgrößen nicht angepasst werden, um das Gleichgewicht zwischen Rauschen und optischer Schnittführung zu optimieren. Allerdings stellt die von SDCM gebotene optische Sektion zumindest eine erhebliche Verbesserung gegenüber dem Weitfeldfall dar, und mit SDCM im Gegensatz zu LSCM kann ein akzeptables SNR mit viel schnelleren Bildraten erreicht werden.

source: Multiphoton microscopy
de: Multiphotonenmikroskopie

source: As previously mentioned, if the size of excitation volume could be reduced enough, then we would know where the photons originated even without a pinhole being required -- but focused excitation is generally still subject to PSF-related issues, so that fluorophores throughout a whole hourglass-shaped volume can end up being excited. The main idea of **multiphoton microscopy** is that fluorophore excitation requires the _simultaneous absorption of multiple photons_, rather than only a single photon. The excitation light has a longer wavelength than would otherwise be required to cause molecular excitation with a single photon, but the energies of the multiple photons combine to cause the excitation.
de: Wie bereits erwähnt, wenn die Größe des Anregungsvolumens ausreichend reduziert werden könnte, dann wüssten wir, woher die Photonen stammen, auch ohne dass eine Lochblende erforderlich wäre – aber die fokussierte Anregung unterliegt im Allgemeinen immer noch PSF-bezogenen Problemen, so dass überall Fluorophore entstehen Sanduhrförmiges Volumen kann am Ende aufgeregt sein. Die Hauptidee der **Multiphotonenmikroskopie** besteht darin, dass die Anregung von Fluorophoren die _gleichzeitige Absorption mehrerer Photonen_ und nicht nur eines einzelnen Photons erfordert. Das Anregungslicht hat eine längere Wellenlänge, als es sonst erforderlich wäre, um eine molekulare Anregung mit einem einzelnen Photon zu bewirken, aber die Energien der mehreren Photonen verbinden sich, um die Anregung zu bewirken.

source: The benefit of this is that the multiphoton excitation only occurs at the focal region of the excitation -- elsewhere within the 'specimen PSF' the light intensities are insufficient to produce the 'multiphoton effect' and raise the fluorophores into an excited state. This means that the region of the specimen emitting photons at any one time is much smaller than when using single photon excitation (as in LSCM), and also less damage is being caused to the sample outside of the sample plane. Furthermore, multiphoton microscopy is able to penetrate deeper into a specimen -- up to several hundred µm.
de: Dies hat den Vorteil, dass die Multiphotonen-Anregung nur im Fokusbereich der Anregung erfolgt – anderswo innerhalb der „Proben-PSF“ reichen die Lichtintensitäten nicht aus, um den „Multiphotonen-Effekt“ zu erzeugen und die Fluorophore in einen angeregten Zustand zu versetzen. Dies bedeutet, dass der Bereich der Probe, der gleichzeitig Photonen emittiert, viel kleiner ist als bei der Einzelphotonenanregung (wie bei LSCM) und auch außerhalb der Probenebene weniger Schaden an der Probe verursacht wird. Darüber hinaus ist die Multiphotonenmikroskopie in der Lage, tiefer in eine Probe einzudringen – bis zu mehreren hundert µm.

source: Total Internal Reflection Fluorescence
de: Totale interne Reflexionsfluoreszenz
