Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/4-microscope_types/microscope_types.po
Languages: de

source: As previously mentioned, widefield images of very thin specimens do not suffer much from out-of-focus blur because light is not emitted from many other planes. **Total Internal Reflection Fluorescence (TIRF)** microscopy makes use of this by stimulating fluorescence only in a very thin section of the sample close to the objective. Very briefly, TIRF microscopy involves using an illumination angled so that the change in refractive index encountered by the light as it approaches the specimen causes a further change in angle sufficient to prevent the light from directly entering the specimen (i.e. it is 'totally internally reflected'). Nevertheless, fluorophores can still be excited by an evanescent wave that is produced when this occurs. This wave decays exponentially, so that only fluorophores right at the surface are excited -- meaning fluorophores deeper within the specimen do not interfere with the recording.
de: Wie bereits erwähnt, leiden Weitfeldbilder sehr dünner Proben nicht stark unter unscharfer Unschärfe, da von vielen anderen Ebenen kein Licht emittiert wird. Die **Total Internal Reflection Fluoreszenz (TIRF)**-Mikroskopie macht sich dies zunutze, indem sie die Fluoreszenz nur in einem sehr dünnen Abschnitt der Probe nahe dem Objektiv anregt. Kurz gesagt, bei der TIRF-Mikroskopie wird eine Beleuchtung verwendet, die so abgewinkelt ist, dass die Änderung des Brechungsindex, die das Licht bei seiner Annäherung an die Probe erfährt, eine weitere Winkeländerung bewirkt, die ausreicht, um zu verhindern, dass das Licht direkt in die Probe eindringt (d. h. es wird vollständig intern reflektiert). '). Dennoch können Fluorophore immer noch durch eine evaneszente Welle angeregt werden, die dabei entsteht. Diese Welle klingt exponentiell ab, sodass nur Fluorophore direkt an der Oberfläche angeregt werden – was bedeutet, dass Fluorophore tiefer im Inneren der Probe die Aufzeichnung nicht stören.

source: Importantly, because the subsequent recording is essentially similar to that used when recording widefield images, photons are detected at all pixels in parallel and fast recording-rates are possible. Therefore if it's only necessary to see to a depth of about 100 nm, TIRF microscopy may be a good choice.
de: Da die anschließende Aufnahme im Wesentlichen der Aufnahme von Weitfeldbildern ähnelt, werden Photonen an allen Pixeln parallel erfasst und schnelle Aufnahmeraten sind möglich. Wenn Sie also nur bis zu einer Tiefe von etwa 100 nm sehen müssen, kann die TIRF-Mikroskopie eine gute Wahl sein.

source: Photon detectors
de: Photonendetektoren

source: Certain detectors are associated with certain types of microscopy, and differ according to the level and type of noise you can expect. Understanding the basic principles greatly helps when choosing sensible values for parameters such as gain, pixel size and binning during acquisition to optimize the useful information in the image. The following provides a very brief introduction to two common detectors, and extra one variation.
de: Bestimmte Detektoren sind mit bestimmten Arten der Mikroskopie verbunden und unterscheiden sich je nach Pegel und Art des zu erwartenden Rauschens. Das Verständnis der Grundprinzipien ist sehr hilfreich bei der Auswahl sinnvoller Werte für Parameter wie Verstärkung, Pixelgröße und Binning während der Aufnahme, um die nützlichen Informationen im Bild zu optimieren. Im Folgenden finden Sie eine sehr kurze Einführung in zwei gängige Detektoren und eine weitere Variante.

source: PMTs: one pixel at a time
de: PMTs: jeweils ein Pixel

source: If you only need to record one pixel at a time, a **photomultiplier tube (PMT)** might be what you need. The basic principle is this: a photon strikes a photocathode, hopefully producing an electron. When this occurs, the electron is accelerated towards a dynode, and any produced electrons accelerated towards further dynodes. By adjusting the 'gain', the acceleration of the electrons towards successive dynodes can be varied; higher accelerations mean there is an increased likelihood that the collision of the electrons with the dynode will produce a higher number of electrons moving into the next stage. The charge of the electrons is then quantified at the end ({numref}`fig-pmt`). Because the (possibly very small) number of original detected photons have now been amplified to a (possibly much) larger number electrons by the successive collisions with dynodes, the effect of read noise is usually minor for a PMT.
de: Wenn Sie jeweils nur ein Pixel aufzeichnen müssen, ist möglicherweise eine **Photomultiplier-Röhre (PMT)** das Richtige für Sie. Das Grundprinzip ist folgendes: Ein Photon trifft auf eine Photokathode und erzeugt dabei hoffentlich ein Elektron. Wenn dies geschieht, wird das Elektron in Richtung einer Dynode beschleunigt und alle erzeugten Elektronen werden in Richtung weiterer Dynoden beschleunigt. Durch Anpassen der „Verstärkung“ kann die Beschleunigung der Elektronen in Richtung aufeinanderfolgender Dynoden variiert werden; Höhere Beschleunigungen bedeuten, dass die Wahrscheinlichkeit steigt, dass die Kollision der Elektronen mit der Dynode eine höhere Anzahl von Elektronen erzeugt, die in die nächste Stufe gelangen. Die Ladung der Elektronen wird dann am Ende quantifiziert ({numref}`fig-pmt`). Da die (möglicherweise sehr kleine) Anzahl der ursprünglich detektierten Photonen nun durch die aufeinanderfolgenden Kollisionen mit Dynoden auf eine (möglicherweise viel) größere Anzahl von Elektronen verstärkt wurde, ist der Effekt des Leserauschens bei einem PMT normalerweise gering.

source: Diagram showing the detection of a photon by a PMT. Each photon can be 'multiplied' to produce many electrons by accelerating the first produced electron towards a dynode, and repeating the process for all electrons produced along a succession of dynodes. The charge of the electrons reaching the end of the process can then be quantified, and ought to be proportional to the number of photons that arrived at the PMT.
de: Diagramm, das die Detektion eines Photons durch einen PMT zeigt. Jedes Photon kann „vervielfacht“ werden, um viele Elektronen zu erzeugen, indem das erste erzeugte Elektron in Richtung einer Dynode beschleunigt wird und der Vorgang für alle entlang einer Reihe von Dynoden erzeugten Elektronen wiederholt wird. Die Ladung der Elektronen, die das Ende des Prozesses erreichen, kann dann quantifiziert werden und sollte proportional zur Anzahl der Photonen sein, die am PMT angekommen sind.

source: More problematically, PMTs can suffer from the problem of having a low **Quantum Efficiency (QE)**. The QE is a measure of the proportion of photons striking the detector which then produce electrons, and values for a conventional PMT may be as low as 10–15%: the majority of the photons reaching the PMT are simply wasted. Thus photon noise can be a major issue, especially if there is a low amount of light available to detect in the first place.
de: Noch problematischer ist, dass PMTs unter dem Problem einer niedrigen **Quanteneffizienz (QE)** leiden können. Die QE ist ein Maß für den Anteil der Photonen, die auf den Detektor treffen und dann Elektronen erzeugen. Die Werte für einen herkömmlichen PMT können bei nur 10–15 % liegen: Der Großteil der Photonen, die den PMT erreichen, wird einfach verschwendet. Daher kann Photonenrauschen ein großes Problem darstellen, insbesondere wenn nur wenig Licht zur Erkennung zur Verfügung steht.

source: Converting electrons to pixels
de: Elektronen in Pixel umwandeln

source: It's important to keep in mind that the final pixel values are not _equal_ to numbers of detected photons -- nor even numbers of counted electrons. They are rather proportional, often with an offset added.
de: Es ist wichtig zu bedenken, dass die endgültigen Pixelwerte nicht der Anzahl der erfassten Photonen entsprechen – und auch nicht der Anzahl der gezählten Elektronen. Sie sind eher proportional, oft mit einem zusätzlichen Versatz.

source: It's essential to estimate this offset (perhaps from a background region or an image acquired without using any excitation light) and subtract it if you need to compare pixel values in different images, in addition to using identical acquisition settings.
de: Es ist wichtig, diesen Versatz zu schätzen (vielleicht aus einem Hintergrundbereich oder einem Bild, das ohne Anregungslicht aufgenommen wurde) und ihn zu subtrahieren, wenn Sie Pixelwerte in verschiedenen Bildern vergleichen müssen, zusätzlich zur Verwendung identischer Aufnahmeeinstellungen.

source: CCDs: fast imaging when there are a lot of photons
de: CCDs: schnelle Bildgebung bei vielen Photonen

source: A **Charged Coupled Device (CCD)** is a detector with a region devoted to sensing photons, and which is subdivided into different 'physical pixels' that correspond to pixels in the final image. Thus the image size cannot be changed arbitrarily, but it's possible to record photons for many pixels in parallel.
de: Ein **Charged Coupled Device (CCD)** ist ein Detektor mit einem Bereich, der der Erfassung von Photonen gewidmet ist und der in verschiedene „physikalische Pixel“ unterteilt ist, die den Pixeln im endgültigen Bild entsprechen. Somit kann die Bildgröße nicht beliebig verändert werden, es ist aber möglich, Photonen für viele Pixel parallel aufzuzeichnen.

source: When a photon strikes a pixel in the sensing part of the CCD, this often releases an electron -- the QE is typically high (perhaps 90%). After a certain exposure time, different 'electron clouds' have then formed at each physical pixel on the sensor, each of which has a charge related to the number of colliding photons. This charge is then measured by passing the electrons through a charge amplifier, and the results used to assign an intensity value to the pixel in the final image ({numref}`fig-ccd`).
de: Wenn ein Photon auf ein Pixel im Sensorteil des CCD trifft, wird häufig ein Elektron freigesetzt – die QE ist typischerweise hoch (vielleicht 90 %). Nach einer bestimmten Belichtungszeit haben sich dann an jedem physischen Pixel des Sensors unterschiedliche „Elektronenwolken“ gebildet, die jeweils eine Ladung haben, die von der Anzahl der kollidierenden Photonen abhängt. Diese Ladung wird dann gemessen, indem die Elektronen durch einen Ladungsverstärker geleitet werden, und die Ergebnisse werden verwendet, um dem Pixel im endgültigen Bild einen Intensitätswert zuzuweisen ({numref}`fig-ccd`) .

source: An illustration of the basic operation of a CCD camera (using frame transfer). First, photons strike a sense register, which is divided into pixels. This causes small clouds of electrons to be released and gather behind the pixels (A). These are then rapidly shifted downwards into another register of the same size, thereby freeing the sense register to continue detecting photons (B). The electron clouds are then shifted downwards again, one row at a time, with each row finally being shifted sequentially through a charge amplifier \(C). This quantifies the charge of the electron clouds, from which pixel values for the final image are determined.
de: Eine Darstellung der grundlegenden Funktionsweise einer CCD-Kamera (mithilfe der Bildübertragung). Zunächst treffen Photonen auf ein Leseregister, das in Pixel unterteilt ist. Dadurch werden kleine Elektronenwolken freigesetzt und sammeln sich hinter den Pixeln (A). Diese werden dann schnell nach unten in ein anderes Register gleicher Größe verschoben, wodurch das Leseregister für die weitere Photonenerfassung frei wird (B). Anschließend werden die Elektronenwolken zeilenweise wieder nach unten verschoben, wobei jede Zeile schließlich nacheinander durch einen Ladungsverstärker \(C) verschoben wird. Dadurch wird die Ladung der Elektronenwolken quantifiziert, aus der die Pixelwerte für das endgültige Bild ermittelt werden.

source: The electron clouds for each pixel might be larger than in the PMT case, both because of the higher QE and because more time can be spent detecting photons (since this is carried out for all pixels simultaneously). However, the step of amplifying the numbers of electrons safely above the read noise before quantification is missing. Consequently, read noise is potentially more problematic, and in some cases can even dominate the result.
de: Die Elektronenwolken für jedes Pixel könnten größer sein als im PMT-Fall, sowohl wegen der höheren QE als auch weil mehr Zeit für die Detektion von Photonen aufgewendet werden kann (da dies für alle Pixel gleichzeitig durchgeführt wird). Allerdings fehlt der Schritt, die Anzahl der Elektronen vor der Quantifizierung sicher über das Leserauschen zu erhöhen. Folglich ist Leserauschen potenziell problematischer und kann in manchen Fällen sogar das Ergebnis dominieren.

source: One way to address the issue of CCD read noise is to use **pixel binning**. In this case, the electrons from 4 (i.e. 2×2) pixels of the CCD are added together before being quantified: the electron clouds are approximately 4 times bigger relative to the read noise ({numref}`fig-ccd_binning`), and readout can be faster because fewer electron clouds need to be quantified. The obvious disadvantage of this is that one cannot then put the electrons from the 4 pixels 'back where they belong'. As a result, the binned measurement is simply treated as a single (bigger) pixel. The recorded image contains 25% of the pixels in the unbinned image, while still covering the same field of view, so spatial information is lost. Larger bins may also be used, with a correspondingly more dramatic impact upon image size ({numref}`fig-ccd_binning`D).
de: Eine Möglichkeit, das Problem des CCD-Leserauschens anzugehen, ist die Verwendung von **Pixel-Binning**. In diesem Fall werden die Elektronen von 4 (d. h. 2×2) Pixeln des CCD vor der Quantifizierung addiert: Die Elektronenwolken sind im Verhältnis zum Leserauschen etwa viermal größer ({numref}`fig-ccd_binning`), und das Auslesen kann schneller erfolgen, da weniger Elektronenwolken quantifiziert werden müssen. Der offensichtliche Nachteil dabei ist, dass man die Elektronen der 4 Pixel dann nicht „dahin bringen kann, wo sie hingehören“. Daher wird die gruppierte Messung einfach als ein einzelnes (größeres) Pixel behandelt. Das aufgezeichnete Bild enthält 25 % der Pixel im nicht gruppierten Bild, deckt aber immer noch das gleiche Sichtfeld ab, sodass räumliche Informationen verloren gehen. Es können auch größere Bins verwendet werden, mit entsprechend dramatischeren Auswirkungen auf die Bildgröße ({numref}`fig-ccd_binning`D).

source: Illustration of the effect of binning applied to an image suffering from photon and (severe) read noise. As the bin size increases, the photons from neighboring pixels are combined into a single (larger) pixel before the read noise is added. As a consequence, the image becomes brighter relative to the read noise -- but at a cost of spatial information.
de: Veranschaulichung des Binning-Effekts, der auf ein Bild angewendet wird, das unter Photonen- und (starkem) Leserauschen leidet. Mit zunehmender Bin-Größe werden die Photonen benachbarter Pixel zu einem einzigen (größeren) Pixel kombiniert, bevor das Leserauschen hinzugefügt wird. Dadurch wird das Bild im Verhältnis zum Leserauschen heller – allerdings auf Kosten der räumlichen Information.

source: EMCCDs: fast imaging with low light levels
de: EMCCDs: schnelle Bildgebung bei geringen Lichtverhältnissen

source: And so you might wonder whether it is possible to increase the electron clouds (like with the PMT) with an CCD, and so get its advantages without the major inconvenience of read noise. **Electron Multiplying CCDs (EMCCDs)** achieve this to some extent. Here, the electrons are first passed through an additional 'gain register' before quantification. At every stage of this gain register, each electron has a small probability -- perhaps only 1% -- of being amplified (through 'impact ionisation') and giving rise to two electrons entering the next stage. Despite the small probability, by incorporating > 500 such stages, the size of the electron cloud arising from even a single photon may be amplified safely above the read noise.
de: Und so fragen Sie sich vielleicht, ob es möglich ist, die Elektronenwolken (wie beim PMT) mit einem CCD zu vergrößern und so seine Vorteile ohne die großen Unannehmlichkeiten des Leserauschens zu nutzen. **Elektronenvervielfachende CCDs (EMCCDs)** erreichen dies bis zu einem gewissen Grad. Dabei durchlaufen die Elektronen vor der Quantifizierung zunächst ein zusätzliches „Gain-Register“. Auf jeder Stufe dieses Verstärkungsregisters hat jedes Elektron eine geringe Wahrscheinlichkeit – vielleicht nur 1 % –, verstärkt zu werden (durch „Stoßionisation“) und zwei Elektronen in die nächste Stufe eintreten zu lassen. Trotz der geringen Wahrscheinlichkeit kann durch den Einbau von > 500 solcher Stufen die Größe der Elektronenwolke, die auch nur aus einem einzelnen Photon entsteht, sicher über das Leserauschen hinaus verstärkt werden.

source: However, the randomness of the amplification process itself introduces a new source of uncertainty, so that the final outcome can be thought of as having the same precision as if perhaps only around half as many photons were detected (see {ref}`chap_formation_noise` for the relationship between noise and the number of photons). Therefore read noise is effectively overcome at the cost of more photon noise.
de: Allerdings bringt die Zufälligkeit des Verstärkungsprozesses selbst eine neue Quelle der Unsicherheit mit sich, sodass davon ausgegangen werden kann, dass das Endergebnis die gleiche Präzision aufweist, als ob vielleicht nur etwa halb so viele Photonen erfasst würden (siehe <span class='notranslate') >{ref}</span>`chap_formation_noise` für den Zusammenhang zwischen Rauschen und der Anzahl der Photonen). Daher wird Leserauschen auf Kosten von mehr Photonenrauschen effektiv überwunden.

source: A simplified diagram comparing a conventional CCD (with and without binning) and an EMCCD. While each has the same physical number of pixels, when binning is used electrons from several pixels are combined before readout -- thereby making the 'logical' pixels in the final image bigger. For the EMCCD, the electrons are shifted through a 'gain register' prior to quantification. See {numref}`fig-ccd` for additional labels; the sense register has been omitted for simplicity.
de: Ein vereinfachtes Diagramm zum Vergleich eines herkömmlichen CCD (mit und ohne Binning) und eines EMCCD. Obwohl jeder die gleiche physikalische Anzahl an Pixeln hat, werden beim Binning Elektronen aus mehreren Pixeln vor dem Auslesen kombiniert – wodurch die „logischen“ Pixel im endgültigen Bild größer werden. Beim EMCCD werden die Elektronen vor der Quantifizierung durch ein „Gain-Register“ verschoben. Weitere Beschriftungen finden Sie unter {numref}`fig-ccd`; Das Sense-Register wurde der Einfachheit halber weggelassen.

source: From a practical point of view, an EMCCD is rather like having a CCD with no read noise, but with half the QE. Under what circumstances (i.e. high or low numbers of photons) is an EMCCD preferable to a CCD?
de: Aus praktischer Sicht ist ein EMCCD eher wie ein CCD ohne Leserauschen, aber mit halber QE. Unter welchen Umständen (d. h. bei hoher oder niedriger Photonenzahl) ist ein EMCCD einem CCD vorzuziehen?

source: The gain register of EMCCDs offers benefits primarily when few photons are available (i.e. when read-noise is the main problem, such as in SDCM). CCDs are preferable when many photons are available (e.g. in widefield).
de: Das Verstärkungsregister von EMCCDs bietet vor allem dann Vorteile, wenn nur wenige Photonen verfügbar sind (d. h. wenn das Leserauschen das Hauptproblem darstellt, wie z. B. bei SDCM). CCDs sind vorzuziehen, wenn viele Photonen verfügbar sind (z. B. im Weitfeld).

source: If you are skeptical about this, consider an image in which your read noise standard deviation is 10 electrons and you detect on average 9 electrons (originally photons). The photon noise then has a standard deviation of 3. The read noise is much larger and will completely dominate the image: nothing interesting will be visible. It's then worth the cost of even more photon noise to be able to eliminate the read noise. The final image will still look pretty bad, but at least interpreting it is not hopeless.
de: Wenn Sie diesbezüglich skeptisch sind, betrachten Sie ein Bild, in dem die Standardabweichung des Leserauschens 10 Elektronen beträgt und Sie durchschnittlich 9 Elektronen (ursprünglich Photonen) erkennen. Das Photonenrauschen hat dann eine Standardabweichung von 3. Das Leserauschen ist viel größer und wird das Bild vollständig dominieren: Es wird nichts Interessantes sichtbar sein. Dann lohnt sich der Aufwand für noch mehr Photonenrauschen, um das Leserauschen eliminieren zu können. Das endgültige Bild wird immer noch ziemlich schlecht aussehen, aber es ist zumindest nicht aussichtslos, es zu interpretieren.

source: But suppose you happen to have 90000 detected photons instead, in which case the standard deviation of the photon noise is now 300. The read noise of 10 is comparatively insignificant, and there is nothing to gain from electron multiplication and making the photon noise situation worse.
de: Angenommen, Sie haben stattdessen zufällig 90.000 detektierte Photonen, dann beträgt die Standardabweichung des Photonenrauschens jetzt 300. Das Leserauschen von 10 ist vergleichsweise unbedeutend, und es gibt nichts zu gewinnen, wenn die Elektronenvervielfachung die Photonenrauschsituation verschlimmert .

source: Based upon the above descriptions, which detectors seem most appropriate (generally!) for (a) widefield microscopy, (b) SDCM and (c) LSCM?
de: Welche Detektoren scheinen auf der Grundlage der obigen Beschreibungen (im Allgemeinen!) für (a) Weitfeldmikroskopie, (b) SDCM und (c) LSCM am besten geeignet zu sein?

source: The following are reasonable rules of thumb:
de: Als Faustregeln gelten folgende:

source: _Widefield microscopy:_ A CCD is suitable because of its ability to record many pixels simultaneously. The large number of photons normally detected means that read noise is not usually a big issue, and an EMCCD can make the problem of noise worse instead of better.
de: _Weitfeldmikroskopie:_ Ein CCD eignet sich aufgrund seiner Fähigkeit, viele Pixel gleichzeitig aufzunehmen. Die große Anzahl der normalerweise erfassten Photonen bedeutet, dass Leserauschen normalerweise kein großes Problem darstellt und ein EMCCD das Rauschproblem verschlimmern statt verbessern kann.

source: _Spinning Disk Confocal Microscopy:_ A CCD may be used, but an EMCCD (or other CCD variant) is often preferable. This is because SDCM usually gives lower photon counts (certainly lower than in a comparable widefield image), which can mean that read noise would dominate the result unless the photons are somehow amplified.
de: _Konfokale Spinnscheibenmikroskopie:_ Ein CCD kann verwendet werden, aber ein EMCCD (oder eine andere CCD-Variante) ist oft vorzuziehen. Dies liegt daran, dass SDCM normalerweise niedrigere Photonenzahlen liefert (sicherlich niedriger als in einem vergleichbaren Weitfeldbild), was bedeuten kann, dass Leserauschen das Ergebnis dominieren würde, sofern die Photonen nicht irgendwie verstärkt werden.

source: _Laser Scanning Confocal Microscopy:_ PMTs are suitable, since the image is built up one pixel at a time.
de: _Konfokale Laser-Scanning-Mikroskopie:_ PMTs sind geeignet, da das Bild pixelweise aufgebaut wird.
