Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/index.po
Languages: es, pt_br

source: Front matter
es: Asunto frontal
pt_br: Matéria inicial

source: Before we begin
es: Antes de que comencemos
pt_br: Antes de começarmos

source: Introducing images
es: Presentando imágenes
pt_br: Apresentando imagens

source: Processing & analysis
es: Procesamiento y análisis
pt_br: Processamento e análise

source: Fluorescence microscopy
es: Microscopio fluorescente
pt_br: Microscópio Fluorescente

source: Appendices
es: Apéndices
pt_br: Apêndices

source: Introduction to Bioimage Analysis
es: Introducción al análisis de bioimagen
pt_br: Introdução à análise de bioimagem

source: [![Jupyter Book Badge](https://jupyterbook.org/badge.svg)](https://bioimagebook.github.io) [![License: CC BY 4.0](https://img.shields.io/badge/License-CC_BY_4.0-blue.svg)](https://creativecommons.org/licenses/by/4.0/) [![Twitter](https://img.shields.io/twitter/follow/petebankhead?style=flat)](https://twitter.com/petebankhead)
es: [![Jupyter Book Badge](https://jupyterbook.org/badge.svg)](https://bioimagebook.github.io) [![Licencia: CC BY 4.0](https://img.shields. io/badge/License-CC_BY_4.0-blue.svg)](https://creativecommons.org/licenses/by/4.0/) [![Twitter](https://img.shields.io/twitter/follow /petebankhead?style=flat)](https://twitter.com/petebankhead)
pt_br: [![Jupyter Book Badge](https://jupyterbook.org/badge.svg)](https://bioimagebook.github.io) [![Licença: CC BY 4.0](https://img.shields. io/badge/License-CC_BY_4.0-blue.svg)](https://creativecommons.org/licenses/by/4.0/) [![Twitter](https://img.shields.io/twitter/follow /petebankhead?style=flat)](https://twitter.com/petebankhead)

source: Jupyter Book Badge
es: Insignia del libro Jupyter
pt_br: Distintivo do livro Jupyter

source: License: CC BY 4.0
es: Licencia: CC BY 4.0
pt_br: Licença: CC BY 4.0

source: Twitter
es: Gorjeo

source: This book tries explain the main ideas of image analysis in a practical and engaging way.
es: Este libro intenta explicar las ideas principales del análisis de imágenes de una manera práctica y atractiva.
pt_br: Este livro tenta explicar as principais ideias da análise de imagens de forma prática e envolvente.

source: It's written primarily for busy biologists who need to analyze images as part of their work -- but I hope others might find it useful as well.
es: Está escrito principalmente para biólogos ocupados que necesitan analizar imágenes como parte de su trabajo, pero espero que otros también lo encuentren útil.
pt_br: Ele foi escrito principalmente para biólogos ocupados que precisam analisar imagens como parte de seu trabalho – mas espero que outros também possam considerá-lo útil.

source: The core content is based on my earlier handbook *{notranslate}`Analyzing fluorescence microscopy images with ImageJ`* ([PDF](https://www.researchgate.net/publication/260261544_Analyzing_fluorescence_microscopy_images_with_ImageJ), [GitBook](https://petebankhead.gitbooks.io/imagej-intro/)). This has been extensively revised, generalized and expanded; the new title reflects the fact that it's no longer entirely focussed on fluorescence images, nor on ImageJ -- although both still play a big role.
es: El contenido principal se basa en mi manual anterior *{notranslate}`Análisis de imágenes de microscopía de fluorescencia con ImageJ`* ([PDF](https://www.researchgate.net/publication/260261544_Analyzing_fluorescent_microscopy_images_with_ImageJ ), [GitBook](https://petebankhead.gitbooks.io/imagej-intro/)). Esto ha sido ampliamente revisado, generalizado y ampliado; El nuevo título refleja el hecho de que ya no se centra exclusivamente en imágenes de fluorescencia ni en ImageJ, aunque ambos siguen desempeñando un papel importante.
pt_br: O conteúdo principal é baseado em meu manual anterior *{notranslate}`Analyzing_fluorescence microscopy images with ImageJ`* ([PDF](https://www.researchgate.net/publication/260261544_Analyzing_fluorescence_microscopy_images_with_ImageJ ), [GitBook](https://petebankhead.gitbooks.io/imagej-intro/)). Isto foi extensivamente revisto, generalizado e expandido; o novo título reflete o fato de não estar mais totalmente focado em imagens de fluorescência, nem em ImageJ - embora ambos ainda desempenhem um papel importante.

source: The biggest change is that it now exists as an open [Jupyter Book](https://jupyterbook.org). This makes the whole thing more maintainable for me, and interactive for anyone who reads it.
es: El mayor cambio es que ahora existe como un [Jupyter Book] abierto (https://jupyterbook.org). Esto hace que todo sea más fácil de mantener para mí e interactivo para cualquiera que lo lea.
pt_br: A maior mudança é que agora ele existe como um [Livro Jupyter](https://jupyterbook.org) aberto. Isso torna tudo mais fácil de manter para mim e interativo para quem o lê.

source: It's a work in progress, and probably always will be, but I hope you find it useful.
es: Es un trabajo en progreso, y probablemente siempre lo será, pero espero que lo encuentre útil.
pt_br: É um trabalho em andamento e provavelmente sempre será, mas espero que seja útil para você.

source: You can download the images used in the practical exercises [here](https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).
es: Puedes descargar las imágenes utilizadas en los ejercicios prácticos [aquí](https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).
pt_br: Você pode baixar as imagens utilizadas nos exercícios práticos [aqui](https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).

source: Title image
es: Imagen del título
pt_br: Imagem do título
