Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/appendices/macros/macro_dog.po
Languages: de, es

source: Difference of Gaussians
de: Gauß-Differenz
es: Diferencia de Gaussianas

source: Introduction
de: Einführung
es: Introducción

source: [Difference of Gaussians (DoG) filtering](sec_filters_dog) is a very useful technique for enhancing the appearance of small spots and edges in an image. It's quite straightforward, but time consuming to apply manually very often -- and you might need to experiment with different filter sizes to get good results. This makes it an excellent candidate for a macro.
de: Die [Gauß-Differenzfilterung](sec_filters_dog) ist eine sehr nützliche Technik zur Verbesserung des Aussehens von kleinen Flecken und Kanten in einem Bild. Sie ist recht einfach, aber zeitaufwendig, wenn man sie häufig manuell anwendet - und man muss möglicherweise mit verschiedenen Filtergrößen experimentieren, um gute Ergebnisse zu erzielen. Das macht sie zu einem ausgezeichneten Kandidaten für ein Makro.
es: [El filtrado por diferencia de gaussianos (DoG)](sec_filters_dog) es una técnica muy útil para mejorar la apariencia de pequeñas manchas y bordes en una imagen. Es bastante sencillo, pero lleva mucho tiempo aplicarlo manualmente muy a menudo -- y puede que necesite experimentar con diferentes tamaños de filtro para obtener buenos resultados. Esto la convierte en una excelente candidata para una macro.

source: Recording a macro
de: Aufzeichnung eines Makros
es: Grabar una macro

source: Example input image
de: Beispiel Eingabebild
es: Ejemplo de imagen de entrada

source: Result of DoG filter
de: Ergebnis des DoG-Filters
es: Resultado del filtro DoG

source: Rather than diving into writing the code, the fastest way to get started is to have ImageJ do most of the hard work itself. Then you only need to fix up the result. The procedure is as follows:
de: Anstatt sich in das Schreiben des Codes zu stürzen, ist der schnellste Weg, ImageJ die meiste Arbeit selbst erledigen zu lassen. Dann brauchen Sie nur noch das Ergebnis zu korrigieren. Die Vorgehensweise ist wie folgt:
es: En lugar de lanzarse a escribir el código, la forma más rápida de empezar es dejar que ImageJ haga por sí mismo la mayor parte del trabajo duro. Entonces sólo tendrá que arreglar el resultado. El procedimiento es el siguiente:

source: Open up an example (2D, non-color) image to use, ideally one including small spot-like or otherwise round objects. I have used {menuselection}`File --> Open samples --> HeLa Cells`, after extracting the red channel only.
de: Öffnen Sie ein Beispielbild (2D, nicht farbig), das Sie verwenden möchten, idealerweise eines, das kleine punktförmige oder anderweitig runde Objekte enthält. Ich habe {menuselection}`Datei --&gt; Proben öffnen --&gt; HeLa-Zellen` verwendet, nachdem ich nur den roten Kanal extrahiert habe.
es: Abra una imagen de ejemplo (2D, sin color) para usar, idealmente una que incluya pequeños objetos redondos. He utilizado {menuselection}`Archivo --&gt; Abrir muestras --&gt; Células HeLa`, después de extraer sólo el canal rojo.

source: Start the _Macro Recorder_ by choosing {menuselection}`Plugins --> Macros --> Record`. Make sure that {guilabel}`Record: Macro` appears at the top of this window (see the drop-down list). Every subsequent click you make that has a corresponding macro command will result in the command being added to the window.
de: Starten Sie den _Macro Recorder_, indem Sie {menuselection}`Plugins --&gt; Macros --&gt; Record` wählen. Stellen Sie sicher, dass {guilabel}`Aufzeichnen: Makro" oben in diesem Fenster erscheint (siehe die Dropdown-Liste). Bei jedem weiteren Klick, der einen entsprechenden Makrobefehl enthält, wird der Befehl dem Fenster hinzugefügt.
es: Inicie el _Macro Recorder_ eligiendo {menuselection}`Plugins --&gt; Macros --&gt; Record`. Asegúrese de que {guilabel}`Record: Macro` aparezca en la parte superior de esta ventana (ver la lista desplegable). Cada clic posterior que hagas que tenga un comando de macro correspondiente hará que el comando se añada a la ventana.

source: Convert your image to 32-bit. This will reduce inaccuracies due to rounding whenever the filtering is applied.
de: Konvertieren Sie Ihr Bild in 32-Bit. Dadurch werden Ungenauigkeiten aufgrund von Rundungen bei der Anwendung der Filterung verringert.
es: Convierte tu imagen a 32 bits. Esto reducirá las imprecisiones debidas al redondeo cada vez que se aplique el filtrado.

source: Duplicate the image.
de: Duplizieren Sie das Bild.
es: Duplicar la imagen.

source: Apply {menuselection}`Process --> Filters --> Gaussian Blur...` to one of the images (it doesn't matter if it's the original or the duplicate), using a small sigma (e.g. 1) for noise suppression.
de: Wenden Sie {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur...` auf eines der Bilder an (es spielt keine Rolle, ob es das Original oder das Duplikat ist), wobei Sie ein kleines Sigma (z.B. 1) zur Rauschunterdrückung verwenden.
es: Aplique {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur...` a una de las imágenes (no importa si es la original o la duplicada), utilizando un sigma pequeño (por ejemplo 1) para suprimir el ruido.

source: Apply {menuselection}`Process --> Filters --> Gaussian Blur...` to the other image, using a larger sigma (e.g. 2).
de: Wenden Sie {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur...` auf das andere Bild an, wobei Sie ein größeres Sigma (z.B. 2) verwenden.
es: Aplique {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur...` a la otra imagen, utilizando un sigma mayor (por ejemplo 2).

source: Run {menuselection}`Process --> Image Calculator...` and subtract the second filtered image from the first. This produces the 'difference of Gaussians' filtered image, in which small features should appear prominently and the background is removed.
de: Starten Sie {menuselection}`Process --&gt; Image Calculator...` und subtrahieren Sie das zweite gefilterte Bild vom ersten. Dies ergibt das nach der Gauß'schen Differenz gefilterte Bild, in dem kleine Merkmale hervorstechen sollten und der Hintergrund entfernt ist.
es: Ejecute {menuselection}`Process --&gt; Image Calculator...` y reste la segunda imagen filtrada de la primera. Así se obtiene la imagen filtrada por "diferencia de Gaussianos", en la que los rasgos pequeños deberían aparecer de forma prominente y se elimina el fondo.

source: Be careful to choose the correct image titles and subtraction operation in the *Image Calculator*!
de: Achten Sie darauf, die richtigen Bildtitel und Subtraktionsoperationen im *Bildrechner* zu wählen!
es: Tenga cuidado de elegir correctamente los títulos de las imágenes y la operación de sustracción en la *Calculadora de imágenes*.

source: Press the {guilabel}`Create` button on the macro recorder. This should cause a text file containing the recorded macro to be opened in Fiji's {menuselection}`Script Editor` (which you can find under {menuselection}`File --> New --> Script...`).
de: Drücken Sie die Schaltfläche {guilabel}`Erstellen` auf dem Makro-Recorder. Dies sollte dazu führen, dass eine Textdatei mit dem aufgezeichneten Makro in Fidschis {menuselection}`Skript-Editor` geöffnet wird (den Sie unter {menuselection}`Datei --&gt; Neu --&gt; Skript...` finden).
es: Pulse el botón {guilabel}`Create` de la grabadora de macros. Esto hará que se abra un archivo de texto con la macro grabada en el `Editor de Script` de Fiji {menuselection}(que puedes encontrar en {menuselection}`Archivo --&gt; Nuevo --&gt; Script...`).

source: Save the text file. The file name should end with the extension `.ijm` (for 'ImageJ Macro'), and include an underscore character somewhere within it.
de: Speichern Sie die Textdatei. Der Dateiname sollte mit der Endung "ijm" (für "ImageJ Macro") enden und irgendwo einen Unterstrich enthalten.
es: Guarde el archivo de texto. El nombre del archivo debe terminar con la extensión `.ijm` (de 'ImageJ Macro'), e incluir un carácter de subrayado en algún lugar del mismo.

source: **Now you have a macro!**
de: **Jetzt haben Sie ein Makro!**
es: **¡Ahora tienes una macro!**

source: You *could* try it out by pressing the tempting {guilabel}`Run` button, but this isn't guaranteed to work (yet). Our macro remains quite brittle: it depends upon exact image names and might become easily confused. We will fix this soon.
de: Sie *könnten* es ausprobieren, indem Sie den verlockenden {guilabel}`Run` Knopf drücken, aber das ist (noch) nicht garantiert. Unser Makro ist noch recht spröde: es hängt von exakten Bildnamen ab und könnte leicht verwechselt werden. Wir werden dies bald beheben.
es: Puedes probarla pulsando el tentador botón `Run` de {guilabel}, pero no está garantizado que funcione (todavía). Nuestra macro sigue siendo bastante frágil: depende de los nombres exactos de las imágenes y podría confundirse fácilmente. Lo arreglaremos pronto.

source: As an alternative,
de: Als Alternative,
es: Como alternativa,

source: Close Fiji completely (to ensure nothing remains from this session)
de: Fidschi vollständig schließen (um sicherzustellen, dass nichts von dieser Sitzung übrig bleibt)
es: Cierre Fiji por completo (para asegurarse de que no queda nada de esta sesión)

source: Reopen Fiji
de: Wiedereröffnung Fidschis
es: Reabrir Fiyi

source: Open the original image you used
de: Öffnen Sie das von Ihnen verwendete Originalbild
es: Abra la imagen original que utilizó

source: Open the macro (you can just drag it onto the ImageJ toolbar)
de: Öffnen Sie das Makro (Sie können es einfach auf die ImageJ-Symbolleiste ziehen)
es: Abra la macro (puede arrastrarla a la barra de herramientas de ImageJ)

source: Now the {guilabel}`Run` button will hopefully give you the same result as when you applied the commands manually. If not, keep reading anyway and the following steps should fix it.
de: Die Schaltfläche {guilabel}"Ausführen" führt nun hoffentlich zu demselben Ergebnis wie bei der manuellen Anwendung der Befehle. Wenn nicht, lesen Sie trotzdem weiter und die folgenden Schritte sollten das Problem beheben.
es: Ahora el botón {guilabel}`Run` le dará el mismo resultado que cuando aplicó los comandos manualmente. Si no es así, sigue leyendo de todos modos y los siguientes pasos deberían solucionarlo.

source: Cleaning up the code
de: Bereinigung des Codes
es: Limpieza del código

source: Now reopen your macro in the *Script Editor*. It should look something like mine:
de: Öffnen Sie nun Ihr Makro erneut im *Script Editor*. Es sollte ungefähr so aussehen wie meines:
es: Ahora vuelve a abrir tu macro en el *Editor de Script*. Debería parecerse a la mía:

source: For easier copy-and-paste, the content is below:
de: Zur Erleichterung des Kopierens und Einfügens wird der Inhalt unten wiedergegeben:
es: Para facilitar la tarea de copiar y pegar, el contenido figura a continuación:

source: Your code is probably not identical, and may well be better. One problem with automatically generated macros is that they contain (almost) _everything_ -- often including a lot of errant clicking, or other non-essential steps. For example, I changed the contrast of an image, but this was only to look at it -- and it does not need to be included in the macro.
de: Ihr Code ist wahrscheinlich nicht identisch und kann durchaus besser sein. Ein Problem mit automatisch generierten Makros ist, dass sie (fast) _alles_ enthalten - oft auch eine Menge irrtümlicher Klicks oder anderer unwesentlicher Schritte. Ich habe z. B. den Kontrast eines Bildes geändert, aber nur, um es zu betrachten - und das muss nicht in das Makro aufgenommen werden.
es: Tu código probablemente no sea idéntico, y puede que sea mejor. Un problema con las macros generadas automáticamente es que contienen (casi) _todo_ -- a menudo incluyendo un montón de clics errantes, u otros pasos no esenciales. Por ejemplo, he cambiado el contraste de una imagen, pero esto era sólo para mirarla -- y no es necesario incluirlo en la macro.

source: After deleting the unnecessary lines, I get:
de: Nachdem ich die unnötigen Zeilen gelöscht habe, erhalte ich:
es: Después de borrar las líneas innecesarias, obtengo:

source: Understanding the code
de: Den Code verstehen
es: Comprender el código

source: You can most likely work out what the macro is doing, if not necessarily the terminology, just by looking at it. Taking the first line, `run` is a **function_ that tells ImageJ to execute a command, while `32-bit` is a piece of text (called a **string**) that tells it which command. Functions always tell ImageJ to do something or give you information, and can be recognized because they are normally followed by parentheses. Strings are recognizable both because they are inside double inverted commas and the script editor shows them in a different color. Notice also that each line needs to end with a semicolon so that the macro interpreter knows the line is over.
de: Sie können höchstwahrscheinlich herausfinden, was das Makro tut, wenn auch nicht notwendigerweise die Terminologie, indem Sie es sich einfach ansehen. Nimmt man die erste Zeile, so ist "run" eine **Funktion_, die ImageJ anweist, einen Befehl auszuführen, während "32-bit" ein Stück Text ist (ein sogenannter **String**), der ImageJ mitteilt, welcher Befehl es ist. Funktionen weisen ImageJ immer an, etwas zu tun oder Informationen zu geben, und sind daran zu erkennen, dass sie normalerweise von Klammern gefolgt werden. Zeichenketten sind daran zu erkennen, dass sie in doppelten Anführungszeichen stehen und der Skript-Editor sie in einer anderen Farbe anzeigt. Beachten Sie auch, dass jede Zeile mit einem Semikolon enden muss, damit der Makrointerpreter weiß, dass die Zeile zu Ende ist.
es: Lo más probable es que puedas entender lo que hace la macro, aunque no necesariamente su terminología, con sólo mirarla. Tomando la primera línea, `run` es una **función_ que le dice a ImageJ que ejecute un comando, mientras que `32-bit` es un trozo de texto (llamado **cadena**) que le dice qué comando. Las funciones siempre le dicen a ImageJ que haga algo o que le dé información, y se pueden reconocer porque normalmente van seguidas de paréntesis. Las cadenas se reconocen porque van entre comillas dobles y porque el editor de scripts las muestra en un color diferente. Observe también que cada línea debe terminar con un punto y coma para que el intérprete de macros sepa que la línea ha terminado.

source: Functions can require different numbers of pieces of information to do their work. At a minimum, `run` needs to know the name of the command and the image to which it should be applied -- which here is taken to be whichever image is currently active, i.e. the one that was selected most recently. But if the command being used by `run` requires extra information of its own, then this is included as an extra string. Therefore
de: Funktionen können eine unterschiedliche Anzahl von Informationen benötigen, um ihre Arbeit zu erledigen. Zumindest muss `run` den Namen des Befehls und das Bild kennen, auf das er angewendet werden soll - was hier so verstanden wird, dass es das Bild ist, das gerade aktiv ist, d.h. dasjenige, das zuletzt ausgewählt wurde. Wenn der Befehl, der von `run` verwendet wird, jedoch zusätzliche Informationen benötigt, werden diese als zusätzliche Zeichenkette hinzugefügt. Daher
es: Las funciones pueden necesitar distintos tipos de información para realizar su trabajo. Como mínimo, `run` necesita saber el nombre de la orden y la imagen a la que debe aplicarse, que aquí se toma como la imagen activa en ese momento, es decir, la que se seleccionó más recientemente. Pero si el comando utilizado por `run` requiere información adicional, ésta se incluye como una cadena extra. Así,

source: informs the {menuselection}`Duplicate` command that the image it creates should be called *C1-hela-cells-1.tif*, and
de: teilt dem Befehl {menuselection}"Duplicate" mit, dass das von ihm erstellte Bild *C1-hela-cells-1.tif* heißen soll, und
es: informa al comando {menuselection}`Duplicate` de que la imagen que crea debe llamarse *C1-hela-cells-1.tif*, y

source: ensures that {menuselection}`Process --> Filters --> Gaussian Blur...` is executed with a sigma value of 1.
de: stellt sicher, dass {menuselection}`Prozess --&gt; Filter --&gt; Gaußscher Weichzeichner...` mit einem Sigma-Wert von 1 ausgeführt wird.
es: asegura que {menuselection}`Proceso --&gt; Filtros --&gt; Desenfoque Gaussiano...` se ejecute con un valor sigma de 1.

source: `selectWindow` is another function, added to the macro whenever you click on a particular window to activate it, and which requires the name of the image window to make active. From this you can see that my example file name was *C1-hela-cells.tif*. Without this line, the duplicated image would be filtered twice -- and the original not at all.
de: selectWindow" ist eine weitere Funktion, die dem Makro hinzugefügt wird, wenn Sie auf ein bestimmtes Fenster klicken, um es zu aktivieren, und die den Namen des Bildfensters benötigt, das aktiviert werden soll. Daraus können Sie ersehen, dass der Dateiname meines Beispiels *C1-hela-cells.tif* war. Ohne diese Zeile würde das duplizierte Bild zweimal gefiltert werden - und das Original überhaupt nicht.
es: `selectWindow` es otra función, que se añade a la macro cada vez que se hace clic en una ventana en particular para activarla, y que requiere el nombre de la ventana de la imagen para hacerla activa. De aquí se puede ver que el nombre de mi archivo de ejemplo era *C1-hela-cells.tif*. Sin esta línea, la imagen duplicada se filtraría dos veces, y la original no.

source: Finally, the {menuselection}`Image Calculator` command is special enough to get its own function in the macro language, `imageCalculator`. The first string it is given tells it both what sort of calculation to do, and that it should `create` a new image for the result -- rather than replacing one of the existing images. The next two strings give it the titles of the images needed for the calculation.
de: Schließlich ist der Befehl {menuselection}"Bildberechnung" so speziell, dass er eine eigene Funktion in der Makrosprache erhält, "Bildberechnung". Die erste Zeichenkette, die ihm gegeben wird, sagt ihm sowohl, welche Art von Berechnung er durchführen soll, als auch, dass er ein neues Bild für das Ergebnis `erstellen` soll -- anstatt eines der bestehenden Bilder zu ersetzen. Die nächsten beiden Zeichenketten geben ihm die Titel der Bilder, die für die Berechnung benötigt werden.
es: Finalmente, el comando {menuselection}`Image Calculator` es lo suficientemente especial como para tener su propia función en el lenguaje de macros, `imageCalculator`. La primera cadena que se le da le indica qué tipo de cálculo debe hacer, y que debe `crear` una nueva imagen para el resultado -- en lugar de reemplazar una de las imágenes existentes. Las dos cadenas siguientes le dan los títulos de las imágenes necesarias para el cálculo.

source: Removing title dependancies
de: Beseitigung von Titelabhängigkeiten
es: Eliminación de las dependencias del título

source: The fact that the original image title appears in the above macro is a problem: if you try to run it on another image, you are likely to find that it does not work because `selectWindow` cannot find what it's looking for. So the next step is to remove this title dependency so that the macro can be applied to any (2D) image.
de: Die Tatsache, dass der Titel des Originalbildes im obigen Makro erscheint, ist ein Problem: Wenn Sie versuchen, es auf ein anderes Bild anzuwenden, werden Sie wahrscheinlich feststellen, dass es nicht funktioniert, weil `selectWindow` nicht finden kann, wonach es sucht. Der nächste Schritt besteht also darin, diese Titelabhängigkeit zu entfernen, damit das Makro auf ein beliebiges (2D-)Bild angewendet werden kann.
es: El hecho de que el título de la imagen original aparezca en la macro anterior es un problema: si intenta ejecutarla en otra imagen, es probable que descubra que no funciona porque `selectWindow` no puede encontrar lo que está buscando. Así que el siguiente paso es eliminar esta dependencia del título para que la macro se pueda aplicar a cualquier imagen (2D).

source: There are two ways to go about this. One is to insert a line that tells the macro the title of the image being processed at the start, e.g.
de: Es gibt zwei Möglichkeiten, dies zu tun. Zum einen kann man eine Zeile einfügen, die dem Makro den Titel des zu verarbeitenden Bildes am Anfang mitteilt, z. B.
es: Hay dos maneras de hacerlo. Una es insertar al principio una línea que indique a la macro el título de la imagen que se está procesando, por ejemplo

source: where `getTitle()` is an example of a function that asks for information. The result is then stored as a **variable**, so that any time we type `titleOrig` later this will be replaced by the string corresponding to the original title [^fn_6]. Then we just find anywhere the title appears and replace the text with our new variable name, i.e. in this case by writing
de: wobei `getTitle()` ein Beispiel für eine Funktion ist, die nach Informationen fragt. Das Ergebnis wird dann als **Variable** gespeichert, so dass jedes Mal, wenn wir später `titleOrig` eingeben, diese durch die Zeichenkette ersetzt wird, die dem ursprünglichen Titel entspricht [^fn_6]. Dann suchen wir einfach die Stelle, an der der Titel erscheint, und ersetzen den Text durch unseren neuen Variablennamen, d.h. in diesem Fall, indem wir schreiben
es: donde `getTitle()` es un ejemplo de función que pide información. El resultado se almacena como una **variable**, de forma que cada vez que escribamos `titleOrig` más adelante éste será sustituido por la cadena correspondiente al título original [^fn_6]. Entonces sólo tenemos que encontrar cualquier lugar donde aparezca el título y sustituir el texto por nuestro nuevo nombre de variable, es decir, en este caso escribiendo

source: If we do this, the window we want will _probably_ be activated as required. However, there is a subtle potential problem. It's possible that we have two images open at the same time with identical titles -- in which case it's not clear which window should be selected, and so the results could be unpredictable. A safer approach is to get a reference to the **image ID** rather than its title. The ID is a number that should be unique for each image, which is useful for ImageJ internally but which we do not normally care about unless we are programming. Using IDs, the updated macro code then becomes:
de: Wenn wir dies tun, wird das gewünschte Fenster _wahrscheinlich_ wie gewünscht aktiviert werden. Es gibt jedoch ein subtiles potenzielles Problem. Es ist möglich, dass wir zwei Bilder mit identischen Titeln gleichzeitig geöffnet haben - in diesem Fall ist nicht klar, welches Fenster ausgewählt werden soll, und so könnten die Ergebnisse unvorhersehbar sein. Eine sicherere Methode ist es, einen Verweis auf die **Bild-ID** statt auf den Titel zu erhalten. Die ID ist eine Nummer, die für jedes Bild eindeutig sein sollte, was für ImageJ intern nützlich ist, was uns aber normalerweise nicht interessiert, es sei denn, wir programmieren. Durch die Verwendung von IDs wird der aktualisierte Makrocode dann zu:
es: Si hacemos esto, la ventana que queremos se activará _probablemente_ como es debido. Sin embargo, existe un sutil problema potencial. Es posible que tengamos dos imágenes abiertas al mismo tiempo con títulos idénticos -- en cuyo caso no está claro qué ventana debe seleccionarse, y por tanto los resultados podrían ser impredecibles. Un enfoque más seguro es obtener una referencia al **ID de la imagen** en lugar de su título. El ID es un número que debe ser único para cada imagen, lo que es útil para ImageJ internamente pero que normalmente no nos importa a menos que estemos programando. Usando los IDs, el código actualizado de la macro se convierte entonces en:
