Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/appendices/macros/macro_simulating.po
Languages: es

source: This creates two variables, `x` and `y`, which are used to store the horizontal and vertical coordinates of a pixel. Each starts off set to 0 (so we begin with the pixel at 0,0, i.e. in the top left of the image). The code in the middle is run to set the first pixel value, then the variable `x` is incremented to become 1 -- because `x++` means `add 1 to x`. This process is repeated so long as `x` is less than the image width, `x < width`. When `x` eventually becomes equal to the width, it means that all pixel values on the first row of the image have been rounded. Then `y` is incremented and `x` is reset to zero, before the process repeats and the next row is rounded as well. This continues until `y` is equal to the image height -- at which point the processing is complete [^fn_loops].
es: Esto crea dos variables, `x` e `y`, que se utilizan para almacenar las coordenadas horizontales y verticales de un píxel. Cada uno comienza establecido en 0 (por lo que comenzamos con el píxel en 0,0, es decir, en la parte superior izquierda de la imagen). El código en el medio se ejecuta para establecer el valor del primer píxel, luego la variable `x` se incrementa hasta convertirse en 1, porque `x++` significa `sumar 1 a x`. Este proceso se repite siempre que `x` sea menor que el ancho de la imagen, `x <ancho`. Cuando `x` finalmente se vuelve igual al ancho, significa que todos los valores de píxeles en la primera fila de la imagen se han redondeado. Luego, se incrementa "y" y "x" se restablece a cero, antes de que el proceso se repita y la siguiente fila también se redondee. Esto continúa hasta que `y` sea igual a la altura de la imagen, momento en el que se completa el procesamiento [^fn_loops].

source: Final code
es: código final

source: The final code of my version of the macro is given below:
es: El código final de mi versión de la macro se proporciona a continuación:

source: Uses & limitations
es: Usos y limitaciones

source: Of course, the above macro is based on some assumptions and simplifications. For example, it treats gain as a simple multiplication of the photon counts -- but the gain amplification process also involves some randomness, which introduces extra noise. Because this noise behaves statistically quite like photon noise, the effect can be thought of as decreasing the number of photons that were detected. Also, we have treated the background as a constant that is the same everywhere in an image. In practice, the background usually consists primarily of out-of-focus light from other image planes, and so really should change in different parts of the image, particularly in the widefield case.
es: Por supuesto, la macro anterior se basa en algunas suposiciones y simplificaciones. Por ejemplo, trata la ganancia como una simple multiplicación del número de fotones, pero el proceso de amplificación de la ganancia también implica cierta aleatoriedad, lo que introduce ruido adicional. Debido a que este ruido se comporta estadísticamente como el ruido de los fotones, se puede considerar que el efecto disminuye la cantidad de fotones que se detectaron. Además, hemos tratado el fondo como una constante que es la misma en todas partes de una imagen. En la práctica, el fondo normalmente consiste principalmente en luz desenfocada de otros planos de la imagen, por lo que realmente debería cambiar en diferentes partes de la imagen, particularmente en el caso de campo amplio.

source: Nevertheless, quite a lot of factors have been taken into consideration. By exploring different combinations of settings, you can get a feeling for how they affect overall image quality. For example, you could try:
es: Sin embargo, se han tenido en cuenta bastantes factores. Al explorar diferentes combinaciones de configuraciones, puede tener una idea de cómo afectan la calidad general de la imagen. Por ejemplo, podrías intentar:

source: Increasing the background, while keeping the maximum photon emission the same
es: Aumentar el fondo, manteniendo igual la emisión máxima de fotones

source: Removing the detector offset, or setting it to a negative value
es: Eliminar la compensación del detector o establecerlo en un valor negativo

source: Comparing the effects of binning for images with low and high photon counts
es: Comparación de los efectos de la agrupación para imágenes con recuentos de fotones altos y bajos

source: Creating multiple images from the same source data, and then averaging them together to see how the noise is changed
es: Crear varias imágenes a partir de los mismos datos de origen y luego promediarlas juntas para ver cómo cambia el ruido.

source: When planning to implement some analysis strategy -- particularly if fluorescence intensity measurements are being made -- it may also be useful to test its effectiveness using this macro. To do so, you would need to
es: Cuando se planifica implementar alguna estrategia de análisis, especialmente si se realizan mediciones de intensidad de fluorescencia, también puede resultar útil probar su eficacia utilizando esta macro. Para hacerlo, necesitarías

source: Somehow create a 'perfect', noise and blur-free example image, either manually or by deconvolving a suitably similar sample image
es: Cree de alguna manera una imagen de ejemplo "perfecta", sin ruido ni desenfoque, ya sea manualmente o desconvolucionando una imagen de muestra adecuadamente similar

source: Apply your algorithm to this perfect image to find out what it detects and what conclusions you could draw
es: Aplica tu algoritmo a esta imagen perfecta para saber qué detecta y qué conclusiones podrías sacar

source: Apply the exact same algorithm to a version of the image that has passed through the simulator, and see how different your measurements and conclusions would be.
es: Aplique exactamente el mismo algoritmo a una versión de la imagen que pasó por el simulador y vea cuán diferentes serían sus mediciones y conclusiones.

source: Ideally, the results should be the same in both cases: this would suggest your analysis method is robust and can handle images with different levels of quality. It's more likely that the results are different, however. In that case, the comparison gives you some idea of how affected by the imaging process your measurements are -- and therefore how reliably they relate to the 'real' underlying sample.
es: Idealmente, los resultados deberían ser los mismos en ambos casos: esto sugeriría que su método de análisis es sólido y puede manejar imágenes con diferentes niveles de calidad. Sin embargo, es más probable que los resultados sean diferentes. En ese caso, la comparación le da una idea de cuán afectadas están sus mediciones por el proceso de obtención de imágenes y, por lo tanto, de cuán confiablemente se relacionan con la muestra subyacente "real".

source: If you're unfamiliar with programming, the syntax of loops may look quite strange. Reading through some online tutorials for the ImageJ macro language or for-loops in Java should help demystify what is happening here
es: Si no está familiarizado con la programación, la sintaxis de los bucles puede parecer bastante extraña. Leer algunos tutoriales en línea para el lenguaje de macros ImageJ o bucles for en Java debería ayudar a desmitificar lo que está sucediendo aquí.
