Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/appendices/macros/macro_dog.po
Languages: de, es

source: We had to change `selectWindow` to `selectImage` for the IDs to work. I also changed the title of the duplicated image to something more meaninglessly general -- which required square brackets, because it includes spaces that would otherwise mess things up [^fn_7]. Also, because the duplicated image will be active immediately after it was created, I ask ImageJ for its ID at that point. This lets me then pass the two IDs (rather than titles) to the `imageCalculator` command when necessary.
de: Wir mussten `selectWindow` in `selectImage` ändern, damit die IDs funktionieren. Ich änderte auch den Titel des duplizierten Bildes in etwas allgemeineres - was eckige Klammern erforderte, weil es Leerzeichen enthält, die sonst alles durcheinander bringen würden [^fn_7]. Da das duplizierte Bild sofort nach seiner Erstellung aktiv wird, frage ich ImageJ zu diesem Zeitpunkt nach seiner ID. So kann ich die beiden IDs (und nicht die Titel) bei Bedarf an den Befehl `imageCalculator` weitergeben.
es: Tuvimos que cambiar `selectWindow` a `selectImage` para que los IDs funcionaran. También cambié el título de la imagen duplicada por algo más general -- que requería corchetes, porque incluye espacios que de otro modo estropearían las cosas [^fn_7]. Además, como la imagen duplicada estará activa inmediatamente después de ser creada, le pido a ImageJ su ID en ese momento. Esto me permite pasar los dos IDs (en lugar de los títulos) al comando `imageCalculator` cuando sea necesario.

source: Adding comments
de: Hinzufügen von Kommentaren
es: Añadir comentarios

source: Whenever macros become more complicated, it can be hard to remember exactly what all the parts do and why. It's then a _very_ good idea to add in some extra notes and explanations. This is done by prefixing a line with `//`, after which we can write whatever we like because the macro interpreter will ignore it. These extra notes are called **comments**, and I will add them from now on.
de: Wenn Makros immer komplizierter werden, kann es schwierig sein, sich genau zu merken, was alle Teile tun und warum. Es ist dann eine _sehr_ gute Idee, ein paar zusätzliche Hinweise und Erklärungen einzufügen. Dazu wird einer Zeile ein `//` vorangestellt, nach dem wir schreiben können, was wir wollen, da der Makrointerpreter es ignoriert. Diese zusätzlichen Hinweise werden **Kommentare** genannt, und ich werde sie von nun an hinzufügen.
es: Cuando las macros se complican, puede ser difícil recordar exactamente qué hacen todas las partes y por qué. Entonces es _muy_ buena idea añadir algunas notas y explicaciones extra. Esto se hace anteponiendo a una línea el prefijo `//`, después del cual podemos escribir lo que queramos porque el intérprete de macros lo ignorará. Estas notas extra se llaman **comentarios**, y las añadiré a partir de ahora.

source: Customizing sigma values
de: Sigma-Werte anpassen
es: Personalización de los valores sigma

source: By changing the size of the Gaussian filters, the macro can be tailored to detecting structures of different sizes. It would be relatively easy to find the `Gaussian Blur` lines and change the sigma values accordingly here, but adjusting settings like this in longer, more complex macros can be awkward. In such cases, it's helpful to extract the settings you might wish to change and include them at the start of the macro.
de: Durch Ändern der Größe der Gauß-Filter kann das Makro auf die Erkennung von Strukturen unterschiedlicher Größe zugeschnitten werden. Es wäre relativ einfach, die "Gaußsche Unschärfe"-Zeilen zu finden und die Sigma-Werte hier entsprechend zu ändern, aber die Anpassung solcher Einstellungen in längeren, komplexeren Makros kann umständlich sein. In solchen Fällen ist es hilfreich, die Einstellungen, die Sie ändern möchten, zu extrahieren und an den Anfang des Makros zu stellen.
es: Cambiando el tamaño de los filtros gaussianos, la macro puede adaptarse para detectar estructuras de diferentes tamaños. Aquí sería relativamente fácil encontrar las líneas `Desenfoque Gaussiano` y cambiar los valores sigma en consecuencia, pero ajustar parámetros como éste en macros más largas y complejas puede resultar incómodo. En estos casos, es útil extraer los ajustes que desee cambiar e incluirlos al principio de la macro.

source: To do this here, insert the following lines at the very beginning:
de: Dazu fügen Sie die folgenden Zeilen ganz am Anfang ein:
es: Para ello, inserte las siguientes líneas al principio:

source: Then, update the later commands to:
de: Aktualisieren Sie dann die späteren Befehle zu:
es: A continuación, actualice los comandos posteriores a:

source: This creates two new variables, which represent the sigma values to use. Now any time you want to change `sigma1` or `sigma2` you do not need to hunt through the macro for the correct lines: you can just update the lines at the top [^fn_8].
de: Dies erzeugt zwei neue Variablen, die die zu verwendenden Sigma-Werte darstellen. Wenn Sie nun `sigma1` oder `sigma2` ändern wollen, brauchen Sie nicht mehr das Makro nach den richtigen Zeilen zu durchsuchen: Sie können einfach die Zeilen am Anfang [^fn_8] aktualisieren.
es: Esto crea dos nuevas variables, que representan los valores sigma a utilizar. Ahora, cada vez que desee cambiar `sigma1` o `sigma2` no necesita buscar en la macro las líneas correctas: sólo tiene que actualizar las líneas en la parte superior [^fn_8].

source: Adding interactivity
de: Hinzufügen von Interaktivität
es: Añadir interactividad

source: Usually I would stop at this point. Still, you might wish to share your macro with someone lacking your macro modification skills, in which case it would be useful to give this person a dialog box into which they could type the Gaussian sigma values that they wanted. An easy way to do this is to remove the sigma value information from the `run` command lines, giving
de: Normalerweise würde ich an diesem Punkt aufhören. In diesem Fall wäre es nützlich, dieser Person ein Dialogfeld zur Verfügung zu stellen, in das sie die gewünschten Gauß-Sigmawerte eingeben kann. Eine einfache Möglichkeit, dies zu tun, besteht darin, die Information über den Sigma-Wert aus den "Ausführen"-Befehlszeilen zu entfernen, so dass
es: Normalmente, yo me detendría en este punto. Aún así, es posible que desee compartir su macro con alguien que carezca de sus habilidades de modificación de macros, en cuyo caso sería útil dar a esta persona un cuadro de diálogo en el que pudieran escribir los valores sigma gaussianos que quisieran. Una manera fácil de hacer esto es eliminar la información del valor sigma de las líneas de comando `run`, dando

source: Since {menuselection}`Process --> Filters --> Gaussian Blur` will not then know what size of filters to use, it will ask. The disadvantage of this is that the user is prompted to enter sigma values at two different times as the macro runs, which is slightly more annoying than necessary.
de: Da {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur` dann nicht weiß, welche Größe der Filter zu verwenden ist, fragt es nach. Der Nachteil dabei ist, dass der Benutzer aufgefordert wird, die Sigma-Werte zu zwei verschiedenen Zeiten einzugeben, während das Makro läuft, was etwas lästiger ist als nötig.
es: Como {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur` no sabrá entonces qué tamaño de filtros utilizar, preguntará. La desventaja de esto es que al usuario se le pide que introduzca los valores sigma en dos momentos diferentes mientras se ejecuta la macro, lo que es un poco más molesto de lo necesario.

source: The alternative is to create a dialog box that asks for all the required settings in one go. To do this, update the beginning of your macro to include something like the following:
de: Die Alternative besteht darin, ein Dialogfeld zu erstellen, in dem alle erforderlichen Einstellungen auf einmal abgefragt werden. Dazu aktualisieren Sie den Anfang Ihres Makros und fügen etwas wie das Folgende ein:
es: La alternativa es crear un cuadro de diálogo que solicite todos los ajustes necesarios de una sola vez. Para ello, actualice el inicio de su macro para incluir algo como lo siguiente:

source: The first line generates a dialog box with the title you specify. Each of the next two lines state that the required user input should be a number with the specified prompts and default values. The other lines simply show the dialog box and then read out whatever the user typed and puts it into variables. This is documented in ImageJ's [list of built-in macro functions](https://imagej.nih.gov/ij/developer/macro/functions.html).
de: Die erste Zeile erzeugt ein Dialogfeld mit dem von Ihnen angegebenen Titel. In den nächsten beiden Zeilen wird jeweils angegeben, dass die erforderliche Benutzereingabe eine Zahl mit den angegebenen Eingabeaufforderungen und Standardwerten sein soll. Die anderen Zeilen zeigen einfach das Dialogfeld an und lesen dann aus, was der Benutzer eingegeben hat, und setzen es in Variablen ein. Dies ist in ImageJs [Liste der eingebauten Makrofunktionen] (https://imagej.nih.gov/ij/developer/macro/functions.html) dokumentiert.
es: La primera línea genera un cuadro de diálogo con el título especificado. Cada una de las dos líneas siguientes indica que la entrada requerida por el usuario debe ser un número con las indicaciones y valores por defecto especificados. Las otras líneas simplemente muestran el cuadro de diálogo y luego leen lo que el usuario escribió y lo pone en variables. Esto está documentado en la [lista de funciones macro incorporadas] de ImageJ (https://imagej.nih.gov/ij/developer/macro/functions.html).

source: You can download the complete example macro [here](https://gist.github.com/petebankhead/53c0651dd1ad4f455622fc8eeefdc21e).
de: Sie können das vollständige Beispielmakro [hier] herunterladen (https://gist.github.com/petebankhead/53c0651dd1ad4f455622fc8eeefdc21e).
es: Puede descargar la macro de ejemplo completa [aquí](https://gist.github.com/petebankhead/53c0651dd1ad4f455622fc8eeefdc21e).

source: Installing the macro
de: Installation des Makros
es: Instalación de la macro

source: If you'd like the macro to appear as an entry in ImageJ's menus, you have a couple of options.
de: Wenn Sie möchten, dass das Makro als Eintrag in den Menüs von ImageJ erscheint, haben Sie mehrere Möglichkeiten.
es: Si quieres que la macro aparezca como una entrada en los menús de ImageJ, tienes un par de opciones.

source: One is the tempting {menuselection}`Plugins --> Macros --> Install...`. This works, but whenever I tested it I found that it only retains the macro until ImageJ is restarted.
de: Eine ist die verlockende {menuselection}`Plugins --&gt; Makros --&gt; Installieren...`. Das funktioniert, aber immer wenn ich es getestet habe, habe ich festgestellt, dass das Makro nur so lange erhalten bleibt, bis ImageJ neu gestartet wird.
es: Una es la tentadora {menuselection}`Plugins --&gt; Macros --&gt; Instalar...`. Esto funciona, pero siempre que lo he probado he visto que sólo retiene la macro hasta que se reinicia ImageJ.

source: More usefully, {menuselection}`Plugins --> Install...` will prompt you to first select the file containing your macro, and then to save it within the *Plugins* directory of ImageJ itself. As long as the macro file you choose has an underscore in its name, it should appear as its own entry towards the bottom of the {menuselection}`Plugins` menu -- and be retained even when ImageJ is relaunched.
de: Unter {menuselection}`Plugins --&gt; Installieren...` werden Sie aufgefordert, zuerst die Datei auszuwählen, die Ihr Makro enthält, und sie dann im *Plugins* Verzeichnis von ImageJ selbst zu speichern. Solange die von Ihnen gewählte Makrodatei einen Unterstrich im Namen hat, sollte sie als eigener Eintrag am unteren Ende des {menuselection}`Plugins`-Menüs erscheinen -- und auch dann erhalten bleiben, wenn ImageJ neu gestartet wird.
es: Más útil, {menuselection}`Plugins --&gt; Install...` te pedirá que primero selecciones el archivo que contiene tu macro, y luego que lo guardes dentro del directorio *Plugins* del propio ImageJ. Siempre y cuando el archivo de macro que elijas tenga un guión bajo en su nombre, debería aparecer como su propia entrada en la parte inferior del menú `Plugins` de {menuselection}, y se conservará incluso cuando se vuelva a iniciar ImageJ.

source: Suggested improvements
de: Vorgeschlagene Verbesserungen
es: Mejoras propuestas

source: You should now have a macro that does something vaguely useful, and which will work on most 2D images. It could nevertheless still be enhanced in many ways. For example,
de: Sie sollten nun ein Makro haben, das etwas halbwegs Sinnvolles tut und mit den meisten 2D-Bildern funktioniert. Es könnte jedoch noch in vielerlei Hinsicht verbessert werden. Zum Beispiel,
es: Ahora debería tener una macro que hace algo vagamente útil, y que funcionará en la mayoría de las imágenes 2D. No obstante, podría mejorarse de muchas maneras. Por ejemplo,

source: You could close any unwanted images (e.g. the original and its duplicate) by selecting their IDs, and then inserting `close();` commands afterwards.
de: Sie können unerwünschte Bilder (z. B. das Original und sein Duplikat) schließen, indem Sie ihre IDs auswählen und anschließend die Befehle `close();` einfügen.
es: Puede cerrar las imágenes no deseadas (por ejemplo, el original y su duplicado) seleccionando sus ID y, a continuación, insertando comandos `close();`.

source: You could make the macro work on entire image stacks. If you want it to process each plane separately, this involves only inserting the words `stack` and `duplicate` in several places -- by recording a new macro in the same way, but using a stack as your example image, you can see where to do this. If you want the filtering to be applied in 3D, you can use the {menuselection}`Process --> Filters --> Gaussian Blur 3D...` command instead of {menuselection}`Process --> Filters --> Gaussian Blur...`
de: Sie können das Makro mit ganzen Bildstapeln arbeiten lassen. Wenn Sie möchten, dass es jede Ebene einzeln bearbeitet, müssen Sie nur die Wörter "Stapel" und "duplizieren" an mehreren Stellen einfügen. Wenn Sie ein neues Makro auf dieselbe Weise aufzeichnen, aber einen Stapel als Beispielbild verwenden, können Sie sehen, wo Sie dies tun müssen. Wenn Sie möchten, dass die Filterung in 3D angewendet wird, können Sie den Befehl {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur 3D...` anstelle von {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur...` verwenden.
es: Puedes hacer que la macro funcione en pilas de imágenes enteras. Si quieres que procese cada plano por separado, esto sólo implica insertar las palabras `pila` y `duplicar` en varios lugares -- grabando una nueva macro de la misma manera, pero usando una pila como imagen de ejemplo, puedes ver dónde hacerlo. Si quiere que el filtrado se aplique en 3D, puede usar el comando {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur 3D...` en lugar de {menuselection}`Process --&gt; Filters --&gt; Gaussian Blur...`.

source: You could create a log of which images you have processed, possibly including the settings used. The log is output by including a `log(text);` line, where `text` is some string you have created, e.g. `text = Image name: + getTitle()`.
de: Sie könnten ein Protokoll erstellen, in dem Sie die verarbeiteten Bilder und möglicherweise auch die verwendeten Einstellungen angeben. Das Protokoll wird durch Einfügen einer Zeile `log(text);` ausgegeben, wobei `text` eine von Ihnen erstellte Zeichenkette ist, z.B. `text = Bildname: + getTitle()`.
es: Podría crear un registro de las imágenes que ha procesado, incluyendo posiblemente la configuración utilizada. El registro se genera incluyendo una línea `log(text);`, donde `text` es una cadena creada por usted, por ejemplo `text = Nombre de la imagen: + getTitle()`.

source: More impressively, you could turn the macro into a full spot-detector by thresholding the DoG filtered image, and then running the {menuselection}`Analyze --> Analyze Particles...` command. If you want to measure original spot intensities, you should remember to go to {menuselection}`Analyze --> Set Measurements...` to make sure the measurements are redirected to the original image -- which you should possibly have duplicated at the beginning. Without the duplication, the original image will have been Gaussian filtered by the time your macro reaches the measurement stage.
de: Noch beeindruckender ist, dass Sie das Makro in einen vollständigen Spot-Detektor verwandeln können, indem Sie das DoG-gefilterte Bild mit einem Schwellenwert versehen und dann den Befehl {menuselection}`Analyze --&gt; Analyze Particles...` ausführen. Wenn Sie die Intensitäten der Originalflecken messen wollen, sollten Sie daran denken, {menuselection}`Analyze --&gt; Set Measurements...` aufzurufen, um sicherzustellen, dass die Messungen auf das Originalbild umgeleitet werden - das Sie möglicherweise zu Beginn dupliziert haben sollten. Ohne diese Duplizierung wird das Originalbild bereits gaußgefiltert sein, wenn Ihr Makro die Messphase erreicht.
es: Y lo que es más impresionante, puedes convertir la macro en un detector de manchas completo umbralizando la imagen filtrada por la DdG, y luego ejecutando el comando {menuselection}`Analyze --&gt; Analyze Particles...`. Si desea medir las intensidades de las manchas originales, debe recordar ir a {menuselection}`Analyze --&gt; Set Measurements...` para asegurarse de que las mediciones son redirigidas a la imagen original -- que posiblemente debería haber duplicado al principio. Sin la duplicación, la imagen original habrá sido filtrada por Gauss cuando su macro llegue a la etapa de medición.

source: In any case, the process of developing a macro is usually the same:
de: In jedem Fall ist der Prozess der Entwicklung eines Makros in der Regel derselbe:
es: En cualquier caso, el proceso de elaboración de una macro suele ser el mismo:

source: Record a macro that does basically the right thing
de: Aufzeichnung eines Makros, das im Grunde das Richtige tut
es: Grabar una macro que haga básicamente lo correcto

source: Remove all the superfluous lines (contrast adjustment, errant clicking etc.)
de: Entfernen Sie alle überflüssigen Zeilen (Kontrastanpassung, fehlerhaftes Klicken usw.)
es: Elimine todas las líneas superfluas (ajuste del contraste, clics erróneos, etc.)

source: Replace the image titles with image ID references
de: Ersetzen Sie die Bildtitel durch Bild-ID-Referenzen
es: Sustituir los títulos de las imágenes por referencias de ID de imagen

source: Add comments to describe what the macro is doing
de: Kommentare hinzufügen, um zu beschreiben, was das Makro tut
es: Añadir comentarios para describir lo que hace la macro

source: Track down bugs and make improvements
de: Aufspüren von Fehlern und Durchführung von Verbesserungen
es: Detectar errores y realizar mejoras

source: There is nothing special about `titleOrig` -- this text can be changed to any variable name you like, so long as it's one word and does not contain special characters.
de: Es gibt nichts Besonderes an `titleOrig` - dieser Text kann in jeden beliebigen Variablennamen geändert werden, solange er aus einem Wort besteht und keine Sonderzeichen enthält.
es: No hay nada especial sobre `titleOrig` -- este texto puede ser cambiado por cualquier nombre de variable que desee, siempre y cuando sea una palabra y no contenga caracteres especiales.

source: In ImageJ's macro language, spaces in the string telling a command what to do are used to indicate that a separate piece of information is being given. So titles or file names that require spaces need to be put inside square brackets.
de: In der Makrosprache von ImageJ werden Leerzeichen in der Zeichenkette, die einem Befehl sagt, was zu tun ist, verwendet, um anzuzeigen, dass ein separater Teil der Information gegeben wird. Titel oder Dateinamen, die Leerzeichen erfordern, müssen also in eckige Klammern gesetzt werden.
es: En el lenguaje de macros de ImageJ, los espacios en la cadena que indica a un comando lo que debe hacer se utilizan para indicar que se está dando una información separada. Por lo tanto, los títulos o nombres de archivo que requieren espacios deben colocarse entre corchetes.

source: Note that `+` is used to join multiple strings into one, converting numbers into strings as needed. Therefore in this case the lines `sigma=+2` and `sigma=+sigma2` would each give us the same result: one longer string with the extra part appended at the end, i.e.`sigma=2`.
de: Beachten Sie, dass `+` verwendet wird, um mehrere Zeichenketten zu einer einzigen zu verbinden, indem Zahlen in Zeichenketten umgewandelt werden. Daher würden in diesem Fall die Zeilen `sigma=+2` und `sigma=+sigma2` jeweils dasselbe Ergebnis liefern: eine längere Zeichenkette mit dem zusätzlichen Teil am Ende, d.h. `sigma=2`.
es: Tenga en cuenta que `+` se utiliza para unir varias cadenas en una, convirtiendo los números en cadenas según sea necesario. Por lo tanto, en este caso las líneas `sigma=+2` y `sigma=+sigma2` nos darían el mismo resultado: una cadena más larga con la parte extra añadida al final, es decir, `sigma=2`.
