Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/appendices/macros/macro_simulating.po
Languages: es

source: Simulating image formation
es: Simulando la formación de imágenes

source: Introduction
es: Introducción

source: The Difference of Gaussians macro developed in {ref}`chap_macro_intro` was useful, but quite simple. This section contains an extended practical, the goal of which is to develop a somewhat more sophisticated macro that takes an 'ideal' image, and then simulates how it would look after being recorded by a fluorescence microscope. It can be used not only to get a better understanding of the image formation process, but also to generate test data for analysis algorithms. By creating simulations with different settings, we can investigate how our results might be affected by changes in image acquisition and quality.
es: La macro Diferencia de Gaussianas desarrollada en {ref}`chap_macro_intro` fue útil, pero bastante simple. Esta sección contiene una práctica ampliada, cuyo objetivo es desarrollar una macro algo más sofisticada que tome una imagen "ideal" y luego simule cómo se vería después de ser registrada por un microscopio de fluorescencia. Puede utilizarse no sólo para comprender mejor el proceso de formación de imágenes, sino también para generar datos de prueba para algoritmos de análisis. Al crear simulaciones con diferentes configuraciones, podemos investigar cómo nuestros resultados podrían verse afectados por cambios en la adquisición y la calidad de la imagen.

source: Image formation summary
es: Resumen de formación de imágenes

source: The following is a summary of the aspects of image formation discussed in this book:
es: El siguiente es un resumen de los aspectos de la formación de imágenes discutidos en este libro:

source: Images are composed of pixels, each of which has a **single numeric value** (not a color!).
es: Las imágenes se componen de píxeles, cada uno de los cuales tiene un **valor numérico único** (¡no un color!).

source: The value of a pixel in fluorescence microscopy relates to a number of detected **photons** -- or, more technically, the charge of the electrons produced by the photons striking a detector.
es: El valor de un píxel en microscopía de fluorescencia se relaciona con una cantidad de **fotones** detectados o, más técnicamente, la carga de los electrones producidos por los fotones que chocan contra un detector.

source: Images can have many **dimensions**. The number of dimensions is essentially the number of things you need to know to identify each pixel (e.g. time point, channel number, _x_ coordinate, _y_ coordinate, _z_ slice).
es: Las imágenes pueden tener muchas **dimensiones**. El número de dimensiones es esencialmente el número de cosas que necesita saber para identificar cada píxel (por ejemplo, punto temporal, número de canal, coordenada _x_, coordenada _y_, segmento _z_).

source: The two main factors that limit image quality are **blur** and **noise**. Both are inevitable, and neither can be completely overcome.
es: Los dos factores principales que limitan la calidad de la imagen son el **desenfoque** y el **ruido**. Ambos son inevitables y ninguno puede superarse por completo.

source: Blur is characterized by the **point spread function (PSF)** of the microscope, which is the 3D volume that would be the result of imaging a single light-emitting point. It acts as a **convolution**.
es: El desenfoque se caracteriza por la **función de dispersión de puntos (PSF)** del microscopio, que es el volumen 3D que sería el resultado de obtener imágenes de un único punto emisor de luz. Actúa como una **convolución**.

source: In the focal plane, the image of a point is an **Airy pattern**. Most of the light is contained within a central region, the **Airy disk**.
es: En el plano focal, la imagen de un punto es un **patrón Airy**. La mayor parte de la luz está contenida dentro de una región central, el **disco Airy**.

source: The **spatial resolution** is a measure of the separation that must exist between structures before they can adequately be distinguished as separate, and relates to the size of the PSF (or Airy disk in 2D).
es: La **resolución espacial** es una medida de la separación que debe existir entre estructuras antes de que puedan distinguirse adecuadamente como separadas, y se relaciona con el tamaño del PSF (o disco de Airy en 2D).

source: The two main types of noise are **photon noise** and **read noise**. The former is caused by the randomness of photon emission, while the latter arises from imprecisions in quantifying numbers of detected photons.
es: Los dos tipos principales de ruido son el **ruido de fotones** y el **ruido de lectura**. El primero es causado por la aleatoriedad de la emisión de fotones, mientras que el segundo surge de imprecisiones en la cuantificación del número de fotones detectados.

source: **Detecting more photons** helps to overcome the problems caused by _both_ types of noise.
es: **Detectar más fotones** ayuda a superar los problemas causados por _ambos_ tipos de ruido.

source: Different types of microscope have different advantages and costs in terms of **spatial information**, **temporal resolution** and **noise**.
es: Los distintos tipos de microscopio tienen diferentes ventajas y costes en términos de **información espacial**, **resolución temporal** y **ruido**.

source: **PMTs** are used to detect photons for single pixels, while **CCDs** and **EMCCDs** are used to detect photons for many pixels in parallel.
es: Los **PMT** se utilizan para detectar fotones de un solo píxel, mientras que los **CCD** y **EMCCD** se utilizan para detectar fotones de muchos píxeles en paralelo.

source: The macro in this chapter will work for 2D images, and simulate the three main components:
es: La macro de este capítulo funcionará para imágenes 2D y simulará los tres componentes principales:

source: the blur of the PSF
es: el desenfoque del PSF

source: photon noise
es: ruido de fotones

source: read noise
es: leer ruido

source: Furthermore, the macro will ultimately be written in such a way that allows us to investigate the effects of changing some additional parameters:
es: Además, la macro finalmente se escribirá de tal manera que nos permita investigar los efectos de cambiar algunos parámetros adicionales:

source: the size of the PSF (related to the objective lens NA and microscope type)
es: el tamaño del PSF (relacionado con la lente del objetivo NA y el tipo de microscopio)

source: the amount of fluorescence being emitted from the brightest region
es: la cantidad de fluorescencia que se emite desde la región más brillante

source: the amount of background (from stray light and other sources)
es: la cantidad de fondo (de luz parásita y otras fuentes)

source: the exposure time (and therefore number of detected photons)
es: el tiempo de exposición (y por lo tanto el número de fotones detectados)

source: the detector's offset
es: compensación del detector

source: the detector's gain
es: la ganancia del detector

source: the detector's read noise
es: El ruido de lectura del detector.

source: camera binning
es: agrupación de cámaras

source: bit-depth
es: profundidad de bits

source: Recording the main steps
es: Grabar los pasos principales.

source: It doesn't really matter which image you use for this, but I recommend a single-channel 2D image that starts out without any obvious noise (e.g. the *Happy cell.tif* image). After starting the macro recorder, complete the following steps to create the main structure for the macro:
es: Realmente no importa qué imagen uses para esto, pero recomiendo una imagen 2D de un solo canal que comience sin ningún ruido obvio (por ejemplo, la imagen *Happy cell.tif*). Después de iniciar la grabadora de macros, complete los siguientes pasos para crear la estructura principal de la macro:

source: Example input image
es: Imagen de entrada de ejemplo

source: Example output image
es: Imagen de salida de ejemplo

source: Ensure the starting image is 32-bit.
es: Asegúrese de que la imagen inicial sea de 32 bits.

source: Run {menuselection}`Process --> Filters --> Gaussian Blur...` using a sigma value of 2 to simulate the convolution with the PSF.
es: Ejecute {menuselection}`Proceso --> Filtros --> Desenfoque Gaussiano...` usando un valor sigma de 2 para simular la convolución con el PSF.

source: Here, we will assume that there are some background photons from other sources, but around the same number at every pixel in the image. So we can simply add a constant to this image using {menuselection}`Add...`. The value should be small, perhaps 10.
es: Aquí asumiremos que hay algunos fotones de fondo de otras fuentes, pero aproximadamente el mismo número en cada píxel de la imagen. Así que simplemente podemos agregar una constante a esta imagen usando {menuselection}`Add...`. El valor debería ser pequeño, quizás 10.

source: The image now contains the 'average rates of photon emission' that we would normally like to have for one particular exposure time (i.e. it is noise-free). If we change the exposure time, we should change the pixel values similarly so that the rates remain the same. Because adjusting the exposure works like a multiplication, we can use the {menuselection}`Process --> Math --> Multiply...` command. Set it to a 'default' value of 1 for now.
es: La imagen ahora contiene las "tasas promedio de emisión de fotones" que normalmente nos gustaría tener para un tiempo de exposición particular (es decir, está libre de ruido). Si cambiamos el tiempo de exposición, deberíamos cambiar los valores de píxeles de manera similar para que las tasas sigan siendo las mismas. Debido a que ajustar la exposición funciona como una multiplicación, podemos usar el comando {menuselection}`Proceso --> Matemáticas --> Multiplicar...`. Configúrelo en un valor 'predeterminado' de 1 por ahora.

source: To convert the photon emission rates into actual photon counts that we could potentially detect, we need to simulate photon noise by replacing each pixel by a random value from a Poisson distribution that that has the same $\lambda$ as the rate itself. At the time of writing, there's no built-in command in ImageJ or Fiji to simulate Poisson noise but we can install *RandomJ* using the instructions at https://imagescience.org/meijering/software/randomj/. Then add noise by calling {menuselection}`Plugins --> RandomJ --> RandomJ Poisson`, making sure to set the {guilabel}`Insertion:` value to {guilabel}`Modulatory`. The {guilabel}`Mean` value will be ignored, so its setting does not matter.
es: Para convertir las tasas de emisión de fotones en recuentos de fotones reales que potencialmente podríamos detectar, necesitamos simular el ruido de los fotones reemplazando cada píxel por un valor aleatorio de una distribución de Poisson que tenga el mismo $\lambda$ que la tasa misma. Al momento de escribir este artículo, no hay ningún comando incorporado en ImageJ o Fiji para simular el ruido de Poisson, pero podemos instalar *RandomJ* siguiendo las instrucciones en https://imagescience.org/meijering/software/randomj/. Luego agregue ruido llamando a {menuselection}`Plugins --> RandomJ --> RandomJ Poisson`, asegurándose de configurar {guilabel}` Inserción:` valor a {guilabel}`Modulatorio`. El valor {guilabel}`Mean` se ignorará, por lo que su configuración no importa.

source: Notice that all the pixels should now have integer values: you cannot detect parts of photons.
es: Observe que todos los píxeles ahora deberían tener valores enteros: no puede detectar partes de fotones.

source: The detector gain scales up the number of electrons produced by detected photons. Make room for it by including another multiplication, although for now set the value to 1 (i.e. no extra gain).
es: La ganancia del detector aumenta la cantidad de electrones producidos por los fotones detectados. Hazle espacio incluyendo otra multiplicación, aunque por ahora establece el valor en 1 (es decir, sin ganancia adicional).

source: Simulate the detector offset by adding another constant, e.g. 100.
es: Simule la compensación del detector agregando otra constante, p.e. 100.

source: Add read noise with {menuselection}`Process --> Noise --> Add Specified Noise...`, setting the standard deviation to 5.
es: Agregue ruido de lectura con {menuselection}`Proceso --> Ruido --> Agregar ruido especificado...`, estableciendo la desviación estándar en 5.

source: Clip any negative values, by running {menuselection}`Process --> Math --> Min...` and setting the value to 0.
es: Recorte cualquier valor negativo ejecutando {menuselection}`Process --> Math --> Min...` y estableciendo el valor en 0.

source: Clip any positive values that exceed the bit-depth, by running {menuselection}`Process --> Math --> Max...`. To assume an a 8-bit image, set the value to 255.
es: Recorte cualquier valor positivo que exceda la profundidad de bits ejecutando {menuselection}`Process --> Math --> Max...`. Para asumir una imagen de 8 bits, establezca el valor en 255.

source: Now is a good time to clean up the code by removing any unnecessary lines, adding suitable comments, and bringing any interesting variables up to the top of the macro so that they can be easily modified later (as in {ref}`chap_macro_dog`). We should also duplicate the image to avoid accidentally modifying the original. The end result should look something like this:
es: Ahora es un buen momento para limpiar el código eliminando líneas innecesarias, agregando comentarios adecuados y colocando cualquier variable interesante en la parte superior de la macro para que pueda modificarse fácilmente más adelante (como en {ref}`chap_macro_dog`). También debemos duplicar la imagen para evitar modificar accidentalmente el original. El resultado final debería verse así:

source: You would have a perfectly respectable macro if you stopped now, but the following section contains some ways in which it may be improved.
es: Tendría una macro perfectamente respetable si se detuviera ahora, pero la siguiente sección contiene algunas formas en las que se puede mejorar.

source: Making improvements
es: Haciendo mejoras

source: Normalizing the image
es: Normalizando la imagen

source: The results you get from running the above macro will change depending upon the original range of the image that you use: that is, an image that starts off with high-valued pixels will end up having much less noise. To compensate for this somewhat, we can first normalize the image so that all pixels fall into the range 0–1. To do this, we need to determine the current range of pixel values, which can be found out using the macro function:
es: Los resultados que obtenga al ejecutar la macro anterior cambiarán según el rango original de la imagen que utilice: es decir, una imagen que comienza con píxeles de alto valor terminará teniendo mucho menos ruido. Para compensar esto un poco, primero podemos normalizar la imagen para que todos los píxeles estén en el rango 0–1. Para hacer esto, necesitamos determinar el rango actual de valores de píxeles, que se puede encontrar usando la función macro:

source: After running this, four variables are created giving the `mean`, `minimum` and `maximum` pixel values in the image, along with the total image `area`. Normalization is now possible using {menuselection}`Subtract` and {menuselection}`Divide` commands, and adjusting their values. In the end this gives us
es: Después de ejecutar esto, se crean cuatro variables que proporcionan los valores de píxeles "media", "mínimo" y "máximo" en la imagen, junto con el "área" total de la imagen. La normalización ahora es posible usando los comandos {menuselection}`Restar` y {menuselection}`Dividir` y ajustando sus valores. Al final esto nos da

source: Varying the fluorescence emission rate
es: Variación de la tasa de emisión de fluorescencia.

source: The new problem we will have after normalization is that there will be a maximum photon emission rate of 1 in the brightest part of the image, which will give us a image dominated completely by noise. We can change this by multiplying the pixels again, and so define what we want the emission rate to be in the brightest part of the image. I suggest creating a variable for this, and setting its value to 10. Then add the following line immediately after normalization:
es: El nuevo problema que tendremos tras la normalización es que habrá una tasa máxima de emisión de fotones de 1 en la parte más brillante de la imagen, lo que nos dará una imagen dominada completamente por el ruido. Esto lo podemos cambiar multiplicando de nuevo los píxeles, y así definir cuál queremos que sea la tasa de emisión en la parte más brillante de la imagen. Sugiero crear una variable para esto y establecer su valor en 10. Luego agregue la siguiente línea inmediatamente después de la normalización:

source: Modifying this value allows you to change between simulating samples that are fluorescing more or less brightly. For a less bright sample, you will most likely need to increase the exposure time to get a similar amount of signal -- but beware that increasing the exposure time also involves collecting more unhelpful background photons, so is not quite so good as having a sample where the important parts are intrinsically brighter.
es: Modificar este valor le permite cambiar entre simular muestras que tienen una fluorescencia más o menos intensa. Para una muestra menos brillante, lo más probable es que necesite aumentar el tiempo de exposición para obtener una cantidad similar de señal, pero tenga en cuenta que aumentar el tiempo de exposición también implica recolectar más fotones de fondo inútiles, por lo que no es tan bueno como tener una muestra. donde las partes importantes son intrínsecamente más brillantes.

source: Simulating binning
es: Simulando agrupación

source: The main idea of [binning](sec_detectors_binning) is that the electrons from multiple pixels are added together prior to readout, so that the number of electrons being quantified is bigger relative to the read noise. For 2×2 binning this involves splitting the image into distinct 2×2 pixel blocks, and creating another image in which the value of each pixel is the sum of the values within the corresponding block.
es: La idea principal de [binning](sec_detectors_binning) es que los electrones de múltiples píxeles se suman antes de la lectura, de modo que la cantidad de electrones que se cuantifican sea mayor en relación con el ruido de lectura. Para la agrupación 2×2, esto implica dividir la imagen en distintos bloques de 2×2 píxeles y crear otra imagen en la que el valor de cada píxel sea la suma de los valores dentro del bloque correspondiente.

source: This could be done using the {menuselection}`Image --> Transform --> Bin` command, with a {guilabel}`shrink factor` of 2 and the {guilabel}`Sum` bin method. The macro recorder can again be used to get the main code that is needed. After some modification, this becomes
es: Esto se podría hacer usando el comando {menuselection}`Imagen --> Transformar --> Bin`, con un {guilabel}`factor de reducción ` de 2 y el método bin {guilabel}`Sum`. La grabadora de macros se puede utilizar nuevamente para obtener el código principal que se necesita. Después de algunas modificaciones, esto se convierte en

source: By enclosing the line within a _code block_ (limit by the curly brackets) and beginning the block with `if (doBinning)`, it's easy to control whether binning is applied or not. You simply add an extra variable to your list at the start of the macro
es: Al encerrar la línea dentro de un _bloque de código_ (limitado por las llaves) y comenzar el bloque con `if (doBinning)`, es fácil controlar si se aplica la agrupación o no. Simplemente agrega una variable adicional a su lista al comienzo de la macro

source: to turn binning on, or
es: para activar la agrupación, o

source: to turn it off. The lines of code that perform the binning should be inserted _before_ the addition of read noise.
es: para apagarlo. Las líneas de código que realizan la agrupación deben insertarse _antes_ de agregar ruido de lectura.

source: Varying bit-depths
es: Profundidad de bits variables

source: Varying the simulated bit-depths by changing the maximum value allowed in the image takes a little work: you need to know that the maximum value in an 8-bit image is 255, while for a 12-bit image it is 4095 and so on. It is more intuitive to just change the image bit-depth and have the macro do the calculation for you. To do this, you can replace the `maxVal = 255;` variable at the start of the macro with `nBits = 8;` and then update the later clipping code to become
es: Variar las profundidades de bits simuladas cambiando el valor máximo permitido en la imagen requiere un poco de trabajo: necesita saber que el valor máximo en una imagen de 8 bits es 255, mientras que para una imagen de 12 bits es 4095 y así sucesivamente. . Es más intuitivo simplemente cambiar la profundidad de bits de la imagen y dejar que la macro haga el cálculo por usted. Para hacer esto, puede reemplazar la variable `maxVal = 255;` al inicio de la macro con `nBits = 8;` y luego actualizar el código de recorte posterior para que se convierta en

source: Here, `pow(2, nBits)` is a function that gives you the value of 2<sup>nBits</sup>. Now it's easier to explore the difference between 8-bit, 12-bit and 14-bit images (which are the main bit-depths normally associated with microscope detectors, even if the resulting image is stored as 16-bit).
es: Aquí, `pow(2, nBits)` es una función que le da el valor de 2<sup>nBits</sup>. Ahora es más fácil explorar la diferencia entre imágenes de 8, 12 y 14 bits (que son las principales profundidades de bits normalmente asociadas con los detectores de microscopio, incluso si la imagen resultante se almacena como 16 bits).

source: Rounding to integer values
es: Redondeo a valores enteros

source: The macro has already clipped the image to a specified bit-depth, but it still contains 32-bit data and so potentially has non-integer values that could not be stored in the 8 or 16-bit images a microscope typically provides as output. Therefore it remains to round the values to the nearest integer.
es: La macro ya ha recortado la imagen a una profundidad de bits específica, pero todavía contiene datos de 32 bits y, por lo tanto, potencialmente tiene valores no enteros que no se pueden almacenar en las imágenes de 8 o 16 bits que un microscopio normalmente proporciona como salida. Por lo tanto, queda redondear los valores al número entero más cercano.

source: There are a few ways to do this: we can convert the image using {menuselection}`Image --> Type -->` commands, though then we need to be careful about whether there will be any scaling applied. However, we can avoid thinking about this if we just apply the rounding ourselves. To do it we need to visit each pixel, extract its value, round the value to the nearest whole number, and put it back in the image. This requires using **loops**. The code, which should be added at the end of the macro, looks like this:
es: Hay algunas formas de hacer esto: podemos convertir la imagen usando los comandos {menuselection}`Imagen --> Tipo -->`, aunque luego debemos tener cuidado sobre si hay será cualquier escala aplicada. Sin embargo, podemos evitar pensar en esto si aplicamos el redondeo nosotros mismos. Para hacerlo necesitamos visitar cada píxel, extraer su valor, redondear el valor al número entero más cercano y volver a colocarlo en la imagen. Esto requiere el uso de **bucles**. El código, que debe agregarse al final de la macro, tiene este aspecto:
