Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/python/python.po
Languages: de, es

source: Python Primer
de: Python-Grundierung
es: Descripción general de Python

source: Work in progress!
de: In Arbeit!
es: ¡Trabajo en progreso!

source: This section isn't complete yet.
de: Dieser Abschnitt ist noch nicht vollständig.
es: Esta sección aún no está completa.

source: This section aims to provide *just enough* info to demystify the weird symbols and to get started with the Python [Python](https://www.python.org) programming language.
de: Dieser Abschnitt soll *gerade genug* Informationen liefern, um die seltsamen Symbole zu entmystifizieren und den Einstieg in die Programmiersprache Python [Python](https://www.python.org) zu erleichtern.
es: Esta sección tiene como objetivo proporcionar información *suficiente* para desmitificar los símbolos extraños y comenzar con el lenguaje de programación Python [Python](https://www.python.org).

source: To make sense of the code throughout this handbook see, it helps to be familiar with four main things:
de: Um den Code in diesem Handbuch verstehen zu können, ist es hilfreich, mit vier wichtigen Dingen vertraut zu sein:
es: Para entender el código de este manual, es útil estar familiarizado con cuatro cosas principales:

source: **Comments** - which help explain what's happening
de: **Kommentare** – die helfen zu erklären, was passiert
es: **Comentarios** - que ayudan a explicar lo que está sucediendo

source: **Variables** - which store values
de: **Variablen** – die Werte speichern
es: **Variables** - que almacenan valores

source: **Functions** - which do stuff with variables
de: **Funktionen** – die Dinge mit Variablen erledigen
es: **Funciones** - que hacen cosas con variables

source: **Modules** - which need to be imported to use the useful stuff (like functions) they contain
de: **Module** – die importiert werden müssen, um die darin enthaltenen nützlichen Dinge (z. B. Funktionen) nutzen zu können
es: **Módulos** - que deben importarse para utilizar las cosas útiles (como funciones) que contienen

source: This is far from everything you need to know to master programming, but it might just be enough to get started - and getting started if often the hardest part.
de: Das ist bei weitem nicht alles, was Sie wissen müssen, um das Programmieren zu beherrschen, aber es könnte gerade für den Einstieg ausreichen – und der Einstieg ist oft der schwierigste Teil.
es: Esto está lejos de ser todo lo que necesitas saber para dominar la programación, pero podría ser suficiente para comenzar, y comenzar es a menudo la parte más difícil.

source: I think it's fair to say that experienced programmers pick up most of what they know as they go along: aided by a great deal of googling* along the way.
de: Ich denke, man kann mit Fug und Recht sagen, dass erfahrene Programmierer sich das meiste von dem, was sie wissen, im Laufe der Zeit aneignen – unterstützt durch viel Googeln* auf dem Weg.
es: Creo que es justo decir que los programadores experimentados aprenden la mayor parte de lo que saben a medida que avanzan: ayudados por una gran cantidad de búsquedas en Google* a lo largo del camino.

source: *-Or the use of some other preferred search engine.
de: *-Oder die Verwendung einer anderen bevorzugten Suchmaschine.
es: *-O el uso de algún otro buscador preferido.

source: Comments
de: Kommentare
es: Comentarios

source: Comments are explanations added to code that help explain what is going on. They aren't essential for the code to *run*, but often are essential to make sense of it. It's a very good idea to add comments to your own code - either for others to read, or for yourself in the future.
de: Kommentare sind dem Code hinzugefügte Erklärungen, die dabei helfen, zu erklären, was vor sich geht. Sie sind nicht unbedingt erforderlich, damit der Code *ausgeführt* wird, aber oft sind sie unerlässlich, um ihm einen Sinn zu geben. Es ist eine sehr gute Idee, Kommentare zu Ihrem eigenen Code hinzuzufügen – entweder für andere zum Lesen oder für Sie selbst in der Zukunft.
es: Los comentarios son explicaciones agregadas al código que ayudan a explicar lo que está sucediendo. No son esenciales para que el código se *ejecute*, pero a menudo son esenciales para que tenga sentido. Es una muy buena idea agregar comentarios a tu propio código, ya sea para que otros los lean o para ti mismo/a en el futuro.

source: In Python, a typical comment starts with a `#`
de: In Python beginnt ein typischer Kommentar mit einem „#“.
es: En Python, un comentario típico comienza con un `#`

source: Variables
de: Variablen

source: Variables provide a place to store stuff: numbers, text, images and so on.
de: Variablen bieten einen Ort zum Speichern von Dingen: Zahlen, Text, Bilder usw.
es: Las variables proporcionan un lugar para almacenar cosas: números, texto, imágenes, etc.

source: You can think of it as a bit like algebra. If you see
de: Man kann es sich ein bisschen wie Algebra vorstellen. Wenn du siehst
es: Puedes pensar en ello como un poco como álgebra. Si tú ves

source: then *x* is the variable.
de: dann ist *x* die Variable.
es: entonces *x* es la variable.

source: When programming, you'll likely use variables all the time for different purposes and to represent different things. The type of the variable will determine what you can do with it. Some examples are given below.
de: Beim Programmieren werden Sie wahrscheinlich ständig Variablen für unterschiedliche Zwecke und zur Darstellung unterschiedlicher Dinge verwenden. Der Typ der Variablen bestimmt, was Sie damit machen können. Nachfolgend finden Sie einige Beispiele.
es: Al programar, es probable que utilices variables todo el tiempo para diferentes propósitos y para representar diferentes cosas. El tipo de variable determinará qué puedes hacer con ella. A continuación se dan algunos ejemplos.

source: Numbers
de: Zahlen
es: Números

source: A variable might be used to represent a number. You *assign* the number to the variable using `=`.
de: Eine Variable kann zur Darstellung einer Zahl verwendet werden. Sie *weisen* der Variablen die Nummer mit „=“ zu.
es: Se podría utilizar una variable para representar un número. Tu *asignas* el número a la variable usando `=`.

source: It's important to note that `=` doesn't really mean 'is equal to' in this case. Rather, when I see
de: Es ist wichtig zu beachten, dass „=“ in diesem Fall nicht wirklich „ist gleich“ bedeutet. Eher, wenn ich sehe
es: Es importante tener en cuenta que "=" en realidad no significa "es igual a" en este caso. Más bien, cuando veo

source: in my mind I read *'x becomes 10'* or alternatively *'set x to 10'*.
de: In meinem Kopf lese ich *'x wird 10'* oder alternativ *'setze x auf 10'*.
es: en mi mente leo *'x se convierte en 10'* o alternativamente *'dale el valor de 10 a x'*.

source: The order is important: the variable being set is on the left and the value it is being set to is on the right. Switching the order can give an error - or a result you might not expect.
de: Die Reihenfolge ist wichtig: Die Variable, die eingestellt wird, steht links und der Wert, auf den sie gesetzt wird, rechts. Das Ändern der Reihenfolge kann zu einem Fehler führen – oder zu einem Ergebnis, das Sie möglicherweise nicht erwarten.
es: El orden es importante: la variable que se establece está a la izquierda y el valor que se establece está a la derecha. Cambiar el orden puede generar un error o un resultado inesperado.

source: If you want to test if a variable is equal to something, you need to use `==` instead. The output of that will be either `True` or `False`.
de: Wenn Sie testen möchten, ob eine Variable gleich etwas ist, müssen Sie stattdessen „==“ verwenden. Die Ausgabe davon ist entweder „True“ oder „False“.
es: Si deseas probar si una variable es igual a algo, debes usar `==` en su lugar. El resultado de eso será "Verdadero" o "Falso".

source: Note that, when using `==`, the order doesn't matter like it does with `=`.
de: Beachten Sie, dass bei der Verwendung von „==“ die Reihenfolge keine Rolle spielt wie bei „=“.
es: Ten en cuenta que, cuando se usa `==`, el orden no importa como ocurre con `=`.

source: You aren't restricted to testing whether a variable itself is equal to a specific value. Rather, you can incorporate extra calculations and compare the results of these calculations to other values or variables.
de: Sie sind nicht darauf beschränkt zu testen, ob eine Variable selbst einem bestimmten Wert entspricht. Stattdessen können Sie zusätzliche Berechnungen einbeziehen und die Ergebnisse dieser Berechnungen mit anderen Werten oder Variablen vergleichen.
es: No estás limitado/a a probar si una variable en sí es igual a un valor específico. Más bien, puedes incorporar cálculos adicionales y comparar los resultados de estos cálculos con otros valores o variables.

source: Strings
de: Saiten
es: Cadena de caracteres o palabras

source: In computer parlance, a piece of text tends to be called a *string*.
de: Im Computerjargon wird ein Textstück meist als *String* bezeichnet.
es: En el lenguaje informático, un fragmento de texto tiende a denominarse *cadena*.

source: You can create a string by enclosing the text in some quotation marks.
de: Sie können eine Zeichenfolge erstellen, indem Sie den Text in Anführungszeichen setzen.
es: Puedes crear una cadena encerrando el texto entre comillas.

source: In Python, both single and double quotation marks can be used.
de: In Python können sowohl einfache als auch doppelte Anführungszeichen verwendet werden.
es: En Python, se pueden utilizar comillas simples y dobles.

source: You can then do things like add strings together using the `+` symbol, which has the effect of concatenating them to create a new string.
de: Anschließend können Sie beispielsweise Zeichenfolgen mithilfe des „+“-Symbols zusammenfügen, wodurch sie zu einer neuen Zeichenfolge verkettet werden.
es: Luego puedes hacer cosas como agregar cadenas usando el símbolo `+`, que tiene el efecto de concatenarlas para crear una nueva cadena.

source: It doesn't *usually* matter whether you use single or double quotes, but it can matter if you want to include the other kind of quotation mark *within* the string.
de: Es spielt *normalerweise* keine Rolle, ob Sie einfache oder doppelte Anführungszeichen verwenden, aber es kann wichtig sein, wenn Sie die andere Art von Anführungszeichen *in* die Zeichenfolge einfügen möchten.
es: *Generalmente* no importa si usa comillas simples o dobles, pero puede importar si deseas incluir el otro tipo de comillas *dentro* de la cadena.

source: In the example above, the `'` within 'wouldn't' was misinterpreted as the end of the string, and an error is the result.
de: Im obigen Beispiel wurde das „“ in „wouldn't“ fälschlicherweise als Ende der Zeichenfolge interpretiert und es kam zu einem Fehler.
es: En el ejemplo anterior, el `'` dentro de 'no haría' se malinterpretó como el final de la cadena y el resultado fue un error.

source: There are two ways to get around that:
de: Es gibt zwei Möglichkeiten, das zu umgehen:
es: Hay dos formas de evitarlo:

source: Use double-quotes
de: Verwenden Sie doppelte Anführungszeichen
es: Utiliza comillas dobles

source: Use `\'` to 'escape' the first quotation mark
de: Verwenden Sie „\“, um das erste Anführungszeichen zu maskieren
es: Utiliza `\'` para 'escapar' de la primera comilla

source: Another way to generate an error is to try to create a string that spans multiple lines.
de: Eine andere Möglichkeit, einen Fehler zu generieren, besteht darin, zu versuchen, eine Zeichenfolge zu erstellen, die sich über mehrere Zeilen erstreckt.
es: Otra forma de generar un error es intentar crear una cadena que abarque varias líneas.

source: One way to get around that is to define the string using *3* double quotation marks `"""`.
de: Eine Möglichkeit, dies zu umgehen, besteht darin, die Zeichenfolge mit *3* doppelten Anführungszeichen „“““ zu definieren.
es: Una forma de evitarlo es definir la cadena usando *3* comillas dobles `"""`.

source: You can use multiline strings like this as an alternative to comments, to avoid needing to add `#` at the beginning.
de: Sie können mehrzeilige Zeichenfolgen wie diese als Alternative zu Kommentaren verwenden, um das Hinzufügen von „#“ am Anfang zu vermeiden.
es: Puedes utilizar cadenas de varias líneas como esta como alternativa a los comentarios, para evitar la necesidad de agregar `#` al principio.

source: Lists
de: Listen
es: Listas

source: Tuples
de: Tupel

source: Dictionaries
de: Wörterbücher
es: Diccionarios

source: Functions
de: Funktionen
es: Funciones

source: Defining functions
de: Funktionen definieren
es: Definiendo funciones

source: Modules
de: Module
es: Módulos

source: Numpy arrays
es: Matrices NumPy
