Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/1-processing_and_analysis/processing_and_analysis.po
Languages: pt_br

source: Image processing & analysis
pt_br: Processamento e análise de imagens

source: Chapter outline
pt_br: Esboço do capítulo

source: **Image processing** involves changing images, usually in ways that will help interpretation later
pt_br: **O processamento de imagens** envolve a alteração de imagens, geralmente de maneiras que ajudarão na interpretação posterior

source: **Image analysis** involves converting images into measurements
pt_br: **A análise de imagens** envolve a conversão de imagens em medidas

source: When image analysis is our goal, we almost always need image processing to get there
pt_br: Quando a análise de imagens é nosso objetivo, quase sempre precisamos de processamento de imagens para chegar lá

source: Introduction
pt_br: Introdução

source: Successfully extracting useful information from microscopy images usually requires triumphing in two main battles.
pt_br: A extração bem-sucedida de informações úteis de imagens microscópicas geralmente requer o triunfo em duas batalhas principais.

source: The first is to overcome limitations in image quality and make the really interesting image content more clearly visible. This involves **image processing**, the output of which is another image. The second is to compute meaningful measurements, which could be presented in tables and summary plots. This is **image analysis**.
pt_br: A primeira é superar as limitações na qualidade da imagem e tornar o conteúdo da imagem realmente interessante mais claramente visível. Isso envolve **processamento de imagem**, cuja saída é outra imagem. A segunda é calcular medidas significativas, que podem ser apresentadas em tabelas e gráficos resumidos. Esta é **análise de imagem**.

source: Our main goal here is analysis -- but processing is almost always indispensable to get us there.
pt_br: Nosso principal objetivo aqui é a análise – mas o processamento é quase sempre indispensável para chegarmos lá.

source: An image analysis workflow
pt_br: Um fluxo de trabalho de análise de imagem

source: So how do we figure out how to analyze our images?
pt_br: Então, como descobrimos como analisar nossas imagens?

source: Ultimately, we need some kind of workflow comprising multiple steps that eventually take us from image to results. Each individual step might be small and straightforward, but the combination is powerful.
pt_br: Em última análise, precisamos de algum tipo de fluxo de trabalho que inclua várias etapas que eventualmente nos levem da imagem aos resultados. Cada passo individual pode ser pequeno e direto, mas a combinação é poderosa.

source: I tend to view the challenge of constructing any scientific image analysis workflow as akin to solving a puzzle. In the end, we hope to extract some kind of quantitative measurements that are justified by the nature of the experiment and the facts of image formation. One of the interesting features of the puzzle is that there is no single, fixed solution.
pt_br: Tenho tendência a ver o desafio de construir qualquer fluxo de trabalho de análise de imagens científicas como algo semelhante a resolver um quebra-cabeça. No final, esperamos extrair algum tipo de medição quantitativa que seja justificada pela natureza do experimento e pelos fatos da formação da imagem. Uma das características interessantes do quebra-cabeça é que não existe uma solução única e fixa.

source: Although this might initially seem inconvenient, it can be liberating: it suggests there is room for lateral thinking and sparks of creativity. The same images could be analyzed in quite different ways. Sometimes giving quite different results, or answering quite different scientific questions.
pt_br: Embora isto possa inicialmente parecer inconveniente, pode ser libertador: sugere que há espaço para pensamento lateral e faíscas de criatividade. As mesmas imagens poderiam ser analisadas de maneiras bastante diferentes. Às vezes, dando resultados bastante diferentes ou respondendo a questões científicas bastante diferentes.

source: Admittedly, if no solution comes to mind after pondering for a while then such an optimistic outlook quickly subsides, and the 'puzzle' may very well turn into an unbearably infuriating 'problem' -- but the point here is that _in principle_ image analysis _can_ be enjoyable. What it takes is:
pt_br: É certo que, se nenhuma solução vier à mente depois de ponderar por um tempo, então essa perspectiva otimista rapidamente desaparece, e o 'quebra-cabeça' pode muito bem se transformar em um 'problema' insuportavelmente irritante - mas o ponto aqui é que _em princípio_ a análise de imagens _pode_ seja agradável. O que é preciso é:

source: a modicum of enthusiasm (please bring your own)
pt_br: um mínimo de entusiasmo (traga o seu próprio)

source: properly-acquired data, including all the necessary metadata (the subject of Part I)
pt_br: dados adquiridos adequadamente, incluindo todos os metadados necessários (o assunto da Parte I)

source: actually *having the tools at your disposal* to solve the puzzle (the subject Part II)
pt_br: na verdade *ter as ferramentas à sua disposição* para resolver o quebra-cabeça (o assunto Parte II)

source: If you're a reluctant puzzler then it also helps to have the good luck not to be working on something horrendously difficult, but that is difficult to control.
pt_br: Se você é um quebra-cabeças relutante, também ajuda ter a sorte de não estar trabalhando em algo terrivelmente difícil, mas que é difícil de controlar.

source: Combining processing tools
pt_br: Combinando ferramentas de processamento

source: Image processing provides a whole host of tools that can be applied to puzzle-solving. When piecing together processing steps to form a workflow, we usually have two main stages:
pt_br: O processamento de imagens fornece uma série de ferramentas que podem ser aplicadas na resolução de quebra-cabeças. Ao reunir as etapas de processamento para formar um fluxo de trabalho, geralmente temos dois estágios principais:

source: **Preprocessing**: the stuff you do to clean up the image, e.g. subtract the background, use a filter to reduce noise
pt_br: **Pré-processamento**: o que você faz para limpar a imagem, por exemplo. subtraia o fundo, use um filtro para reduzir o ruído

source: **Segmentation** the stuff you do to identify the things in the image you care about, e.g. apply a threshold to locate interesting features
pt_br: **Segmentação** o que você faz para identificar o que é importante para você na imagem, por exemplo, aplique um limite para localizar recursos interessantes

source: Having successfully navigated these stages, there are usually some additional tasks remaining (e.g. making measurements of shape, intensity or dynamics). However, these depend upon the specifics of the application and are *usually* not the hard part. If you can identify what you want to quantify, you're a long way towards solving the puzzle.
pt_br: Depois de navegar com sucesso por esses estágios, geralmente restam algumas tarefas adicionais (por exemplo, fazer medições de forma, intensidade ou dinâmica). No entanto, estes dependem das especificidades da aplicação e *geralmente* não são a parte difícil. Se você conseguir identificar o que deseja quantificar, estará um longo caminho para resolver o quebra-cabeça.

source: {numref}`fig-workflow` shows an example of how these ideas can fit together.
pt_br: {numref}`fig-workflow` mostra um exemplo de como essas ideias podem se encaixar.

source: A simple image analysis workflow for detecting and measuring spots in an image.
pt_br: Um fluxo de trabalho simples de análise de imagens para detectar e medir pontos em uma imagem.

source: It won't be possible to cover *all* image processing tools in a book like this. Rather, we will focus on the essential ones needed to get started: thresholds, filters, morphological operations and transforms.
pt_br: Não será possível cobrir *todas* as ferramentas de processamento de imagem em um livro como este. Em vez disso, vamos nos concentrar nos itens essenciais necessários para começar: limites, filtros, operações morfológicas e transformações.

source: These are already enough to solve many image analysis puzzles, and provide the framework to which more can be added later.
pt_br: Isso já é suficiente para resolver muitos quebra-cabeças de análise de imagens e fornece a estrutura à qual mais coisas podem ser adicionadas posteriormente.
