Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/imagej.po
Languages: de, es, pt_br

source: Three different profile plots, based on a rectangle. *(Top)* A regular profile plot from the active 2D slice, using {menuselection}`Analyze --> Plot Profile`. *(Bottom)* Profiles generated by {menuselection}`Image --> Stacks --> Plot Z-axis Profile` along the z-axis *(left)* and across time points *(right)*.
de: Drei verschiedene Profildarstellungen, basierend auf einem Rechteck. *(Oben)* Eine reguläre Profildarstellung aus dem aktiven 2D-Slice mit {menuselection}`Analyze --&gt; Plot Profile`. *(Unten)* Profile, die mit {menuselection}`Image --&gt; Stacks --&gt; Plot Z-axis Profile` entlang der z-Achse *(links)* und über Zeitpunkte *(rechts)* erstellt wurden.
es: Tres perfiles diferentes, basados en un rectángulo. *(Arriba)* Un perfil regular del corte 2D activo, usando {menuselection}`Analyze --&gt; Plot Profile`. *(Abajo)* Perfiles generados por {menuselection}`Image --&gt; Stacks --&gt; Plot Z-axis Profile` a lo largo del eje z *(izquierda)* y a través de puntos temporales *(derecha)*.
pt_br: Três gráficos de perfis diferentes, baseados em um retângulo. *(Topo)* Um gráfico de perfil regular da fatia 2D ativa, usando {menuselection}`Analyze --> Plot Profile`. *(Inferior)* Perfis gerados por {menuselection}`Imagem --> Pilhas --> Plotar perfil do eixo Z` ao longo do eixo z *(esquerda)* e em pontos de tempo *(certo)*.

source: Create a profile plot from any image, by drawing a line ROI and pressing {kbd}`K`.
de: Erstellen Sie ein Profilplot von einem beliebigen Bild, indem Sie eine ROI-Linie zeichnen und {kbd}`K` drücken.
es: Cree un trazado de perfil a partir de cualquier imagen, dibujando una línea ROI y pulsando {kbd}`K`.
pt_br: Crie um gráfico de perfil a partir de qualquer imagem, desenhando uma linha ROI e pressionando {kbd}`K`.

source: As far as ImageJ is concerned, the profile plot itself is an image -- albeit a strange one. This means you can use {menuselection}`Image --> Properties...` to check the pixel size *of the profile plot*.
de: Was ImageJ betrifft, so ist die Profildarstellung selbst ein Bild - wenn auch ein seltsames. Das bedeutet, dass Sie {menuselection}`Bild --&gt; Eigenschaften...` verwenden können, um die Pixelgröße *der Profildarstellung* zu überprüfen.
es: En lo que respecta a ImageJ, el propio trazado del perfil es una imagen, aunque extraña. Esto significa que puede utilizar {menuselection}`Image --&gt; Properties...` para comprobar el tamaño en píxeles *del trazado del perfil*.
pt_br: No que diz respeito ao ImageJ, o gráfico do perfil em si é uma imagem - embora estranha. Isso significa que você pode usar {menuselection}`Image --> Properties...` para verificar o tamanho do pixel *do gráfico do perfil*.

source: What do you notice about the pixel sizes?
de: Was fällt Ihnen an den Pixelgrößen auf?
es: ¿Qué notas en el tamaño de los píxeles?
pt_br: O que você nota sobre os tamanhos dos pixels?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run= https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)

source: You will probably see that the pixel width and height are different. In fact, the pixel width depends upon the scaling of the x-axis and the pixel height depends upon the scaling of the y-axis.
de: Sie werden wahrscheinlich feststellen, dass die Pixelbreite und -höhe unterschiedlich sind. Tatsächlich hängt die Pixelbreite von der Skalierung der x-Achse und die Pixelhöhe von der Skalierung der y-Achse ab.
es: Probablemente verá que la anchura y la altura de los píxeles son diferentes. De hecho, la anchura del píxel depende de la escala del eje x y la altura del píxel depende de la escala del eje y.
pt_br: Você provavelmente verá que a largura e a altura dos pixels são diferentes. Na verdade, a largura do pixel depende da escala do eixo x e a altura do pixel depende da escala do eixo y.

source: This can be quite useful, because it means you can make measurements within the profile plot itself.
de: Dies kann sehr nützlich sein, da Sie so Messungen innerhalb der Profildarstellung selbst vornehmen können.
es: Esto puede resultar muy útil, ya que permite realizar mediciones dentro del propio trazado del perfil.
pt_br: Isto pode ser bastante útil, pois significa que você pode fazer medições dentro do próprio gráfico do perfil.

source: If you want to measure a distance along the x or y axis, you can use the line tool <img src="../../../images/imagej/icons/line.png" /> while pressing {kbd}`Shift`. This forces the line to be perfectly horizontal or perfectly vertical; without {kbd}`Shift` it would be easy to draw a line at a slight diagonal that could give incorrect results.
de: Wenn Sie eine Strecke entlang der X- oder Y-Achse messen möchten, können Sie das Linienwerkzeug <img src="../../../images/imagej/icons/line.png" /> verwenden, während Sie {kbd}"Umschalttaste" drücken. Dadurch wird die Linie gezwungen, perfekt horizontal oder vertikal zu sein; ohne {kbd}`Shift` wäre es leicht, eine Linie mit einer leichten Diagonale zu zeichnen, die falsche Ergebnisse liefern könnte.
es: Si desea medir una distancia a lo largo de los ejes x o y, puede utilizar la herramienta de línea <img src="../../../images/imagej/icons/line.png" /> mientras pulsa {kbd}`Shift`. Esto fuerza a la línea a ser perfectamente horizontal o perfectamente vertical; sin {kbd}`Shift` sería fácil dibujar una línea en una ligera diagonal que podría dar resultados incorrectos.
pt_br: Se quiser medir uma distância ao longo do eixo x ou y, você pode usar a ferramenta de linha <img src="../../../images/imagej/icons/line.png" /> enquanto pressiona {kbd}`Shift `. Isto força a linha a ser perfeitamente horizontal ou perfeitamente vertical; sem {kbd}`Shift` seria fácil desenhar uma linha em uma leve diagonal que poderia dar resultados incorretos.

source: Displaying dimensions
de: Anzeige der Abmessungen
es: Visualización de las dimensiones
pt_br: Exibindo dimensões

source: Z-projections
de: Z-Projektionen
es: Proyecciones en Z
pt_br: Projeções Z

source: The command to generate a [*z*-projection](sec_dims_z_project) in ImageJ is {menuselection}`Image --> Stacks --> Z Project...`. This supports several different projection types, as shown in {numref}`fig-visualize_fiji_projection`.
de: Der Befehl zur Erzeugung einer [*z*-Projektion](sec_dims_z_project) in ImageJ lautet {menuselection}`Bild --&gt; Stapel --&gt; Z-Projekt...`. Dies unterstützt mehrere verschiedene Projektionsarten, wie in {numref}`fig-visualize_fiji_projection` gezeigt wird.
es: El comando para generar una [*z*-proyección](sec_dims_z_project) en ImageJ es {menuselection}`Image --&gt; Stacks --&gt; Z Project...`. Esto soporta diferentes tipos de proyección, como se muestra en {numref}`fig-visualize_fiji_projection`.
pt_br: O comando para gerar uma [*z*-projeção](sec_dims_z_project) no ImageJ é {menuselection}`Image --> Stacks --> Z Project...`. Isto suporta vários tipos de projeção diferentes, como mostrado em {numref}`fig-visualize_fiji_projection`.

source: Three projections of a *z*-stack. Sum projections often look similar to maximum projections, but less sharp.
de: Drei Projektionen eines *z*-Stapels. Summenprojektionen sehen oft ähnlich aus wie Maximalprojektionen, sind aber weniger scharf.
es: Tres proyecciones de una pila *z*. Las proyecciones de suma suelen tener un aspecto similar a las proyecciones máximas, pero menos nítidas.
pt_br: Três projeções de uma pilha *z*. As projeções de soma geralmente parecem semelhantes às projeções máximas, mas menos nítidas.

source: Imagine computing a sum and a maximum projection of a 10-slice stack containing a large, in-focus nucleus. How might each of these projections be affected if your stack contained:
de: Stellen Sie sich vor, Sie berechnen die Summe und die maximale Projektion eines 10er-Stapels, der einen großen, unscharfen Zellkern enthält. Wie könnte jede dieser Projektionen beeinflusst werden, wenn der Stapel einen großen Kern enthält?
es: Imagine que calcula la suma y la proyección máxima de una pila de 10 cortes que contiene un núcleo grande y enfocado. Cómo se vería afectada cada una de estas proyecciones si la pila contuviera:
pt_br: Imagine calcular uma soma e uma projeção máxima de uma pilha de 10 fatias contendo um núcleo grande e em foco. Como cada uma dessas projeções poderia ser afetada se sua pilha contivesse:

source: 4 additional, out-of-focus slices (with non-zero pixel values)
de: 4 zusätzliche, unscharfe Slices (mit Pixelwerten ungleich Null)
es: 4 cortes adicionales desenfocados (con valores de píxel distintos de cero)
pt_br: 4 fatias adicionais fora de foco (com valores de pixel diferentes de zero)

source: several very bright, isolated, randomly distributed outlier pixels – with values twice what they should be (due to noise)
de: mehrere sehr helle, isolierte, zufällig verteilte Ausreißerpixel - mit Werten, die doppelt so hoch sind wie sie sein sollten (aufgrund von Rauschen)
es: varios píxeles atípicos muy brillantes, aislados y distribuidos aleatoriamente, con valores dos veces superiores a los que deberían tener (debido al ruido)
pt_br: vários pixels discrepantes muito brilhantes, isolados e distribuídos aleatoriamente – com valores duas vezes maiores que deveriam ser (devido ao ruído)

source: Additional, out-of-focus planes will have an effect upon sum projections: increasing all the resulting pixel values. However, the extra planes would have minimal effects upon maximum projections, since they are unlikely to contain higher values than the in-focus planes.
de: Zusätzliche, unscharfe Ebenen wirken sich auf die Summenprojektionen aus: Sie erhöhen alle resultierenden Pixelwerte. Die zusätzlichen Ebenen hätten jedoch nur minimale Auswirkungen auf die Maximalprojektionen, da es unwahrscheinlich ist, dass sie höhere Werte enthalten als die fokussierten Ebenen.
es: Los planos desenfocados adicionales tendrán un efecto sobre las proyecciones de suma: aumentarán todos los valores de píxel resultantes. Sin embargo, los planos adicionales tendrían efectos mínimos sobre las proyecciones máximas, ya que es poco probable que contengan valores más altos que los planos enfocados.
pt_br: Planos adicionais fora de foco terão efeito nas projeções de soma: aumentando todos os valores de pixel resultantes. Contudo, os planos extras teriam efeitos mínimos sobre as projeções máximas, uma vez que é improvável que contenham valores mais elevados do que os planos em foco.

source: Maximum projections will, however, be very affected by bright outliers: these will almost certainly appear in the result with their values unchanged. Such outliers would also influence a sum projection, but less drastically because each pixel would contain the sum of 9 reasonable values and only 1 large value (unless, by bad luck or a dubious detector, many outliers happen to overlap at the same _xy_ coordinate).
de: Maximalprojektionen werden jedoch stark von hellen Ausreißern beeinflusst: Diese werden mit ziemlicher Sicherheit mit unveränderten Werten im Ergebnis erscheinen. Solche Ausreißer würden auch eine Summenprojektion beeinflussen, aber weniger drastisch, da jedes Pixel die Summe von 9 vernünftigen Werten und nur einem großen Wert enthalten würde (es sei denn, durch Pech oder einen zweifelhaften Detektor überschneiden sich viele Ausreißer an derselben _xy_-Koordinate).
es: Sin embargo, las proyecciones máximas se verán muy afectadas por los valores atípicos brillantes: éstos aparecerán casi con toda seguridad en el resultado con sus valores inalterados. Estos valores atípicos también influirían en una proyección de suma, pero de forma menos drástica, ya que cada píxel contendría la suma de 9 valores razonables y sólo 1 valor grande (a menos que, por mala suerte o por un detector dudoso, muchos valores atípicos se solapen en la misma coordenada _xy_).
pt_br: As projeções máximas serão, no entanto, muito afetadas por valores discrepantes brilhantes: estes aparecerão quase certamente no resultado com os seus valores inalterados. Esses valores discrepantes também influenciariam uma projeção de soma, mas de forma menos drástica porque cada pixel conteria a soma de 9 valores razoáveis e apenas 1 valor grande (a menos que, por azar ou por um detector duvidoso, muitos valores discrepantes se sobreponham na mesma coordenada _xy_) .

source: What happens if you calculate a maximum projection *twice* for the 5D image {menuselection}`File --> Open samples --> Mitosis`?
de: Was passiert, wenn Sie eine maximale Projektion *zwei Mal* für das 5D-Bild berechnen {menuselection}`Datei --&gt; Proben öffnen --&gt; Mitose`?
es: ¿Qué ocurre si calcula una proyección máxima *dos veces* para la imagen 5D {menuselection}`Archivo --&gt; Abrir muestras --&gt; Mitosis`?
pt_br: O que acontece se você calcular uma projeção máxima *duas vezes* para a imagem 5D {menuselection}`Arquivo --> Abrir amostras --> Mitose`?

source: By this I mean you run {menuselection}`Image --> Stacks --> Z Project...` on the original image, and then again on the output of the first projection.
de: Damit meine ich, dass Sie {menuselection}`Bild --&gt; Stapel --&gt; Z-Projekt...` auf das ursprüngliche Bild und dann erneut auf die Ausgabe der ersten Projektion anwenden.
es: Con esto quiero decir que ejecute {menuselection}`Image --&gt; Stacks --&gt; Z Project...` en la imagen original, y luego otra vez en la salida de la primera proyección.
pt_br: Com isso quero dizer que você executa {menuselection}`Image --> Stacks --> Z Project...` na imagem original e novamente na saída da primeira projeção.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/9dbe7657bb476ea457f14229e93c5862)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/9dbe7657bb476ea457f14229e93c5862)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/9dbe7657bb476ea457f14229e93c5862)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run= https://gist.github.com/petebankhead/9dbe7657bb476ea457f14229e93c5862)

source: You should end up with a maximum *z*-projecton followed by a time projection!
de: Am Ende sollten Sie eine maximale *z*-Projektion gefolgt von einer Zeitprojektion erhalten!
es: Deberías acabar con una proyección *z* máxima seguida de una proyección temporal.
pt_br: Você deve terminar com uma projeção *z* máxima seguida por uma projeção de tempo!

source: If there is a time dimension but no *z* dimension, {menuselection}`Image --> Stacks --> Z Project...` will use time instead.
de: Wenn es eine Zeitdimension, aber keine *z* Dimension gibt, verwendet {menuselection}`Bild --&gt; Stapel --&gt; Z-Projekt...` stattdessen die Zeit.
es: Si hay una dimensión temporal pero no una dimensión *z*, {menuselection}`Image --&gt; Stacks --&gt; Z Project...` utilizará el tiempo en su lugar.
pt_br: Se houver uma dimensão de tempo, mas nenhuma dimensão *z*, {menuselection}`Image --> Stacks --> Z Project...` usará o tempo.

source: If there *is* a *z* dimension but you want a time projection anyway, you could try careful use of {menuselection}`Image --> Hyperstack --> Re-order Hyperstacks...` or {menuselection}`Image --> Hyperstack --> Stack to Hyperstack...` to temporarily switch the dimension names and trick ImageJ into doing what you want.
de: Wenn es *eine* Dimension *z* gibt, Sie aber trotzdem eine Zeitprojektion wollen, könnten Sie versuchen, {menuselection}`Image --&gt; Hyperstack --&gt; Re-order Hyperstacks...` oder {menuselection}`Image --&gt; Hyperstack --&gt; Stack to Hyperstack...` zu benutzen, um die Dimensionsnamen vorübergehend zu vertauschen und ImageJ auszutricksen, damit es das tut, was Sie wollen.
es: Si *existe* una dimensión *z* pero quieres una proyección temporal de todos modos, puedes intentar usar cuidadosamente {menuselection}`Image --&gt; Hyperstack --&gt; Re-order Hyperstacks...` o {menuselection}`Image --&gt; Hyperstack --&gt; Stack to Hyperstack...` para cambiar temporalmente los nombres de las dimensiones y engañar a ImageJ para que haga lo que quieres.
pt_br: Se *existe* uma dimensão *z* mas você deseja uma projeção de tempo de qualquer maneira, você pode tentar usar com cuidado {menuselection}`Image --> Hyperstack --> Re-order Hyperstacks ...` ou {menuselection}`Image --> Hyperstack --> Stack to Hyperstack...` para mudar temporariamente os nomes das dimensões e enganar o ImageJ para fazer o que você deseja.

source: Orthogonal views
de: Orthogonale Ansichten
es: Vistas ortogonales
pt_br: Vistas ortogonais

source: The command {menuselection}`Image --> Stacks --> Orthogonal Views` makes it possible to generate interactive [orthogonal slices](sec_dims_orthogonal) from an image stack. This opens up 2 extra windows, so that when you click at any point on the original _xy_ view, you are shown cross-sections through that point from each direction.
de: Der Befehl {menuselection}`Bild --&gt; Stapel --&gt; Orthogonale Ansichten` ermöglicht es, interaktive [orthogonale Schnitte](sec_dims_orthogonal) aus einem Bildstapel zu erzeugen. Dies öffnet 2 zusätzliche Fenster, so dass Sie, wenn Sie auf einen beliebigen Punkt in der ursprünglichen _xy_-Ansicht klicken, Querschnitte durch diesen Punkt aus jeder Richtung angezeigt bekommen.
es: El comando {menuselection}`Image --&gt; Stacks --&gt; Orthogonal Views` permite generar [cortes ortogonales] interactivos (sec_dims_orthogonal) a partir de una pila de imágenes. Esto abre 2 ventanas adicionales, de modo que cuando se hace clic en cualquier punto de la vista _xy_ original, se muestran cortes transversales a través de ese punto desde cada dirección.
pt_br: O comando {menuselection}`Image --> Stacks --> Orthogonal Views` torna possível gerar [fatias ortogonais](sec_dims_orthogonal) interativas a partir de uma pilha de imagens. Isto abre 2 janelas extras, de modo que quando você clica em qualquer ponto da vista _xy_ original, são mostradas seções transversais através desse ponto em cada direção.

source: Orthogonal views in ImageJ.
de: Orthogonale Ansichten in ImageJ.
es: Vistas ortogonales en ImageJ.
pt_br: Vistas ortogonais em ImageJ.

source: Note that when viewing the orthogonal slices, clicks on the image are intercepted. This makes it difficult to interact with the image normally or create new ROIs. If you close any of the additional views then the command is deactivated, and you can go back to working with the image as before.
de: Beachten Sie, dass beim Betrachten der orthogonalen Schnitte Klicks auf das Bild abgefangen werden. Das macht es schwierig, normal mit dem Bild zu interagieren oder neue ROIs zu erstellen. Wenn Sie eine der zusätzlichen Ansichten schließen, wird der Befehl deaktiviert, und Sie können wieder wie zuvor mit dem Bild arbeiten.
es: Tenga en cuenta que al visualizar los cortes ortogonales, los clics en la imagen son interceptados. Esto dificulta la interacción normal con la imagen o la creación de nuevos ROI. Si cierra cualquiera de las vistas adicionales, el comando se desactiva y puede volver a trabajar con la imagen como antes.
pt_br: Observe que ao visualizar as fatias ortogonais, os cliques na imagem são interceptados. Isso dificulta a interação normal com a imagem ou a criação de novos ROIs. Se você fechar qualquer uma das visualizações adicionais, o comando será desativado e você poderá voltar a trabalhar com a imagem como antes.

source: Reslicing
de: Wiederveröffentlichung
es: Reelaboración de
pt_br: Fatiamento

source: If you look closely at the orthogonal slices, you will see that they are RGB images -- even if the original stack is not RGB. They are also locked to using the LUT and brightness/contrast settings that were active when the command was first run.
de: Wenn Sie sich die orthogonalen Slices genau ansehen, werden Sie feststellen, dass es sich um RGB-Bilder handelt - auch wenn der ursprüngliche Stapel nicht RGB ist. Außerdem sind sie auf die Verwendung der LUT- und Helligkeits-/Kontrasteinstellungen festgelegt, die bei der ersten Ausführung des Befehls aktiv waren.
es: Si observa detenidamente los cortes ortogonales, verá que son imágenes RGB, aunque la pila original no sea RGB. También están bloqueadas para usar la LUT y los ajustes de brillo/contraste que estaban activos cuando se ejecutó el comando por primera vez.
pt_br: Se você observar atentamente as fatias ortogonais, verá que são imagens RGB - mesmo que a pilha original não seja RGB. Eles também estão bloqueados para usar as configurações de LUT e brilho/contraste que estavam ativas quando o comando foi executado pela primeira vez.

source: This makes them a useful visualization trick, but they do not provide a rotated version of the data for analysis.
de: Das macht sie zu einem nützlichen Visualisierungstrick, aber sie liefern keine gedrehte Version der Daten für die Analyse.
es: Esto los convierte en un truco de visualización útil, pero no proporcionan una versión rotada de los datos para su análisis.
pt_br: Isso os torna um truque de visualização útil, mas não fornecem uma versão rotacionada dos dados para análise.

source: If you instead want to rotate the entire stack so that you can browse through what are effectively _xz_ or _yz_ slices and do whatever you want to them, the command you need is {menuselection}`Image --> Stacks --> Reslice...`.
de: Wenn Sie stattdessen den gesamten Stapel drehen wollen, so dass Sie durch die _xz_ oder _yz_ Slices blättern und mit ihnen machen können, was Sie wollen, brauchen Sie den Befehl {menuselection}`Bild --&gt; Stapel --&gt; neu schneiden...`.
es: Si lo que desea es rotar toda la pila de modo que pueda navegar a través de lo que son efectivamente rodajas _xz_ o _yz_ y hacer lo que quiera con ellas, el comando que necesita es {menuselection}`Image --&gt; Stacks --&gt; Reslice...`.
pt_br: Se, em vez disso, você quiser girar a pilha inteira para poder navegar pelo que são efetivamente fatias _xz_ ou _yz_ e fazer o que quiser com elas, o comando necessário é {menuselection}`Image -> Pilhas -> Fatiar novamente...`.

source: Reslicing an image.
de: Ein Bild neu anordnen.
es: Reproducir una imagen.
pt_br: Recortando uma imagem.

source: After reslicing, you can then use {menuselection}`Image --> Stacks --> Z Project...` to effectively generate orthogonal *z*-projections.
de: Nach dem Neuschnitt können Sie dann {menuselection}`Bild --&gt; Stapel --&gt; Z-Projekt...` verwenden, um effektiv orthogonale *z*-Projektionen zu erzeugen.
es: Después de volver a cortar, puede utilizar {menuselection}`Image --&gt; Stacks --&gt; Z Project...` para generar efectivamente proyecciones *z* ortogonales.
pt_br: Após o novo fatiamento, você pode usar {menuselection}`Image --> Stacks --> Z Project...` para gerar efetivamente projeções *z* ortogonais.

source: Reslicing and interpolation
de: Reslicing und Interpolation
es: Repetición e interpolación
pt_br: Reslicing e interpolação
