Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/imagej.po
Languages: de, es, pt_br

source: ImageJ: Pixel size & dimensions
de: ImageJ: Pixelgröße und Abmessungen
es: ImageJ: Tamaño de píxel y dimensiones
pt_br: ImageJ: tamanho e dimensões do pixel

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: This section will explore pixel sizes and dimensions in ImageJ. Along the way, we will see how to generate scale bars and fix images where the pixel size or dimensions are incorrect -- at least whenever we know what the correct values are.
de: In diesem Abschnitt werden wir uns mit Pixelgrößen und -abmessungen in ImageJ beschäftigen. Dabei werden wir sehen, wie wir Maßstabsbalken erzeugen und Bilder korrigieren können, bei denen die Pixelgröße oder -abmessungen nicht korrekt sind - zumindest, wenn wir die richtigen Werte kennen.
es: Esta sección explorará los tamaños y dimensiones de los píxeles en ImageJ. Por el camino, veremos cómo generar barras de escala y arreglar imágenes donde el tamaño del píxel o las dimensiones son incorrectas -- al menos siempre que sepamos cuáles son los valores correctos.
pt_br: Esta seção explorará tamanhos e dimensões de pixels no ImageJ. Ao longo do caminho, veremos como gerar barras de escala e corrigir imagens onde o tamanho ou as dimensões dos pixels estão incorretos - pelo menos sempre que soubermos quais são os valores corretos.

source: Pixel sizes & Properties
de: Pixelgrößen &amp; Eigenschaften
es: Tamaño y propiedades de los píxeles
pt_br: Tamanhos e propriedades de pixels

source: You can see the pixel size for an image in ImageJ under {menuselection}`Image --> Properties...`. These are provided separately as values for {guilabel}`Pixel width` and {guilabel}`Pixel height`.
de: Sie können die Pixelgröße für ein Bild in ImageJ unter {menuselection}`Bild --&gt; Eigenschaften...` sehen. Diese werden separat als Werte für {guilabel}`Pixelbreite` und {guilabel}`Pixelhöhe` bereitgestellt.
es: Puede ver el tamaño en píxeles de una imagen en ImageJ en {menuselection}`Image --&gt; Properties...`. Se proporcionan por separado como valores para {guilabel}`Pixel width` y {guilabel}`Pixel height`.
pt_br: Você pode ver o tamanho do pixel de uma imagem no ImageJ em {menuselection}`Image --> Properties...`. Eles são fornecidos separadamente como valores para {guilabel}`Largura do pixel` e {guilabel}`Altura do pixel`.

source: A **voxel** is the 3D analogue of a pixel; a 'volume pixel'.
de: Ein **Voxel** ist das 3D-Analogon eines Pixels, ein "Volumenpixel".
es: Un **voxel** es el análogo tridimensional de un píxel; un "píxel de volumen".
pt_br: Um **voxel** é o análogo 3D de um pixel; um 'pixel de volume'.

source: There is also an additional value, {guilabel}`Voxel depth`, which is only relevant for *z*-stacks; this gives the spacing between *z*-slices.
de: Es gibt auch einen zusätzlichen Wert, {guilabel}`Voxel depth`, der nur für *z*-Stapel relevant ist; dieser gibt den Abstand zwischen *z*-Scheiben an.
es: También hay un valor adicional, {guilabel}`Voxel depth`, que sólo es relevante para *z*-stacks; esto da el espaciado entre *z*-slices.
pt_br: Há também um valor adicional, {guilabel}`Profundidade do voxel`, que é relevante apenas para pilhas *z*; isso fornece o espaçamento entre as fatias *z*.

source: Image properties for the *Confocal Series* sample, which include the pixel size.
de: Bildeigenschaften für das Beispiel *Confocal Series*, einschließlich der Pixelgröße.
es: Propiedades de imagen para la muestra *Confocal Series*, que incluyen el tamaño de píxel.
pt_br: Propriedades de imagem para a amostra *Série Confocal*, que incluem o tamanho do pixel.

source: If the pixel size information is unavailable, the pixel sizes are given as 1 pixel: not terribly informative. Otherwise, the pixel sizes are given in the units displayed nearby in the properties dialog.
de: Wenn die Informationen zur Pixelgröße nicht verfügbar sind, werden die Pixelgrößen als 1 Pixel angegeben: nicht sehr informativ. Andernfalls werden die Pixelgrößen in den Einheiten angegeben, die in der Nähe im Eigenschaften-Dialog angezeigt werden.
es: Si la información sobre el tamaño de los píxeles no está disponible, los tamaños de los píxeles se dan como 1 píxel: no es muy informativo. De lo contrario, los tamaños de píxel se dan en las unidades mostradas en el diálogo de propiedades.
pt_br: Se as informações sobre o tamanho do pixel não estiverem disponíveis, os tamanhos dos pixels serão fornecidos como 1 pixel: não muito informativo. Caso contrário, os tamanhos dos pixels serão fornecidos nas unidades exibidas próximas na caixa de diálogo de propriedades.

source: Image properties for the *Fluorescent Cells* sample, which do not include useful pixel size information.
de: Bildeigenschaften für die Probe *Fluorescent Cells*, die keine nützlichen Informationen zur Pixelgröße enthalten.
es: Propiedades de imagen para la muestra *Células fluorescentes*, que no incluyen información útil sobre el tamaño de los píxeles.
pt_br: Propriedades de imagem para a amostra *Células Fluorescentes*, que não incluem informações úteis sobre tamanho de pixel.

source: The pixel width and height are *usually* the same. The voxel depth (where relevant) is often different.
de: Die Pixelbreite und -höhe sind *in der Regel* gleich. Die Voxeltiefe (sofern relevant) ist oft unterschiedlich.
es: La anchura y la altura de los píxeles suelen ser las mismas. La profundidad del vóxel (si procede) suele ser diferente.
pt_br: A largura e a altura do pixel são *geralmente* iguais. A profundidade do voxel (quando relevante) costuma ser diferente.

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: One way to check if the pixel size information is set for an image is to use {menuselection}`Image --> Properties...`
de: Eine Möglichkeit zu überprüfen, ob die Pixelgröße für ein Bild eingestellt ist, ist die Verwendung von {menuselection}`Bild --&gt; Eigenschaften...`
es: Una forma de comprobar si la información del tamaño de píxel está configurada para una imagen es utilizar {menuselection}`Image --&gt; Properties...` (Imagen --&gt; Propiedades...`).
pt_br: Uma maneira de verificar se as informações de tamanho de pixel estão definidas para uma imagem é usar {menuselection}`Image --> Properties...`

source: How else can you check this, even more easily?
de: Wie kann man das sonst noch überprüfen, noch einfacher?
es: ¿De qué otra forma puede comprobarlo, incluso más fácilmente?
pt_br: De que outra forma você pode verificar isso, ainda mais facilmente?

source: **Tip:** The answer should already be visible in {numref}`fig-properties_confocal` and {numref}`fig-properties_fluorescent`.
de: **Tipp:** Die Antwort sollte bereits in {numref}`fig-properties_confocal` und {numref}`fig-properties_fluorescent` zu finden sein.
es: **Consejo:** La respuesta ya debería ser visible en {numref}`fig-properties_confocal` y {numref}`fig-properties_fluorescent`.
pt_br: **Dica:** a resposta já deve estar visível em {numref}`fig-properties_confocal` e {numref}`fig-properties_fluorescent` .

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: The size of the image is given at the top of each image window. If the pixel size information is available, this is given in calibrated units. Otherwise, it is given only in pixels.
de: Die Größe des Bildes wird am oberen Rand jedes Bildfensters angegeben. Wenn die Information über die Pixelgröße verfügbar ist, wird diese in kalibrierten Einheiten angegeben. Andernfalls wird sie nur in Pixeln angegeben.
es: El tamaño de la imagen se indica en la parte superior de cada ventana de imagen. Si se dispone de información sobre el tamaño de los píxeles, se indica en unidades calibradas. En caso contrario, se indica sólo en píxeles.
pt_br: O tamanho da imagem é fornecido na parte superior de cada janela de imagem. Se as informações sobre o tamanho do pixel estiverem disponíveis, elas serão fornecidas em unidades calibradas. Caso contrário, será fornecido apenas em pixels.

source: Pixel sizes & measurements
de: Pixelgrößen und Abmessungen
es: Tamaños y medidas de los píxeles
pt_br: Tamanhos e medidas de pixels

source: As [described before](sec_imagej_measure_calibration), the pixel size influences measurements in ImageJ -- but the units don't appear anywhere in the *Results table*. Furthermore, once a measurement is added to the *Results table* it is fixed: it won't automatically update if the pixel sizes are changed later.
de: Wie [zuvor](sec_imagej_measure_calibration) beschrieben, beeinflusst die Pixelgröße die Messungen in ImageJ - aber die Einheiten erscheinen nirgendwo in der *Results table*. Außerdem ist eine Messung, die einmal zur *Results-Tabelle* hinzugefügt wurde, fixiert: sie wird nicht automatisch aktualisiert, wenn die Pixelgrößen später geändert werden.
es: Como [descrito antes](sec_imagej_measure_calibration), el tamaño del píxel influye en las medidas en ImageJ -- pero las unidades no aparecen en ninguna parte de la *Tabla de resultados*. Además, una vez que una medida se añade a la *Tabla de resultados* es fija: no se actualizará automáticamente si los tamaños de píxel se cambian más tarde.
pt_br: Conforme [descrito anteriormente](sec_imagej_measure_calibration), o tamanho do pixel influencia as medições no ImageJ - mas as unidades não aparecem em nenhum lugar da *tabela de resultados*. Além disso, quando uma medida é adicionada à *Tabela de resultados* ela é corrigida: ela não será atualizada automaticamente se os tamanhos dos pixels forem alterados posteriormente.

source: For that reason, you need to be careful to check pixel sizes *before* making any measurements and make sure it's clear to you which units have been used.
de: Aus diesem Grund müssen Sie darauf achten, dass Sie die Pixelgrößen *vor* jeder Messung überprüfen und sicherstellen, dass Ihnen klar ist, welche Einheiten verwendet wurden.
es: Por eso, hay que tener cuidado de comprobar el tamaño de los píxeles *antes* de realizar cualquier medición y asegurarse de que queda claro qué unidades se han utilizado.
pt_br: Por esse motivo, você precisa ter cuidado ao verificar os tamanhos dos pixels *antes* de fazer qualquer medição e certificar-se de que está claro quais unidades foram usadas.

source: The same ROI (here, a 100 x 100 pixel square) can appear to have a different area if it is measured on images that have different pixel sizes. The measurement is converted before being added to the *Results table*, but the units are not included.
de: Dieselbe ROI (hier ein 100 x 100 Pixel großes Quadrat) kann eine andere Fläche haben, wenn sie auf Bildern mit unterschiedlichen Pixelgrößen gemessen wird. Die Messung wird umgerechnet, bevor sie in die *Ergebnistabelle* aufgenommen wird, aber die Einheiten werden nicht berücksichtigt.
es: El mismo ROI (aquí, un cuadrado de 100 x 100 píxeles) puede parecer tener un área diferente si se mide en imágenes que tienen diferentes tamaños de píxel. La medición se convierte antes de añadirse a la tabla *Results*, pero no se incluyen las unidades.
pt_br: O mesmo ROI (aqui, um quadrado de 100 x 100 pixels) pode parecer ter uma área diferente se for medido em imagens com tamanhos de pixel diferentes. A medida é convertida antes de ser adicionada à *Tabela de resultados*, mas as unidades não são incluídas.

source: Setting the pixel size
de: Einstellung der Pixelgröße
es: Ajuste del tamaño de los píxeles
pt_br: Configurando o tamanho do pixel

source: If the pixel size information is missing, but you know what it should be, you can simply enter the required width and height values in the *Properties...* dialog box.
de: Wenn die Informationen zur Pixelgröße fehlen, Sie aber wissen, wie hoch sie sein sollte, können Sie die erforderlichen Werte für Breite und Höhe einfach in das Dialogfeld *Eigenschaften...* eingeben.
es: Si falta la información sobre el tamaño de los píxeles, pero sabe cuál debería ser, puede introducir simplemente los valores necesarios de anchura y altura en el cuadro de diálogo *Propiedades...*.
pt_br: Se as informações de tamanho de pixel estiverem faltando, mas você souber qual deveria ser, basta inserir os valores de largura e altura necessários na caixa de diálogo *Propriedades...*.

source: Typing µm
de: Typisierung µm
es: Tipificación µm
pt_br: Digitando µm

source: Depending upon your computer, typing µm for the units might be tricky. Fortunately, typing *um* works as well -- ImageJ automatically converts *um &rarr; µm*.
de: Abhängig von Ihrem Computer kann es schwierig sein, µm als Einheit einzugeben. Glücklicherweise funktioniert auch die Eingabe von *um* - ImageJ konvertiert automatisch *um &rarr; µm*.
es: Dependiendo de tu ordenador, escribir µm para las unidades puede ser complicado. Afortunadamente, escribir *um* también funciona -- ImageJ convierte automáticamente *um &rarr; µm*.
pt_br: Dependendo do seu computador, digitar µm para as unidades pode ser complicado. Felizmente, digitar *um* também funciona - o ImageJ converte automaticamente *um &rarr; µm*.

source: If you don't know what the pixel size should be, but you *do* know the length of some structure in your image, then you can
de: Wenn Sie nicht wissen, wie groß die Pixel sein sollen, aber die Länge einer Struktur in Ihrem Bild *kennen*, können Sie
es: Si no sabe cuál debe ser el tamaño de los píxeles, pero *sí* conoce la longitud de alguna estructura de su imagen, entonces puede
pt_br: Se você não sabe qual deve ser o tamanho do pixel, mas *conhece* o comprimento de alguma estrutura na sua imagem, então você pode

source: Draw a line along the known structure with the line tool <img src="../../../images/imagej/icons/line.png" />
de: Zeichnen Sie eine Linie entlang der bekannten Struktur mit dem Linienwerkzeug <img src="../../../images/imagej/icons/line.png" />
es: Dibuje una línea a lo largo de la estructura conocida con la herramienta de línea <img src="../../../images/imagej/icons/line.png" />
pt_br: Desenhe uma linha ao longo da estrutura conhecida com a ferramenta de linha <img src="../../../images/imagej/icons/line.png" />

source: Run {menuselection}`Analyze --> Set Scale...`.
de: Führen Sie {menuselection}"Analysieren --&gt; Skala festlegen" aus.
es: Ejecute {menuselection}`Analyze --&gt; Set Scale...`.
pt_br: Execute {menuselection}`Analisar --> Definir escala...`.

source: This will automatically populate the {guilabel}`Distance in pixels` based upon the length of the line. You can then input the known physical length and units, then click {guilabel}`OK`. You should check {menuselection}`Image --> Properties...` to confirm that the values have been updated sensibly.
de: Dadurch wird das Feld {guilabel}"Abstand in Pixel" automatisch auf der Grundlage der Länge der Linie ausgefüllt. Sie können dann die bekannte physische Länge und die Einheiten eingeben und dann auf {guilabel}`OK` klicken. Sie sollten {menuselection}`Bild --&gt; Eigenschaften...` überprüfen, um zu bestätigen, dass die Werte vernünftig aktualisiert wurden.
es: Esto rellenará automáticamente {guilabel}`Distancia en píxeles` basándose en la longitud de la línea. A continuación, puede introducir la longitud física conocida y las unidades, y hacer clic en {guilabel}`OK`. Debería comprobar {menuselection}`Image --&gt; Properties...` para confirmar que los valores se han actualizado correctamente.
pt_br: Isso preencherá automaticamente a {guilabel}`Distância em pixels` com base no comprimento da linha. Você pode então inserir o comprimento físico e as unidades conhecidas e clicar em {guilabel}`OK`. Você deve verificar {menuselection}`Image --> Properties...` para confirmar se os valores foram atualizados de forma sensata.

source: Setting the pixel size in an image by inserting the length of a known structure.
de: Einstellung der Pixelgröße in einem Bild durch Einfügen der Länge einer bekannten Struktur.
es: Establecer el tamaño de los píxeles de una imagen insertando la longitud de una estructura conocida.
pt_br: Definir o tamanho do pixel em uma imagem inserindo o comprimento de uma estrutura conhecida.

source: Using *Set Scale...*
de: Mit *Set Scale...*
es: Usando *Fijar Escala...*
pt_br: Usando *Definir escala...*

source: Ideally, {menuselection}`Analyze --> Set Scale...` would be used with a calibration slide to establish the pixel sizes reliably. The values can then be transferred to other images acquired with the same settings using {menuselection}`Image --> Properties...` (or a [macro](chap_macro_intro)).
de: Idealerweise wird {menuselection}`Analyze --&gt; Set Scale...` mit einem Kalibrierungsdia verwendet, um die Pixelgrößen zuverlässig zu bestimmen. Die Werte können dann mit {menuselection}`Bild --&gt; Eigenschaften...` (oder einem [Makro](chap_macro_intro) auf andere Bilder übertragen werden, die mit denselben Einstellungen aufgenommen wurden.)
es: Lo ideal sería utilizar {menuselection}`Analyze --&gt; Set Scale...` con una diapositiva de calibración para establecer el tamaño de los píxeles de forma fiable. Los valores pueden entonces ser transferidos a otras imágenes adquiridas con los mismos ajustes usando {menuselection}`Image --&gt; Properties...` (o un [macro](chap_macro_intro)).
pt_br: Idealmente, {menuselection}`Analyze --> Set Scale...` seria usado com um slide de calibração para estabelecer os tamanhos dos pixels de forma confiável. Os valores podem então ser transferidos para outras imagens adquiridas com as mesmas configurações usando {menuselection}`Image --> Properties...` (ou uma [macro](chap_macro_intro)).

source: Beware that, if you have drawn a line as described above, the {guilabel}`Distance in pixels` value is initialized from that line -- so *don't* change that. Rather, *do* change the {guilabel}`Known distance` and {guilabel}`Unit of length` values according to the physical length indicated by the line.
de: Beachten Sie, dass, wenn Sie eine Linie wie oben beschrieben gezeichnet haben, der {guilabel}`Abstand in Pixeln` Wert von dieser Linie initialisiert wird - ändern Sie ihn also *nicht*. Ändern Sie stattdessen die Werte {guilabel}`Known distance` und {guilabel}`Unit of length` entsprechend der von der Linie angegebenen physikalischen Länge.
es: Tenga en cuenta que, si ha dibujado una línea como se ha descrito anteriormente, el valor {guilabel}`Distance in pixels` se inicializa a partir de esa línea -- así que *no* lo cambie. En su lugar, *cambie* los valores {guilabel}`Distancia conocida` y {guilabel}`Unidad de longitud` de acuerdo con la longitud física indicada por la línea.
pt_br: Tenha em atenção que, se tiver desenhado uma linha como descrito acima, o valor {guilabel}`Distância em pixels` será inicializado a partir dessa linha -- por isso *não* altere isso. Em vez disso, *faça* altere os valores de {guilabel}`Distância conhecida` e {guilabel}`Unidade de comprimento` de acordo com o comprimento físico indicado pela linha.

source: If the {guilabel}`Unit of length` should be *µm* but your keyboard lacks a *µ*, you can type *um* instead.
de: Wenn die {guilabel}`Längeneinheit` *µm* sein sollte, aber auf Ihrer Tastatur kein *µ* vorhanden ist, können Sie stattdessen *um* schreiben.
es: Si la {guilabel}`Unidad de longitud` debe ser *µm* pero su teclado carece de *µ*, puede escribir *um* en su lugar.
pt_br: Se a {guilabel}`Unidade de comprimento` for *µm* mas seu teclado não tiver um *µ*, você pode digitar *um*.

source: Showing a scale bar
de: Anzeige eines Maßstabsbalkens
es: Mostrar una barra de escala
pt_br: Mostrando uma barra de escala

source: It's generally good practice to include a scalebar in any figures. This is only really meaningful if the pixel sizes are set correctly within the image properties.
de: Es ist im Allgemeinen eine gute Praxis, eine Skalierungsleiste in jede Abbildung einzubauen. Dies ist nur dann sinnvoll, wenn die Pixelgrößen in den Bildeigenschaften korrekt eingestellt sind.
es: Por lo general, es una buena práctica incluir una barra de escala en las figuras. Esto sólo tiene sentido si el tamaño de los píxeles es correcto en las propiedades de la imagen.
pt_br: Geralmente é uma boa prática incluir uma barra de escala em qualquer figura. Isso só é realmente significativo se os tamanhos dos pixels estiverem definidos corretamente nas propriedades da imagem.

source: You can create a scalebar using {menuselection}`Analyze --> Tools --> Scale Bar...`.
de: Sie können eine Skalenleiste mit {menuselection}`Analysieren --&gt; Werkzeuge --&gt; Skalenleiste...` erstellen.
es: Puede crear una barra de escala utilizando {menuselection}`Analizar --&gt; Herramientas --&gt; Barra de escala...`.
pt_br: Você pode criar uma barra de escala usando {menuselection}`Analyze --> Tools --> Scale Bar...`.

source: Setting a scale bar as an overlay.
de: Einstellen eines Maßstabsbalkens als Overlay.
es: Establecer una barra de escala como superposición.
pt_br: Definir uma barra de escala como sobreposição.

source: There are several options that can be used to adjust the appearance of the scalebar. One of the most important is the {guilabel}`Overlay` option, because this determines whether the scalebar is 'burned in' to the image (i.e. the pixel values are modified) or if it's instead added as a (text) ROI as part of the image overlay.
de: Es gibt mehrere Optionen, mit denen das Aussehen der Skalenleiste angepasst werden kann. Eine der wichtigsten ist die Option {guilabel}`Overlay`, denn sie bestimmt, ob die Skalenleiste in das Bild "eingebrannt" wird (d.h. die Pixelwerte werden geändert) oder ob sie stattdessen als (Text-)ROI als Teil des Bild-Overlays hinzugefügt wird.
es: Existen varias opciones para ajustar el aspecto de la barra de escala. Una de las más importantes es la opción `Overlay` de {guilabel}, ya que determina si la barra de escala se "incrusta" en la imagen (es decir, se modifican los valores de píxel) o si se añade como una ROI (texto) como parte de la superposición de la imagen.
pt_br: Existem diversas opções que podem ser usadas para ajustar a aparência da barra de escala. Uma das mais importantes é a opção {guilabel}`Overlay`, porque determina se a barra de escala está 'gravada' na imagem (ou seja, os valores dos pixels são modificados) ou se é em vez disso, adicionado como um ROI (texto) como parte da sobreposição de imagem.
