Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/imagej.po
Languages: de, es, pt_br

source: My advice is to always add the scalebar as an overlay. That means you can remove it again, or adjust its appearance. The only disadvantage is that, if you save the image immediately, it might not appear in other software. The solution is to [generate an RGB image](sec_imagej_flatten) that includes the overlay as a final step before saving, by using {menuselection}`Image --> Overlay --> Flatten`.
de: Mein Rat ist, die Skalenleiste immer als Overlay hinzuzufügen. Das bedeutet, dass Sie sie wieder entfernen oder ihr Aussehen anpassen können. Der einzige Nachteil ist, dass das Bild, wenn Sie es sofort speichern, in anderen Programmen möglicherweise nicht angezeigt wird. Die Lösung besteht darin, [ein RGB-Bild](sec_imagej_flatten) zu erzeugen, das die Überlagerung als letzten Schritt vor dem Speichern enthält, indem Sie {menuselection}`Bild --&gt; Überlagerung --&gt; Abflachen` verwenden.
es: Mi consejo es que añadas siempre la barra de escala como una superposición. Eso significa que puedes volver a quitarla o ajustar su aspecto. El único inconveniente es que, si guarda la imagen inmediatamente, puede que no aparezca en otro software. La solución es [generar una imagen RGB](sec_imagej_flatten) que incluya la superposición como paso final antes de guardar, utilizando {menuselection}`Image --&gt; Overlay --&gt; Flatten`.
pt_br: Meu conselho é sempre adicionar a barra de escala como uma sobreposição. Isso significa que você pode removê-lo novamente ou ajustar sua aparência. A única desvantagem é que, se você salvar a imagem imediatamente, ela poderá não aparecer em outro software. A solução é [gerar uma imagem RGB](sec_imagej_flatten) que inclua a sobreposição como etapa final antes de salvar, usando {menuselection}`Image --> Overlay --> Flatten` .

source: Stacks & Hyperstacks
de: Stapel und Hyperstapel
es: Pilas e hiperpilas
pt_br: Pilhas e hiperpilhas

source: 2D images have been around since the beginning. Then ImageJ supported **stacks**, which allowed an extra dimension that could either include different time points or *z*-slices -- but not both. Nowadays, **hyperstacks** are the more flexible derivative of stacks, and can (currently) store up to 5 dimensions without getting them confused.
de: 2D-Bilder gab es von Anfang an. Damals unterstützte ImageJ **Stacks**, die eine zusätzliche Dimension erlaubten, die entweder verschiedene Zeitpunkte oder *z*-Scheiben enthalten konnte - aber nicht beides. Heutzutage sind **Hyperstapel** die flexiblere Ableitung von Stapeln und können (derzeit) bis zu 5 Dimensionen speichern, ohne dass sie durcheinander geraten.
es: Las imágenes 2D han existido desde el principio. Entonces ImageJ soportaba **stacks**, que permitían una dimensión extra que podía incluir diferentes puntos temporales o *z*-slices -- pero no ambos. Hoy en día, los **hyperstacks** son el derivado más flexible de los stacks, y pueden (actualmente) almacenar hasta 5 dimensiones sin que se confundan.
pt_br: Imagens 2D existem desde o início. Então o ImageJ suportou **pilhas**, o que permitiu uma dimensão extra que poderia incluir diferentes pontos de tempo ou fatias *z* - mas não ambos. Hoje em dia, **hiperstacks** são os derivados mais flexíveis das pilhas e podem (atualmente) armazenar até 5 dimensões sem confundi-las.

source: Hyperstack flexibility
de: Hyperstack-Flexibilität
es: Flexibilidad de Hyperstack
pt_br: Flexibilidade de hiperstack

source: A hyperstack can contain 0–5 dimensions, while a stack can only contain 0–3. So why worry about stacks at all?
de: Ein Hyperstapel kann 0-5 Dimensionen enthalten, während ein Stapel nur 0-3 enthalten kann. Warum sollte man sich also überhaupt mit Stapeln beschäftigen?
es: Una hiperpila puede contener de 0 a 5 dimensiones, mientras que una pila sólo puede contener de 0 a 3. Entonces, ¿por qué preocuparse por las pilas?
pt_br: Uma hiperpilha pode conter de 0 a 5 dimensões, enquanto uma pilha pode conter apenas de 0 a 3. Então, por que se preocupar com pilhas?

source: The main reason comes from ImageJ's evolution over time. Some commands -- perhaps originating in the pre-hyperstack era -– were written only for 2D or 3D data. Trying to apply them to 4D or 5D images may then cause an error, or it may simply produce strange results.
de: Der Hauptgrund liegt in der Entwicklung von ImageJ im Laufe der Zeit. Einige Befehle - die vielleicht noch aus der Zeit vor Hyperstack stammen - wurden nur für 2D- oder 3D-Daten geschrieben. Der Versuch, sie auf 4D- oder 5D-Bilder anzuwenden, kann dann einen Fehler verursachen oder einfach nur seltsame Ergebnisse liefern.
es: La razón principal es la evolución de ImageJ a lo largo del tiempo. Algunos comandos -- quizás originados en la era pre-hyperstack -- fueron escritos sólo para datos 2D o 3D. Intentar aplicarlos a imágenes 4D o 5D puede provocar un error, o simplemente producir resultados extraños.
pt_br: A principal razão vem da evolução do ImageJ ao longo do tempo. Alguns comandos - talvez originados na era pré-hyperstack - foram escritos apenas para dados 2D ou 3D. Tentar aplicá-los a imagens 4D ou 5D pode causar um erro ou simplesmente produzir resultados estranhos.

source: In practice, this is unlikely to be an issue nowadays. Hyperstacks have been around for so long now that all major commands that work on stacks should also handle hyperstacks properly. Nevertheless, it helps to have a historical perspective to understand why both terms still exist in ImageJ's interface.
de: In der Praxis dürfte dies heutzutage kaum noch ein Problem sein. Hyperstacks gibt es schon so lange, dass alle wichtigen Befehle, die mit Stacks arbeiten, auch mit Hyperstacks richtig umgehen sollten. Nichtsdestotrotz ist es hilfreich, eine historische Perspektive einzunehmen, um zu verstehen, warum beide Begriffe in der ImageJ-Schnittstelle immer noch existieren.
es: En la práctica, es poco probable que esto suponga un problema hoy en día. Los hiperapilamientos existen desde hace tanto tiempo que todos los comandos importantes que trabajan con apilamientos también deberían manejar los hiperapilamientos correctamente. No obstante, es útil tener una perspectiva histórica para entender por qué ambos términos siguen existiendo en la interfaz de ImageJ.
pt_br: Na prática, é improvável que isso seja um problema hoje em dia. Os hiperstacks já existem há tanto tempo que todos os comandos principais que funcionam em pilhas também devem lidar com os hiperstacks de maneira adequada. No entanto, ajuda ter uma perspectiva histórica para entender por que ambos os termos ainda existem na interface do ImageJ.

source: It may also help if you encounter some very old plugin that was written for stacks but that doesn't handle hyperstacks properly.
de: Es kann auch helfen, wenn Sie auf ein sehr altes Plugin stoßen, das für Stacks geschrieben wurde, aber nicht richtig mit Hyperstacks umgehen kann.
es: También puede ayudar si te encuentras con algún plugin muy antiguo que fue escrito para pilas pero que no maneja hyperstacks correctamente.
pt_br: Também pode ajudar se você encontrar algum plugin muito antigo que foi escrito para pilhas, mas que não lida com hiperstacks corretamente.

source: Navigating dimensions
de: Navigieren in den Dimensionen
es: Navegar por las dimensiones
pt_br: Navegando pelas dimensões

source: With a stack or hyperstack, only a single 2D **slice** is 'active' at any one time. A (hyper)stack image window can have up to 3 sliders, used to navigate the **channels**, **z** and **time** dimensions and select the active slice. In the case of multichannel images (where there is a 'channel' dimension), any changes to lookup tables are made for all the slices on the currently-active channel.
de: Bei einem Stack oder Hyperstack ist immer nur ein einziges 2D-Slice** aktiv. Ein (Hyper-)Stapel-Bildfenster kann bis zu 3 Schieberegler haben, mit denen die Dimensionen **Kanäle**, **z** und **Zeit** gesteuert und die aktive Schicht ausgewählt werden können. Im Falle von Mehrkanalbildern (bei denen es eine "Kanal"-Dimension gibt) werden alle Änderungen an den Lookup-Tabellen für alle Slices auf dem gerade aktiven Kanal vorgenommen.
es: Con una pila o hiperpila, sólo hay un único **corte** 2D "activo" en cada momento. Una ventana de imagen (hiper)pila puede tener hasta 3 controles deslizantes, que se utilizan para navegar por las dimensiones **canales**, **z** y **tiempo** y seleccionar el corte activo. En el caso de las imágenes multicanal (en las que existe una dimensión "canal"), cualquier cambio en las tablas de búsqueda se realiza para todos los cortes del canal activo en ese momento.
pt_br: Com uma pilha ou hiperstack, apenas uma única **fatia** 2D está 'ativa' por vez. Uma janela de imagem (hiper)pilha pode ter até 3 controles deslizantes, usados para navegar pelas dimensões **canais**, **z** e **tempo** e selecionar a fatia ativa. No caso de imagens multicanal (onde existe uma dimensão 'canal'), quaisquer alterações nas tabelas de consulta são feitas para todas as fatias no canal atualmente ativo.

source: A 5D image viewed in ImageJ.
de: Ein 5D-Bild, das in ImageJ angezeigt wird.
es: Una imagen 5D vista en ImageJ.
pt_br: Uma imagem 5D visualizada no ImageJ.

source: Correcting dimensions
de: Korrektur der Abmessungen
es: Corrección de las dimensiones
pt_br: Correção de dimensões

source: Like the pixel size, the dimensions of an image can found under {menuselection}`Image --> Properties...`.
de: Wie die Pixelgröße kann auch die Größe eines Bildes unter {menuselection}`Bild --&gt; Eigenschaften...` eingesehen werden.
es: Al igual que el tamaño en píxeles, las dimensiones de una imagen pueden encontrarse en {menuselection}`Image --&gt; Properties...`.
pt_br: Assim como o tamanho do pixel, as dimensões de uma imagem podem ser encontradas em {menuselection}`Imagem --> Propriedades...`.

source: Sometimes the dimensions can be incorrect. This might happen, for example, if different *z*-slices were wrongly interpreted as time points when a file was opened, or the presence of multiple channels was not spotted. Misinterpreting the dimensions can not only affect the display of the image, but also some processing and measurements.
de: Manchmal können die Dimensionen falsch sein. Dies kann z. B. passieren, wenn beim Öffnen einer Datei verschiedene *z*-Scheiben fälschlicherweise als Zeitpunkte interpretiert wurden oder das Vorhandensein mehrerer Kanäle nicht erkannt wurde. Eine Fehlinterpretation der Abmessungen kann nicht nur die Anzeige des Bildes, sondern auch einige Verarbeitungen und Messungen beeinträchtigen.
es: A veces, las dimensiones pueden ser incorrectas. Esto puede ocurrir, por ejemplo, si al abrir un archivo se interpretan erróneamente diferentes cortes *z* como puntos temporales, o no se detecta la presencia de varios canales. La interpretación errónea de las dimensiones no sólo puede afectar a la visualización de la imagen, sino también a algunos procesamientos y mediciones.
pt_br: Às vezes, as dimensões podem estar incorretas. Isso pode acontecer, por exemplo, se diferentes fatias *z* forem interpretadas incorretamente como pontos no tempo quando um arquivo foi aberto ou se a presença de vários canais não for detectada. A interpretação incorreta das dimensões pode afetar não apenas a exibição da imagem, mas também alguns processamentos e medições.

source: It's also possible to change the dimensions through {menuselection}`Image --> Properties...`, but I find that can sometimes be unreliable because of the old stack/hyperstack distinction (i.e. it doesn't convert a stack to a hyperstack, and therefore doesn't display all the sliders that are needed). A better option is to use {menuselection}`Image --> Hyperstack --> Stack to Hyperstack...` to fix dimensions.
de: Es ist auch möglich, die Abmessungen über {menuselection}`Bild --&gt; Eigenschaften...` zu ändern, aber ich finde, dass das manchmal unzuverlässig sein kann, wegen der alten Stack/Hyperstack-Unterscheidung (d.h. es konvertiert einen Stack nicht in einen Hyperstack und zeigt daher nicht alle Schieberegler an, die benötigt werden). Eine bessere Möglichkeit ist die Verwendung von {menuselection}`Bild --&gt; Hyperstapel --&gt; Stapel zu Hyperstapel...`, um die Abmessungen zu fixieren.
es: También es posible cambiar las dimensiones a través de {menuselection}`Image --&gt; Properties...`, pero encuentro que a veces puede ser poco fiable debido a la antigua distinción pila/hiperpila (es decir, no convierte una pila en hiperpila, y por lo tanto no muestra todos los deslizadores que se necesitan). Una mejor opción es utilizar {menuselection}`Image --&gt; Hyperstack --&gt; Stack to Hyperstack...` para fijar las dimensiones.
pt_br: Também é possível alterar as dimensões através de {menuselection}`Image --> Properties...`, mas acho que às vezes isso pode não ser confiável devido à antiga distinção pilha/hiperstack (ou seja, ele não converte uma pilha em uma hiperpilha e, portanto, não exibe todos os controles deslizantes necessários). Uma opção melhor é usar {menuselection}`Image --> Hyperstack --> Stack to Hyperstack...` para corrigir dimensões.

source: Practical
de: Praktisch
es: Práctico
pt_br: Prático

source: Something terrible has befallen the file *lost_dimensions.tif*, so that it's displayed as a 3D stack, when in reality it should have more dimensions.
de: Der Datei *lost_dimensions.tif* ist etwas Schlimmes zugestoßen, so dass sie als 3D-Stapel angezeigt wird, obwohl sie in Wirklichkeit mehr Dimensionen haben sollte.
es: Algo terrible le ha ocurrido al archivo *lost_dimensions.tif*, de modo que se muestra como una pila 3D, cuando en realidad debería tener más dimensiones.
pt_br: Algo terrível aconteceu com o arquivo *lost_dimensions.tif*, de modo que ele é exibido como uma pilha 3D, quando na realidade deveria ter mais dimensões.

source: By inspecting the file, identify how many channels, *z*-slices and time points it originally contained, and set these using {menuselection}`Image --> Hyperstack --> Stack to Hyperstack...` so that it displays properly. What are the correct dimensions?
de: Prüfen Sie die Datei und stellen Sie fest, wie viele Kanäle, *z*-Scheiben und Zeitpunkte sie ursprünglich enthielt, und stellen Sie diese mit {menuselection}`Bild --&gt; Hyperstack --&gt; Stack to Hyperstack...` so ein, dass sie richtig angezeigt wird. Was sind die richtigen Abmessungen?
es: Inspeccionando el archivo, identifique cuántos canales, *z*-slices y puntos de tiempo contenía originalmente, y ajústelos usando {menuselection}`Image --&gt; Hyperstack --&gt; Stack to Hyperstack...` para que se muestre correctamente. ¿Cuáles son las dimensiones correctas?
pt_br: Ao inspecionar o arquivo, identifique quantos canais, fatias *z* e pontos de tempo ele continha originalmente e defina-os usando {menuselection}`Image --> Hyperstack --> Stack para Hyperstack...` para que seja exibido corretamente. Quais são as dimensões corretas?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/lost_dimensions.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/lost_dimensions.tif)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/lost_dimensions.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/lost_dimensions.tif)

source: launch ImageJ.JS
de: ImageJ.JS starten
es: iniciar ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
de: Lösung
es: Solución
pt_br: Solução

source: *lost_dimensions.tif* should contain 2 channels, 3 *z*-slices and 16 time points.
de: *lost_dimensions.tif* sollte 2 Kanäle, 3 *z*-Scheiben und 16 Zeitpunkte enthalten.
es: *lost_dimensions.tif* debe contener 2 canales, 3 cortes *z* y 16 puntos temporales.
pt_br: *lost_dimensions.tif* deve conter 2 canais, 3 fatias *z* e 16 pontos de tempo.

source: The dimensions are in the default order (*xyczt*).
de: Die Abmessungen sind in der Standardreihenfolge (*xyczt*).
es: Las dimensiones están en el orden por defecto (*xyczt*).
pt_br: As dimensões estão na ordem padrão (*xyczt*).

source: Plots and profiles
de: Grundstücke und Profile
es: Parcelas y perfiles
pt_br: Parcelas e perfis

source: More dimensions can make data harder to visualize and interpret. Reducing dimensions can help.
de: Mehr Dimensionen können die Visualisierung und Interpretation von Daten erschweren. Eine Reduzierung der Dimensionen kann helfen.
es: Un mayor número de dimensiones puede dificultar la visualización e interpretación de los datos. Reducir las dimensiones puede ayudar.
pt_br: Mais dimensões podem dificultar a visualização e a interpretação dos dados. Reduzir as dimensões pode ajudar.

source: {menuselection}`Analyze --> Plot Profile` can be used to generate a 1D plot of pixel values along a line within the image. To use it, you can first draw a line ROI <img src="../../../images/imagej/icons/line.png" />. By default, pixel values occurring along the line will be displayed in the plot, however it's possible to average multiple pixels perpendicular to line if needed. To do this, double-click on the line tool and adjust the {guilabel}`Line width` value.
de: {menuselection}Analysieren --&gt; Profil zeichnen" kann verwendet werden, um ein 1D-Diagramm der Pixelwerte entlang einer Linie im Bild zu erstellen. Um es zu verwenden, können Sie zunächst eine Linie ROI <img src="../../../images/imagej/icons/line.png" /> zeichnen. Standardmäßig werden die Pixelwerte entlang der Linie in der Darstellung angezeigt, es ist jedoch möglich, bei Bedarf mehrere Pixel senkrecht zur Linie zu mitteln. Dazu doppelklicken Sie auf das Linienwerkzeug und passen den Wert {guilabel}"Linienbreite" an.
es: {menuselection}`Analyze --&gt; Plot Profile` se puede utilizar para generar un gráfico 1D de los valores de los píxeles a lo largo de una línea dentro de la imagen. Para utilizarlo, primero puede dibujar una línea ROI <img src="../../../images/imagej/icons/line.png" />. Por defecto, los valores de píxel que ocurren a lo largo de la línea se mostrarán en el gráfico, sin embargo es posible promediar múltiples píxeles perpendiculares a la línea si es necesario. Para ello, haga doble clic en la herramienta de línea y ajuste el valor {guilabel}`Line width`.
pt_br: {menuselection}`Analyze --> Plot Profile` pode ser usado para gerar um gráfico 1D de valores de pixel ao longo de uma linha dentro da imagem. Para usá-lo, você pode primeiro desenhar uma linha ROI <img src="../../../images/imagej/icons/line.png" />. Por padrão, os valores de pixels que ocorrem ao longo da linha serão exibidos no gráfico, no entanto, é possível calcular a média de vários pixels perpendiculares à linha, se necessário. Para fazer isso, clique duas vezes na ferramenta de linha e ajuste o valor da {guilabel}`Largura da linha`.

source: It's also possible to apply {menuselection}`Analyze --> Plot Profile` {kbd}`K` to a rectangle <img src="../../../images/imagej/icons/rectangle.png" />, in which case it will average pixels vertically (default) or horizontally (if the {kbd}`Alt` key is pressed).
de: Es ist auch möglich, {menuselection}`Analyze --&gt; Plot Profile` {kbd}`K` auf ein Rechteck <img src="../../../images/imagej/icons/rectangle.png" /> anzuwenden. In diesem Fall werden die Pixel vertikal (Standard) oder horizontal (wenn die {kbd}`Alt` Taste gedrückt wird) gemittelt.
es: También es posible aplicar {menuselection}`Analyze --&gt; Plot Profile` {kbd}`K` a un rectángulo <img src="../../../images/imagej/icons/rectangle.png" />, en cuyo caso promediará los píxeles verticalmente (por defecto) u horizontalmente (si se pulsa la tecla {kbd}`Alt`).
pt_br: Também é possível aplicar {menuselection}`Analyze --> Plot Profile` {kbd}`K` a um retângulo <img src="../../../images/imagej/icons/rectangle.png" />, nesse caso ele calculará a média dos pixels verticalmente (padrão) ou horizontalmente (se a tecla {kbd}`Alt` for pressionada).

source: Another option if you have a stack or hyperstack is to use {menuselection}`Image --> Stacks --> Plot Z-axis Profile` to generate a profile across the slices. This essentially plots the mean value within any ROI (or across the whole image) for every slice in the stack. Perhaps unexpectedly, the same command is able to generate a profile across time points as well; when necessary, a dialog is shown to choose the dimension.
de: Eine weitere Möglichkeit, wenn Sie einen Stapel oder Hyperstapel haben, ist die Verwendung von {menuselection}`Bild --&gt; Stapel --&gt; Z-Achsen-Profil zeichnen`, um ein Profil über die Schichten zu erstellen. Damit wird im Wesentlichen der Mittelwert innerhalb einer beliebigen ROI (oder über das gesamte Bild) für jede Schicht im Stapel aufgezeichnet. Unerwarteterweise kann mit demselben Befehl auch ein Profil über Zeitpunkte hinweg erstellt werden; bei Bedarf wird ein Dialog zur Auswahl der Dimension angezeigt.
es: Otra opción si usted tiene una pila o hyperstack es utilizar {menuselection}`Image --&gt; Stacks --&gt; Plot Z-axis Profile` para generar un perfil a través de las rebanadas. Esto esencialmente traza el valor medio dentro de cualquier ROI (o a través de toda la imagen) para cada corte en la pila. Quizás inesperadamente, el mismo comando es capaz de generar un perfil a través de puntos de tiempo también; cuando es necesario, se muestra un diálogo para elegir la dimensión.
pt_br: Outra opção se você tiver uma pilha ou hiperstack é usar {menuselection}`Image --> Stacks --> Plot Z-axis Profile` para gerar um perfil entre as fatias. Basicamente, isso representa graficamente o valor médio dentro de qualquer ROI (ou em toda a imagem) para cada fatia na pilha. Talvez inesperadamente, o mesmo comando também seja capaz de gerar um perfil entre pontos no tempo; quando necessário, uma caixa de diálogo é mostrada para escolher a dimensão.

source: In all cases, profile plots contain a {guilabel}`Live` button. This means the plot data updates as any changes are made to the image, including ROIs being generated and moved around.
de: In allen Fällen enthalten die Profildiagramme eine Schaltfläche {guilabel}"Live". Das bedeutet, dass die Plotdaten aktualisiert werden, wenn Änderungen am Bild vorgenommen werden, einschließlich der Erstellung und Verschiebung von ROIs.
es: En todos los casos, los gráficos de perfil contienen un botón `Live` en {guilabel}. Esto significa que los datos del gráfico se actualizan a medida que se realizan cambios en la imagen, incluidos los ROI que se generan y se desplazan.
pt_br: Em todos os casos, os gráficos de perfil contêm um botão {guilabel}`Live`. Isso significa que os dados do gráfico são atualizados à medida que quaisquer alterações são feitas na imagem, incluindo ROIs sendo gerados e movidos.
