Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/imagej.po
Languages: de, es, pt_br

source: Interpolation effectively means making up plausible new pixel values to fill in the gaps 'between' known pixels. In this case, interpolation handles the fact that the pixel width, pixel height and voxel depth (*z*-spacing) are seldom identical.
de: Interpolation bedeutet, dass plausible neue Pixelwerte erfunden werden, um die Lücken zwischen bekannten Pixeln zu füllen. In diesem Fall wird bei der Interpolation die Tatsache berücksichtigt, dass die Pixelbreite, die Pixelhöhe und die Voxeltiefe (*z*-Abstand) selten identisch sind.
es: Interpolar significa, en efecto, inventar nuevos valores de píxel plausibles para rellenar los huecos "entre" píxeles conocidos. En este caso, la interpolación tiene en cuenta el hecho de que la anchura, la altura y la profundidad del vóxel (espaciado *z*) rara vez son idénticas.
pt_br: A interpolação significa efetivamente criar novos valores de pixel plausíveis para preencher as lacunas “entre” os pixels conhecidos. Nesse caso, a interpolação lida com o fato de que a largura do pixel, a altura do pixel e a profundidade do voxel (espaçamento *z*) raramente são idênticas.

source: With that in mind, if you need to reslice an image then I recommend trying it both with and without {guilabel}`Avoid pixel interpolation` selected, checking the pixel size under {menuselection}`Image --> Properties...` in both cases. Seeing what actually happens is likely to be more informative than trying to make sense of any explanation I could try to give.
de: Wenn Sie also ein Bild neu schneiden müssen, empfehle ich Ihnen, es sowohl mit als auch ohne {guilabel}"Pixelinterpolation vermeiden" zu probieren und die Pixelgröße unter {menuselection}"Bild --&gt; Eigenschaften..." in beiden Fällen zu überprüfen. Zu sehen, was tatsächlich passiert, ist wahrscheinlich aufschlussreicher als der Versuch, eine Erklärung zu finden, die ich versuchen könnte.
es: Teniendo esto en cuenta, si necesita volver a cortar una imagen, le recomiendo que lo intente con y sin {guilabel}`Avoid pixel interpolation` seleccionado, comprobando el tamaño del píxel en {menuselection}`Image --&gt; Properties...` en ambos casos. Ver lo que realmente sucede es probable que sea más informativo que tratar de dar sentido a cualquier explicación que podría tratar de dar.
pt_br: Com isso em mente, se você precisar fatiar novamente uma imagem, recomendo tentar com e sem {guilabel}`Evitar interpolação de pixels` selecionado, verificando o tamanho do pixel em {menuselection}`Imagem --> Propriedades...` em ambos os casos. Ver o que realmente acontece provavelmente será mais informativo do que tentar entender qualquer explicação que eu possa tentar dar.
