Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/python.po
Languages: de

source: Python: Pixel size & dimensions
de: Python: Pixelgröße und Abmessungen

source: This section gives a bit of background on working with pixel sizes and dimensions in Python... which is a bit more complicated than one might first expect.
de: Dieser Abschnitt vermittelt ein wenig Hintergrundwissen über die Arbeit mit Pixelgrößen und -dimensionen in Python... was etwas komplizierter ist, als man zunächst annehmen könnte.

source: Pixel size
de: Pixelgröße

source: Checking the pixel size in Python has been, in my opinion, a bit of a pain - because the common libraries used to read images don't always make that information very easy to access.
de: Die Überprüfung der Pixelgröße in Python ist meiner Meinung nach etwas mühsam, da die gängigen Bibliotheken, die zum Lesen von Bildern verwendet werden, diese Information nicht immer leicht zugänglich machen.

source: The situation is improving though.
de: Die Situation verbessert sich jedoch.

source: Here, we'll look at accessing pixel size information using two popular image-reading libraries:
de: Im Folgenden werden wir uns den Zugriff auf Informationen zur Pixelgröße mithilfe von zwei beliebten Bibliotheken zum Lesen von Bildern ansehen:

source: [`imageio`](https://pypi.org/project/imageio/) - which very commonly used, and makes reading lots of common image types straightforward
de: [`imageio`](https://pypi.org/project/imageio/) - das sehr häufig verwendet wird und das Lesen vieler gängiger Bildtypen vereinfacht

source: [`AICSImageIO`](https://pypi.org/project/aicsimageio/3.2.1/) - which is a bit more complex, but has some *extremely* useful features for working with scientific images
de: [`AICSImageIO`](https://pypi.org/project/aicsimageio/3.2.1/) - das ist etwas komplexer, hat aber einige *extrem* nützliche Funktionen für die Arbeit mit wissenschaftlichen Bildern

source: To explore pixel sizes with `imageio`, let's return to the neuron image used in the 'Channels & colors' chapter.
de: Um die Pixelgrößen mit `imageio` zu untersuchen, kehren wir zu dem Neuronenbild zurück, das im Kapitel "Kanäle und Farben" verwendet wurde.

source: The following code shows how we can read both the pixel values and the metadata.
de: Der folgende Code zeigt, wie wir sowohl die Pixelwerte als auch die Metadaten lesen können.

source: The metadata contains a lot of info, even including lookup tables.
de: Die Metadaten enthalten eine Vielzahl von Informationen, darunter auch Nachschlagetabellen.

source: Printing it a little more nicely (and skipping the LUTs), we get:
de: Druckt man es ein wenig schöner aus (und lässt die LUTs weg), erhält man:

source: This metadata is actually quite ImageJ-specific, and other TIFFs may give quite different metadata.
de: Diese Metadaten sind ziemlich ImageJ-spezifisch, und andere TIFFs können ganz andere Metadaten liefern.

source: We can see the version of ImageJ that wrote the file, but picking out the key thing we want here - the pixel size - is not so easy.
de: Wir können die Version von ImageJ sehen, die die Datei geschrieben hat, aber es ist nicht so einfach, das Wichtigste herauszufinden, das wir hier wollen - die Pixelgröße.

source: Seeing `unit=um` is encouraging, but not enough.
de: Der Hinweis auf `unit=um` ist ermutigend, aber nicht ausreichend.

source: We can explore a bit more with 'properties', which imageio described as ['a curated set of standardized metadata'](https://imageio.readthedocs.io/en/v2.30.0/reference/userapi.html#metadata).
de: Wir können die "Eigenschaften", die imageio als ["ein kuratierter Satz von standardisierten Metadaten"] (https://imageio.readthedocs.io/en/v2.30.0/reference/userapi.html#metadata) beschreibt, etwas genauer untersuchen.

source: Here, the `spacing=(6.25, 6.25)` seems promising.
de: Hier scheint die Option "spacing=(6.25, 6.25)" vielversprechend.

source: It's tempting to suppose that means the pixel width and height are both 6.25 µm - *however* if I check the same image in ImageJ itself, I see the pixel width and height are actually 0.16 µm... which happens to equal 1.0/6.25 µm.
de: Es ist verlockend, anzunehmen, dass dies bedeutet, dass die Pixelbreite und -höhe beide 6,25 µm betragen - *wenn* ich jedoch das gleiche Bild in ImageJ selbst überprüfe, sehe ich, dass die Pixelbreite und -höhe tatsächlich 0,16 µm betragen... was zufällig 1,0/6,25 µm entspricht.

source: Therefore the information **is** in the metadata, but it's very easy to misinterpret - and it isn't even guaranteed to be correct if the image was written by some other software.
de: Die Informationen **sind** also in den Metadaten enthalten, aber sie sind sehr leicht falsch zu interpretieren - und es ist nicht einmal garantiert, dass sie korrekt sind, wenn das Bild mit einer anderen Software erstellt wurde.

source: So while `imageio` is excellent for reading images easily - generally just a quick `im = imread(path)` - it's not necessarily the best thing to use when pixel sizes (or other metadata) matter.
de: Während `imageio` also hervorragend geeignet ist, um Bilder einfach zu lesen - im Allgemeinen genügt ein schnelles `im = imread(path)` - ist es nicht unbedingt die beste Lösung, wenn Pixelgrößen (oder andere Metadaten) wichtig sind.

source: Using AICSImageIO
de: Verwendung von AICSImageIO

source: The best alternative I know for working with scientific (especially biomedical) images is [**AICSImageIO**](https://github.com/AllenCellModeling/aicsimageio). This is a really useful Python library that standardizes reading and writing multiple file formats - and, depending upon how it's installed, can even access lots more awkward proprietary file formats with the help of [Bio-Formats](http://www.openmicroscopy.org/bio-formats/).
de: Die beste Alternative, die ich für die Arbeit mit wissenschaftlichen (insbesondere biomedizinischen) Bildern kenne, ist [**AICSImageIO**](https://github.com/AllenCellModeling/aicsimageio). Dies ist eine wirklich nützliche Python-Bibliothek, die das Lesen und Schreiben mehrerer Dateiformate standardisiert - und, je nachdem, wie sie installiert ist, mit Hilfe von [Bio-Formats](http://www.openmicroscopy.org/bio-formats/) sogar auf viele weitere umständliche proprietäre Dateiformate zugreifen kann.

source: Although it's possible to use a version of `imread` with AICSImageIO, it's worth learning the alternative way of doing things by creating an `AICSImage` object. This provides us with a way to access pixels and lots of other useful things whenever we need them.
de: Obwohl es möglich ist, eine Version von `imread` mit AICSImageIO zu verwenden, lohnt es sich, den alternativen Weg zu lernen, indem man ein `AICSImage`-Objekt erstellt. Dies bietet uns eine Möglichkeit, auf Pixel und viele andere nützliche Dinge zuzugreifen, wann immer wir sie brauchen.

source: From this, we can immediately see the attribute that will provide us with pixel sizes directly.
de: Daraus können wir sofort das Attribut erkennen, das uns direkt die Pixelgrößen liefert.

source: One perhaps non-obvious thing to know when using AICSImageIO is that the `AICSImage` isn't a regular NumPy array of the kind that `imageio.imread` would return. Rather, if you want that, you need to request the data.
de: Eine vielleicht nicht offensichtliche Sache, die man bei der Verwendung von AICSImageIO wissen sollte, ist, dass `AICSImage` kein normales NumPy-Array ist, wie es `imageio.imread` zurückgeben würde. Wenn Sie das wollen, müssen Sie die Daten vielmehr anfordern.

source: Using this knowledge, we can check that we have the same mean pixel value for both - as a quick way to ascertain that the actual pixel values are likely to match.
de: Mit diesem Wissen können wir überprüfen, ob wir den gleichen mittleren Pixelwert für beide haben - so können wir schnell feststellen, ob die tatsächlichen Pixelwerte wahrscheinlich übereinstimmen.

source: Dimensions
de: Abmessungen

source: Array shapes and dimensions
de: Arrayformen und -abmessungen

source: We've seen how two different libraries can enable us to read the same pixel values as NumPy arrays and extract pixel size information.
de: Wir haben gesehen, wie zwei verschiedene Bibliotheken es uns ermöglichen, dieselben Pixelwerte als NumPy-Arrays zu lesen und Informationen zur Pixelgröße zu extrahieren.

source: We might well expect that the NumPy arrays representing the pixel values are the same, but in fact we can't count on that.
de: Man könnte annehmen, dass die NumPy-Arrays, die die Pixelwerte repräsentieren, gleich sind, aber darauf können wir uns nicht verlassen.

source: NumPy is incredibly flexible when it comes to handling multidimensional arrays. And while that flexibility can be really helpful, it can also complicate things.
de: NumPy ist unglaublich flexibel, wenn es um den Umgang mit mehrdimensionalen Arrays geht. Und während diese Flexibilität wirklich hilfreich sein kann, kann sie die Dinge auch verkomplizieren.

source: To see it in action, let's check the dimensions of the images we read using imageio and AICSImageIO.
de: Um es in Aktion zu sehen, überprüfen wir die Abmessungen der Bilder, die wir mit imageio und AICSImageIO lesen.

source: We can see the number of pixels are the same, but there are some extra 'singleton' dimensions stuck into the results from AICSImageIO (i.e. with length `1`).
de: Wir sehen, dass die Anzahl der Pixel gleich ist, aber in den Ergebnissen von AICSImageIO sind einige zusätzliche "Singleton"-Dimensionen enthalten (d. h. mit der Länge "1").

source: Fortunately, we can easily remove them with an `np.squeeze` - and end up with the same arrays.
de: Glücklicherweise können wir sie mit einem `np.squeeze` leicht entfernen - und haben am Ende die gleichen Arrays.

source: So a natural question is: **why has AICSImageIO snuck in some extra dimensions?**
de: Eine natürliche Frage ist also: **Warum hat sich AICSImageIO in einige zusätzliche Dimensionen eingeschlichen?**

source: Before answering that, we should ask ourselves something else. **What exactly do we _have_ along the dimension of length `5`?**
de: Bevor wir diese Frage beantworten, sollten wir uns etwas anderes fragen. **Was genau _haben_ wir entlang der Dimension der Länge "5"?

source: And this is where things aren't terribly clear with imageio.
de: Und das ist der Punkt, an dem die Dinge bei imageio nicht ganz klar sind.

source: `5` *could* be the width of the image, height of the image, number of channels, number of z-slices, or number of timepoints.
de: 5" *kann* die Breite des Bildes, die Höhe des Bildes, die Anzahl der Kanäle, die Anzahl der z-Slices oder die Anzahl der Zeitpunkte sein.

source: Based upon our knowledge of images and the other dimensions, we'd be justified in expecting that the `5` doesn't correspond to the image width or height - `512` seems more likely for those - so it's probably one of the others.
de: Ausgehend von unserem Wissen über Bilder und die anderen Dimensionen können wir mit Recht davon ausgehen, dass die "5" nicht der Bildbreite oder -höhe entspricht - "512" scheint für diese wahrscheinlicher zu sein - also ist es wahrscheinlich eine der anderen.

source: But the problem is that **we have no way of knowing** without further information. If we don't have some external source to tell us, we need to poke around the metadata or look at the contents to figure out the answer.
de: Das Problem ist jedoch, dass **wir ohne weitere Informationen keine Möglichkeit haben, es zu wissen**. Wenn wir keine externe Quelle haben, die es uns sagt, müssen wir in den Metadaten herumstochern oder uns den Inhalt ansehen, um die Antwort herauszufinden.

source: To me, that looks very much like we have 5 different channels. I'm making some assumptions there... but they seem pretty safe assumptions.
de: Für mich sieht das sehr danach aus, dass wir 5 verschiedene Kanäle haben. Ich stelle hier einige Vermutungen an... aber das scheinen ziemlich sichere Vermutungen zu sein.

source: However AICSImageIO removes this ambiguity in a couple of ways.
de: AICSImageIO beseitigt diese Zweideutigkeit jedoch auf mehrere Arten.

source: You can expect `AICSImage` to return a 5D array, with the dimensions in a consistent order: `TCZYX` (although there is at least one caveat in the next section!)
de: Sie können erwarten, dass `AICSImage` ein 5D-Array zurückgibt, mit den Dimensionen in einer konsistenten Reihenfolge: `TCZYX` (obwohl es mindestens eine Warnung im nächsten Abschnitt gibt!)

source: You can easily query the dimensions and order to be sure
de: Sie können die Abmessungen und die Bestellung leicht abfragen, um sicher zu sein

source: Where are my channels?!?
de: Wo sind meine Kanäle?!?

source: We've seen above that imageio can return a 5-channel image with the channels first. Our question here is: does it always do that?
de: Wir haben oben gesehen, dass imageio ein 5-Kanal-Bild mit den Kanälen zuerst zurückgeben kann. Unsere Frage hier ist: macht es das immer?

source: The answer, alas, is no. The location of the channels dimensions is painfully uncertain in Python, and often different tools expect it to be in different places.
de: Die Antwort lautet leider: Nein. Die Position der Kanaldimensionen ist in Python schmerzhaft unsicher, und oft erwarten verschiedene Tools, dass sie an unterschiedlichen Stellen liegen.

source: Or sometimes the *same* tool might put it in a different place.
de: Oder manchmal kann das *gleiche* Werkzeug es an einer anderen Stelle platzieren.

source: To see that in action, let's read a simple RGB image with imageio.
de: Um dies in Aktion zu sehen, lassen Sie uns ein einfaches RGB-Bild mit imageio lesen.

source: An RGB image has 3 channels - red, green and blue - but it seems that suddenly we have the channels dimension last.
de: Ein RGB-Bild hat 3 Kanäle - rot, grün und blau -, aber es scheint, dass wir plötzlich die Kanaldimension zuletzt haben.

source: Why?
de: Warum?

source: I don't have a very satisfying explanation, except to say that for RGB that's often what you want because matplotlib expects the channels to be last, and we often use matplotlib to show images.
de: Ich habe keine sehr befriedigende Erklärung, außer zu sagen, dass für RGB, das ist oft, was Sie wollen, weil matplotlib erwartet, dass die Kanäle zuletzt sein, und wir verwenden oft matplotlib, um Bilder zu zeigen.

source: It's not *always* what you want though, and if you get enough deep learning then you'll find the 'channels-first' or 'channels-last' question coming up often.
de: Es ist jedoch nicht *immer* das, was Sie wollen, und wenn Sie genug Deep Learning betreiben, werden Sie die Frage "Kanäle zuerst" oder "Kanäle zuletzt" häufig stellen.

source: With that in mind, we can use NumPy to shift from so-called 'channels-last' to 'channels-first' - but matplotlib won't like that very much.
de: In diesem Sinne können wir NumPy verwenden, um vom sogenannten "channels-last" zum "channels-first" zu wechseln - aber matplotlib wird das nicht sehr mögen.

source: So imageio might get channels at the start or the end. For RGB, it seems to prefer the end.
de: Imageio kann also Kanäle am Anfang oder am Ende erhalten. Bei RGB scheint es das Ende zu bevorzugen.

source: What does AICSImageIO do?
de: Was macht AICSImageIO?

source: Since I said AICSImageIO is consistent, I'd like to say it puts the channels in the same place for the RGB and 5-channel image... but no. It also treats RGB as a special case.
de: Da ich sagte, dass AICSImageIO konsistent ist, würde ich gerne sagen, dass es die Kanäle für das RGB- und das 5-Kanal-Bild an die gleiche Stelle setzt... aber nein. Es behandelt auch RGB als Sonderfall.

source: It's a little hard to find, but the AICSImageIO documentation mentions that [you can expect 5 dimensions for non-RGB images, but RGB images have 6 dimensions](https://allencellmodeling.github.io/aicsimageio/aicsimageio.readers.html#aicsimageio.readers.bioformats_reader.BioFile.to_numpy) - where the sixth is called `S` for `Samples`.
de: Es ist etwas schwer zu finden, aber in der AICSImageIO-Dokumentation wird erwähnt, dass [Sie 5 Dimensionen für Nicht-RGB-Bilder erwarten können, aber RGB-Bilder haben 6 Dimensionen] (https://allencellmodeling.github.io/aicsimageio/aicsimageio.readers.html#aicsimageio.readers.bioformats_reader.BioFile.to_numpy) - wobei die sechste Dimension `S` für `Samples` heißt.

source: The good thing is that, assuming you don't have anything else going on with the first 3 dimensions - i.e. they are just `(1, 1, 1)` - a simple `np.squeeze` is enough to convert the pixel array into a matplotlib-friendly channels-last RGB format.
de: Das Gute daran ist, dass, vorausgesetzt, Sie haben nichts anderes mit den ersten 3 Dimensionen zu tun - d.h. sie sind nur `(1, 1, 1)` - ein einfaches `np.squeeze` reicht aus, um das Pixel-Array in ein Matplotlib-freundliches channels-last RGB-Format zu konvertieren.

source: More dimensions
de: Mehr Dimensionen

source: We'll end this section by looking at an image with 2 channels and 25 z-slices.
de: Zum Abschluss dieses Abschnitts betrachten wir ein Bild mit 2 Kanälen und 25 z-Slices.

source: Since you now know how to explore the dimensions in detail, I'll use my `load_image` helper function for convenience... which returns a NumPy array that's pre-squeezed to remove any singleton dimensions.
de: Da Sie nun wissen, wie Sie die Dimensionen im Detail erkunden können, verwende ich der Einfachheit halber meine Hilfsfunktion "load_image", die ein NumPy-Array zurückgibt, das bereits gequetscht ist, um alle Singleton-Dimensionen zu entfernen.

source: Since we already considered how to view multichannel images in the last chapter, let's extract a single channel here.
de: Da wir uns bereits im letzten Kapitel mit der Darstellung von Mehrkanalbildern beschäftigt haben, wollen wir hier einen einzelnen Kanal extrahieren.

source: At this point, NumPy becomes quite fun - because it is *so easy* to do stuff along different dimensions.
de: An diesem Punkt macht NumPy richtig Spaß - weil es *so einfach* ist, Dinge entlang verschiedener Dimensionen zu tun.

source: For example, we can rapidly generate different z-projections.
de: Zum Beispiel können wir schnell verschiedene z-Projektionen erzeugen.

source: But we're not limited to projecting along z - we can just switch the `axis` value and project along some other dimension.
de: Aber wir sind nicht auf die Projektion entlang der Z-Achse beschränkt - wir können einfach den "Achsen"-Wert ändern und entlang einer anderen Dimension projizieren.

source: Note that this won't do any correction for differences in pixel size in xy vs. z. With only 25 z-slices, these projections look extremely squashed.
de: Beachten Sie, dass dies keine Korrektur für Unterschiede in der Pixelgröße in xy und z vornimmt. Mit nur 25 z-Slices sehen diese Projektionen extrem gequetscht aus.

source: And we can also slice wherever we like as well, to obtain orthogonal views.
de: Und wir können auch schneiden, wo wir wollen, um orthogonale Ansichten zu erhalten.
