Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/6-files/files.po
Languages: de

source: Default Caption
de: Standardbeschriftung

source: Files & file formats
de: Dateien und Dateiformate

source: Chapter outline
de: Kapitelüberblick

source: Image files consist of **pixel values** and **metadata**
de: Bilddateien bestehen aus **Pixelwerten** und **Metadaten**

source: Some file formats are suitable for **data to analyze**, others for **data only to display**
de: Einige Dateiformate eignen sich für **zu analysierende Daten**, andere für **nur anzuzeigende Daten**

source: Metadata essential for analysis can be lost by saving in a **non-scientific file format**
de: Für die Analyse wesentliche Metadaten können durch das Speichern in einem **nichtwissenschaftlichen Dateiformat** verloren gehen.

source: **Compression** can be either **lossless** or **lossy** -- with different results
de: **Komprimierung** kann entweder **verlustfrei** oder **verlustbehaftet** sein – mit unterschiedlichen Ergebnissen

source: Original pixel values can be lost through **lossy compression**, **conversion to RGB**, or by **removing dimensions**
de: Ursprüngliche Pixelwerte können durch **verlustbehaftete Komprimierung**, **Konvertierung in RGB** oder durch **Entfernen von Abmessungen** verloren gehen.

source: Introduction
de: Einführung

source: One of the surest ways to lose information when working with images is by making bad file format choices.
de: Eine der sichersten Möglichkeiten, bei der Arbeit mit Bildern Informationen zu verlieren, ist die falsche Wahl des Dateiformats.

source: There is a vast array of file formats used to store images -- but not all formats support all the bit-depths, types and dimensions needed for scientific imaging. Some formats tend to lose metadata, and some compromise pixel values through compression.
de: Es gibt eine Vielzahl von Dateiformaten, die zum Speichern von Bildern verwendet werden – aber nicht alle Formate unterstützen alle Bittiefen, Typen und Abmessungen, die für wissenschaftliche Bildgebung erforderlich sind. Einige Formate neigen dazu, Metadaten zu verlieren, und andere beeinträchtigen die Pixelwerte durch Komprimierung.

source: To avoid getting bogged down in file format intricacies, I want to give you the main messages of this chapter up-front:
de: Damit Sie sich nicht in den Feinheiten des Dateiformats verlieren, möchte ich Ihnen vorab die Hauptaussagen dieses Kapitels mitteilen:

source: Working with image formats
de: Arbeiten mit Bildformaten

source: Always keep your original image files, in their original format
de: Behalten Sie Ihre Originalbilddateien immer im Originalformat

source: During analysis:
de: Während der Analyse:

source: Use software designed for scientific data (i.e. not a general photo editor)
de: Verwenden Sie eine Software, die für wissenschaftliche Daten entwickelt wurde (d. h. kein allgemeiner Fotoeditor).

source: If you need to save images, use the default file format for the software (e.g. TIFF for ImageJ)
de: Wenn Sie Bilder speichern müssen, verwenden Sie das Standarddateiformat für die Software (z. B. TIFF für ImageJ).

source: **Check everything!** Make sure you can reopen the image after saving, and any pixel values, pixel size information and dimensions are retained exactly.
de: **Überprüfen Sie alles!** Stellen Sie sicher, dass Sie das Bild nach dem Speichern wieder öffnen können und alle Pixelwerte, Pixelgrößeninformationen und Abmessungen genau beibehalten werden.

source: Use general-purpose file formats (e.g. PNG, JPEG) for figures, presentations or websites -- but not later analysis
de: Verwenden Sie allgemeine Dateiformate (z. B. PNG, JPEG) für Abbildungen, Präsentationen oder Websites – jedoch nicht für spätere Analysen

source: Use TIFF cautiously, because it can be used both as a scientific format suitable for analysis and a general-purpose format suitable only for display
de: Verwenden Sie TIFF mit Vorsicht, da es sowohl als wissenschaftliches Format für die Analyse als auch als allgemeines Format nur für die Anzeige verwendet werden kann

source: OME-TIFF is often a better alternative to TIFF, since it standardizes how the metadata is stored
de: OME-TIFF ist oft eine bessere Alternative zu TIFF, da es standardisiert, wie die Metadaten gespeichert werden

source: To help put this into practice, {numref}`table-file_formats` lists some of the most important image formats you need to know about when saving images yourself.
de: Um dies in die Praxis umzusetzen, listet {numref}`table-file_formats` einige der wichtigsten Bildformate auf, die Sie kennen müssen, wenn Sie Bilder selbst speichern.

source: Some of the most useful file formats for bioimage analysis & display
de: Einige der nützlichsten Dateiformate für die Analyse und Anzeige von Biobildern

source: Extensions
de: Erweiterungen

source: Main use
de: Hauptverwendung

source: Compression
de: Kompression

source: Comment
de: Kommentar

source: Analysis, display (print)
de: Analyse, Anzeige (Drucken)

source: None, lossless, lossy
de: Keine, verlustfrei, verlustbehaftet

source: Very general image format
de: Sehr allgemeines Bildformat

source: Analysis, Display (print)
de: Analyse, Darstellung (Drucken)

source: TIFF, with standardized metadata for microscopy
de: TIFF, mit standardisierten Metadaten für die Mikroskopie

source: Analysis
de: Analyse

source: Emerging format, great for big datasets -- but limited support currently
de: Neues Format, ideal für große Datensätze – derzeit jedoch nur begrenzte Unterstützung

source: Display (web, print)
de: Anzeige (Web, Druck)

source: Lossless
de: Verlustfrei

source: Small(ish) file sizes without compression artefacts
de: Kleine (irgendwie) Dateigrößen ohne Komprimierungsartefakte

source: Display (web)
de: Anzeige (Web)

source: Lossy (usually)
de: Verlustbehaftet (normalerweise)

source: Small file sizes, but visible artefacts
de: Kleine Dateigrößen, aber sichtbare Artefakte

source: The rest of this chapter explains the key ideas. Despite already having the conclusions, I hope you might persist with reading the rest anyway. Understanding more about file formats can help enormously when it comes to choosing how to save images for different purposes, and diagnosing problems when the wrong formats have been used.
de: Im Rest dieses Kapitels werden die wichtigsten Ideen erläutert. Obwohl ich bereits über die Schlussfolgerungen verfüge, hoffe ich, dass Sie trotzdem weiterhin den Rest lesen. Ein besseres Verständnis von Dateiformaten kann enorm hilfreich sein, wenn es darum geht, Bilder für verschiedene Zwecke zu speichern und Probleme zu diagnostizieren, wenn die falschen Formate verwendet wurden.

source: Image file contents
de: Inhalt der Bilddatei

source: An image file stored on computer contains two main things:
de: Eine auf dem Computer gespeicherte Bilddatei enthält im Wesentlichen zwei Dinge:

source: **Pixel values** -- the 'raw numbers' of the image
de: **Pixelwerte** – die „Rohzahlen“ des Bildes

source: **Metadata** -- additional information, such as dimensions, image type, bit-depth, pixel sizes and microscope settings ('data about data')
de: **Metadaten** – zusätzliche Informationen wie Abmessungen, Bildtyp, Bittiefe, Pixelgrößen und Mikroskopeinstellungen („Daten über Daten“)

source: The pixel values are clearly important. But some pieces of the metadata are essential for the image data to be interpretable at all. And if metadata such as the pixel size is incorrect or missing, measurements can also be wrong. Therefore files must be saved in formats that preserve both the pixel values and metadata accurately if they are to be suitable for analysis later.
de: Die Pixelwerte sind eindeutig wichtig. Einige Teile der Metadaten sind jedoch unerlässlich, damit die Bilddaten überhaupt interpretierbar sind. Und wenn Metadaten wie die Pixelgröße falsch sind oder fehlen, können auch Messungen falsch sein. Daher müssen Dateien in Formaten gespeichert werden, die sowohl die Pixelwerte als auch die Metadaten genau bewahren, damit sie für eine spätere Analyse geeignet sind.

source: Pixel values & compression
de: Pixelwerte und Komprimierung

source: Pixel values are represented using bytes. As described in {ref}`chap_bit_depths`, an 8-bit image uses 1 byte per pixel, a 16-bit image uses 2 bytes per pixel and a 32-bit image uses 4 bytes per pixel.
de: Pixelwerte werden durch Bytes dargestellt. Wie in {ref}`chap_bit_ Depths` beschrieben, verwendet ein 8-Bit-Bild 1 Byte pro Pixel, ein 16-Bit-Bild 2 Bytes pro Pixel und ein 32-Bit-Bild 4 Bytes pro Pixel.

source: However, the way these bytes are stored in the image file can depending upon whether compression is used. There are three main options:
de: Die Art und Weise, wie diese Bytes in der Bilddatei gespeichert werden, kann jedoch davon abhängen, ob Komprimierung verwendet wird. Es gibt drei Hauptoptionen:

source: **No compression**. The bytes representing the pixels are stored directly in the file. This means that the pixel values are preserved exactly, but the file can be quite large.
de: **Keine Komprimierung**. Die Bytes, die die Pixel darstellen, werden direkt in der Datei gespeichert. Dies bedeutet, dass die Pixelwerte exakt erhalten bleiben, die Datei jedoch recht groß sein kann.

source: *Examples: TIFF (Uncompressed), ICS/IDS*
de: *Beispiele: TIFF (unkomprimiert), ICS/IDS*

source: **Lossless compression**. The bytes representing the pixels are stored using a compression algorithm that (usually) results in less storage space being required, while making it possible to reconstruct the original values exactly by decompression. Compared to uncompressed data, the file size using lossless compression is generally smaller but reading or writing the file takes longer.
de: **Verlustfreie Kompression**. Die Bytes, die die Pixel darstellen, werden mit einem Komprimierungsalgorithmus gespeichert, der (normalerweise) dazu führt, dass weniger Speicherplatz benötigt wird, es aber gleichzeitig ermöglicht, die Originalwerte durch Dekomprimierung exakt wiederherzustellen. Im Vergleich zu unkomprimierten Daten ist die Dateigröße bei verlustfreier Komprimierung im Allgemeinen kleiner, das Lesen oder Schreiben der Datei dauert jedoch länger.

source: *Examples: TIFF (LZW compressed), PNG, BMP, JPEG2000 (lossless)*
de: *Beispiele: TIFF (LZW-komprimiert), PNG, BMP, JPEG2000 (verlustfrei)*

source: **Lossy compression**. The bytes representing the pixels are stored using a compression algorithm that does *not* have to be able to reconstruct the original values exactly. This can result in dramatically smaller file sizes, but at a loss of information in the image -- and often visual artefacts.
de: **Verlustbehaftete Komprimierung**. Die Bytes, die die Pixel darstellen, werden mit einem Komprimierungsalgorithmus gespeichert, der *nicht* in der Lage sein muss, die Originalwerte exakt zu rekonstruieren. Dies kann zu erheblich geringeren Dateigrößen führen, führt jedoch zu einem Informationsverlust im Bild – und häufig auch zu visuellen Artefakten.

source: *Examples: TIFF (JPEG compressed), JPEG, GIF, JPEG2000 (lossy)*
de: *Beispiele: TIFF (JPEG-komprimiert), JPEG, GIF, JPEG2000 (verlustbehaftet)*

source: Probably the most famous file format that uses lossy compression is JPEG.
de: Das wohl bekannteste Dateiformat, das verlustbehaftete Komprimierung verwendet, ist JPEG.

source: The basic idea of JPEG compression is that an image is split into 8x8 pixel blocks, and an approximation of the original values is stored rather than the exact values themselves. Technically, this approximation involves the 'discrete cosine transform'; for our purposes, it's enough to know that JPEG artefacts tend to look 8x8 pixel squares, each containing wavy patterns, which are most evident when zooming in and/or cranking up the brightness and contrast to an extreme level ({numref}`fig-files_lossy`).
de: Die Grundidee der JPEG-Komprimierung besteht darin, dass ein Bild in 8x8-Pixel-Blöcke aufgeteilt wird und eine Annäherung an die Originalwerte und nicht die genauen Werte selbst gespeichert wird. Technisch gesehen beinhaltet diese Näherung die „diskrete Kosinustransformation“; Für unsere Zwecke reicht es zu wissen, dass JPEG-Artefakte in der Regel wie Quadrate mit einer Größe von 8 x 8 Pixeln aussehen, die jeweils Wellenmuster enthalten, die am deutlichsten sichtbar werden, wenn man hineinzoomt und/oder die Helligkeit und den Kontrast auf ein extremes Niveau erhöht ({numref}`fig-files_lossy`).

source: Examples of images saved with (A) no compression, (B) lossless compression, and (C) lossy JPEG compression. The pixel values of (A) and (B) are identical. Image (C) looks similar, but zooming in on a detailed region reveals characteristic JPEG artefacts.
de: Beispiele für Bilder, die mit (A) keiner Komprimierung, (B) verlustfreier Komprimierung und (C) verlustbehafteter JPEG-Komprimierung gespeichert wurden. Die Pixelwerte von (A) und (B) sind identisch. Bild (C) sieht ähnlich aus, aber das Vergrößern eines detaillierten Bereichs zeigt charakteristische JPEG-Artefakte.

source: Compression quality
de: Komprimierungsqualität

source: Lossy compression can often be varied with a 'compression quality' setting. For a JPEG with a high quality setting, the 8x8 artefacts are likely to be much less obvious than they appear in {numref}`fig-files_lossy` -- although the pixel values are still modified. Therefore it's a good idea to also use {ref}`statistics & histograms <chap_histograms>` to check for pixel changes.
de: Die verlustbehaftete Komprimierung kann häufig mit der Einstellung „Komprimierungsqualität“ variiert werden. Bei einem JPEG mit einer hohen Qualitätseinstellung sind die 8x8-Artefakte wahrscheinlich viel weniger offensichtlich, als sie in {numref}`fig-files_lossy` erscheinen – obwohl die Pixelwerte immer noch geändert werden . Daher ist es eine gute Idee, auch {ref}`Statistiken und Histogramme <chap_histograms>` zu verwenden, um nach Pixeländerungen zu suchen.

source: Based upon the importance of preserving pixel values, the easy rule is that:
de: Basierend auf der Bedeutung der Beibehaltung von Pixelwerten lautet die einfache Regel:

source: **Lossy compression is bad for analysis!**
de: **Verlustbehaftete Komprimierung ist schlecht für die Analyse!**

source: If in doubt, don't use lossy compression when working with scientific images.
de: Im Zweifelsfall sollten Sie bei der Arbeit mit wissenschaftlichen Bildern keine verlustbehaftete Komprimierung verwenden.

source: The choice between 'no compression' and 'lossless compression' is a matter of preference, depending upon whether it's more important to you to save disk space or to open images quickly. Compatibility is also a consideration if you want to open the images in different software: not all compression types are supported by all software. So best check this before saving a lot of images in a format you might not be able to read elsewhere.
de: Die Wahl zwischen „keine Komprimierung“ und „verlustfreie Komprimierung“ ist eine Frage der Präferenz, je nachdem, ob es Ihnen wichtiger ist, Speicherplatz zu sparen oder Bilder schnell zu öffnen. Wenn Sie die Bilder in verschiedenen Programmen öffnen möchten, ist auch die Kompatibilität zu berücksichtigen: Nicht alle Komprimierungsarten werden von allen Programmen unterstützt. Überprüfen Sie dies am besten, bevor Sie viele Bilder in einem Format speichern, das Sie woanders möglicherweise nicht lesen können.

source: How do I know if a file has been compressed?
de: Wie erkenne ich, ob eine Datei komprimiert wurde?

source: An easy way to identify if an image has been lossily compressed is to look at the file extension, and check if it matches a format that uses lossy compression (e.g. *.jpeg*). Easy, but not *always* successful.
de: Eine einfache Möglichkeit, festzustellen, ob ein Bild verlustbehaftet komprimiert wurde, besteht darin, sich die Dateierweiterung anzusehen und zu prüfen, ob sie mit einem Format übereinstimmt, das verlustbehaftete Komprimierung verwendet (z. B. *.jpeg*). Einfach, aber nicht *immer* erfolgreich.

source: One reason is that some file formats support both lossless and lossy compression. For example, both JPEG and JPEG2000 (*not* the same thing!) are generally used with lossy compression but they both *could* be used for lossless compression as well. Unless you've proof to the contrary, if you see a file with extension *.jpg*, *.jpeg*, *.jp2* then it's best to assume lossy compression has been used.
de: Ein Grund dafür ist, dass einige Dateiformate sowohl verlustfreie als auch verlustbehaftete Komprimierung unterstützen. Beispielsweise werden sowohl JPEG als auch JPEG2000 (*nicht* dasselbe!) im Allgemeinen mit verlustbehafteter Komprimierung verwendet, aber beide *könnten* auch für verlustfreie Komprimierung verwendet werden. Wenn Sie eine Datei mit der Erweiterung *.jpg*, *.jpeg*, *.jp2* sehen, gehen Sie am besten davon aus, dass eine verlustbehaftete Komprimierung verwendet wurde, es sei denn, Sie können das Gegenteil beweisen.

source: TIFF images are particularly tricky. A TIFF image could contain uncompressed data, or data compressed using a variety of different methods -- both lossless and lossy, including JPEG. To determine if a TIFF image has used lossy compression, more detective work may be needed (e.g. zooming in and hunting for artefacts, comparing pixel statistics with the original data file, or using software to check for metadata).
de: Besonders heikel sind TIFF-Bilder. Ein TIFF-Bild kann unkomprimierte Daten oder Daten enthalten, die mit verschiedenen Methoden komprimiert wurden – sowohl verlustfrei als auch verlustbehaftet, einschließlich JPEG. Um festzustellen, ob ein TIFF-Bild eine verlustbehaftete Komprimierung verwendet hat, ist möglicherweise mehr Detektivarbeit erforderlich (z. B. Heranzoomen und Suchen nach Artefakten, Vergleichen von Pixelstatistiken mit der Originaldatendatei oder Verwenden von Software zur Überprüfung auf Metadaten).

source: Question
de: Frage

source: It takes approximately 1 MB to store (1,000,000 bytes) an 8-bit uncompressed image with 1,000,000 pixels.
de: Das Speichern (1.000.000 Bytes) eines unkomprimierten 8-Bit-Bildes mit 1.000.000 Pixeln benötigt etwa 1 MB.

source: How much memory does it take to store a 16-bit image with the same number of pixels?
de: Wie viel Speicher wird benötigt, um ein 16-Bit-Bild mit der gleichen Pixelanzahl zu speichern?

source: *You can ignore the tiny bit of extra space needed to store any associated metadata.*
de: *Sie können den winzigen zusätzlichen Speicherplatz, der zum Speichern aller zugehörigen Metadaten benötigt wird, ignorieren.*

source: Answer
de: Antwort

source: 8 bits corresponds to 1 byte, so 16 bits correspond to 2 bytes. We multiply the number of bytes per pixel by the number of pixels to get the minimum size required to store the uncompressed image.
de: 8 Bits entsprechen 1 Byte, 16 Bits entsprechen also 2 Bytes. Wir multiplizieren die Anzahl der Bytes pro Pixel mit der Anzahl der Pixel, um die Mindestgröße zu erhalten, die zum Speichern des unkomprimierten Bildes erforderlich ist.

source: Suppose you have an original image in TIFF format (no compression). First, you save it as JPEG (lossy compression) to reduce the file size, then close it and throw away the TIFF.
de: Angenommen, Sie haben ein Originalbild im TIFF-Format (keine Komprimierung). Zuerst speichern Sie es als JPEG (verlustbehaftete Komprimierung), um die Dateigröße zu reduzieren, schließen es dann und entsorgen das TIFF.

source: Upon hearing JPEG is bad, you reopen the image and save it as TIFF once more (no compression), throwing away the JPEG. How does your final TIFF image look, and what is its file size?
de: Wenn Sie hören, dass JPEG schlecht ist, öffnen Sie das Bild erneut und speichern es noch einmal als TIFF (keine Komprimierung) und verwerfen das JPEG. Wie sieht Ihr endgültiges TIFF-Bild aus und welche Dateigröße hat es?

source: The final image will look exactly like the JPEG version, *but with the same file size as the original TIFF!* As such, it has 'the worst of both worlds'.
de: Das endgültige Bild sieht genauso aus wie die JPEG-Version, *aber mit der gleichen Dateigröße wie das Original-TIFF!* Es bietet also „das Schlimmste aus beiden Welten“.

source: Core metadata
de: Kernmetadaten

source: Pixel values are represented as a [stream of bits: ones and zeros](chap_bit_depths). A few core pieces of metadata *must* be stored alongside these bits to interpret them as an image, such as the dimensions, bit-depth and type. If this information is missing -- or wrong -- then the image usually either cannot be read, or looks strange in some way ({numref}`fig-files_core_metadata`).
de: Pixelwerte werden als [Bitstrom: Einsen und Nullen] (chap_bit_ Depths) dargestellt. Neben diesen Bits *müssen* einige Kernmetadaten gespeichert werden, um sie als Bild zu interpretieren, wie etwa die Abmessungen, die Bittiefe und den Typ. Wenn diese Informationen fehlen oder falsch sind, kann das Bild normalerweise entweder nicht gelesen werden oder sieht auf irgendeine Weise seltsam aus ({numref}`fig-files_core_metadata`).

source: Some examples of core metadata being read correctly or incorrectly.
de: Einige Beispiele für das korrekte oder falsche Lesen von Kernmetadaten.

source: *Most* of the time, we don't need to care about this because all image file formats store this core information, and software used to open the image *usually* interprets this correctly.
de: *Meistens* müssen wir uns darum nicht kümmern, da alle Bilddateiformate diese Kerninformationen speichern und die Software, die zum Öffnen des Bildes verwendet wird, diese *normalerweise* richtig interpretiert.

source: But it isn't unheard of for some fancy new format to store the core metadata in a way that cannot be properly read and interpreted by other software. If you try to open your images and find they look very odd, you should be aware that there might be a metadata problem -- and you might need to contact the developer of the software to figure out what has gone wrong.
de: Aber es ist nicht ungewöhnlich, dass ein schickes neues Format die Kernmetadaten auf eine Weise speichert, die von anderer Software nicht richtig gelesen und interpretiert werden kann. Wenn Sie versuchen, Ihre Bilder zu öffnen und feststellen, dass sie sehr seltsam aussehen, sollten Sie sich darüber im Klaren sein, dass möglicherweise ein Metadatenproblem vorliegt – und Sie müssen sich möglicherweise an den Entwickler der Software wenden, um herauszufinden, was schief gelaufen ist.

source: More commonly, the choice of file format impacts what type of image can be stored. For example, PNG or JPEG images are limited to 2D integer data, optionally with 1, 3 or 4 channels; they do not support (for example) 32-bit floating point images, z-stacks or time series. Saving a 5D floating point image as a JPEG or PNG therefore inherently involves converting the image type and discarding information.
de: Häufiger hat die Wahl des Dateiformats Einfluss darauf, welche Art von Bild gespeichert werden kann. Beispielsweise sind PNG- oder JPEG-Bilder auf 2D-Integer-Daten beschränkt, wahlweise mit 1, 3 oder 4 Kanälen; Sie unterstützen beispielsweise keine 32-Bit-Gleitkommabilder, Z-Stacks oder Zeitreihen. Das Speichern eines 5D-Gleitkommabilds als JPEG oder PNG erfordert daher zwangsläufig eine Konvertierung des Bildtyps und das Verwerfen von Informationen.

source: Additional metadata
de: Zusätzliche Metadaten
