Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/6-files/files.po
Languages: de

source: The most important piece of 'non-core' metadata is the {ref}`pixel size <chap_pixel_size>`. Unlike core metadata, it is *not* necessary for a file format to preserve the pixel size for an image to be opened and appear 'correct'.
de: Der wichtigste Teil der „nicht zum Kern gehörenden“ Metadaten ist die Pixelgröße <chap_pixel_size>`. Im Gegensatz zu Kernmetadaten ist es *nicht* erforderlich, dass ein Dateiformat die Pixelgröße beibehält, damit ein Bild geöffnet wird und „richtig“ erscheint.

source: This is a problem because if the pixel size is incorrect or missing, it remains possible to make length, area or volume measurements within an image -- but these measurements are likely to be wrong.
de: Dies ist ein Problem, denn wenn die Pixelgröße falsch ist oder fehlt, ist es weiterhin möglich, Längen-, Flächen- oder Volumenmessungen innerhalb eines Bildes vorzunehmen – diese Messungen sind jedoch wahrscheinlich falsch.

source: In microscopy, the pixel size is typically represented as a value in µm/pixel. Saving in some file formats (e.g. JPEG and PNG) tends to lose pixel size information. Others (e.g. TIFF) *might* preserve the pixel size, *might* lose it, or *might* convert it to something else entirely.
de: In der Mikroskopie wird die Pixelgröße typischerweise als Wert in µm/Pixel dargestellt. Beim Speichern in einigen Dateiformaten (z. B. JPEG und PNG) gehen tendenziell Informationen zur Pixelgröße verloren. Andere (z. B. TIFF) *konvertieren* möglicherweise die Pixelgröße, *möglicherweise* verlieren sie oder *konvertieren* sie in etwas ganz anderes.

source: This should sound odd, scary and outrageous. Losing pixel size information is one thing, but why would any sneaky software just change the value to something else??!?
de: Das sollte seltsam, beängstigend und empörend klingen. Der Verlust von Informationen zur Pixelgröße ist eine Sache, aber warum sollte eine hinterlistige Software den Wert einfach in einen anderen Wert ändern??!?

source: To explain this, we need to remember that most images aren't intended for analysis. Most are intended only for display. And, for display, size can have a different meaning.
de: Um dies zu erklären, müssen wir bedenken, dass die meisten Bilder nicht für die Analyse gedacht sind. Die meisten sind nur zur Präsentation gedacht. Und für die Anzeige kann die Größe eine andere Bedeutung haben.

source: Many researchers already encounter this when it comes to publishing papers. Journals often require that figures are submitted at a sufficiently high resolution for printing, with the resolution defined in terms of **dots per inch (*dpi*)**. For example, an image might be requested that is at least 300 dpi; if it should be printed at a size of 2 x 2 inches, then it should be at least 600 x 600 pixels.
de: Viele Forscher stoßen bereits darauf, wenn es um die Veröffentlichung von Arbeiten geht. Zeitschriften verlangen oft, dass Abbildungen mit einer ausreichend hohen Auflösung zum Drucken eingereicht werden, wobei die Auflösung in **Punkten pro Zoll (*dpi*)** definiert ist. Beispielsweise könnte ein Bild mit mindestens 300 dpi angefordert werden; Wenn es in einer Größe von 2 x 2 Zoll gedruckt werden soll, sollte es mindestens 600 x 600 Pixel groß sein.

source: For an image with a dpi of 300, one *could* argue that a single pixel has a size of 1/300 inches. In this case, size is related to display. It doesn't matter what the image depicts -- it could be a cell, a person, a building, a galaxy -- or tell us anything about its scale. In this case, the pixel size is only telling us how the image ought to be displayed.
de: Bei einem Bild mit einer Auflösung von 300 dpi *könnte* man argumentieren, dass ein einzelner Pixel eine Größe von 1/300 Zoll hat. In diesem Fall hängt die Größe von der Anzeige ab. Es spielt keine Rolle, was das Bild darstellt – es könnte eine Zelle, eine Person, ein Gebäude, eine Galaxie sein – oder uns etwas über deren Ausmaß verraten. In diesem Fall sagt uns die Pixelgröße nur, wie das Bild angezeigt werden soll.

source: When it comes to TIFF images, the pixel size for science or the pixel size for display (i.e. dpi) might be stored *in exactly the same part of the file*. Therefore what this value actually means depends entirely upon which software wrote the image, and whether it was more concerned with analysis or display.
de: Bei TIFF-Bildern kann die Pixelgröße für die Wissenschaft oder die Pixelgröße für die Anzeige (d. h. dpi) *im genau gleichen Teil der Datei* gespeichert sein. Daher hängt die tatsächliche Bedeutung dieses Werts vollständig davon ab, welche Software das Bild geschrieben hat und ob es sich eher um Analyse oder Anzeige handelte.

source: For that reason:
de: Aus diesem Grund:

source: **Always sanity-check pixel size values!**
de: **Überprüfen Sie immer die Plausibilität der Pixelgrößenwerte!**

source: How to do that will depend upon which software you are using: each may display pixel size information in a different place. But one universal rule is to use whatever knowledge you have about whatever is in your images.
de: Wie das geht, hängt davon ab, welche Software Sie verwenden: Jede Software zeigt möglicherweise Informationen zur Pixelgröße an einer anderen Stelle an. Eine allgemeingültige Regel besteht jedoch darin, das gesamte Wissen zu nutzen, das Sie über die Inhalte Ihrer Bilder haben.

source: For example, suppose you have an image of cells. A quick internet search can reveal a typical diameter of a nucleus (perhaps 5-20&nbsp;µm). Therefore you could spend a few minutes measuring some nucleus diameters to see if they are close to this value. If so, it does not prove the pixel size is correct but it does give some added confidence; if the value is far from what is expected, then it is a warning that the pixel size is wrong.
de: Angenommen, Sie haben ein Bild von Zellen. Eine schnelle Suche im Internet kann einen typischen Durchmesser eines Kerns aufdecken (vielleicht 5–20 µm). Deshalb könnten Sie ein paar Minuten damit verbringen, einige Kerndurchmesser zu messen, um zu sehen, ob sie diesem Wert nahe kommen. Wenn ja, ist dies kein Beweis dafür, dass die Pixelgröße korrekt ist, aber es gibt zusätzliche Sicherheit; Wenn der Wert weit von den Erwartungen entfernt ist, ist dies eine Warnung, dass die Pixelgröße falsch ist.

source: Choosing file formats
de: Dateiformate auswählen

source: The right choice of file format depends upon when you are saving the image, and what you will want to do with it. Three main scenarios are described below.
de: Die richtige Wahl des Dateiformats hängt davon ab, wann Sie das Bild speichern und was Sie damit machen möchten. Im Folgenden werden drei Hauptszenarien beschrieben.

source: During acquisition
de: Während der Akquise

source: Examples formats for specific microscopes include *.lif* (Leica), *.czi* (Zeiss), *.nd2* (Nikon), *.vsi* (Olympus)... with many more.
de: Beispielformate für bestimmte Mikroskope sind *.lif* (Leica), *.czi* (Zeiss), *.nd2* (Nikon), *.vsi* (Olympus) ... und viele mehr.

source: The general rule is to
de: Die allgemeine Regel lautet:

source: Saving images during acquisition
de: Bilder während der Aufnahme speichern

source: Use the default file format for your microscope and acquisition software
de: Verwenden Sie das Standarddateiformat für Ihr Mikroskop und Ihre Aufnahmesoftware

source: The rationale is that the manufacturer's format ought to preserve all the information and metadata. Often, the acquisition software supports saving the data in some other way -- but that can be risky. There's a strong chance that at least some metadata could be lost. Sometimes, the alternative export might do even worse things -- such as convert the data to RGB.
de: Der Grundgedanke ist, dass das Format des Herstellers alle Informationen und Metadaten bewahren sollte. Oft unterstützt die Erfassungssoftware das Speichern der Daten auf andere Weise – das kann jedoch riskant sein. Es besteht eine hohe Wahrscheinlichkeit, dass zumindest einige Metadaten verloren gehen. Manchmal kann der alternative Export sogar noch Schlimmeres bewirken – beispielsweise die Konvertierung der Daten in RGB.

source: The disadvantage of this is that microscopy formats are usually uncommon in the rest of the world, which means your images might be hard to open in other software.
de: Der Nachteil dabei ist, dass Mikroskopieformate im Rest der Welt normalerweise ungewöhnlich sind, was bedeutet, dass Ihre Bilder möglicherweise nur schwer in anderer Software geöffnet werden können.

source: **Fortunately, there is a magnificent open-source project to help with this: [**Bio-Formats**](https://www.openmicroscopy.org/bio-formats/).**
de: **Glücklicherweise gibt es ein großartiges Open-Source-Projekt, das dabei hilft: [**Bio-Formats**](https://www.openmicroscopy.org/bio-formats/).**

source: Bio-Formats enables a [wide range of different formats](https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) to be read by many different software applications. It's already available within Fiji and QuPath by default, or can be installed as a plugin for ImageJ. Although it's written in Java, Bio-Formats can also be used within some Python applications.
de: Bio-Formats ermöglicht das Lesen einer [großen Auswahl verschiedener Formate](https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) durch viele verschiedene Softwareanwendungen. Es ist standardmäßig bereits in Fidschi und QuPath verfügbar oder kann als Plugin für ImageJ installiert werden. Obwohl es in Java geschrieben ist, können Bio-Formate auch in einigen Python-Anwendungen verwendet werden.

source: *If* you are unlucky enough that the native format for your microscope isn't supported by Bio-Formats, you might need to export it in a different format for use elsewhere. But if you do this, it's best to retain a copy of the original data anyway -- so you can always refer to it using the original acquisition software to check what (if anything) might have been lost in the export.
de: *Wenn* Sie das Pech haben, dass das native Format Ihres Mikroskops nicht von Bio-Formats unterstützt wird, müssen Sie es möglicherweise in ein anderes Format exportieren, um es anderswo zu verwenden. Aber wenn Sie dies tun, ist es ohnehin am besten, eine Kopie der Originaldaten aufzubewahren – so können Sie jederzeit mit der Original-Erfassungssoftware darauf zurückgreifen, um zu überprüfen, was (wenn überhaupt) beim Export verloren gegangen ist.

source: During analysis
de: Während der Analyse

source: If you want to save an image during analysis, the rule is
de: Wenn Sie ein Bild während der Analyse speichern möchten, gilt die Regel

source: Saving images during analysis
de: Bilder während der Analyse speichern

source: Use the default file format for the analysis software you're using -- or OME-TIFF
de: Verwenden Sie das Standarddateiformat für die von Ihnen verwendete Analysesoftware – oder OME-TIFF

source: Like the rule for acquisition, the idea is that this will generally preserve as much metadata as possible.
de: Wie bei der Erfassungsregel besteht die Idee darin, dass dadurch im Allgemeinen so viele Metadaten wie möglich erhalten bleiben.

source: For ImageJ, the default format is an uncompressed TIFF image. This supports 8-bit, 16-bit and 32-bit images with up to 5 dimensions, squeezing the key metadata required by ImageJ (e.g. pixel size) into one of the TIFF fields. All of this information should then be available if you open the image again in ImageJ or Fiji -- although it is not *necessarily* preserved if you open the TIFF in other software, which may not know how to interpret ImageJ's metadata. So if this is important to you, you'll need to check.
de: Für ImageJ ist das Standardformat ein unkomprimiertes TIFF-Bild. Dies unterstützt 8-Bit-, 16-Bit- und 32-Bit-Bilder mit bis zu 5 Dimensionen und drückt die für ImageJ erforderlichen Schlüsselmetadaten (z. B. Pixelgröße) in eines der TIFF-Felder. Alle diese Informationen sollten dann verfügbar sein, wenn Sie das Bild erneut in ImageJ oder Fiji öffnen – obwohl sie nicht *notwendigerweise* erhalten bleiben, wenn Sie das TIFF in einer anderen Software öffnen, die möglicherweise nicht weiß, wie die Metadaten von ImageJ zu interpretieren sind. Wenn dies für Sie wichtig ist, müssen Sie dies überprüfen.

source: *However*, this might not be the best choice if you want to continue working with your image in different software. In that case, it might take some exploration to see which formats enable metadata to be saved in a way that your preferred software applications recognize.
de: *Allerdings* ist dies möglicherweise nicht die beste Wahl, wenn Sie mit Ihrem Bild in einer anderen Software weiterarbeiten möchten. In diesem Fall ist möglicherweise etwas Recherche nötig, um herauszufinden, welche Formate es ermöglichen, Metadaten so zu speichern, dass Ihre bevorzugten Softwareanwendungen sie erkennen.

source: If you're using software that incorporates Bio-Formats, the best option is likely to be OME-TIFF. Bio-Formats can read and write OME-TIFF images, which has a very well-defined standard for storing metadata (developed by the group behind Bio-Formats itself). This opens up more possibilities, such as writing TIFFs that include either lossless or lossy compression. OME-TIFF can also contain a lot more metadata than an ImageJ TIFF can, including things like stage position, laser power etc.
de: Wenn Sie Software verwenden, die Bio-Formate integriert, ist OME-TIFF wahrscheinlich die beste Option. Bio-Formats kann OME-TIFF-Bilder lesen und schreiben, was über einen sehr klar definierten Standard zum Speichern von Metadaten verfügt (entwickelt von der Gruppe hinter Bio-Formats selbst). Dies eröffnet weitere Möglichkeiten, beispielsweise das Schreiben von TIFFs, die entweder verlustfreie oder verlustbehaftete Komprimierung beinhalten. OME-TIFF kann auch viel mehr Metadaten enthalten als ImageJ-TIFF, einschließlich Dinge wie Bühnenposition, Laserleistung usw.

source: For display
de: Zur Ausstellung

source: When it comes to displaying images, we usually only need a format that can support RGB images. Since we won't use the image for further analysis, we don't need to preserve the pixel size and don't *necessarily* have to avoid compression artefacts. My personal preferred formats for different scenarios are:
de: Für die Darstellung von Bildern benötigen wir meist nur ein Format, das RGB-Bilder unterstützen kann. Da wir das Bild nicht für weitere Analysen verwenden, müssen wir die Pixelgröße nicht beibehalten und Komprimierungsartefakte nicht unbedingt vermeiden. Meine persönlichen bevorzugten Formate für verschiedene Szenarien sind:

source: **Journal figure: TIFF.** <br /> Often the journal requests this anyway. Even if I'm not convinced it always makes sense.
de: **Journal-Abbildung: TIFF.** <br /> Oft fordert das Journal dies ohnehin an. Auch wenn ich nicht davon überzeugt bin, dass es immer Sinn macht.

source: **Presentation: PNG.** <br /> File size is not usually a problem, and PNG provides some compression without introducing artefacts.
de: **Präsentation: PNG.** <br /> Die Dateigröße stellt normalerweise kein Problem dar und PNG bietet eine gewisse Komprimierung, ohne dass Artefakte entstehen.

source: **Website: JPEG or PNG**, <br />JPEG (usually) because smaller file sizes mean the website can load quicker (and eat less data). But PNG for images that contain few colors, including most 'artificial' images such as drawings, dialog boxes or logos. JPEG artifacts can look especially ugly in such cases, while PNG can compress them very well.
de: **Website: JPEG oder PNG**, <br />JPEG (normalerweise), da kleinere Dateigrößen bedeuten, dass die Website schneller geladen werden kann (und weniger Daten verbraucht). Aber PNG für Bilder, die wenige Farben enthalten, einschließlich der meisten „künstlichen“ Bilder wie Zeichnungen, Dialogfelder oder Logos. JPEG-Artefakte können in solchen Fällen besonders hässlich aussehen, während PNG sie sehr gut komprimieren kann.

source: Creating figures for publication
de: Erstellen von Zahlen zur Veröffentlichung

source: Preparing figures for publication can be a bewildering process. To begin with, it's necessary to make another distinction between image types, one of which has not been discussed here so far:
de: Die Vorbereitung von Zahlen für die Veröffentlichung kann ein verwirrender Prozess sein. Zunächst muss noch einmal zwischen Bildtypen unterschieden werden, von denen einer hier bisher noch nicht besprochen wurde:

source: **Bitmaps**. These are composed of individual pixels: e.g. photographs, or all the microscopy images we are concerned with here.
de: **Bitmaps**. Diese bestehen aus einzelnen Pixeln: z.B. Fotos oder alle Mikroskopiebilder, um die es hier geht.

source: **Vector images**. These are composed of lines, curves, shapes or text. The instructions needed to draw the image (i.e. coordinates, equations, fonts) are stored rather than pixels, and then the image is recreated from these instructions when necessary.
de: **Vektorbilder**. Diese bestehen aus Linien, Kurven, Formen oder Text. Die zum Zeichnen des Bildes erforderlichen Anweisungen (d. h. Koordinaten, Gleichungen, Schriftarten) werden anstelle von Pixeln gespeichert, und das Bild wird dann bei Bedarf anhand dieser Anweisungen neu erstellt.

source: Every other part of this handbook concentrates on bitmap images. Vector images are quite different.
de: Alle anderen Teile dieses Handbuchs konzentrieren sich auf Bitmap-Bilder. Vektorbilder sind ganz anders.

source: If you scale a 2D bitmap image by doubling its width and height, then it will contain four times as many pixels. Guesses need to be made about how to fill in the extra information properly (which is the problem of **interpolation**), and the result generally looks less sharp than the original. But if you double the size of a vector image, it's just a matter of updating the maths needed to draw the image accordingly, and the result looks just as sharp as the original.
de: Wenn Sie ein 2D-Bitmap-Bild durch Verdoppelung seiner Breite und Höhe skalieren, enthält es viermal so viele Pixel. Es müssen Vermutungen darüber angestellt werden, wie die zusätzlichen Informationen richtig eingefügt werden (was das Problem der **Interpolation** ist), und das Ergebnis sieht im Allgemeinen weniger scharf aus als das Original. Wenn Sie jedoch die Größe eines Vektorbilds verdoppeln, müssen Sie lediglich die Mathematik aktualisieren, die zum Zeichnen des Bilds erforderlich ist, und das Ergebnis sieht genauso scharf aus wie das Original.

source: Vector images are therefore best for things like diagrams, histograms, plots and charts, because they can be resized freely and still look good. Also, they often have tiny file sizes because only a few instructions to redraw the image need to be kept, whereas a huge number of pixels might be required to store sufficiently nice, sharp text in a bitmap. But bitmaps are needed for images formed from detecting light, which cannot be reduced to a few simple equations and instructions.
de: Vektorbilder eignen sich daher am besten für Dinge wie Diagramme, Histogramme, Plots und Diagramme, da sie frei in der Größe geändert werden können und trotzdem gut aussehen. Außerdem haben sie oft winzige Dateigrößen, da nur wenige Anweisungen zum Neuzeichnen des Bildes gespeichert werden müssen, wohingegen eine große Anzahl von Pixeln erforderlich sein kann, um ausreichend schönen, scharfen Text in einer Bitmap zu speichern. Für Bilder, die durch die Erkennung von Licht entstehen, werden jedoch Bitmaps benötigt, die nicht auf ein paar einfache Gleichungen und Anweisungen reduziert werden können.

source: Finally, some versatile file formats, such as PDF or EPS, can store both kinds of image: perhaps a bitmap with some text annotations on top. If you are including text or diagrams, these formats are generally best. But if you only have bitmaps without annotations of any kind, then TIFF is probably the most common file format for creating figures.
de: Schließlich können einige vielseitige Dateiformate wie PDF oder EPS beide Arten von Bildern speichern: vielleicht eine Bitmap mit einigen Textanmerkungen darüber. Wenn Sie Text oder Diagramme einbinden, sind diese Formate im Allgemeinen am besten. Wenn Sie jedoch nur Bitmaps ohne Anmerkungen jeglicher Art haben, ist TIFF wahrscheinlich das am häufigsten verwendete Dateiformat zum Erstellen von Abbildungen.

source: When viewed from afar, it may be difficult to know whether an image is a vector or a bitmap (A) because they can sometimes look identical (although a photograph or micrograph will always be a bitmap). However, when enlarged a vector image will remain sharp (B), whereas a bitmap will not (C).
de: Bei der Betrachtung aus der Ferne kann es schwierig sein, zu erkennen, ob es sich bei einem Bild um einen Vektor oder eine Bitmap (A) handelt, da sie manchmal identisch aussehen können (obwohl ein Foto oder eine Mikroaufnahme immer eine Bitmap sein wird). Allerdings bleibt ein Vektorbild beim Vergrößern scharf (B), während dies bei einer Bitmap nicht der Fall ist (C).

source: Pyramidal images
de: Pyramidenbilder

source: Finally, we end with a few words on **pyramidal images**: a type of image that is becoming increasingly common.
de: Abschließend schließen wir mit ein paar Worten zu **Pyramidenbildern**: einem Bildtyp, der immer häufiger vorkommt.

source: Modern bioimages can be *huge*. It's not uncommon for a single image to contain many gigabytes of pixel data, making it infeasible to open the full image in one go.
de: Moderne Biobilder können *riesig* sein. Es ist nicht ungewöhnlich, dass ein einzelnes Bild viele Gigabyte an Pixeldaten enthält, sodass es unmöglich ist, das vollständige Bild auf einmal zu öffnen.

source: However, for visualization or analysis we often don't *need* all the pixels at once. For example, when viewing an image we only really need to access the pixels that are visible on screen at any moment -- at the magnification at which they are being viewed.
de: Für die Visualisierung oder Analyse *benötigen* wir jedoch oft nicht alle Pixel auf einmal. Wenn wir beispielsweise ein Bild betrachten, müssen wir nur auf die Pixel zugreifen, die zu jedem Zeitpunkt auf dem Bildschirm sichtbar sind – und zwar in der Vergrößerung, mit der sie betrachtet werden.

source: Pyramidal image files help overcome this by using two tricks:
de: Pyramidenbilddateien helfen, dieses Problem zu überwinden, indem sie zwei Tricks anwenden:

source: They store the image as separate chunks (often called 'tiles', if they are 2D)
de: Sie speichern das Bild als separate Blöcke (oft als „Kacheln“ bezeichnet, wenn es sich um zweidimensionale Bilder handelt).

source: They store the same image at different resolutions in the same file
de: Sie speichern dasselbe Bild in unterschiedlichen Auflösungen in derselben Datei

source: Schematic diagram of a pyramidal image. The image itself (left) is broken into chunks and stored at multiple resolutions. The chunks needed to display the current field of view (top right) are highlighted in yellow. The original whole slide image here is from the [CAMELYON](https://camelyon16.grand-challenge.org) grand challenge.
de: Schematische Darstellung eines Pyramidenbildes. Das Bild selbst (links) wird in Stücke zerlegt und in mehreren Auflösungen gespeichert. Die zur Anzeige des aktuellen Sichtfelds (oben rechts) benötigten Blöcke werden gelb hervorgehoben. Das Originalbild der gesamten Folie hier stammt von der großen Herausforderung [CAMELYON](https://camelyon16.grand-challenge.org).
