Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/6-files/files.po
Languages: de

source: Software designed to handle pyramidal images can then dip into the image file and read **only the part of the image that is needed at the time**. This is often only a tiny proportion of the entire dataset.
de: Software, die für die Verarbeitung von Pyramidenbildern entwickelt wurde, kann dann in die Bilddatei eintauchen und **nur den Teil des Bildes lesen, der gerade benötigt wird**. Dies ist oft nur ein winziger Teil des gesamten Datensatzes.

source: Pyramidal images are especially common for pathology, although they are starting to be used more for other applications. [QuPath](https://qupath.github.io) is open source software that is designed specifically to handle pyramidal images efficiently (and happens to also be the software that I wrote and maintain, because I wasn't able to do the analysis with other open source tools at the time). Although QuPath can do a lot of things on its own, it can also be used [with ImageJ](https://qupath.readthedocs.io/en/stable/docs/advanced/imagej.html).
de: Pyramidenbilder kommen vor allem in der Pathologie häufig vor, obwohl sie zunehmend auch für andere Anwendungen eingesetzt werden. [QuPath](https://qupath.github.io) ist eine Open-Source-Software, die speziell für den effizienten Umgang mit Pyramidenbildern entwickelt wurde (und zufällig auch die Software ist, die ich geschrieben und gewartet habe, weil ich dazu nicht in der Lage war Analyse mit anderen Open-Source-Tools damals). Obwohl QuPath viele Dinge alleine erledigen kann, kann es auch [mit ImageJ](https://qupath.readthedocs.io/en/stable/docs/advanced/imagej.html) verwendet werden.
