Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/0-preamble/reading/reading.po
Languages: de, es, pt_br

source: How to read this book
de: Wie man dieses Buch liest
es: Cómo leer este libro
pt_br: Como ler este livro

source: Practical data
de: Praktische Daten
es: Datos prácticos
pt_br: Dados práticos

source: **Download the images used in the practical exercises [here](https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).**
de: **Laden Sie die in den praktischen Übungen verwendeten Bilder [hier] herunter (https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).**
es: **Descarga las imágenes utilizadas en los ejercicios prácticos [aquí](https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).**
pt_br: **Baixe as imagens utilizadas nos exercícios práticos [aqui](https://github.com/bioimagebook/practical-data/archive/refs/heads/main.zip).**

source: Each chapter in this book starts with a main section that describes one or more key concepts in bioimage analysis. This is intended for all readers. Working through these sections should be enough to become familiar with the main ideas of the book.
de: Jedes Kapitel in diesem Buch beginnt mit einem Hauptabschnitt, der ein oder mehrere Schlüsselkonzepte der Bioimage-Analyse beschreibt. Dies ist für alle Leser gedacht. Das Durcharbeiten dieser Abschnitte sollte ausreichen, um sich mit den Hauptgedanken des Buches vertraut zu machen.
es: Cada capítulo de este libro comienza con una sección principal que describe uno o más conceptos clave en el análisis de bioimágenes. Esto está destinado a todos los lectores. Repasar estas secciones debería ser suficiente para familiarizarse con las ideas principales del libro.
pt_br: Cada capítulo deste livro começa com uma seção principal que descreve um ou mais conceitos-chave na análise de bioimagem. Isto é destinado a todos os leitores. Trabalhar nessas seções deve ser suficiente para se familiarizar com as ideias principais do livro.

source: However, actually *doing* bioimage analysis requires software. And the same concepts can surface in different software in different ways.
de: Für die tatsächliche Durchführung einer Biobildanalyse ist jedoch Software erforderlich. Und dieselben Konzepte können in unterschiedlicher Software auf unterschiedliche Weise auftauchen.
es: Sin embargo, en realidad *hacer* análisis de bioimágenes requiere software. Y los mismos conceptos pueden surgir en diferentes software de diferentes maneras.
pt_br: No entanto, *realizar* a análise de bioimagem requer software. E os mesmos conceitos podem surgir em softwares diferentes de maneiras diferentes.

source: For that reason, all the chapters in Part 1 each contain two extra subsections:
de: Aus diesem Grund enthalten alle Kapitel in Teil 1 jeweils zwei zusätzliche Unterabschnitte:
es: Por esa razón, todos los capítulos de la Parte 1 contienen cada uno dos subsecciones adicionales:
pt_br: Por esse motivo, todos os capítulos da Parte 1 contêm, cada um, duas subseções extras:

source: **ImageJ:** This describes how the concepts relate to the popular bioimage analysis software, [ImageJ](https://imagej.nih.gov/ij/index.html), including the [Fiji distribution](https://fiji.sc).
de: **ImageJ:** Dies beschreibt, wie sich die Konzepte auf die beliebte Biobildanalysesoftware [ImageJ](https://imagej.nih.gov/ij/index.html) beziehen, einschließlich der [Fidschi-Distribution](https:/ /fiji.sc).
es: **ImageJ:** Esto describe cómo se relacionan los conceptos con el popular software de análisis de bioimágenes, [ImageJ](https://imagej.nih.gov/ij/index.html), incluida la [distribución de Fiji](https:/ /fiji.sc).
pt_br: **ImageJ:** descreve como os conceitos se relacionam com o popular software de análise de bioimagem, [ImageJ](https://imagej.nih.gov/ij/index.html), incluindo a [distribuição de Fiji](https:/ /fiji.sc).

source: **Python:** This shows the concepts through code in the Python language, using tools like [NumPy](https://numpy.org), [SciPy](https://scipy.org) and [scikit-image](https://scikit-image.org).
de: **Python:** Dies zeigt die Konzepte durch Code in der Python-Sprache unter Verwendung von Tools wie [NumPy](https://numpy.org), [SciPy](https://scipy.org) und [scikit-image ](https://scikit-image.org).
es: **Python:** Muestra los conceptos a través de código en el lenguaje Python, utilizando herramientas como [NumPy](https://numpy.org), [SciPy](https://scipy.org) y [scikit-image ](https://scikit-image.org).
pt_br: **Python:** mostra os conceitos por meio de código na linguagem Python, usando ferramentas como [NumPy](https://numpy.org), [SciPy](https://scipy.org) e [scikit-image ](https://scikit-image.org).

source: ImageJ sections continue to feature in Part 2, but Python is dropped because *the whole book is written using Python code anyway*. So once you have the main ideas, any time you want to see some Python code you can just press the {guilabel}`Click to show` buttons found next to almost every figure.
de: ImageJ-Abschnitte kommen weiterhin in Teil 2 vor, aber Python wird weggelassen, weil *das ganze Buch sowieso mit Python-Code geschrieben ist*. Sobald Sie also die Hauptideen haben, können Sie jedes Mal, wenn Sie Python-Code sehen möchten, einfach auf die Schaltflächen {guilabel}„Zum Anzeigen klicken“ neben fast jeder Abbildung klicken.
es: Las secciones de ImageJ continúan apareciendo en la Parte 2, pero Python se elimina porque *de todos modos, todo el libro está escrito usando código Python*. Entonces, una vez que tenga las ideas principales, cada vez que quiera ver algo de código Python, puede simplemente presionar los botones {guilabel}`Haga clic para mostrar` que se encuentran al lado de casi todas las figuras.
pt_br: As seções do ImageJ continuam aparecendo na Parte 2, mas o Python foi descartado porque *de qualquer maneira, todo o livro foi escrito usando código Python*. Assim, uma vez que você tenha as ideias principais, sempre que quiser ver algum código Python, basta pressionar os botões {guilabel}`Click to show` encontrados ao lado de quase todas as figuras.

source: This means that you can read the book in different ways:
de: Das bedeutet, dass Sie das Buch auf verschiedene Arten lesen können:
es: Esto significa que puedes leer el libro de diferentes maneras:
pt_br: Isso significa que você pode ler o livro de diferentes maneiras:

source: As an **ImageJ primer**, skipping all the bits that involve looking at Python code
de: Als **ImageJ-Grundierung** werden alle Teile übersprungen, die das Betrachten des Python-Codes erfordern
es: Como **introducción a ImageJ**, omitir todos los bits que implican mirar el código Python
pt_br: Como uma **cartilha do ImageJ**, pulando todas as partes que envolvem a visualização do código Python

source: As a **Python-for-image-analysis manual**, skipping all the ImageJ-specific sections
de: Als **Python-Handbuch für die Bildanalyse**, wobei alle ImageJ-spezifischen Abschnitte übersprungen werden
es: Como **manual de Python para análisis de imágenes**, omitiendo todas las secciones específicas de ImageJ
pt_br: Como um **manual de análise de imagem do Python**, pulando todas as seções específicas do ImageJ

source: As a **conceptual overview**, just reading the main chapters and skipping anything specific involving ImageJ and Python
de: Als **konzeptioneller Überblick** lesen Sie einfach die Hauptkapitel und überspringen Sie alles, was sich speziell auf ImageJ und Python bezieht
es: Como **resumen conceptual**, simplemente lea los capítulos principales y omita todo lo específico que involucre ImageJ y Python.
pt_br: Como uma **visão geral conceitual**, basta ler os capítulos principais e pular qualquer coisa específica que envolva ImageJ e Python

source: As a **full introduction to image analysis, ImageJ and Python**, skipping nothing
de: Als **vollständige Einführung in die Bildanalyse, ImageJ und Python**, bei der nichts ausgelassen wird
es: Como una **introducción completa al análisis de imágenes, ImageJ y Python**, sin omitir nada
pt_br: Como uma **introdução completa à análise de imagens, ImageJ e Python**, sem pular nada

source: My advice is to read the book focussing on the concepts and ImageJ first, to get a fairly quick overview of everything -- without worrying too much about Python.
de: Mein Rat ist, das Buch zunächst mit Schwerpunkt auf den Konzepten und ImageJ zu lesen, um einen relativ schnellen Überblick über alles zu bekommen – ohne sich zu viele Gedanken über Python zu machen.
es: Mi consejo es leer el libro centrándose primero en los conceptos y en ImageJ, para obtener una descripción general bastante rápida de todo, sin preocuparse demasiado por Python.
pt_br: Meu conselho é ler o livro focando primeiro nos conceitos e no ImageJ, para obter uma visão geral bastante rápida de tudo - sem se preocupar muito com Python.

source: You can always return to work through the Python sections later. However, be warned that the Python code is intended for people who already reasonably comfortable with programming, so if the language is entirely new to you then you might want to work through an introductory Python course first.
de: Sie können die Python-Abschnitte später jederzeit weiter bearbeiten. Seien Sie jedoch gewarnt, dass der Python-Code für Personen gedacht ist, die bereits einigermaßen mit dem Programmieren vertraut sind. Wenn die Sprache für Sie also völlig neu ist, sollten Sie zunächst einen Einführungskurs in Python absolvieren.
es: Siempre puedes volver a trabajar en las secciones de Python más adelante. Sin embargo, tenga en cuenta que el código Python está destinado a personas que ya se sienten razonablemente cómodas con la programación, por lo que si el lenguaje es completamente nuevo para usted, es posible que desee realizar primero un curso introductorio de Python.
pt_br: Você sempre pode voltar a trabalhar nas seções do Python mais tarde. No entanto, esteja avisado de que o código Python é destinado a pessoas que já estão razoavelmente confortáveis com programação; portanto, se a linguagem for totalmente nova para você, talvez você queira trabalhar primeiro em um curso introdutório ao Python.

source: Interactivity
de: Interaktivität
es: Interactividad
pt_br: Interatividade

source: It is *strongly* recommended to not only read the text, but also to put what you read into practice by exploring and experimenting.
de: Es wird *dringend* empfohlen, nicht nur den Text zu lesen, sondern das Gelesene auch durch Erkunden und Experimentieren in die Praxis umzusetzen.
es: Se recomienda *fuertemente* no sólo leer el texto, sino también poner en práctica lo leído explorando y experimentando.
pt_br: É *fortemente* recomendado não apenas ler o texto, mas também colocar em prática o que você lê, explorando e experimentando.

source: This handbook is designed to be interactive in two main ways:
de: Dieses Handbuch ist im Wesentlichen auf zwei Arten interaktiv gestaltet:
es: Este manual está diseñado para ser interactivo de dos maneras principales:
pt_br: Este manual foi projetado para ser interativo de duas maneiras principais:

source: [How to read this book](how-to-read-this-book)
de: [Wie man dieses Buch liest](wie-man-dieses-Buch-liest)
es: [Cómo leer este libro](cómo-leer-este-libro)
pt_br: [Como ler este livro](como-ler-este-livro)

source: [Interactivity](interactivity)
de: [Interaktivität](Interaktivität)
es: [Interactividad](interactividad)
pt_br: [Interatividade](interatividade)

source: [Questions \& practicals](questions-and-practicals)
de: [Fragen & Übungen](Fragen und Übungen)
es: [Preguntas\y practicas](preguntas-y-practicas)
pt_br: [Perguntas e práticas](perguntas e práticas)

source: [Live Jupyter notebooks ](sec-live-notebooks)
de: [Live-Jupyter-Notizbücher](sec-live-notebooks)
es: [Cuadernos Live Jupyter] (sec-live-notebooks)
pt_br: [Cadernos Jupyter ao vivo] (cadernos sec-live)

source: Questions & practicals
de: Fragen und praktische Hinweise
es: Preguntas y practicas
pt_br: Perguntas e práticas

source: Various questions and practical exercises are scattered throughout the text. To make the most of these, please follow the instructions below.
de: Im gesamten Text sind verschiedene Fragen und praktische Übungen verstreut. Um das Beste daraus zu machen, befolgen Sie bitte die nachstehenden Anweisungen.
es: A lo largo del texto se encuentran varias preguntas y ejercicios prácticos. Para aprovecharlos al máximo, siga las instrucciones a continuación.
pt_br: Várias questões e exercícios práticos estão espalhados ao longo do texto. Para aproveitar ao máximo, siga as instruções abaixo.

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: When you see a question, try to come up with your own answer first.
de: Wenn Sie eine Frage sehen, versuchen Sie zunächst, eine eigene Antwort zu finden.
es: Cuando vea una pregunta, primero intente encontrar su propia respuesta.
pt_br: Ao ver uma pergunta, tente primeiro encontrar sua própria resposta.

source: Then, if you want to compare your answer with mine, click on the *Answer* tab.
de: Wenn Sie dann Ihre Antwort mit meiner vergleichen möchten, klicken Sie auf die Registerkarte *Antwort*.
es: Luego, si quieres comparar tu respuesta con la mía, haz clic en la pestaña *Respuesta*.
pt_br: Então, se quiser comparar sua resposta com a minha, clique na aba *Resposta*.

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: Good! This is my answer.
de: Gut! Das ist meine Antwort.
es: ¡Bien! Esta es mi respuesta.
pt_br: Bom! Esta é a minha resposta.

source: Live Jupyter notebooks <a name="jupyter-notebooks" />
es: Cuadernos de Jupyter en vivo <a name="jupyter-notebooks" />
pt_br: Blocos de anotações Jupyter ativos <a name="jupyter-notebooks" />

source: This text exists as [Jupyter notebooks](https://jupyter.org) -- which can be made interactive with the help of [Binder](https://mybinder.org).
de: Dieser Text existiert als [Jupyter-Notizbücher](https://jupyter.org) – die mit Hilfe von [Binder](https://mybinder.org) interaktiv gestaltet werden können.
es: Este texto existe como [cuadernos de Jupyter](https://jupyter.org), que pueden volverse interactivos con la ayuda de [Binder](https://mybinder.org).
pt_br: Este texto existe como [cadernos Jupyter](https://jupyter.org) - que podem ser interativos com a ajuda do [Binder](https://mybinder.org).

source: You can activate a 'Live' version by clicking on the rocket icon on the top right, and choosing {guilabel}`Binder` or {guilabel}`Live code`.
de: Sie können eine „Live“-Version aktivieren, indem Sie oben rechts auf das Raketensymbol klicken und „Binder“ oder <span class='notranslate'>{guilabel}</span auswählen >`Live-Code`.
es: Puedes activar una versión 'en vivo' haciendo clic en el icono del cohete en la parte superior derecha y eligiendo {guilabel}`Binder` o {guilabel}`Código en vivo`.
pt_br: Você pode ativar uma versão 'Live' clicando no ícone do foguete no canto superior direito e escolhendo {guilabel}`Binder` ou {guilabel}`Código ao vivo`.

source: It will take a bit of time to start up Binder, but once it's ready you should see that the page is divided into different sections, called 'cells'.
de: Das Starten von Binder wird einige Zeit in Anspruch nehmen, aber sobald es fertig ist, sollten Sie sehen, dass die Seite in verschiedene Abschnitte, sogenannte „Zellen“, unterteilt ist.
es: Tomará un poco de tiempo iniciar Binder, pero una vez que esté listo deberías ver que la página está dividida en diferentes secciones, llamadas "celdas".
pt_br: Demorará um pouco para iniciar o Binder, mas quando estiver pronto você verá que a página está dividida em diferentes seções, chamadas ‘células’.

source: Some of these cells contain explanations (like this one), and some contain code. You can run each cell by clicking inside it and either a) clicking the *Run* button in the live toolbar, or b) pressing {kbd}`Shift+Enter`.
de: Einige dieser Zellen enthalten Erklärungen (wie diese), andere enthalten Code. Sie können jede Zelle ausführen, indem Sie in sie hineinklicken und entweder a) auf die Schaltfläche *Ausführen* in der Live-Symbolleiste klicken oder b) {kbd}`Umschalt+Eingabetaste` drücken.
es: Algunas de estas celdas contienen explicaciones (como esta) y otras contienen código. Puede ejecutar cada celda haciendo clic dentro de ella y a) haciendo clic en el botón *Ejecutar* en la barra de herramientas en vivo, ob) presionando {kbd}`Shift+Enter`.
pt_br: Algumas dessas células contêm explicações (como esta) e outras contêm código. Você pode executar cada célula clicando dentro dela e a) clicando no botão *Executar* na barra de ferramentas ao vivo ou b) pressionando {kbd}`Shift+Enter`.

source: This is how the Python sections should be used. With live Jupyter notebooks, you can run all the code yourself interactively. This includes making changes to the code within cells, and exploring how these changes impact the output.
de: So sollten die Python-Abschnitte verwendet werden. Mit Live-Jupyter-Notebooks können Sie den gesamten Code interaktiv selbst ausführen. Dazu gehört das Vornehmen von Änderungen am Code innerhalb der Zellen und die Untersuchung, wie sich diese Änderungen auf die Ausgabe auswirken.
es: Así es como se deben utilizar las secciones de Python. Con los cuadernos de Jupyter en vivo, puede ejecutar todo el código usted mismo de forma interactiva. Esto incluye realizar cambios en el código dentro de las celdas y explorar cómo estos cambios afectan el resultado.
pt_br: É assim que as seções Python devem ser usadas. Com notebooks Jupyter ativos, você mesmo pode executar todo o código de forma interativa. Isso inclui fazer alterações no código dentro das células e explorar como essas alterações afetam a saída.

source: But this isn't restricted *only* to the Python sections, because the figures in the main text are generated using Python code as well. This means you can use the {guilabel}`Click to show` buttons, like the one below, to see exactly how the figure was made -- and even modify the figures in a live notebook.
de: Dies ist aber nicht *nur* auf die Python-Abschnitte beschränkt, denn auch die Abbildungen im Haupttext werden mit Python-Code generiert. Das bedeutet, dass Sie die Schaltflächen {guilabel}„Zum Anzeigen anklicken“ wie die folgende verwenden können, um genau zu sehen, wie die Figur erstellt wurde – und die Figuren sogar in einem Live-Notizbuch ändern können .
es: Pero esto no se limita *sólo* a las secciones de Python, porque las figuras en el texto principal también se generan usando código Python. Esto significa que puedes usar los botones {guilabel}`Haz clic para mostrar`, como el que se muestra a continuación, para ver exactamente cómo se hizo la figura, e incluso modificar las figuras en un cuaderno en vivo. .
pt_br: Mas isso não está restrito *apenas* às seções Python, porque as figuras no texto principal também são geradas usando código Python. Isso significa que você pode usar os botões {guilabel}`Clique para mostrar`, como o mostrado abaixo, para ver exatamente como a figura foi feita - e até mesmo modificar as figuras em um caderno dinâmico .

source: An example figure.
de: Eine Beispielfigur.
es: Una figura de ejemplo.
pt_br: Uma figura de exemplo.
