Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: es, pt_br

source: Suppose that, on average, a single photon will be emitted from some part of a fluorescing sample within a particular time interval. The randomness entails that we cannot say for sure what will happen on any one occasion when we look; sometimes one photon will be emitted, sometimes none, sometimes two, occasionally even more. What we are really interested in, therefore, is not precisely _how many_ photons are emitted, which varies every time we look, but rather the _rate_ at which they would be emitted under fixed conditions, which is a constant. The difference between the number of photons actually emitted and the true rate of emission is the **photon noise**. The trouble is that keeping the conditions fixed might not be possible: leaving us with the problem of trying to figure out rates from single, noisy measurements.
es: Supongamos que, por término medio, se emitirá un solo fotón de alguna parte de una muestra fluorescente en un intervalo de tiempo determinado. La aleatoriedad implica que no podemos decir con seguridad qué ocurrirá en cada ocasión en que miremos; a veces se emitirá un fotón, a veces ninguno, a veces dos, a veces incluso más. Por tanto, lo que realmente nos interesa no es precisamente _cuántos_ fotones se emiten, lo cual varía cada vez que miramos, sino la _velocidad_ a la que se emitirían en condiciones fijas, que es una constante. La diferencia entre el número de fotones realmente emitidos y el verdadero ritmo de emisión es el **ruido fotónico**. El problema es que mantener las condiciones fijas puede no ser posible, lo que nos deja con el problema de intentar calcular las tasas a partir de mediciones únicas y ruidosas.
pt_br: Suponha que, em média, um único fóton seja emitido por alguma parte de uma amostra fluorescente dentro de um determinado intervalo de tempo. A aleatoriedade implica que não podemos dizer com certeza o que acontecerá em qualquer ocasião quando olharmos; às vezes um fóton será emitido, às vezes nenhum, às vezes dois, ocasionalmente até mais. O que realmente nos interessa, portanto, não é precisamente quantos fótons são emitidos, o que varia cada vez que olhamos, mas sim a taxa na qual eles seriam emitidos sob condições fixas, que é uma constante. A diferença entre o número de fótons realmente emitidos e a verdadeira taxa de emissão é o **ruído de fótons**. O problema é que manter as condições fixas pode não ser possível: deixando-nos com o problema de tentar calcular as taxas a partir de medições únicas e ruidosas.

source: Signal-dependent noise
es: Ruido dependiente de la señal
pt_br: Ruído dependente de sinal

source: Clearly, since it's a rate that we want, we could get that with more accuracy if we averaged many observations: just like with Gaussian noise, averaging reduces photon noise. Therefore, we can expect smoothing filters to work similarly for both noise types -- and they do.
es: Evidentemente, puesto que es una tasa lo que queremos, podríamos obtenerla con más precisión si promediáramos muchas observaciones: al igual que con el ruido gaussiano, promediar reduce el ruido de fotones. Por lo tanto, podemos esperar que los filtros de suavizado funcionen de forma similar para ambos tipos de ruido, y así es.
pt_br: Claramente, como é uma taxa que queremos, poderíamos obtê-la com mais precisão se calculássemos a média de muitas observações: assim como acontece com o ruído gaussiano, a média reduz o ruído dos fótons. Portanto, podemos esperar que os filtros de suavização funcionem de forma semelhante para ambos os tipos de ruído – e funcionam.

source: The primary distinction between the noise types, however, is that Poisson noise is **signal-dependent**, and _does_ change according to the number of emitted (or detected) photons. Fortunately, the relationship is simple: if the rate of photon emission is $\lambda$, the noise variance is also $\lambda$, and the noise standard deviation is $\sqrt{\lambda}$.
es: Sin embargo, la principal distinción entre los tipos de ruido es que el ruido de Poisson es **dependiente de la señal**, y _cambia_ según el número de fotones emitidos (o detectados). Afortunadamente, la relación es sencilla: si la tasa de emisión de fotones es $\lambda$, la varianza del ruido también es $\lambda$, y la desviación típica del ruido es $\sqrt{\lambda}$.
pt_br: A principal distinção entre os tipos de ruído, entretanto, é que o ruído de Poisson é **dependente do sinal** e _muda_ de acordo com o número de fótons emitidos (ou detectados). Felizmente, a relação é simples: se a taxa de emissão de fótons for $\lambda$, a variância do ruído também será $\lambda$, e o desvio padrão do ruído será $\sqrt{\lambda}$.

source: This is not really as unexpected as it might first seem (see {numref}`fig-fishing`). It can even be observed from a very close inspection of {numref}`fig-noise_neuron`, in which the increased variability in the neuron causes its ghostly appearance even in an image that ought to consist (almost) exclusively of noise.
es: En realidad, esto no es tan inesperado como podría parecer a primera vista (véase {numref}`fig-fishing`). Incluso puede observarse en una inspección muy cercana de {numref}`fig-noise_neuron`, en la que el aumento de la variabilidad en la neurona provoca su apariencia fantasmal incluso en una imagen que debería consistir (casi) exclusivamente en ruido.
pt_br: Isto não é tão inesperado quanto pode parecer à primeira vista (veja {numref}`fig-fishing`). Pode até ser observado a partir de uma inspeção muito minuciosa de {numref}`fig-noise_neuron`, em que o aumento da variabilidade no neurônio causa sua aparência fantasmagórica mesmo em uma imagem que deveria consistir (quase) exclusivamente de ruído.

source: __'The standard deviation of photon noise is equal to the square root of the expected value.'__ To understand this better, it may help to imagine a fisherman, fishing many times at the same location and under the same conditions. If he catches 10 fish on average, it would be quite reasonable to catch 7 or 13 on any one day -- while 20 would be exceptional. If, however, he caught 100 on average, then it would be unexceptional if he caught 90 or 110 on a particular day, although catching only 10 would be strange (and presumably disappointing). Intuitively, the range of values that would be considered likely is related to the expected value. If nothing else, this imperfect analogy may at least help remember the name of the distribution that photon noise follows.
es: La desviación típica del ruido de los fotones es igual a la raíz cuadrada del valor esperado"__ Para entenderlo mejor, puede ser útil imaginar a un pescador que pesca muchas veces en el mismo lugar y en las mismas condiciones. Si pesca una media de 10 peces, sería razonable que pescara 7 ó 13 un mismo día, mientras que 20 sería excepcional. Si, por el contrario, pesca 100 peces de media, no sería excepcional que pescara 90 o 110 en un día concreto, aunque pescar sólo 10 sería extraño (y presumiblemente decepcionante). Intuitivamente, el rango de valores que se considerarían probables está relacionado con el valor esperado. Aunque sólo sea por eso, esta analogía imperfecta puede ayudar al menos a recordar el nombre de la distribución que sigue el ruido de los fotones.
pt_br: __'O desvio padrão do ruído do fóton é igual à raiz quadrada do valor esperado.'__ Para entender isso melhor, pode ser útil imaginar um pescador pescando muitas vezes no mesmo local e nas mesmas condições. Se ele pescar 10 peixes em média, seria bastante razoável pescar 7 ou 13 em um dia – enquanto 20 seriam excepcionais. Se, no entanto, ele capturasse 100 em média, então não seria excepcional se capturasse 90 ou 110 num determinado dia, embora capturar apenas 10 fosse estranho (e presumivelmente decepcionante). Intuitivamente, o intervalo de valores que seriam considerados prováveis está relacionado ao valor esperado. No mínimo, essa analogia imperfeita pode pelo menos ajudar a lembrar o nome da distribuição que o ruído dos fótons segue.

source: A demonstration that Poisson noise changes throughout an image. (A) Part of a fluorescence microscopy image. (B) A Gaussian filtered version of (A) using a very small filter ($\sigma$=0.25). Gaussian filtering reduces the noise in an image by replacing each pixel with a weighted average of neighboring pixels (see {ref}`chap_filters`). \(C) The difference between the original and filtered image contains the noise that the filtering removed. The brighter areas in the original image are still visible in this 'noise image' as regions of increased variability. This is partly an effect of Poisson noise having made the noise standard deviation larger in the brighter parts of the acquired image.
es: Demostración de que el ruido de Poisson cambia a lo largo de una imagen. (A) Parte de una imagen de microscopía de fluorescencia. (B) Una versión con filtro gaussiano de (A) utilizando un filtro muy pequeño ($\sigma$=0,25). El filtrado gaussiano reduce el ruido de una imagen sustituyendo cada píxel por una media ponderada de los píxeles vecinos (véase {ref}`chap_filters`). \(C) La diferencia entre la imagen original y la filtrada contiene el ruido que el filtrado ha eliminado. Las zonas más brillantes de la imagen original siguen siendo visibles en esta "imagen de ruido" como regiones de mayor variabilidad. Esto es en parte un efecto del ruido de Poisson que ha hecho que la desviación estándar del ruido sea mayor en las partes más brillantes de la imagen adquirida.
pt_br: Uma demonstração de que o ruído de Poisson muda ao longo de uma imagem. (A) Parte de uma imagem de microscopia de fluorescência. (B) Uma versão filtrada gaussiana de (A) usando um filtro muito pequeno ($\sigma$=0,25). A filtragem gaussiana reduz o ruído em uma imagem substituindo cada pixel por uma média ponderada de pixels vizinhos (consulte {ref}`chap_filters`). \(C) A diferença entre a imagem original e a filtrada contém o ruído que a filtragem removeu. As áreas mais brilhantes na imagem original ainda são visíveis nesta “imagem de ruído” como regiões de maior variabilidade. Isto é parcialmente um efeito do ruído de Poisson ter aumentado o desvio padrão do ruído nas partes mais brilhantes da imagem adquirida.

source: The formula for the probability mass function of the Poisson distribution is:
es: La fórmula de la función de masa de probabilidad de la distribución de Poisson es:
pt_br: A fórmula para a função de massa de probabilidade da distribuição de Poisson é:

source: where
es: donde
pt_br: onde

source: $\lambda$ is the mean rate of occurrence of the event (i.e. the noise-free photon emission rate we want)
es: $\lambda$ es la tasa media de ocurrencia del suceso (es decir, la tasa de emisión de fotones sin ruido que queremos)
pt_br: $\lambda$ é a taxa média de ocorrência do evento (ou seja, a taxa de emissão de fótons sem ruído que queremos)

source: $k$ is an actual number of occurrences for which we want to compute the probability
es: $k$ es un número real de ocurrencias para las que queremos calcular la probabilidad
pt_br: $k$ é um número real de ocorrências para as quais queremos calcular a probabilidade

source: $k!$ is the _factorial_ of $k$ (i.e. $k \times (k-1) \times (k-2) \times ... \times 1$)
es: $k!$ es el _factorial_ de $k$ (es decir, $k \times (k-1) \times (k-2) \times ... \veces 1$)
pt_br: $k!$ é o _fatorial_ de $k$ (ou seja, $k \times (k-1) \times (k-2) \times ... \times 1$)

source: So if you know that the rate of photon emission is 0.5, for example, you can put $\lambda = 0.5$ into the equation and determine the probability of getting any particular (integer) value of $k$ photons. Applying this, the probability of not detecting any photons ($k = 0$) is 0.6065, while the probability of detecting a single photon ($k = 1$) is $0.3033$.
es: Así, si se sabe que la tasa de emisión de fotones es 0,5, por ejemplo, se puede poner $\lambda = 0,5$ en la ecuación y determinar la probabilidad de obtener cualquier valor particular (entero) de $k$ fotones. Aplicando esto, la probabilidad de no detectar ningún fotón ($k = 0$) es 0,6065, mientras que la probabilidad de detectar un solo fotón ($k = 1$) es 0,3033$.
pt_br: Então, se você sabe que a taxa de emissão de fótons é 0,5, por exemplo, você pode colocar $\lambda = 0,5$ na equação e determinar a probabilidade de obter qualquer valor particular (inteiro) de $k$ fótons. Aplicando isso, a probabilidade de não detectar nenhum fóton ($k = 0$) é 0,6065, enquanto a probabilidade de detectar um único fóton ($k = 1$) é $0,3033$.

source: What we know for sure is that we can't possibly detect 0.5 photons: we'll get an integer value, not 'part of a photon'.
es: Lo que sabemos con certeza es que no es posible detectar 0,5 fotones: obtendremos un valor entero, no "parte de un fotón".
pt_br: O que sabemos com certeza é que não podemos detectar 0,5 fótons: obteremos um valor inteiro, não “parte de um fóton”.

source: Assuming the mean rate of photon emission is 1, use Equation {eq}`eqn-poisson` to calculate the probability of actually detecting 5 (which, at 5 times the true rate, would be an extremely inaccurate result). How common do you suppose it is to find pixels that are so noisy in the background region of a dark image?
es: Suponiendo que la tasa media de emisión de fotones es 1, utilice la ecuación {eq}`eqn-poisson` para calcular la probabilidad de detectar realmente 5 (que, con una tasa 5 veces superior a la verdadera, sería un resultado extremadamente inexacto). ¿Cómo de común crees que es encontrar píxeles tan ruidosos en la región de fondo de una imagen oscura?
pt_br: Supondo que a taxa média de emissão de fótons seja 1, use a Equação {eq}`eqn-poisson` para calcular a probabilidade de realmente detectar 5 (que, a 5 vezes a taxa verdadeira, seria um resultado extremamente impreciso). Você acha que é comum encontrar pixels com tanto ruído na região de fundo de uma imagem escura?

source: The probability of detecting 5 photons is approximately 0.0031.
es: La probabilidad de detectar 5 fotones es de aproximadamente 0,0031.
pt_br: A probabilidade de detectar 5 fótons é de aproximadamente 0,0031.

source: Although this is a very low probability, images contain so many pixels that one should expect to see such noisy values often. For example, in a rather dark and dull 512×512 pixel image in which the average photon emission rate is 1, we would expect 800 pixels to have a value of 5 -- and two pixels even to have a value of 8. The presence of isolated bright or dark pixels therefore usually tells us very little indeed, and it is only by processing the image more carefully and looking at surrounding values that we can (sometimes) discount the possibility these are simply the result of noise.
es: Aunque se trata de una probabilidad muy baja, las imágenes contienen tantos píxeles que cabe esperar ver con frecuencia valores tan ruidosos. Por ejemplo, en una imagen bastante oscura y apagada de 512×512 píxeles en la que la tasa media de emisión de fotones es 1, cabría esperar que 800 píxeles tuvieran un valor de 5, y que dos píxeles incluso tuvieran un valor de 8. Por tanto, la presencia de píxeles brillantes u oscuros aislados suele decirnos muy poco, y sólo procesando la imagen con más cuidado y observando los valores circundantes podemos (a veces) descartar la posibilidad de que sean simplemente el resultado del ruido.
pt_br: Embora esta seja uma probabilidade muito baixa, as imagens contêm tantos pixels que seria de esperar ver valores tão barulhentos com frequência. Por exemplo, em uma imagem bastante escura e opaca de 512 × 512 pixels, na qual a taxa média de emissão de fótons é 1, esperaríamos que 800 pixels tivessem um valor de 5 - e até dois pixels tivessem um valor de 8. A presença Portanto, a quantidade de pixels brilhantes ou escuros isolados geralmente nos diz muito pouco, e é somente processando a imagem com mais cuidado e observando os valores circundantes que podemos (às vezes) descartar a possibilidade de que estes sejam simplesmente o resultado de ruído.

source: The SNR for Poisson noise
es: La SNR para el ruido de Poisson
pt_br: O SNR para ruído de Poisson

source: If the standard deviation of noise was the only thing that mattered, this would suggest that we are better not detecting much light: then the photon noise standard deviation is lower. But the SNR is a much more reliable guide. For noise that follows a Poisson distribution this is particularly easy to calculate. Substituting into the formula for the SNR (Equation {eq}`eqn-snr`):
es: Si la desviación típica del ruido fuera lo único que importara, esto sugeriría que es mejor no detectar mucha luz: entonces la desviación típica del ruido fotónico es menor. Pero la SNR es una guía mucho más fiable. Para el ruido que sigue una distribución de Poisson, es especialmente fácil de calcular. Sustituyendo en la fórmula para la SNR (Ecuación {eq}`eqn-snr`):
pt_br: Se o desvio padrão do ruído fosse a única coisa que importasse, isso sugeriria que é melhor não detectarmos muita luz: então o desvio padrão do ruído do fóton é menor. Mas o SNR é um guia muito mais confiável. Para ruído que segue uma distribuição de Poisson isto é particularmente fácil de calcular. Substituindo na fórmula o SNR (Equação b033ec2e2e2a8c98z0`eqn-snr`):

source: Therefore **the SNR of photon noise is equal to the square root of the signal**!
es: ¡Por lo tanto **la SNR del ruido fotónico es igual a la raíz cuadrada de la señal**!
pt_br: Portanto **o SNR do ruído do fóton é igual à raiz quadrada do sinal**!

source: This means that as the average number of emitted (and thus detected) photons increases, so too does the SNR. More photons &rarr; a better SNR, directly leading to the assertion
es: Esto significa que a medida que aumenta el número medio de fotones emitidos (y, por tanto, detectados), también lo hace la SNR. Más fotones &rarr; <span class='transifex-protect'> </span> una mejor SNR, lo que conduce directamente a la afirmación
pt_br: Isto significa que à medida que o número médio de fótons emitidos (e, portanto, detectados) aumenta, o mesmo acontece com o SNR. Mais fótons &rarr; um SNR melhor, levando diretamente à afirmação

source: If you want to reduce photon noise, you need to detect more photons
es: Si se quiere reducir el ruido fotónico, hay que detectar más fotones
pt_br: Se você quiser reduzir o ruído dos fótons, precisará detectar mais fótons

source: We can visualize this using a simulation that displays how an image and its histogram change over time as more photons are detected.
es: Podemos visualizarlo mediante una simulación que muestra cómo una imagen y su histograma cambian con el tiempo a medida que se detectan más fotones.
pt_br: Podemos visualizar isso usando uma simulação que mostra como uma imagem e seu histograma mudam ao longo do tempo à medida que mais fótons são detectados.

source: This is really just the same as the insight that averaging reduces noise. Averaging and summing have the same effect, differing only by a constant scale factor.
es: Esto es lo mismo que decir que el promedio reduce el ruido. El promedio y la suma tienen el mismo efecto y sólo se diferencian por un factor de escala constante.
pt_br: Na verdade, isso é exatamente o mesmo que a percepção de que a média reduz o ruído. A média e a soma têm o mesmo efeito, diferindo apenas por um fator de escala constante.

source: Why relativity matters: a simple example
es: Por qué es importante la relatividad: un ejemplo sencillo
pt_br: Por que a relatividade é importante: um exemplo simples

source: The SNR increases with the number of photons, even though the noise standard deviation increases too, because it's really _relative_ differences in the brightness in parts of the image that we are interested in. Absolute numbers usually are of very little importance -- which is fortunate, since not all photons are detected.
es: La SNR aumenta con el número de fotones, aunque la desviación estándar del ruido también aumente, porque lo que realmente nos interesa son las diferencias _relativas_ en el brillo de algunas partes de la imagen. Los números absolutos suelen tener muy poca importancia, lo cual es una suerte, ya que no se detectan todos los fotones.
pt_br: O SNR aumenta com o número de fótons, embora o desvio padrão do ruído também aumente, porque são realmente diferenças _relativas_ no brilho em partes da imagem nas quais estamos interessados. Os números absolutos geralmente têm muito pouca importância - o que é uma sorte , uma vez que nem todos os fótons são detectados.

source: Yet if you remain unconvinced that the noise standard deviation can get bigger while the situation gets better, the following specific example might help. Suppose the true signal for a pixel is 4 photons. Assuming the actual measured value is within one noise standard deviation of the proper result (which it will be, about 68% of the time), one expects it to be in the range 2–6. The true signal at another pixel is twice as strong -- 8 photons -- and, by the same argument, one expects to measure a value in the range 5–11. _The ranges for both pixels overlap!_ With photon counts this low, even if one pixel has twice the value of another, we often cannot discern with confidence that the *true*, noise-free value for both pixels would be different at all.
es: Sin embargo, si sigue sin estar convencido de que la desviación típica del ruido puede aumentar mientras mejora la situación, el siguiente ejemplo concreto podría ayudarle. Supongamos que la señal verdadera de un píxel es de 4 fotones. Suponiendo que el valor medido real esté dentro de una desviación estándar de ruido del resultado correcto (lo que será, aproximadamente, el 68% de las veces), se espera que esté en el rango 2-6. La señal real en otro píxel es el doble de fuerte -- 8 fotones -- y, por el mismo argumento, se espera medir un valor en el rango 5-11. Con recuentos de fotones tan bajos, aunque un píxel tenga el doble de valor que otro, a menudo no podemos discernir con seguridad que el valor *verdadero*, sin ruido, de ambos píxeles sea diferente.
pt_br: No entanto, se você ainda não está convencido de que o desvio padrão do ruído pode aumentar à medida que a situação melhora, o exemplo específico a seguir pode ajudar. Suponha que o sinal verdadeiro para um pixel seja de 4 fótons. Supondo que o valor real medido esteja dentro de um desvio padrão de ruído do resultado adequado (o que estará, cerca de 68% das vezes), espera-se que esteja na faixa de 2–6. O sinal verdadeiro em outro pixel é duas vezes mais forte – 8 fótons – e, pelo mesmo argumento, espera-se medir um valor na faixa de 5–11. _Os intervalos de ambos os pixels se sobrepõem!_ Com contagens de fótons tão baixas, mesmo que um pixel tenha o dobro do valor de outro, muitas vezes não conseguimos discernir com confiança que o valor *verdadeiro* e livre de ruído para ambos os pixels seria diferente.
