Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: es, pt_br

source: On the other hand, suppose the true signal for the first pixel is 100 photons, so we measure something in the range of 90–110. The second pixel, still twice as bright, gives a measurement in the range 186–214. These ranges are larger, but crucially they are not even close to overlapping, so it's very easy to tell the pixels apart. Thus the noise standard deviation alone is not a very good measure of how noisy an image is. The SNR is much more informative: the simple rule is that higher is better. Or, if that still does not feel right, you can turn it upside down and consider the noise-to-signal ratio (the _relative noise_), in which case lower is better ({numref}`fig-snr_plot`).
es: Por otro lado, supongamos que la señal real del primer píxel es de 100 fotones, por lo que medimos algo en el rango de 90-110. El segundo píxel, todavía el doble de brillante, da una medida en el rango 186-214. Estos rangos son mayores, pero lo más importante es que ni siquiera se superponen, por lo que es muy fácil distinguir los píxeles. Por lo tanto, la desviación estándar del ruido por sí sola no es una buena medida de lo ruidosa que es una imagen. La SNR es mucho más informativa: la regla simple es que cuanto más alta, mejor. O, si aún así no le parece correcto, puede darle la vuelta y considerar la relación ruido/señal (el _ruido relativo_), en cuyo caso más bajo es mejor ({numref}`fig-snr_plot`).
pt_br: Por outro lado, suponha que o sinal verdadeiro para o primeiro pixel seja de 100 fótons, então medimos algo na faixa de 90–110. O segundo pixel, ainda duas vezes mais brilhante, fornece uma medição na faixa de 186–214. Esses intervalos são maiores, mas o mais importante é que não chegam nem perto da sobreposição, por isso é muito fácil distinguir os pixels. Assim, o desvio padrão do ruído por si só não é uma medida muito boa do nível de ruído de uma imagem. O SNR é muito mais informativo: a regra simples é que quanto maior, melhor. Ou, se isso ainda não parecer certo, você pode virar de cabeça para baixo e considerar a relação ruído-sinal (o _ruído relativo_), caso em que quanto menor, melhor ({numref}`fig-snr_plot`).

source: For Poisson noise, the standard deviation increases with the square root of the signal. So does the SNR, with the result that plots (A) and (B) look identical. This improvement in SNR despite the growing noise occurs because the signal is increasing faster than the noise, and so the noise is relatively smaller. Plotting the relative noise (1/SNR) shows this effect \(C).
es: Para el ruido de Poisson, la desviación típica aumenta con la raíz cuadrada de la señal. Lo mismo ocurre con la SNR, por lo que los gráficos (A) y (B) son idénticos. Esta mejora de la SNR a pesar del aumento del ruido se debe a que la señal aumenta más rápido que el ruido, por lo que éste es relativamente menor. El ruido relativo (1/SNR) muestra este efecto (C).
pt_br: Para o ruído de Poisson, o desvio padrão aumenta com a raiz quadrada do sinal. O mesmo acontece com o SNR, com o resultado de que os gráficos (A) e (B) parecem idênticos. Esta melhoria no SNR, apesar do ruído crescente, ocorre porque o sinal aumenta mais rapidamente que o ruído e, portanto, o ruído é relativamente menor. Traçar o ruído relativo (1/SNR) mostra esse efeito \(C).

source: Poisson noise & detection
es: Ruido de Poisson y detección
pt_br: Ruído e detecção de Poisson

source: So why should you care that photon noise is signal-dependent?
es: Entonces, ¿por qué debería importarte que el ruido de los fotones dependa de la señal?
pt_br: Então, por que você deveria se preocupar com o fato de o ruído do fóton depender do sinal?

source: One reason is that it can make features of identical sizes and brightnesses easier or harder to detect in an image purely because of the local background. This is illustrated in {numref}`fig-poisson_ramp`.
es: Una de las razones es que puede facilitar o dificultar la detección de características de tamaños y brillos idénticos en una imagen debido únicamente al fondo local. Esto se ilustra en {numref}`fig-poisson_ramp`.
pt_br: Um dos motivos é que ele pode facilitar ou dificultar a detecção de recursos de tamanhos e brilhos idênticos em uma imagem, apenas por causa do plano de fundo local. Isso é ilustrado em {numref}`fig-poisson_ramp`.

source: The signal-dependence of Poisson noise affects how visible (and therefore detectable) structures are in an image. (A) Nine spots of the same _absolute_ brightness are added to an image with a linearly increasing background _(top)_ and Poisson noise is added _(bottom)_. Because the noise variability becomes higher as the background increases, the spots in the darkest part of the image can be clearly seen in the profile but it's more difficult to discern spots in the brighter part. (B) Spots of the same brightness _relative_ to the background are added, along with Poisson noise. Because the noise is now relatively lower as the brightness increases, only the spots in the brightest part of the image can be seen, while those in the darker part are buried within the noise.
es: La dependencia de la señal del ruido de Poisson afecta al grado de visibilidad (y, por tanto, de detectabilidad) de las estructuras en una imagen. (A) Se añaden nueve manchas del mismo brillo _absoluto_ a una imagen con un fondo que aumenta linealmente _(arriba)_ y se añade ruido de Poisson _(abajo)_. Como la variabilidad del ruido es mayor a medida que aumenta el fondo, las manchas de la parte más oscura de la imagen pueden verse claramente en el perfil, pero es más difícil distinguir las manchas de la parte más brillante. (B) Se añaden manchas del mismo brillo _relativo_ al fondo, junto con ruido de Poisson. Como el ruido es ahora relativamente menor a medida que aumenta la luminosidad, sólo pueden verse las manchas de la parte más luminosa de la imagen, mientras que las de la parte más oscura quedan ocultas por el ruido.
pt_br: A dependência do sinal do ruído de Poisson afeta o quão visíveis (e, portanto, detectáveis) as estruturas são em uma imagem. (A) Nove pontos com o mesmo brilho _absoluto_ são adicionados a uma imagem com um fundo linearmente crescente _(superior)_ e ruído de Poisson é adicionado _(inferior)_. Como a variabilidade do ruído aumenta à medida que o fundo aumenta, os pontos na parte mais escura da imagem podem ser vistos claramente no perfil, mas é mais difícil discernir os pontos na parte mais clara. (B) São adicionados pontos com o mesmo brilho _em relação_ ao fundo, junto com o ruído de Poisson. Como o ruído é agora relativamente menor à medida que o brilho aumenta, apenas os pontos na parte mais clara da imagem podem ser vistos, enquanto os da parte mais escura ficam ocultos no ruído.

source: In general, if we want to see a fluorescence increase of a fixed number of photons, this is easier to do if the background is very dark. But if the fluorescence increase is defined _relative_ to the background, it will be much easier to identify if the background is high. Either way, when attempting to determine the number of any small structures in an image, for example, we need to remember that the numbers we will be able to detect will be affected by the background nearby. Therefore results obtained from bright and dark regions might not be directly comparable.
es: En general, si queremos ver un aumento de fluorescencia de un número fijo de fotones, es más fácil hacerlo si el fondo es muy oscuro. Pero si el aumento de fluorescencia se define _relativo_ al fondo, será mucho más fácil identificarlo si el fondo es alto. En cualquier caso, cuando intentemos determinar el número de estructuras pequeñas en una imagen, por ejemplo, debemos recordar que el número que podremos detectar se verá afectado por el fondo cercano. Por lo tanto, los resultados obtenidos a partir de regiones claras y oscuras podrían no ser directamente comparables.
pt_br: Em geral, se quisermos ver um aumento de fluorescência de um número fixo de fótons, isso será mais fácil de fazer se o fundo for muito escuro. Mas se o aumento da fluorescência for definido _em relação_ ao fundo, será muito mais fácil identificar se o fundo é alto. De qualquer forma, ao tentar determinar o número de quaisquer pequenas estruturas em uma imagem, por exemplo, precisamos lembrar que os números que seremos capazes de detectar serão afetados pelo fundo próximo. Portanto, os resultados obtidos em regiões claras e escuras podem não ser diretamente comparáveis.

source: Practical
es: Práctico
pt_br: Prático

source: Open the images *mystery_noise_1.tif* and *mystery_noise_2.tif* in ImageJ.
es: Abra las imágenes *mystery_noise_1.tif* y *mystery_noise_2.tif* en ImageJ.
pt_br: Abra as imagens *mystery_noise_1.tif* e *mystery_noise_2.tif* no ImageJ.

source: Both are noisy, but in one the noise follows a Gaussian distribution (like read noise) and in the other it follows a Poisson distribution (like photon noise). Which is which?
es: Ambos tienen ruido, pero en uno el ruido sigue una distribución gaussiana (como el ruido de lectura) y en el otro sigue una distribución de Poisson (como el ruido de fotones). ¿Cuál es cuál?
pt_br: Ambos são ruidosos, mas em um o ruído segue uma distribuição gaussiana (como o ruído de leitura) e no outro segue uma distribuição de Poisson (como o ruído de fóton). Qual e qual?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_2.tif)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_1.tif&amp;open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_2.tif)
pt_br: [![lançar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https:/ /github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_2.tif)

source: launch ImageJ.JS
es: iniciar ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
es: Solución
pt_br: Solução

source: The noise in *mystery_noise_1.tif* is Gaussian; the noise in *mystery_noise_2.tif* follows a Poisson distribution. Since there are reasonably flat regions within the cell and background, I would test this by drawing a ROI within each and measuring the standard deviations. Where these are similar, the noise is Gaussian; if there is a big difference, the noise is likely to be Poisson.
es: El ruido en *mystery_noise_1.tif* es gaussiano; el ruido en *mystery_noise_2.tif* sigue una distribución de Poisson. Dado que hay regiones razonablemente planas dentro de la celda y el fondo, yo lo comprobaría dibujando una ROI dentro de cada una y midiendo las desviaciones estándar. Si son similares, el ruido es gaussiano; si hay una gran diferencia, es probable que el ruido sea de Poisson.
pt_br: O ruído em *mystery_noise_1.tif* é gaussiano; o ruído em *mystery_noise_2.tif* segue uma distribuição de Poisson. Como existem regiões razoavelmente planas na célula e no fundo, eu testaria isso desenhando um ROI dentro de cada uma e medindo os desvios padrão. Onde estes são semelhantes, o ruído é gaussiano; se houver uma grande diferença, o ruído provavelmente será de Poisson.

source: If no flat regions were available, I would try applying a gradient filter with the coefficients `-1 1 0`, and inspecting the results. Alternatively, I might try plotting a fluorescence profile or subtracting a very slightly smoothed version of each image.
es: Si no dispusiera de regiones planas, intentaría aplicar un filtro de gradiente con los coeficientes `-1 1 0`, e inspeccionar los resultados. Otra posibilidad sería trazar un perfil de fluorescencia o sustraer una versión ligeramente suavizada de cada imagen.
pt_br: Se nenhuma região plana estivesse disponível, eu tentaria aplicar um filtro de gradiente com os coeficientes `-1 1 0` e inspecionar os resultados. Alternativamente, posso tentar traçar um perfil de fluorescência ou subtrair uma versão ligeiramente suavizada de cada imagem.

source: Combining noise sources
es: Combinación de fuentes de ruido
pt_br: Combinando fontes de ruído

source: Combining our noise sources then, we can imagine an actual pixel value as being the sum of three values: the true rate of photon emission, the photon noise component, and the read noise component [^fn_5]. The first of these is what we want, while the latter two are random numbers that may be positive or negative.
es: Combinando nuestras fuentes de ruido, podemos imaginar un valor de píxel real como la suma de tres valores: la tasa real de emisión de fotones, el componente de ruido de fotones y el componente de ruido de lectura [^fn_5]. El primero de ellos es el que queremos, mientras que los dos últimos son números aleatorios que pueden ser positivos o negativos.
pt_br: Combinando nossas fontes de ruído, podemos imaginar um valor real de pixel como sendo a soma de três valores: a taxa real de emissão de fótons, o componente de ruído de fóton e o componente de ruído de leitura [^fn_5]. O primeiro deles é o que queremos, enquanto os dois últimos são números aleatórios que podem ser positivos ou negativos.

source: An illustration of how photon noise differs from read noise. When both are added to a signal (here, a series of steps in which the value doubles at each higher step), the relative importance of each depends upon the value of the signal. At low signal levels this doubling is very difficult to discern amidst either type of noise, and even more so when both noise components are present.
es: Ilustración de la diferencia entre el ruido fotónico y el ruido de lectura. Cuando ambos se añaden a una señal (en este caso, una serie de pasos en los que el valor se duplica en cada paso superior), la importancia relativa de cada uno depende del valor de la señal. A niveles bajos de señal, esta duplicación es muy difícil de discernir en medio de cualquiera de los dos tipos de ruido, y más aún cuando están presentes ambos componentes de ruido.
pt_br: Uma ilustração de como o ruído do fóton difere do ruído de leitura. Quando ambos são adicionados a um sinal (aqui, uma série de passos em que o valor duplica a cada passo mais elevado), a importância relativa de cada um depende do valor do sinal. Em níveis de sinal baixos, esta duplicação é muito difícil de discernir em qualquer tipo de ruído, e ainda mais quando ambos os componentes de ruído estão presentes.

source: This is illustrated in {numref}`fig-noise_steps` using a simple 1D signal consisting of a series of steps. Random values are added to this to simulate photon and read noise. Whenever the signal is very low (indicating few photons), the variability in the photon noise is very low -- but high _relative_ to the signal (B)! This variability increases when the signal increases. However, in the read noise case \(C), the variability is similar everywhere. When both noise types are combined in (D), the read noise dominates completely when there are few photons, but has very little impact whenever the signal increases. Photon noise has already made detecting relative differences in brightness difficult when there are few photons; with read noise, it can become hopeless.
es: Esto se ilustra en {numref}`fig-noise_steps` utilizando una simple señal 1D consistente en una serie de pasos. Se le añaden valores aleatorios para simular el ruido de fotones y de lectura. Cuando la señal es muy baja (indicando pocos fotones), la variabilidad en el ruido de fotones es muy baja - ¡pero alta _relativa_ a la señal (B)! Esta variabilidad aumenta cuando la señal aumenta. Sin embargo, en el caso del ruido de lectura \(C), la variabilidad es similar en todas partes. Cuando ambos tipos de ruido se combinan en (D), el ruido de lectura domina completamente cuando hay pocos fotones, pero tiene muy poco impacto cuando la señal aumenta. El ruido de fotones ya ha dificultado la detección de diferencias relativas de brillo cuando hay pocos fotones; con el ruido de lectura, puede llegar a ser desesperante.
pt_br: Isso é ilustrado em {numref}`fig-noise_steps` usando um sinal 1D simples que consiste em uma série de etapas. Valores aleatórios são adicionados a isso para simular fótons e ruído de leitura. Sempre que o sinal é muito baixo (indicando poucos fótons), a variabilidade no ruído do fóton é muito baixa - mas alta _em relação_ ao sinal (B)! Essa variabilidade aumenta quando o sinal aumenta. Entretanto, no caso do ruído de leitura \(C), a variabilidade é semelhante em todos os lugares. Quando ambos os tipos de ruído são combinados em (D), o ruído de leitura domina completamente quando há poucos fótons, mas tem muito pouco impacto sempre que o sinal aumenta. O ruído dos fótons já dificultou a detecção de diferenças relativas no brilho quando há poucos fótons; com ruído de leitura, pode ficar sem esperança.

source: Therefore overcoming read noise is critical for low-light imaging, and the choice of detector is extremely important (see {ref}`chap_microscope_types`). But, where possible, detecting more photons is an _extremely_ good thing anyway, since it helps to overcome _both_ types of noise.
es: Por lo tanto, superar el ruido de lectura es fundamental para obtener imágenes con poca luz, y la elección del detector es extremadamente importante (véase {ref}`chap_microscope_types`). Pero, siempre que sea posible, detectar más fotones es algo _extremadamente_ bueno, ya que ayuda a superar _ambos_ tipos de ruido.
pt_br: Portanto, superar o ruído de leitura é fundamental para imagens com pouca luz, e a escolha do detector é extremamente importante (consulte {ref}`chap_microscope_types`). Mas, sempre que possível, detectar mais fótons é algo _extremamente_ bom, pois ajuda a superar _ambos_ os tipos de ruído.

source: Other noise sources
es: Otras fuentes de ruido
pt_br: Outras fontes de ruído

source: Photon and read noise are the main sources of noise that need to be considered when designing and carrying out an experiment. One other source often mentioned in the literature is _dark noise_, which can be thought of as arising when a wayward electron causes the detector to register a photon even when there was not actually one there. In very low-light images, this lead to spurious bright pixels. However, dark noise is less likely to cause problems if many true photons are detected, and many detectors reduce its occurrence by cooling the sensor.
es: Los fotones y el ruido de lectura son las principales fuentes de ruido que hay que tener en cuenta a la hora de diseñar y llevar a cabo un experimento. Otra fuente que se menciona a menudo en la bibliografía es el _ruido oscuro_, que se produce cuando un electrón caprichoso hace que el detector registre un fotón aunque en realidad no haya ninguno. En imágenes con muy poca luz, esto da lugar a píxeles brillantes espurios. Sin embargo, es menos probable que el ruido oscuro cause problemas si se detectan muchos fotones reales, y muchos detectores reducen su aparición enfriando el sensor.
pt_br: O ruído de fótons e de leitura são as principais fontes de ruído que precisam ser consideradas ao projetar e realizar um experimento. Uma outra fonte frequentemente mencionada na literatura é o ruído escuro, que pode ser considerado como surgindo quando um elétron rebelde faz com que o detector registre um fóton, mesmo quando na verdade não havia nenhum ali. Em imagens com pouca luz, isso leva a pixels brilhantes falsos. No entanto, é menos provável que o ruído escuro cause problemas se muitos fótons verdadeiros forem detectados, e muitos detectores reduzem sua ocorrência resfriando o sensor.

source: If the equipment is functioning properly, other noise sources could probably not be distinguished from these three. Nevertheless, brave souls who wish to know more may find a concise, highly informative, list of more than 40 sources of imprecision in _The 39 steps: a cautionary tale of quantitative 3-D fluorescence microscopy_ by James Pawley (available online from various sources).
es: Si el equipo funciona correctamente, es probable que no se puedan distinguir otras fuentes de ruido de estas tres. No obstante, los valientes que deseen saber más pueden encontrar una lista concisa y muy informativa de más de 40 fuentes de imprecisión en _The 39 steps: a cautionary tale of quantitative 3-D fluorescence microscopy_, de James Pawley (disponible en línea en diversas fuentes).
pt_br: Se o equipamento estiver funcionando corretamente, provavelmente não será possível distinguir outras fontes de ruído destas três. No entanto, almas corajosas que desejam saber mais podem encontrar uma lista concisa e altamente informativa de mais de 40 fontes de imprecisão em _Os 39 passos: um conto preventivo sobre microscopia quantitativa de fluorescência 3-D_ de James Pawley (disponível online em várias fontes) .

source: Suppose you have an image that does not contain much light, but has some isolated bright pixels.
es: Suponga que tiene una imagen que no contiene mucha luz, pero tiene algunos píxeles brillantes aislados.
pt_br: Suponha que você tenha uma imagem que não contém muita luz, mas possui alguns pixels brilhantes isolados.

source: Which kind of filter could you use to remove them? And is it safe to assume they are due to dark noise or something similar, or might the pixels correspond to actual bright structures?
es: ¿Qué tipo de filtro podría utilizar para eliminarlos? ¿Y es seguro suponer que se deben a ruido oscuro o algo similar, o puede que los píxeles correspondan a estructuras brillantes reales?
pt_br: Que tipo de filtro você poderia usar para removê-los? E é seguro presumir que são devidos a ruído escuro ou algo semelhante, ou os pixels podem corresponder a estruturas brilhantes reais?

source: A median filter is a popular choice for removing isolated bright pixels, although when using ImageJ I sometimes prefer {menuselection}`Process --> Noise --> Remove Outliers...` because this only puts the median-filtered output in the image if the original value was really extreme (according to some user-defined threshold). This then preserves the independence of the noise at all other pixels -- so it still behaves reliably and predictably like Poisson + Gaussian noise. We can reduce the remaining noise with a Gaussian filter if necessary.
es: Un filtro de mediana es una opción popular para eliminar los píxeles brillantes aislados, aunque cuando se utiliza ImageJ a veces prefiero {menuselection}`Process --&gt; Noise --&gt; Remove Outliers...` porque esto sólo pone la salida filtrada por la mediana en la imagen si el valor original era realmente extremo (de acuerdo con algún umbral definido por el usuario). Esto preserva la independencia del ruido en el resto de los píxeles -- por lo que todavía se comporta de forma fiable y predecible como el ruido de Poisson + Gauss. Si es necesario, podemos reducir el ruido restante con un filtro gaussiano.
pt_br: Um filtro mediano é uma escolha popular para remover pixels brilhantes isolados, embora ao usar ImageJ eu às vezes prefira {menuselection}`Process --> Noise --> Remove Outliers...` porque isso só coloca a saída filtrada pela mediana na imagem se o valor original for realmente extremo (de acordo com algum limite definido pelo usuário). Isso preserva a independência do ruído em todos os outros pixels - de modo que ainda se comporta de maneira confiável e previsível como o ruído Poisson + Gaussiano. Podemos reduzir o ruído restante com um filtro gaussiano, se necessário.
