Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: es, pt_br

source: The noise causes us a similar degree of uncertainty in the first two cases. In the third case, the noise is likely to be less problematic: higher SNRs are good.
es: El ruido nos causa un grado similar de incertidumbre en los dos primeros casos. En el tercer caso, es probable que el ruido sea menos problemático: las SNR más altas son buenas.
pt_br: O ruído nos causa um grau semelhante de incerteza nos dois primeiros casos. No terceiro caso, o ruído provavelmente será menos problemático: SNRs mais elevados são bons.

source: Exploring noise
es: Explorar el ruido
pt_br: Explorando o ruído

source: I find the best way to learn about noise is by creating simulation images, and exploring their properties through making and testing predictions.
es: Creo que la mejor forma de aprender sobre el ruido es crear imágenes de simulación y explorar sus propiedades haciendo y probando predicciones.
pt_br: Acho que a melhor maneira de aprender sobre o ruído é criando imagens de simulação e explorando suas propriedades fazendo e testando previsões.

source: The figures in this chapter are generated using such simulations in Python. If you want to do something similar in ImageJ, you can add Gaussian noise with a fixed standard deviation to any image using {menuselection}`Process --> Noise --> Add Specified Noise...`.
es: Las figuras de este capítulo se han generado utilizando este tipo de simulaciones en Python. Si desea hacer algo similar en ImageJ, puede añadir ruido gaussiano con una desviación estándar fija a cualquier imagen utilizando {menuselection}`Process --&gt; Noise --&gt; Add Specified Noise...`.
pt_br: As figuras neste capítulo são geradas usando tais simulações em Python. Se quiser fazer algo semelhante no ImageJ, você pode adicionar ruído gaussiano com um desvio padrão fixo a qualquer imagem usando {menuselection}`Process --> Noise --> Add Specified Noise. ..`.

source: If needed, you can create an empty 32-bit image with {menuselection}`File --> New --> Image...` add noise to get an image containing nothing but noise.
es: Si es necesario, puede crear una imagen vacía de 32 bits con {menuselection}`Archivo --&gt; Nuevo --&gt; Imagen...` añadir ruido para obtener una imagen que no contenga nada más que ruido.
pt_br: Se necessário, você pode criar uma imagem vazia de 32 bits com {menuselection}`File --> New --> Image...` add noise para obter uma imagem contendo nada além de ruído .

source: Adding & averaging noisy images
es: Añadir y promediar imágenes ruidosas
pt_br: Adicionando e calculando a média de imagens com ruído

source: {ref}`At the beginning of this chapter<sec_noise_background>`, I stated how to calculate the new standard deviation of the noise whenever two noisy pixels are added together:
es: {ref}`Al principio de este capítulo<sec_noise_background>`, indiqué cómo calcular la nueva desviación estándar del ruido cuando se suman dos píxeles ruidosos:
pt_br: {ref}`No início deste capítulo<sec_noise_background>`, afirmei como calcular o novo desvio padrão do ruído sempre que dois ruídos pixels são somados:

source: Square the original noise standard deviation to get the variance for each pixel
es: Eleva al cuadrado la desviación típica del ruido original para obtener la varianza de cada píxel
pt_br: Eleve ao quadrado o desvio padrão do ruído original para obter a variação de cada pixel

source: Add the variances
es: Añadir las desviaciones
pt_br: Adicione as variações

source: Take the square root of the result
es: Sacar la raíz cuadrada del resultado
pt_br: Tire a raiz quadrada do resultado

source: Suppose that we have two (independent) images with the same Gaussian noise standard deviation, let's say 5. Applying this calculation, if we add the images together then the noise standard deviation of the resulting image is
es: Supongamos que tenemos dos imágenes (independientes) con la misma desviación típica del ruido gaussiano, digamos 5. Aplicando este cálculo, si sumamos las imágenes, la desviación típica del ruido de la imagen resultante es
pt_br: Suponha que temos duas imagens (independentes) com o mesmo desvio padrão do ruído gaussiano, digamos 5. Aplicando este cálculo, se somarmos as imagens então o desvio padrão do ruído da imagem resultante é

source: \sqrt{5^2 + 5^2} = \sqrt{50} \approx 7.07
es: \sqrt{5^2 + 5^2} = \sqrt{50} \Aproximadamente 7.07
pt_br: \sqrt{5^2 + 5^2} = \sqrt{50} \aproximadamente 7,07

source: The noise standard deviation of the resulting image is higher.
es: La desviación típica del ruido de la imagen resultante es mayor.
pt_br: O desvio padrão do ruído da imagem resultante é maior.

source: We might expect that the sum of two noisy image is therefore *worse*: we have increased the noise. *However*, we need to remember that the signal is also higher: in fact, it has been doubled (because we added two similar images).
es: Podríamos esperar que la suma de dos imágenes ruidosas sea, por tanto, *peor*: hemos aumentado el ruido. *Sin embargo*, debemos recordar que la señal también es mayor: de hecho, se ha duplicado (porque hemos sumado dos imágenes similares).
pt_br: Poderíamos esperar que a soma de duas imagens com ruído fosse, portanto, *pior*: aumentamos o ruído. *No entanto*, precisamos lembrar que o sinal também é maior: na verdade, ele foi duplicado (porque adicionamos duas imagens semelhantes).

source: If we want an output image with similar signal to the originals, we should *average* the corresponding pixel values instead of adding. In this case, averaging is the same as adding, except that we divide by two. When we do this, the noise standard deviation is also halved and becomes approximately 3.54 -- i.e. it is *lower* than in either of the original two images.
es: Si queremos una imagen de salida con una señal similar a la de los originales, debemos *promediar* los valores de los píxeles correspondientes en lugar de sumar. En este caso, promediar es lo mismo que sumar, salvo que dividimos por dos. Al hacer esto, la desviación estándar del ruido también se reduce a la mitad y pasa a ser aproximadamente 3,54, es decir, es *más baja* que en cualquiera de las dos imágenes originales.
pt_br: Se quisermos uma imagem de saída com sinal semelhante aos originais, devemos *fazer a média* dos valores dos pixels correspondentes em vez de somar. Nesse caso, calcular a média é o mesmo que somar, exceto que dividimos por dois. Quando fazemos isso, o desvio padrão do ruído também cai pela metade e se torna aproximadamente 3,54 - ou seja, é *menor* do que em qualquer uma das duas imagens originais.

source: This matters, because it implies that if we were to average two independent noisy images of the same scene with similar SNRs, we would get a result that contains _less_ noise, i.e. a higher SNR.
es: Esto es importante, porque implica que si tuviéramos que promediar dos imágenes ruidosas independientes de la misma escena con SNR similares, obtendríamos un resultado que contiene _menos_ ruido, es decir, una SNR más alta.
pt_br: Isso é importante porque implica que se fizéssemos a média de duas imagens independentes com ruído da mesma cena com SNRs semelhantes, obteríamos um resultado que contém _menos_ ruído, ou seja, um SNR mais alto.

source: But you shouldn't just take my word for it. We can check that it really works by using a simulation. {numref}`fig-fig_noise_sum` demonstrates this, and has a very practical implication: noise reduction by averaging images creates a better peak separation in the histogram. This means it should usually give us an image that is more amenable to thresholding.
es: Pero no hay que fiarse sólo de mi palabra. Podemos comprobar que realmente funciona mediante una simulación. {numref} El programa `fig-fig_noise_sum` lo demuestra, y tiene una implicación muy práctica: la reducción de ruido promediando imágenes crea una mejor separación de picos en el histograma. Esto significa que, por lo general, debería darnos una imagen más susceptible de umbralización.
pt_br: Mas você não deve acreditar apenas na minha palavra. Podemos verificar se realmente funciona usando uma simulação. {numref}`fig-fig_noise_sum` demonstra isso e tem uma implicação muito prática: a redução de ruído por meio da média das imagens cria uma melhor separação de picos no histograma. Isso significa que geralmente deve nos fornecer uma imagem mais passível de limiarização.

source: Adding and averaging two independent images with Gaussian noise. Both adding and averaging give an image with an improved SNR, as can be seen in the improved separation between the histogram peaks.
es: Suma y promedio de dos imágenes independientes con ruido gaussiano. Tanto sumando como promediando se obtiene una imagen con una SNR mejorada, como puede verse en la separación mejorada entre los picos del histograma.
pt_br: Adicionando e calculando a média de duas imagens independentes com ruído gaussiano. Tanto a adição quanto a média fornecem uma imagem com um SNR melhorado, como pode ser visto na separação aprimorada entre os picos do histograma.

source: Adding & averaging within an image
es: Añadir y promediar dentro de una imagen
pt_br: Adicionando e calculando a média em uma imagem

source: All this means that *if* can acquire the same image multiple times, then averaging our different images would give a result with reduced noise.
es: Todo esto significa que *si* se puede adquirir la misma imagen varias veces, al promediar las distintas imágenes se obtendría un resultado con menos ruido.
pt_br: Tudo isso significa que *se* pudermos adquirir a mesma imagem várias vezes, então calcular a média de nossas diferentes imagens daria um resultado com ruído reduzido.

source: Of course, we don't usually have multiple independent images of everything we might want to analyze. Instead, we just have one image. However, we can explore the idea by splitting a single image into two -- provided we are willing to sacrifice some spatial resolution.
es: Por supuesto, no solemos tener varias imágenes independientes de todo lo que queramos analizar. En su lugar, sólo tenemos una imagen. Sin embargo, podemos explorar la idea dividiendo una sola imagen en dos, siempre que estemos dispuestos a sacrificar algo de resolución espacial.
pt_br: É claro que normalmente não temos múltiplas imagens independentes de tudo o que queremos analisar. Em vez disso, temos apenas uma imagem. No entanto, podemos explorar a ideia dividindo uma única imagem em duas – desde que estejamos dispostos a sacrificar alguma resolução espacial.

source: If we take the pixels from every second column of the image, we can extract these and combine them to form another image that looks like a squished version of the original. We can do the same process for all the columns we skipped -- thereby giving us two squished images, one from the even-numbered columns and one from the odd-numbered columns.
es: Si tomamos los píxeles de cada dos columnas de la imagen, podemos extraerlos y combinarlos para formar otra imagen que parezca una versión comprimida de la original. Podemos hacer lo mismo con todas las columnas que nos hemos saltado, con lo que obtendremos dos imágenes reducidas, una de las columnas pares y otra de las impares.
pt_br: Se pegarmos os pixels de cada segunda coluna da imagem, podemos extraí-los e combiná-los para formar outra imagem que se pareça com uma versão comprimida da original. Podemos fazer o mesmo processo para todas as colunas que pulamos - obtendo assim duas imagens comprimidas, uma das colunas pares e outra das colunas ímpares.

source: You can see in Figure {numref}`fig-fig_noise_split` that our squished images do look almost identical, because adjacent pixels usually do have very similar values -- apart from the differences caused by noise. If we average these images together, these differences average out and we have another similar-looking image -- but with reduced noise.
es: Puede ver en la figura {numref}`fig-fig_noise_split` que nuestras imágenes aplastadas parecen casi idénticas, porque los píxeles adyacentes suelen tener valores muy similares, aparte de las diferencias causadas por el ruido. Si promediamos estas imágenes, estas diferencias se compensan y obtenemos otra imagen de aspecto similar, pero con menos ruido.
pt_br: Você pode ver na Figura {numref}`fig-fig_noise_split` que nossas imagens comprimidas parecem quase idênticas, porque pixels adjacentes geralmente têm valores muito semelhantes - exceto pelas diferenças causadas pelo ruído . Se fizermos a média dessas imagens, essas diferenças serão médias e teremos outra imagem de aparência semelhante - mas com ruído reduzido.

source: Creating two images from one by taking even and odd-numbered columns. If we then average our two images, noise is reduced. The difference is subtle, but can be seen in the better separation of the peaks in the histogram.
es: Crear dos imágenes a partir de una tomando columnas pares e impares. Si luego promediamos las dos imágenes, se reduce el ruido. La diferencia es sutil, pero se aprecia en la mejor separación de los picos en el histograma.
pt_br: Criar duas imagens a partir de uma usando colunas pares e ímpares. Se fizermos a média de nossas duas imagens, o ruído será reduzido. A diferença é sutil, mas pode ser percebida na melhor separação dos picos no histograma.

source: Of course, this trick has an obvious downside: the squishing is undesirable. Fortunately, we can avoid it simply by averaging adjacent columns but not splitting them into separate image. Then we can do the same with adjacent rows. And perhaps even adjacent diagonals, if we wish.
es: Por supuesto, este truco tiene un inconveniente obvio: el aplastamiento es indeseable. Afortunadamente, podemos evitarlo simplemente promediando las columnas adyacentes pero sin dividirlas en imágenes separadas. Luego podemos hacer lo mismo con filas adyacentes. E incluso con las diagonales adyacentes, si lo deseamos.
pt_br: É claro que esse truque tem uma desvantagem óbvia: o esmagamento é indesejável. Felizmente, podemos evitá-lo simplesmente calculando a média das colunas adjacentes, mas não dividindo-as em imagens separadas. Então podemos fazer o mesmo com linhas adjacentes. E talvez até diagonais adjacentes, se desejarmos.

source: This is *precisely* the idea underlying our use of a [3×3 mean filter to reduce noise](chap_filters): we don't have independent images to average, so we average within an image instead ({numref}`fig-noise_filt_averaging`).
es: Esta es *precisamente* la idea que subyace a nuestro uso de un [filtro de media 3×3 para reducir el ruido](chap_filters): no tenemos imágenes independientes para promediar, así que promediamos dentro de una imagen en su lugar ({numref}`fig-noise_filt_averaging`).
pt_br: Esta é *precisamente* a ideia subjacente ao nosso uso de um [filtro médio 3×3 para reduzir o ruído](chap_filters): não temos imagens independentes para calcular a média, então, em vez disso, calculamos a média dentro de uma imagem ({numref}`fig-noise_filt_averaging`).

source: Noise reduction by averaging adjacent pixels. Even though the overall appearance of the image has not changed much, the histograms indicate a much bigger separation of the foreground and background -- meaning that thresholds are more likely to work well. In (C), the result is equivalent to applying a 3×3 mean filter.
es: Reducción del ruido promediando píxeles adyacentes. Aunque el aspecto general de la imagen no ha cambiado mucho, los histogramas indican una separación mucho mayor entre el primer plano y el fondo, lo que significa que es más probable que los umbrales funcionen bien. En (C), el resultado es equivalente a aplicar un filtro de media 3×3.
pt_br: Redução de ruído calculando a média de pixels adjacentes. Embora a aparência geral da imagem não tenha mudado muito, os histogramas indicam uma separação muito maior entre o primeiro plano e o fundo – o que significa que os limites têm maior probabilidade de funcionar bem. Em (C), o resultado equivale à aplicação de um filtro de média 3×3.

source: Hopefully this discussion helps build your intuition as to *why* filters are able to reduce Gaussian noise. In the next section, we'll see how many of the same ideas apply to Poisson noise as well.
es: Esperamos que este análisis le ayude a comprender por qué los filtros son capaces de reducir el ruido gaussiano. En la próxima sección, veremos cómo muchas de las mismas ideas se aplican también al ruido de Poisson.
pt_br: Esperamos que esta discussão ajude a construir sua intuição sobre *por que* os filtros são capazes de reduzir o ruído gaussiano. Na próxima seção, veremos quantas das mesmas ideias também se aplicam ao ruído de Poisson.

source: Poisson noise
es: Ruido de Poisson
pt_br: Ruído de Poisson

source: In 1898, Ladislaus Bortkiewicz published a book entitled _The Law of Small Numbers_. Among other things, it included a now-famous analysis of the number of soldiers in different corps of the Prussian cavalry who were killed by being kicked by a horse, measured over a 20-year period. Specifically, he showed that these numbers follows a **Poisson distribution**.
es: En 1898, Ladislaus Bortkiewicz publicó un libro titulado _La ley de los números pequeños_. Entre otras cosas, incluía un análisis, ahora famoso, del número de soldados de diferentes cuerpos de la caballería prusiana que morían al ser pateados por un caballo, medido a lo largo de un periodo de 20 años. En concreto, demostró que estas cifras siguen una **distribución de Poisson**.
pt_br: Em 1898, Ladislaus Bortkiewicz publicou um livro intitulado _A Lei dos Pequenos Números_. Entre outras coisas, incluía uma análise agora famosa do número de soldados em diferentes corpos da cavalaria prussiana que foram mortos ao serem coiceados por um cavalo, medido ao longo de um período de 20 anos. Especificamente, ele mostrou que esses números seguem uma **distribuição de Poisson**.

source: This distribution, introduced by Siméon Denis Poisson in 1838, gives the probability of an event happening a certain number of times, given that we know (1) the average rate at which it occurs, and (2) that all of its occurrences are independent. However, the usefulness of the Poisson distribution extends far beyond gruesome military analysis to many, quite different applications -- including the probability of photon emission, which is itself inherently random.
es: Esta distribución, introducida por Siméon Denis Poisson en 1838, da la probabilidad de que un suceso ocurra un cierto número de veces, dado que conocemos (1) el ritmo medio al que ocurre y (2) que todos sus sucesos son independientes. Sin embargo, la utilidad de la distribución de Poisson va mucho más allá de los truculentos análisis militares y tiene aplicaciones muy diversas, como la probabilidad de emisión de fotones, que es intrínsecamente aleatoria.
pt_br: Esta distribuição, introduzida por Siméon Denis Poisson em 1838, dá a probabilidade de um evento acontecer um certo número de vezes, dado que sabemos (1) a taxa média com que ocorre e (2) que todas as suas ocorrências são independentes. . No entanto, a utilidade da distribuição de Poisson estende-se muito além da horrível análise militar, abrangendo muitas aplicações bastante diferentes - incluindo a probabilidade de emissão de fotões, que é em si inerentemente aleatória.

source: Siméon Denis Poisson and his distribution. (A) Poisson is said to have been extremely clumsy and uncoordinated with his hands. This contributed to him giving up an apprenticeship as a surgeon and entering mathematics, where the problem was less debilitating -- although apparently this meant his diagrams tended not to very well drawn (see https://mathshistory.st-andrews.ac.uk/Biographies/Poisson/). (B) The 'Probability Mass Function' of the Poisson distribution for several different values of λ. This allows one to see for any 'true signal' λ the probability of actually counting any actual value k. Although it's more likely that one will count exactly k = λ than any other possible k, as λ increases the probability of getting precisely this value becomes smaller and smaller.
es: Siméon Denis Poisson y su distribución. (A) Se dice que Poisson era extremadamente torpe y descoordinado con las manos. Esto contribuyó a que abandonara su aprendizaje como cirujano y se dedicara a las matemáticas, donde el problema era menos debilitante, aunque aparentemente esto significaba que sus diagramas no solían estar muy bien dibujados (véase https://mathshistory.st-andrews.ac.uk/Biographies/Poisson/). (B) La "función de masa de probabilidad" de la distribución de Poisson para varios valores diferentes de λ. Esto permite ver, para cualquier "señal verdadera" λ, la probabilidad de contar realmente cualquier valor real k. Aunque es más probable que uno cuente exactamente k = λ que cualquier otro k posible, a medida que λ aumenta la probabilidad de obtener precisamente este valor se hace cada vez más pequeña.
pt_br: Siméon Denis Poisson e sua distribuição. (A) Diz-se que Poisson era extremamente desajeitado e descoordenado com as mãos. Isso contribuiu para que ele desistisse do aprendizado de cirurgião e ingressasse na matemática, onde o problema era menos debilitante - embora aparentemente isso significasse que seus diagramas tendiam a não ser muito bem desenhados (ver https://mathshistory.st-andrews.ac.uk /Biografias/Poisson/). (B) A 'Função de Massa de Probabilidade' da distribuição de Poisson para vários valores diferentes de λ. Isso permite ver, para qualquer 'sinal verdadeiro' λ, a probabilidade de realmente contar qualquer valor real k. Embora seja mais provável que se conte exatamente k = λ do que qualquer outro k possível, à medida que λ aumenta, a probabilidade de obter precisamente esse valor torna-se cada vez menor.
