Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: es, pt_br

source: Noise
es: Ruido
pt_br: Barulho

source: Chapter outline
es: Esquema del capítulo
pt_br: Esboço do capítulo

source: There are two main types of noise in fluorescence microscopy: **photon noise & read noise**
es: Existen dos tipos principales de ruido en microscopía de fluorescencia: **ruido fotónico y ruido de lectura
pt_br: Existem dois tipos principais de ruído na microscopia de fluorescência: **ruído de fóton e ruído de leitura**

source: **Photon noise** is _signal-dependent_, varying throughout an image
es: **El ruido fotónico depende de la señal y varía a lo largo de la imagen.
pt_br: **O ruído do fóton** _depende do sinal_, variando ao longo da imagem

source: **Read noise** is _signal-independent_, and depends upon the detector
es: **El ruido de lectura es independiente de la señal y depende del detector.
pt_br: **O ruído de leitura** é _independente do sinal_ e depende do detector

source: **Detecting more photons** reduces the impact of both noise types
es: **Detectar más fotones** reduce el impacto de ambos tipos de ruido
pt_br: **A detecção de mais fótons** reduz o impacto de ambos os tipos de ruído

source: Introduction
es: Introducción
pt_br: Introdução

source: We could reasonably expect that a noise-free microscopy image should look pleasantly smooth, not least because the convolution with the PSF has a blurring effect that softens any sharp transitions. Yet in practice raw fluorescence microscopy images are not smooth. They are always, to a greater or lesser extent, corrupted by noise. This appears as a random 'graininess' throughout the image, which is often strong enough to obscure details.
es: Podríamos esperar razonablemente que una imagen de microscopía sin ruido tuviera un aspecto agradablemente suave, entre otras cosas porque la convolución con la PSF tiene un efecto de desenfoque que suaviza cualquier transición brusca. Sin embargo, en la práctica, las imágenes en bruto de microscopía de fluorescencia no son lisas. Siempre están, en mayor o menor medida, corrompidas por el ruido. Éste aparece como un "grano" aleatorio en toda la imagen, que a menudo es lo suficientemente fuerte como para ocultar los detalles.
pt_br: Poderíamos razoavelmente esperar que uma imagem de microscopia sem ruído parecesse agradavelmente suave, até porque a convolução com o PSF tem um efeito de desfoque que suaviza quaisquer transições nítidas. No entanto, na prática, as imagens brutas de microscopia de fluorescência não são suaves. Estão sempre, em maior ou menor grau, corrompidos pelo ruído. Isto aparece como uma “granulação” aleatória em toda a imagem, que muitas vezes é forte o suficiente para obscurecer os detalhes.

source: This chapter considers the nature of the noisiness, where it comes from, and what can be done about it. Before starting, it may be helpful to know the one major lesson of this chapter for the working microscopist is simply:
es: En este capítulo se analiza la naturaleza del ruido, de dónde procede y qué se puede hacer al respecto. Antes de empezar, puede ser útil saber que la lección principal de este capítulo para el microscopista en activo es simplemente:
pt_br: Este capítulo considera a natureza do ruído, de onde ele vem e o que pode ser feito a respeito. Antes de começar, pode ser útil saber que a principal lição deste capítulo para o microscopista ativo é simplesmente:

source: **If you want to reduce noise, you need to detect more photons**
es: **Si quieres reducir el ruido, necesitas detectar más fotones**
pt_br: **Se quiser reduzir o ruído, você precisa detectar mais fótons**

source: This general guidance applies in the overwhelming majority of cases when a good quality microscope is functioning properly. Nevertheless, it may be helpful to know a bit more detail about why -- and what you might do if detecting more photons is not feasible.
es: Esta orientación general se aplica en la inmensa mayoría de los casos cuando un microscopio de buena calidad funciona correctamente. No obstante, puede ser útil conocer un poco más en detalle por qué y qué hacer si no es posible detectar más fotones.
pt_br: Esta orientação geral aplica-se na esmagadora maioria dos casos quando um microscópio de boa qualidade está funcionando corretamente. No entanto, pode ser útil saber um pouco mais detalhadamente sobre o porquê - e o que você pode fazer se a detecção de mais fótons não for viável.

source: Background
es: Fondo
pt_br: Fundo

source: Illustration of the difference between a noisy image that we can record (A), and the noise-free image we would prefer (B). The 'noise' itself is what would be left over if we subtracted one from the other \(C). The histogram in (D) resembles a normal (i.e. Gaussian) distribution and shows that the noise consists of positive and negative values, with a mean of 0.
es: Ilustración de la diferencia entre una imagen con ruido que podemos grabar (A), y la imagen sin ruido que preferiríamos (B). El "ruido" en sí es lo que quedaría si restáramos una de la otra (C). El histograma en (D) se asemeja a una distribución normal (es decir, gaussiana) y muestra que el ruido consiste en valores positivos y negativos, con una media de 0.
pt_br: Ilustração da diferença entre uma imagem com ruído que podemos gravar (A) e a imagem sem ruído que preferiríamos (B). O 'ruído' em si é o que sobraria se subtraíssemos um do outro \(C). O histograma em (D) se assemelha a uma distribuição normal (ou seja, gaussiana) e mostra que o ruído consiste em valores positivos e negativos, com média 0.

source: In general, we can assume that noise in fluorescence microscopy images has the following three characteristics, illustrated in {numref}`fig-noise_demo`:
es: En general, podemos suponer que el ruido en las imágenes de microscopía de fluorescencia tiene las tres características siguientes, ilustradas en {numref}`fig-noise_demo`:
pt_br: Em geral, podemos assumir que o ruído nas imagens de microscopia de fluorescência tem as três características a seguir, ilustradas em {numref}`fig-noise_demo`:

source: **Noise is random** -- For any pixel, the noise is a random positive or negative number added to the 'true value' the pixel should have.
es: **El ruido es aleatorio** -- Para cualquier píxel, el ruido es un número aleatorio positivo o negativo añadido al "valor verdadero" que debería tener el píxel.
pt_br: **O ruído é aleatório** - Para qualquer pixel, o ruído é um número aleatório positivo ou negativo adicionado ao 'valor verdadeiro' que o pixel deveria ter.

source: **Noise is independent at each pixel** -- The value of the noise at any pixel does not depend upon where the pixel is, or what the noise is at any other pixel.
es: **El ruido es independiente en cada píxel** -- El valor del ruido en cualquier píxel no depende de dónde esté el píxel, o de cuál sea el ruido en cualquier otro píxel.
pt_br: **O ruído é independente em cada pixel** -- O valor do ruído em qualquer pixel não depende de onde o pixel está ou qual é o ruído em qualquer outro pixel.

source: **Noise follows a particular distribution** -- Each noise value can be seen as a _random variable_ drawn from a particular distribution. If we have enough noise values, their histogram would resemble a plot of the distribution [^fn_1].
es: **El ruido sigue una distribución particular** -- Cada valor de ruido puede verse como una _variable aleatoria_ extraída de una distribución particular. Si tenemos suficientes valores de ruido, su histograma se parecería a un gráfico de la distribución [^fn_1].
pt_br: **O ruído segue uma distribuição específica** - Cada valor de ruído pode ser visto como uma _variável aleatória_ extraída de uma distribuição específica. Se tivermos valores de ruído suficientes, seu histograma se assemelharia a um gráfico da distribuição [^fn_1].

source: There are many different possible noise distributions, but we only need to consider the **Poisson** and **Gaussian** cases. No matter which of these we have, the most interesting distribution parameter for us is the **standard deviation**. Assuming everything else stays the same, if the standard deviation of the noise is higher then the image looks worse ({numref}`fig-gaussian_hists`).
es: Hay muchas distribuciones de ruido posibles, pero sólo tenemos que considerar los casos **Poisson** y **Gaussiano**. Sea cual sea, el parámetro de distribución más interesante para nosotros es la **desviación estándar**. Suponiendo que todo lo demás permanezca igual, si la desviación estándar del ruido es mayor, la imagen tendrá peor aspecto ({numref}`fig-gaussian_hists`).
pt_br: Existem muitas distribuições de ruído possíveis, mas só precisamos considerar os casos **Poisson** e **Gaussiano**. Não importa qual deles tenhamos, o parâmetro de distribuição mais interessante para nós é o **desvio padrão**. Supondo que todo o resto permaneça igual, se o desvio padrão do ruído for maior, a imagem parecerá pior ({numref}`fig-gaussian_hists`).

source: Gaussian noise with different standard deviations added to an image. Noise with a higher standard deviation has a worse effect when added to an image. Its impact can be seen in the histogram, as the distribution of foreground and background pixels overlap more -- which is problematic for things like [thresholding](chap_thresholding).
es: Ruido gaussiano con diferentes desviaciones estándar añadido a una imagen. El ruido con una desviación estándar más alta tiene un efecto peor cuando se añade a una imagen. Su impacto puede verse en el histograma, ya que la distribución de los píxeles del primer plano y del fondo se solapan más -- lo que es problemático para cosas como [thresholding](chap_thresholding).
pt_br: Ruído gaussiano com diferentes desvios padrão adicionados a uma imagem. Ruído com desvio padrão mais alto tem efeito pior quando adicionado a uma imagem. Seu impacto pode ser visto no histograma, à medida que a distribuição dos pixels de primeiro plano e de fundo se sobrepõem mais - o que é problemático para coisas como [limiar](chap_thresholding).

source: The reason we will consider two distributions is that there are two main types of noise for us to worry about:
es: La razón por la que consideraremos dos distribuciones es que hay dos tipos principales de ruido de los que debemos preocuparnos:
pt_br: A razão pela qual consideraremos duas distribuições é que existem dois tipos principais de ruído com os quais devemos nos preocupar:

source: **Photon noise**, from the emission (and detection) of the light itself. This follows a Poisson distribution, for which _the standard deviation changes with the local image brightness_.
es: **Ruido fotónico**, procedente de la emisión (y detección) de la propia luz. Éste sigue una distribución de Poisson, para la cual _la desviación estándar cambia con el brillo local de la imagen_.
pt_br: **Ruído de fóton**, proveniente da emissão (e detecção) da própria luz. Isso segue uma distribuição de Poisson, para a qual _o desvio padrão muda com o brilho local da imagem_.

source: **Read noise**, arising from inaccuracies in quantifying numbers of detected photons. This follows a Gaussian distribution, for which _the standard deviation stays the same throughout the image_.
es: **Ruido de lectura**, debido a las imprecisiones en la cuantificación del número de fotones detectados. Sigue una distribución gaussiana, para la que _la desviación típica es la misma en toda la imagen_.
pt_br: **Ruído de leitura**, resultante de imprecisões na quantificação do número de fótons detectados. Isso segue uma distribuição gaussiana, para a qual _o desvio padrão permanece o mesmo em toda a imagem_.

source: Therefore the noise in the image is really the result of adding two [^fn_2] separate random components together. In other words, to get the value of any pixel $P$ you need to calculate the sum of the 'true' (noise-free) value $T$, a random photon noise value $N_p$, and a random read noise value $N_r$, i.e.
es: Por lo tanto, el ruido en la imagen es realmente el resultado de sumar dos [^fn_2] componentes aleatorios separados. En otras palabras, para obtener el valor de cualquier píxel $P$ hay que calcular la suma del valor "verdadero" (sin ruido) $T$, un valor de ruido fotónico aleatorio $N_p$, y un valor de ruido de lectura aleatorio $N_r$, es decir
pt_br: Portanto, o ruído na imagem é realmente o resultado da adição de dois [^fn_2] componentes aleatórios separados. Em outras palavras, para obter o valor de qualquer pixel $P$ você precisa calcular a soma do valor 'verdadeiro' (sem ruído) $T$, um valor de ruído de fóton aleatório $N_p$ e um valor de ruído de leitura aleatório $N_r$, ou seja

source: In this case, we have $P$ in the image but we want $T$. Unfortunately, we don't know precisely what the random values $N_p$ and $N_r$ are.
es: En este caso, tenemos $P$ en la imagen pero queremos $T$. Por desgracia, no sabemos con precisión cuáles son los valores aleatorios $N_p$ y $N_r$.
pt_br: Neste caso, temos $P$ na imagem mas queremos $T$. Infelizmente, não sabemos exatamente quais são os valores aleatórios $N_p$ e $N_r$.

source: Finally, some useful maths:
es: Por último, algunas matemáticas útiles:
pt_br: Finalmente, algumas contas úteis:

source: Suppose we add two random noisy values together. Both are independent and drawn from distributions (Gaussian or Poisson) with standard deviations $\sigma_1$ and $\sigma_2$. The result is a third random value, drawn from a distribution with a standard deviation $\sqrt{\sigma_1^2 + \sigma_2^2}$.
es: Supongamos que sumamos dos valores aleatorios ruidosos. Ambos son independientes y proceden de distribuciones (Gaussiana o Poisson) con desviaciones típicas $\sigma_1$ y $\sigma_2$. El resultado es un tercer valor aleatorio, extraído de una distribución con una desviación típica $\sqrt{\sigma_1^2 + \sigma_2^2}$.
pt_br: Suponha que adicionemos dois valores ruidosos aleatórios. Ambos são independentes e extraídos de distribuições (Gaussiana ou Poisson) com desvios padrão $\sigma_1$ e $\sigma_2$. O resultado é um terceiro valor aleatório, extraído de uma distribuição com desvio padrão $\sqrt{\sigma_1^2 + \sigma_2^2}$.

source: If we multiply a noisy value from a distribution with a standard deviation $\sigma_1$ by $k$, the result is noise from a distribution with a standard deviation $k\sigma_1$.
es: Si multiplicamos un valor ruidoso de una distribución con una desviación típica $\sigma_1$ por $k$, el resultado es ruido de una distribución con una desviación típica $k\sigma_1$.
pt_br: Se multiplicarmos um valor ruidoso de uma distribuição com desvio padrão $\sigma_1$ por $k$, o resultado será ruído de uma distribuição com desvio padrão $k\sigma_1$.

source: These are all my most important noise facts, upon which the rest of this chapter is built. We will begin with Gaussian noise because it's easier to work with, found in many applications, and widely studied in the image processing literature. However, in _most_ fluorescence images photon noise is the more important factor. Fortunately, there's a close relationship between the Gaussian and Poisson noise -- and it's even possible to convert the latter to behave like the former.
es: Estos son los datos más importantes sobre el ruido, sobre los que se construye el resto de este capítulo. Empezaremos con el ruido gaussiano porque es más fácil trabajar con él, se encuentra en muchas aplicaciones y está ampliamente estudiado en la literatura sobre procesamiento de imágenes. Sin embargo, en la mayoría de las imágenes de fluorescencia, el ruido fotónico es el factor más importante. Afortunadamente, existe una estrecha relación entre el ruido gaussiano y el de Poisson, e incluso es posible convertir este último para que se comporte como el primero.
pt_br: Esses são todos os meus fatos mais importantes sobre ruído, sobre os quais o restante deste capítulo será construído. Começaremos com o ruído gaussiano porque é mais fácil de trabalhar, encontrado em muitas aplicações e amplamente estudado na literatura de processamento de imagens. No entanto, na maioria das imagens de fluorescência, o ruído do fóton é o fator mais importante. Felizmente, existe uma relação estreita entre o ruído gaussiano e o ruído de Poisson - e é até possível converter o último para se comportar como o primeiro.

source: Gaussian noise
es: Ruido gaussiano
pt_br: Ruído gaussiano

source: Gaussian noise is a common problem in fluorescence images acquired using a CCD camera (see {ref}`chap_microscope_types`). It arises at the stage of quantifying the number of photons detected for each pixel. Quantifying photons is hard to do with complete precision, and the result is likely to be wrong by at least a few photons. This error is the read noise.
es: El ruido gaussiano es un problema común en las imágenes de fluorescencia adquiridas con una cámara CCD (véase {ref}`chap_microscope_types`). Surge en la fase de cuantificación del número de fotones detectados en cada píxel. Cuantificar los fotones es difícil de hacer con total precisión, y es probable que el resultado sea erróneo en al menos unos pocos fotones. Este error es el ruido de lectura.
pt_br: O ruído gaussiano é um problema comum em imagens de fluorescência adquiridas usando uma câmera CCD (consulte {ref}`chap_microscope_types`). Surge na fase de quantificação do número de fótons detectados para cada pixel. Quantificar fótons é difícil de ser feito com total precisão, e o resultado provavelmente estará errado em pelo menos alguns fótons. Este erro é o ruído de leitura.

source: Read noise typically follows a Gaussian distribution and has a mean of zero: this implies there is an equal likelihood of over or underestimating the number of photons. Furthermore, according to the properties of Gaussian distributions, we should expect around ~68% of measurements to be ±1 standard deviation from the true, read-noise-free value. If a detector has a low read noise standard deviation, this is then a good thing: it means the error should be small.
es: El ruido de lectura sigue normalmente una distribución gaussiana y tiene una media de cero: esto implica que existe la misma probabilidad de sobreestimar o subestimar el número de fotones. Además, de acuerdo con las propiedades de las distribuciones gaussianas, deberíamos esperar que alrededor del ~68% de las mediciones tuvieran una desviación estándar de ±1 respecto al valor real sin ruido de lectura. Si un detector tiene una desviación estándar de ruido de lectura baja, esto es bueno: significa que el error debería ser pequeño.
pt_br: O ruído de leitura normalmente segue uma distribuição gaussiana e tem média zero: isso implica que há uma probabilidade igual de superestimar ou subestimar o número de fótons. Além disso, de acordo com as propriedades das distribuições gaussianas, devemos esperar que cerca de ~68% das medições sejam ±1 desvio padrão do valor verdadeiro e livre de ruído de leitura. Se um detector tiver um desvio padrão de ruído de leitura baixo, isso é bom: significa que o erro deve ser pequeno.

source: Signal-to-Noise Ratio (SNR)
es: Relación señal/ruido (SNR)
pt_br: Relação sinal-ruído (SNR)

source: Read noise is said to be **signal independent**: its standard deviation is constant, and does not depend upon how many photons are being quantified. However, the extent to which read noise is a problem probably _does_ depend upon the number of photons. For example, if we have detected 20 photons, a noise standard deviation of 10 photons is huge; if we have detected 10 000 photons, it's likely not so important.
es: Se dice que el ruido de lectura es **independiente de la señal**: su desviación estándar es constante y no depende del número de fotones cuantificados. Sin embargo, la medida en que el ruido de lectura es un problema probablemente _depende_ del número de fotones. Por ejemplo, si hemos detectado 20 fotones, una desviación estándar del ruido de 10 fotones es enorme; si hemos detectado 10 000 fotones, probablemente no sea tan importante.
pt_br: Diz-se que o ruído de leitura é **independente do sinal**: seu desvio padrão é constante e não depende de quantos fótons estão sendo quantificados. No entanto, até que ponto o ruído de leitura é um problema provavelmente _depende_ do número de fótons. Por exemplo, se detectamos 20 fótons, um desvio padrão de ruído de 10 fótons é enorme; se detectamos 10.000 fótons, provavelmente não é tão importante.

source: A better way to assess the noisiness of an image is then the ratio of the interesting component of each pixel (called the **signal**, which is here what we would ideally detect in terms of photons) to the noise standard deviation, which is known as the __Signal-to-Noise Ratio__ [^fn_3]:
es: Una forma mejor de evaluar el ruido de una imagen es entonces la relación entre el componente interesante de cada píxel (llamado **señal**, que es aquí lo que idealmente detectaríamos en términos de fotones) y la desviación estándar del ruido, lo que se conoce como __Relación señal/ruido__ [^fn_3]:
pt_br: Uma maneira melhor de avaliar o ruído de uma imagem é então a relação entre o componente interessante de cada pixel (chamado de **sinal**, que é aqui o que idealmente detectaríamos em termos de fótons) e o desvio padrão do ruído, que é conhecido como __Relação sinal-ruído__ [^fn_3]:

source: \textrm{SNR} = \frac{\textrm{Signal}}{\textrm{Noise standard deviation}}
es: \textrm{SNR} = \frac{\textrm{señal}}{\textrm{desviación estándar del ruido}}
pt_br: \textrm{SNR} = \frac{\textrm{Sinal}}{\textrm{Desvio padrão do ruído}}

source: Question
es: Pregunta
pt_br: Pergunta

source: Calculate the SNR in the following cases:
es: Calcula la SNR en los siguientes casos:
pt_br: Calcule o SNR nos seguintes casos:

source: We detect an average of 10 photons, read noise standard deviation 1 photon
es: Detectamos una media de 10 fotones, desviación estándar del ruido de lectura 1 fotón
pt_br: Detectamos uma média de 10 fótons, lemos o desvio padrão do ruído 1 fóton

source: We detect an average of 100 photons, read noise standard deviation 10 photons
es: Detectamos una media de 100 fotones, desviación estándar del ruido de lectura 10 fotones
pt_br: Detectamos uma média de 100 fótons, lemos o desvio padrão do ruído 10 fótons

source: We detect an average of 1000 photons, read noise standard deviation 10 photons
es: Detectamos una media de 1000 fotones, desviación estándar del ruido de lectura 10 fotones
pt_br: Detectamos uma média de 1000 fótons, lemos o desvio padrão do ruído 10 fótons

source: For the purposes of this question, you should assume that read noise is the only noise present (ignore photon noise).
es: A efectos de esta pregunta, debes suponer que el ruido de lectura es el único ruido presente (ignora el ruido de fotones).
pt_br: Para os fins desta questão, você deve assumir que o ruído de leitura é o único ruído presente (ignore o ruído do fóton).

source: Answer
es: Respuesta
pt_br: Responder

source: We detect an average of 10 photons, read noise std. dev. 1 photon: _SNR = 10_
es: Detectamos una media de 10 fotones, desviación estándar del ruido de lectura. 1 fotón: _SNR = 10_
pt_br: Detectamos uma média de 10 fótons, lemos o ruído padrão. dev. 1 fóton: _SNR = 10_

source: We detect an average of 100 photons, read noise std. dev. 10 photons: _SNR = 10_
es: Detectamos una media de 100 fotones, desviación típica del ruido de lectura. 10 fotones: _SNR = 10_
pt_br: Detectamos uma média de 100 fótons, lemos o ruído padrão. dev. 10 fótons: _SNR = 10_

source: We detect an average of 1000 photons, read noise std. dev. 10 photons: _SNR = 100_
es: Detectamos una media de 1000 fotones, desviación típica del ruido de lectura. 10 fotones: _SNR = 100_
pt_br: Detectamos uma média de 1000 fótons, lemos o ruído padrão. dev. 10 fótons: _SNR = 100_
