Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: es, pt_br

source: Assuming that the size of a pixel is smaller than the PSF (which is usually the case in microscopy), it's a good idea to remove these outliers. They _cannot_ be real structures, because any real structure would have to extend over a region at least as large as the PSF. However if the pixel size is very large, then we may not be able to rule out that the 'outliers' are caused by some real, bright structures.
es: Suponiendo que el tamaño de un píxel sea menor que la PSF (lo que suele ocurrir en microscopía), es una buena idea eliminar estos valores atípicos. No pueden ser estructuras reales, porque cualquier estructura real tendría que extenderse sobre una región al menos tan grande como la PSF. Sin embargo, si el tamaño del píxel es muy grande, es posible que no podamos descartar que los "valores atípicos" estén causados por estructuras brillantes reales.
pt_br: Supondo que o tamanho de um pixel seja menor que o PSF (o que geralmente acontece na microscopia), é uma boa ideia remover esses valores discrepantes. Não podem ser estruturas reais, porque qualquer estrutura real teria de se estender por uma região pelo menos tão grande como o PSF. No entanto, se o tamanho do pixel for muito grande, talvez não possamos descartar que os “outliers” sejam causados por algumas estruturas reais e brilhantes.

source: Finding photons
es: Encontrar fotones
pt_br: Encontrando fótons

source: There are various places from which the extra photons required to overcome noise might come. One is to simply acquire images more slowly, spending more time detecting light. If this is too harsh on the sample, it may be possible to record multiple images quickly. If there is little movement between exposures, these images could be added or averaged to get a similar effect ({numref}`fig-noise_averaging`).
es: Los fotones adicionales necesarios para superar el ruido pueden proceder de varias fuentes. Uno es simplemente adquirir imágenes más lentamente, dedicando más tiempo a detectar la luz. Si esto resulta demasiado duro para la muestra, puede ser posible grabar varias imágenes rápidamente. Si hay poco movimiento entre exposiciones, estas imágenes podrían sumarse o promediarse para obtener un efecto similar ({numref}`fig-noise_averaging`).
pt_br: Existem vários lugares de onde podem vir os fótons extras necessários para superar o ruído. Uma delas é simplesmente adquirir imagens mais lentamente, gastando mais tempo detectando luz. Se isso for muito severo para a amostra, poderá ser possível gravar várias imagens rapidamente. Se houver pouco movimento entre as exposições, essas imagens poderão ser adicionadas ou calculadas em média para obter um efeito semelhante ({numref}`fig-noise_averaging`).

source: The effect of adding (or averaging) multiple noisy images, each independent with a similar SNR.
es: El efecto de añadir (o promediar) varias imágenes ruidosas, cada una independiente con una SNR similar.
pt_br: O efeito de adicionar (ou calcular a média) múltiplas imagens com ruído, cada uma independente de um SNR semelhante.

source: An alternative would be to increase the pixel size, so that each pixel incorporates photons from larger regions -- although clearly this comes at a cost in spatial information. One way to do this is though [binning](sec_detectors_binning).
es: Una alternativa sería aumentar el tamaño del píxel, de forma que cada píxel incorpore fotones de regiones más grandes -- aunque claramente esto tiene un coste en información espacial. Una forma de hacerlo es mediante [binning](sec_detectors_binning).
pt_br: Uma alternativa seria aumentar o tamanho do pixel, de modo que cada pixel incorpore fótons de regiões maiores – embora isso claramente tenha um custo em informação espacial. Uma maneira de fazer isso é através de [binning](sec_detectors_binning).

source: However, noise cannot be completely eliminated during acquisition. Understanding its behavior, and especially how [filters](chap_filters) can reduce it, can help us cope with it during analysis.
es: Sin embargo, el ruido no puede eliminarse por completo durante la adquisición. Comprender su comportamiento, y sobre todo cómo [filtros](chap_filters) puede reducirlo, puede ayudarnos a hacerle frente durante el análisis.
pt_br: No entanto, o ruído não pode ser completamente eliminado durante a aquisição. Compreender seu comportamento, e especialmente como [filters](chap_filters) podem reduzi-lo, pode nos ajudar a lidar com isso durante a análise.

source: Nyquist sampling & choosing a pixel size
es: Muestreo Nyquist y elección del tamaño de píxel
pt_br: Amostragem de Nyquist e escolha de um tamanho de pixel

source: Small pixels are needed to see detail, but also reduce the number of photons per pixel and thereby increase noise. However, {ref}`chap_formation_spatial` has already argued that ultimately it's not pixel size, but rather the PSF that limits spatial resolution -- which suggests that there is a minimum pixel size below which nothing is gained, and the only result is that more noise is added.
es: Los píxeles pequeños son necesarios para ver los detalles, pero también reducen el número de fotones por píxel y, por tanto, aumentan el ruido. Sin embargo, {ref}`chap_formation_spatial` ya ha argumentado que, en última instancia, no es el tamaño del píxel, sino la PSF lo que limita la resolución espacial -- lo que sugiere que hay un tamaño mínimo de píxel por debajo del cual no se gana nada, y el único resultado es que se añade más ruido.
pt_br: Pequenos pixels são necessários para ver detalhes, mas também reduzem o número de fótons por pixel e, assim, aumentam o ruído. No entanto, {ref}`chap_formation_spatial` já argumentou que, em última análise, não é o tamanho do pixel, mas sim o PSF que limita a resolução espacial - o que sugere que existe um tamanho mínimo de pixel abaixo do qual nada é obtido, e o único resultado é que mais ruído é adicionado.

source: This size can be determined based upon knowledge of the PSF and the **Nyquist-Shannon sampling theorem** ({numref}`fig-nyquist_shannon`). Images acquired with this pixel size are said to be **Nyquist sampled** (although see Alvy Ray Smith's epic *A Biography of the Pixel* for the case why credit for the sampling theorem really belongs to **Vladimir Kotelnikov**).
es: Este tamaño puede determinarse basándose en el conocimiento de la PSF y el teorema de muestreo **Nyquist-Shannon** ({numref}`fig-nyquist_shannon`). Se dice que las imágenes adquiridas con este tamaño de píxel están **muestreadas por Nyquist** (aunque véase la épica *A Biography of the Pixel* de Alvy Ray Smith para saber por qué el mérito del teorema de muestreo pertenece realmente a **Vladimir Kotelnikov**).
pt_br: Esse tamanho pode ser determinado com base no conhecimento do PSF e do **teorema de amostragem de Nyquist-Shannon** ({numref}`fig-nyquist_shannon`). Diz-se que as imagens adquiridas com este tamanho de pixel são **amostradas por Nyquist** (embora veja o épico *A Biography of the Pixel* de Alvy Ray Smith para saber por que o crédito pelo teorema da amostragem realmente pertence a **Vladimir Kotelnikov**).

source: The easiest way I know to determine the corresponding pixel size for a given experiment is to use the online calculator provided by *Scientific Volume Imaging* at https://svi.nl/NyquistCalculator. You may need larger pixels to reduce noise or see a wider field of view, but you do not get anything extra by using smaller pixels.
es: La forma más fácil que conozco de determinar el tamaño de píxel correspondiente para un experimento determinado es utilizar la calculadora en línea que ofrece *Scientific Volume Imaging* en https://svi.nl/NyquistCalculator. Es posible que necesite píxeles más grandes para reducir el ruido o ver un campo de visión más amplio, pero no obtendrá nada extra utilizando píxeles más pequeños.
pt_br: A maneira mais fácil que conheço de determinar o tamanho do pixel correspondente para um determinado experimento é usar a calculadora on-line fornecida pela *Scientific Volume Imaging* em https://svi.nl/NyquistCalculator. Você pode precisar de pixels maiores para reduzir o ruído ou ver um campo de visão mais amplo, mas não obtém nada extra usando pixels menores.

source: Harry Nyquist (1889-1975) and Claude Shannon (1916-2001), sampled using different pixel sizes. Their work is used when determining the pixel sizes needed to maximize the available information when acquiring images, which depends upon the size of the PSF.
es: Harry Nyquist (1889-1975) y Claude Shannon (1916-2001), muestrearon utilizando distintos tamaños de píxel. Su trabajo se utiliza para determinar los tamaños de píxel necesarios para maximizar la información disponible al adquirir imágenes, que depende del tamaño de la PSF.
pt_br: Harry Nyquist (1889-1975) e Claude Shannon (1916-2001), amostrados usando diferentes tamanhos de pixel. Seu trabalho é utilizado na determinação dos tamanhos de pixel necessários para maximizar a informação disponível na aquisição de imagens, que depende do tamanho do PSF.

source: Specifically its probability density or mass function -- which for a Gaussian distribution is the familiar bell curve.
es: En concreto, su densidad de probabilidad o función de masa, que para una distribución gaussiana es la conocida curva de campana.
pt_br: Especificamente, sua densidade de probabilidade ou função de massa - que para uma distribuição gaussiana é a curva em sino familiar.

source: Actually more. But the two mentioned here are usually by far the most significant, and it does not matter to our model at all if they contain various other sub-components. The important fact remains that there is some noise that varies throughout the image, and some that does not.
es: En realidad, más. Pero los dos mencionados aquí suelen ser, con mucho, los más significativos, y a nuestro modelo no le importa en absoluto que contengan otros subcomponentes. Lo importante es que hay ruido que varía a lo largo de la imagen y ruido que no varía.
pt_br: Na verdade mais. Mas os dois mencionados aqui são geralmente de longe os mais significativos, e não importa para o nosso modelo se eles contêm vários outros subcomponentes. O fato importante é que há algum ruído que varia ao longo da imagem e outro não.

source: This is one definition of SNR. Many other definitions appear in the literature, leading to different values. The fact that any interesting image will vary in brightness in different places means that the SNR is not necessarily the same at all pixels -- therefore computing it in practice involves coming up with some summary measurement for the whole image. This can be approached differently, but the general principle is always to compare how much noise we have relative to interesting things: where higher is better.
es: Ésta es una definición de SNR. En la literatura aparecen muchas otras definiciones, que dan lugar a valores diferentes. El hecho de que cualquier imagen interesante varíe en brillo en diferentes lugares significa que la SNR no es necesariamente la misma en todos los píxeles, por lo que calcularla en la práctica implica obtener alguna medida resumen para toda la imagen. Esto se puede abordar de diferentes maneras, pero el principio general es siempre comparar cuánto ruido tenemos en relación con las cosas interesantes: cuanto más alto, mejor.
pt_br: Esta é uma definição de SNR. Muitas outras definições aparecem na literatura, levando a valores diferentes. O fato de qualquer imagem interessante variar em brilho em locais diferentes significa que o SNR não é necessariamente o mesmo em todos os pixels - portanto, calculá-lo na prática envolve chegar a alguma medida resumida para toda a imagem. Isto pode ser abordado de forma diferente, mas o princípio geral é sempre comparar quanto ruído temos em relação a coisas interessantes: onde mais alto é melhor.

source: For a fuller picture, gain and offset also need to be taken into consideration, see {ref}`chap_microscope_types`.
es: Para una visión más completa, también hay que tener en cuenta la ganancia y el desplazamiento, véase {ref}`chap_microscope_types`.
pt_br: Para uma visão mais completa, o ganho e o deslocamento também precisam ser levados em consideração, consulte {ref}`chap_microscope_types`.
