Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/pixel_size.po
Languages: de, es, pt_br

source: But if we needed to know _x_ and _y_ coordinates, a _z_-slice number, a color channel and a time point then we would be working with 5D data ({numref}`fig-dimensions`). We could throw away one of these dimensions -- any one at all -- and get a 4D image, and keep going until we have a single pixel remaining: a 0D image.
de: Aber wenn wir _x_- und _y_-Koordinaten, eine _z_-Slice-Nummer, einen Farbkanal und einen Zeitpunkt kennen müssten, würden wir mit 5D-Daten arbeiten ({numref}`fig-dimensions `). Wir könnten eine dieser Dimensionen – jede beliebige – wegwerfen und ein 4D-Bild erhalten und so lange weitermachen, bis wir nur noch ein einziges Pixel übrig haben: ein 0D-Bild.
es: Pero si necesitáramos saber las coordenadas _x_ e _y_, un número de sección _z_, un canal de color y un punto de tiempo, entonces estaríamos trabajando con datos 5D ({numref}`fig-dimensions `). Podríamos descartar una de estas dimensiones (cualquiera) y obtener una imagen 4D, y continuar hasta que nos quede un solo píxel: una imagen 0D.
pt_br: Mas se precisássemos saber as coordenadas _x_ e _y_, um número de fatia _z_, um canal de cor e um ponto no tempo, então estaríamos trabalhando com dados 5D ({numref}`fig-dimensions `). Poderíamos descartar uma dessas dimensões - qualquer uma delas - e obter uma imagem 4D, e continuar até termos um único pixel restante: uma imagem 0D.

source: Throw away that pixel, and we no longer have an image.
de: Wenn wir dieses Pixel wegwerfen, haben wir kein Bild mehr.
es: Si desechamos ese píxel, ya no tendremos imagen.
pt_br: Jogue fora esse pixel e não teremos mais imagem.

source: Depictions of images with different numbers of dimensions. (A) A single value is considered to have 0 dimensions. (B--E) Additional dimensions are added, here in the following order: _x_ coordinate (1), _y_ coordinate (2), channel number (3), _z_ slice (4). The volume view in (E) was generated using the [ClearVolume plugin for Fiji](https://imagej.net/plugins/clearvolume).
de: Darstellungen von Bildern mit unterschiedlicher Anzahl an Dimensionen. (A) Es wird davon ausgegangen, dass ein einzelner Wert 0 Dimensionen hat. (B--E) Zusätzliche Dimensionen werden hinzugefügt, hier in der folgenden Reihenfolge: _x_-Koordinate (1), _y_-Koordinate (2), Kanalnummer (3), _z_-Slice (4). Die Volumenansicht in (E) wurde mit dem [ClearVolume-Plugin für Fidschi](https://imagej.net/plugins/clearvolume) generiert.
es: Representaciones de imágenes con diferente número de dimensiones. (A) Se considera que un valor único tiene 0 dimensiones. (B--E) Se agregan dimensiones adicionales, aquí en el siguiente orden: coordenada _x_ (1), coordenada _y_ (2), número de canal (3), sección _z_ (4). La vista de volumen en (E) se generó utilizando el [ClearVolume plugin for Fiji] (https://imagej.net/plugins/clearvolume).
pt_br: Representações de imagens com diferentes números de dimensões. (A) Um único valor é considerado como tendo 0 dimensões. (B--E) Dimensões adicionais são adicionadas, aqui na seguinte ordem: coordenada _x_ (1), coordenada _y_ (2), número do canal (3), fatia _z_ (4). A visualização do volume em (E) foi gerada usando o [plugin ClearVolume para Fiji](https://imagej.net/plugins/clearvolume).

source: Loic A. Royer et al. (2015). "ClearVolume – Open-source live 3D visualization for light sheet microscopy". *Nature Methods* 12, 480–481. https://doi.org/10.1038/nmeth.3372
de: Loic A. Royer et al. (2015). „ClearVolume – Open-Source-Live-3D-Visualisierung für die Lichtblattmikroskopie“. *Nature Methods* 12, 480–481. https://doi.org/10.1038/nmeth.3372
pt_br: Loic A. Royer et al. (2015). "ClearVolume - visualização 3D ao vivo de código aberto para microscopia light sheet" . *Métodos da Natureza* 12, 480–481. https://doi.org/10.1038/nmeth.3372

source: Visualization of a 5D image (xyczt) using ClearVolume + Fiji.
de: Visualisierung eines 5D-Bildes (xyczt) mit ClearVolume + Fiji.
es: Visualización de una imagen 5D (xyczt) usando ClearVolume + Fiji.
pt_br: Visualização de uma imagem 5D (xyczt) usando ClearVolume + Fiji.

source: In principle, therefore, 2D images do not need to have *x* and *y* dimensions. The dimensions could be *x* and *z*, or *y* and time, for example. But while we may play around with the identity of dimensions, the important fact remains: an *nD* image requires *n* pieces of information to identify each pixel.
de: Daher müssen 2D-Bilder grundsätzlich keine *x*- und *y*-Dimensionen haben. Die Dimensionen könnten beispielsweise *x* und *z* oder *y* und Zeit sein. Aber auch wenn wir mit der Identität der Dimensionen herumspielen, bleibt die wichtige Tatsache bestehen: Ein *nD*-Bild benötigt *n* Informationen, um jedes Pixel zu identifizieren.
es: Por lo tanto, en principio, las imágenes 2D no necesitan tener dimensiones *x* e *y*. Las dimensiones podrían ser *x* y *z*, o *y* y tiempo, por ejemplo. Pero si bien podemos jugar con la identidad de las dimensiones, algo es cierto: una imagen *nD* requiere *n* piezas de información para identificar cada píxel.
pt_br: Em princípio, portanto, as imagens 2D não precisam ter dimensões *x* e *y*. As dimensões podem ser *x* e *z*, ou *y* e tempo, por exemplo. Mas embora possamos brincar com a identidade das dimensões, o fato importante permanece: uma imagem *nD* requer *n* informações para identificar cada pixel.

source: Do channels really add a dimension?
de: Fügen Kanäle wirklich eine Dimension hinzu?
es: ¿Los canales realmente añaden una dimensión?
pt_br: Os canais realmente acrescentam uma dimensão?

source: There can be some fuzziness in the idea of dimensions, particularly when channels are involved. If we rigorously follow the approach above, an image with *x*, *y* and *channels* would be 3D... but in practice such images are often (but not always!) called 2D anyway.
de: Die Vorstellung von Dimensionen kann etwas unscharf sein, insbesondere wenn Kanäle beteiligt sind. Wenn wir den oben genannten Ansatz strikt befolgen, wäre ein Bild mit *x*, *y* und *Kanälen* 3D... aber in der Praxis werden solche Bilder ohnehin oft (aber nicht immer!) als 2D bezeichnet.
es: Puede haber cierta confusión en la idea de dimensiones, particularmente cuando se trata de canales. Si seguimos rigurosamente el enfoque anterior, una imagen con *x*, *y* y *canales* sería 3D... pero en la práctica dichas imágenes a menudo (¡pero no siempre!) se llaman 2D de todos modos.
pt_br: Pode haver alguma imprecisão na ideia de dimensões, especialmente quando canais estão envolvidos. Se seguirmos rigorosamente a abordagem acima, uma imagem com *x*, *y* e *canais* seria 3D... mas na prática tais imagens são frequentemente (mas nem sempre!) chamadas de 2D de qualquer maneira.

source: '3D' is sometimes restricted to mean that there is a *z* dimension. If we have an image with *x*, *y* and *time* then we might technically be correct to call it 3D -- but that is likely to be confusing, so it's probably best to refer to a 'time series' instead.
de: „3D“ wird manchmal so eingeschränkt, dass es bedeutet, dass es eine *z*-Dimension gibt. Wenn wir ein Bild mit *x*, *y* und *Zeit* haben, dann wäre es technisch gesehen vielleicht richtig, es 3D zu nennen – aber das ist wahrscheinlich verwirrend, daher ist es wahrscheinlich am besten, stattdessen von einer „Zeitreihe“ zu sprechen .
es: '3D' a veces se limita a significar que hay una dimensión *z*. Si tenemos una imagen con *x*, *y* y *time* entonces técnicamente sería correcto llamarla 3D, pero es probable que resulte confuso, por lo que probablemente sea mejor referirse a ella como 'serie de tiempo'.
pt_br: '3D' às vezes é restrito para significar que existe uma dimensão *z*. Se tivermos uma imagem com *x*, *y* e *time* então podemos estar tecnicamente corretos em chamá-la de 3D - mas isso provavelmente será confuso, então provavelmente é melhor nos referirmos a uma 'série temporal' em vez disso .

source: I still think that our explanation of the number of dimensions as being 'the number of things you need to know to identify a pixel' is a good baseline way to think about it, and corresponds well with the implementation in software and usage in Python/NumPy. But we need to be prepared to use context to identify when the word 'dimensions' is being used with images more casually.
de: Ich denke immer noch, dass unsere Erklärung der Anzahl der Dimensionen als „die Anzahl der Dinge, die Sie wissen müssen, um ein Pixel zu identifizieren“ eine gute grundlegende Denkweise ist und gut mit der Implementierung in Software und der Verwendung in Python übereinstimmt. NumPy. Aber wir müssen darauf vorbereitet sein, den Kontext zu nutzen, um zu erkennen, wann das Wort „Dimensionen“ bei Bildern eher beiläufig verwendet wird.
es: Sigo pensando que nuestra explicación del número de dimensiones como "el número de cosas que necesitas saber para identificar un píxel" es una buena forma básica de conceptualizarlo y corresponde bien con la implementación en software y el uso en Python/ NumPy. Pero debemos estar preparados para utilizar el contexto para identificar cuándo la palabra "dimensiones" se utiliza con imágenes de manera más informal.
pt_br: Ainda acho que nossa explicação do número de dimensões como sendo 'o número de coisas que você precisa saber para identificar um pixel' é uma boa maneira básica de pensar sobre isso e corresponde bem à implementação em software e ao uso em Python/ NumPy. Mas precisamos estar preparados para usar o contexto para identificar quando a palavra “dimensões” está sendo usada com imagens de forma mais casual.

source: Z-Projections
de: Z-Projektionen
es: Proyecciones Z
pt_br: Projeções Z

source: The more dimensions we have, the trickier it can be to visualize the entire image effectively.
de: Je mehr Dimensionen wir haben, desto schwieriger kann es sein, das gesamte Bild effektiv zu visualisieren.
es: Cuantas más dimensiones tengamos, más complicado puede resultar visualizar la imagen completa de forma eficaz.
pt_br: Quanto mais dimensões tivermos, mais complicado será visualizar a imagem inteira de maneira eficaz.

source: **Z-stacks** are composed of different 2D images (called **slices**) acquired at different focal depths, optionally with an extra channel dimension added as well.
de: **Z-Stapel** bestehen aus verschiedenen 2D-Bildern (sogenannte **Scheiben**), die bei unterschiedlichen Fokustiefen aufgenommen wurden, optional auch mit hinzugefügter zusätzlicher Kanaldimension.
es: Las **pilas Z** se componen de diferentes imágenes 2D (llamadas **secciones** o slices) adquiridas a diferentes profundidades focales, opcionalmente con una dimensión de canal adicional agregada.
pt_br: **Pilhas Z** são compostas por diferentes imagens 2D (chamadas de **fatias**) adquiridas em diferentes profundidades focais, opcionalmente com uma dimensão de canal extra adicionada também.

source: One way to visualize a z-stack is to simply look at each slice individually.
de: Eine Möglichkeit, einen Z-Stapel zu visualisieren, besteht darin, einfach jedes Segment einzeln zu betrachten.
es: Una forma de visualizar una pila z es simplemente mirar cada segmento individualmente.
pt_br: Uma maneira de visualizar uma pilha z é simplesmente observar cada fatia individualmente.

source: Visualizing the slices from a z-stack as separate images. Here, each slice has 2 channels.
de: Visualisierung der Slices aus einem Z-Stapel als separate Bilder. Hier hat jedes Slice 2 Kanäle.
es: Visualizar los cortes de una pila z como imágenes separadas. Aquí, cada segmento tiene 2 canales.
pt_br: Visualizando as fatias de uma pilha z como imagens separadas. Aqui, cada fatia possui 2 canais.

source: How many dimensions does the z-stack in {numref}`fig-dimensions_slices` have?
de: Wie viele Dimensionen hat der Z-Stapel in {numref}`fig-dimensions_slices`?
es: ¿Cuántas dimensiones tiene la pila z en {numref}`fig-dimensions_slices`?
pt_br: Quantas dimensões tem a pilha z em {numref}`fig-dimensions_slices`?

source: *Remember: we count channels as a dimension here!*
de: *Denken Sie daran: Wir zählen Kanäle hier als Dimension!*
es: *Recuerda: ¡aquí contamos los canales como una dimensión!*
pt_br: *Lembre-se: aqui consideramos os canais como uma dimensão!*

source: The image is 4D: x, y, z, channels.
de: Das Bild ist 4D: x, y, z, Kanäle.
es: La imagen es 4D: canales x, y, z.
pt_br: A imagem é 4D: canais x, y, z.

source: Viewing many slices separately is cumbersome.
de: Das separate Betrachten vieler Slices ist umständlich.
es: Ver muchas porciones por separado es engorroso.
pt_br: Visualizar muitas fatias separadamente é complicado.

source: An efficient way to summarize the information in a z-stack is to compute a **z-projection**.
de: Eine effiziente Möglichkeit, die Informationen in einem Z-Stapel zusammenzufassen, ist die Berechnung einer **Z-Projektion**.
es: Una forma eficaz de resumir la información en una pila z es calcular una **proyección z**.
pt_br: Uma maneira eficiente de resumir as informações em uma pilha z é calcular uma **projeção z**.

source: This generates a new image with the z-dimension essentially removed, i.e. a 3D image becomes 2D, or a 4D image becomes 3D.
de: Dadurch wird ein neues Bild erzeugt, bei dem die Z-Dimension im Wesentlichen entfernt wurde, d. h. ein 3D-Bild wird zu 2D oder ein 4D-Bild wird zu 3D.
es: Esto genera una nueva imagen con la dimensión z esencialmente eliminada, es decir, una imagen 3D se vuelve 2D o una imagen 4D se vuelve 3D.
pt_br: Isso gera uma nova imagem com a dimensão z essencialmente removida, ou seja, uma imagem 3D torna-se 2D ou uma imagem 4D torna-se 3D.

source: The pixel values in the output image depend upon which function was used to compute the projection. Perhaps the most common is to use a **maximum z-projection**. For each pixel location in the new image, the maximum value is taken across all the z-slices at the corresponding pixel location in the original image (i.e. the same _x_, _y_, _c_ and _t_ coordinate, as appropriate).
de: Die Pixelwerte im Ausgabebild hängen davon ab, welche Funktion zur Berechnung der Projektion verwendet wurde. Am gebräuchlichsten ist vielleicht die Verwendung einer **maximalen Z-Projektion**. Für jede Pixelposition im neuen Bild wird der Maximalwert über alle Z-Schnitte hinweg an der entsprechenden Pixelposition im Originalbild ermittelt (d. h. je nach Fall dieselben _x_-, _y_-, _c_- und _t_-Koordinaten).
es: Los valores de píxeles en la imagen de output dependen de qué función se utilizó para calcular la proyección. Quizás lo más común sea utilizar una **proyección z máxima**. Para cada ubicación de píxel en la nueva imagen, el valor máximo se toma en todos los cortes z en la ubicación de píxel correspondiente en la imagen original (es decir, las mismas coordenadas _x_, _y_, _c_ y _t_, según corresponda).
pt_br: Os valores de pixel na imagem de saída dependem de qual função foi usada para calcular a projeção. Talvez o mais comum seja usar uma **projeção z máxima**. Para cada localização de pixel na nova imagem, o valor máximo é obtido em todas as fatias z na localização de pixel correspondente na imagem original (ou seja, a mesma coordenada _x_, _y_, _c_ e _t_, conforme apropriado).

source: Visualizing a z-stack using z-projections.
de: Visualisierung eines Z-Stapels mithilfe von Z-Projektionen.
es: Visualizando una pila z usando proyecciones z.
pt_br: Visualizando uma pilha z usando projeções z.

source: Orthogonal slices
de: Orthogonale Scheiben
es: Secciones ortogonales
pt_br: Fatias ortogonais

source: Another useful way to visualize z-stack information is to use **orthogonal slices**.
de: Eine weitere nützliche Möglichkeit zur Visualisierung von Z-Stack-Informationen ist die Verwendung von **orthogonalen Slices**.
es: Otra forma útil de visualizar información de la pila z es utilizar **cortes ortogonales**.
pt_br: Outra maneira útil de visualizar informações da pilha z é usar **fatias ortogonais**.

source: Conceptually, the z-stack is viewed as a 3D block of pixels (or perhaps, 4D if we count channels). We choose a single point in the image, and generate three orthogonal views on the image that pass through that point. We can think of it as looking at the block from three different angles: from above, and from two adjacent sides.
de: Konzeptionell wird der Z-Stapel als 3D-Pixelblock betrachtet (oder vielleicht als 4D, wenn wir Kanäle zählen). Wir wählen einen einzelnen Punkt im Bild und erzeugen drei orthogonale Ansichten des Bildes, die durch diesen Punkt verlaufen. Wir können uns das so vorstellen, als würden wir den Block aus drei verschiedenen Blickwinkeln betrachten: von oben und von zwei benachbarten Seiten.
es: Conceptualmente, el la pila z se ve como un bloque de píxeles 3D (o quizás, 4D si contamos los canales). Elegimos un único punto en la imagen y generamos tres vistas ortogonales de la imagen que pasan por ese punto. Podemos pensar que estamos mirando el bloque desde tres ángulos diferentes: desde arriba y desde dos lados adyacentes.
pt_br: Conceitualmente, a pilha z é vista como um bloco 3D de pixels (ou talvez 4D se contarmos os canais). Escolhemos um único ponto na imagem e geramos três vistas ortogonais da imagem que passam por esse ponto. Podemos pensar nisso como olhar para o bloco de três ângulos diferentes: de cima e de dois lados adjacentes.

source: This gives us 3 images, as shown in {numref}`fig-dimensions_orthogonal`. Each image depends upon the single point through which the orthogonal views pass.
de: Dadurch erhalten wir 3 Bilder, wie in {numref}`fig-dimensions_orthogonal` gezeigt. Jedes Bild hängt von dem einzelnen Punkt ab, durch den die orthogonalen Ansichten verlaufen.
es: Esto nos da 3 imágenes, como se muestra en {numref}`fig-dimensions_orthogonal`. Cada imagen depende del único punto por el que pasan las vistas ortogonales.
pt_br: Isso nos dá 3 imagens, conforme mostrado em {numref}`fig-dimensions_orthogonal`. Cada imagem depende do único ponto através do qual passam as vistas ortogonais.

source: Visualizing a z-stack using orthogonal slices at different locations within a z-stack, indicated by dashed lines.
de: Visualisierung eines Z-Stapels mithilfe orthogonaler Schnitte an verschiedenen Stellen innerhalb eines Z-Stapels, angezeigt durch gestrichelte Linien.
es: Visualización de una pila z utilizando cortes ortogonales en diferentes ubicaciones dentro de una pila z, indicadas por líneas discontinuas.
pt_br: Visualização de uma pilha z usando fatias ortogonais em diferentes locais dentro de uma pilha z, indicadas por linhas tracejadas.

source: The idea of orthogonal views and projections can be combined to give **orthogonal projections**, as shown in {numref}`fig-dimensions_orthogonal_projections`. In this case, we don't need to choose a point through which to pass, because the projections do not depend upon a specific slice location; rather, all pixels contribute to each projection.
de: Die Idee orthogonaler Ansichten und Projektionen kann kombiniert werden, um **orthogonale Projektionen** zu ergeben, wie in {numref}`fig-dimensions_orthogonal_projections` gezeigt. In diesem Fall müssen wir keinen Punkt auswählen, durch den wir gehen, da die Projektionen nicht von einer bestimmten Schnittposition abhängen; Vielmehr tragen alle Pixel zu jeder Projektion bei.
es: La idea de vistas y proyecciones ortogonales se puede combinar para generar **proyecciones ortogonales**, como se muestra en {numref}`fig-dimensions_orthogonal_projections`. En este caso, no necesitamos elegir un punto por el cual pasar, porque las proyecciones no dependen de una ubicación de corte específica; más bien, todos los píxeles contribuyen a cada proyección.
pt_br: A ideia de vistas e projeções ortogonais pode ser combinada para gerar **projeções ortogonais**, como mostrado em {numref}`fig-dimensions_orthogonal_projections`. Neste caso, não precisamos escolher um ponto por onde passar, pois as projeções não dependem de uma localização específica do corte; em vez disso, todos os pixels contribuem para cada projeção.

source: Visualizing a z-stack using orthogonal projections.
de: Visualisierung eines Z-Stapels mithilfe orthogonaler Projektionen.
es: Visualizando una pila z usando proyecciones ortogonales.
pt_br: Visualizando uma pilha z usando projeções ortogonais.

source: If we *do* get too philosophical about it, I would expect there to be issues with 'know', 'size' and 'real life' -- and probably many other elements of that sentence.
de: Wenn wir dabei zu philosophisch werden, erwarte ich, dass es Probleme mit „wissen“, „Größe“ und „wirkliches Leben“ gibt – und wahrscheinlich mit vielen anderen Elementen dieses Satzes.
es: Si nos ponemos demasiado filosóficos al respecto, esperaría que haya problemas con "saber", "tamaño" y "vida real", y probablemente con muchos otros elementos de esa oración.
pt_br: Se *ficarmos* muito filosóficos sobre isso, eu esperaria que houvesse problemas com 'saber', 'tamanho' e 'vida real' - e provavelmente muitos outros elementos dessa frase.
