Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/pixel_size.po
Languages: de, es, pt_br

source: Default Caption
de: Standardbeschriftung
es: Leyenda predeterminada
pt_br: Legenda padrão

source: Pixel size & dimensions
de: Pixelgröße und -abmessungen
es: Tamaño y dimensiones de píxeles
pt_br: Tamanho e dimensões dos pixels

source: Chapter outline
de: Kapitelüberblick
es: Outline del capítulo
pt_br: Esboço do capítulo

source: The concept of **pixel size** relates measurements in pixels to physical units
de: Das Konzept der **Pixelgröße** bezieht Messungen in Pixeln auf physikalische Einheiten
es: El concepto de **tamaño de píxel** relaciona las medidas en píxeles con unidades físicas
pt_br: O conceito de **tamanho de pixel** relaciona medidas em pixels a unidades físicas

source: It can be helpful to think of pixels as little squares -- but this is a simplification
de: Es kann hilfreich sein, sich Pixel als kleine Quadrate vorzustellen – dies ist jedoch eine Vereinfachung
es: Puede resultar útil pensar en los píxeles como pequeños cuadrados, pero esto es una simplificación.
pt_br: Pode ser útil pensar nos pixels como pequenos quadrados - mas isso é uma simplificação

source: The number of **dimensions** of an image is the number of pieces of information required to identify each pixel
de: Die Anzahl der **Dimensionen** eines Bildes ist die Anzahl der Informationen, die zur Identifizierung jedes Pixels erforderlich sind
es: El número de **dimensiones** de una imagen es el número de datos necesarios para identificar cada píxel.
pt_br: O número de **dimensões** de uma imagem é o número de informações necessárias para identificar cada pixel

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: Hopefully by now you're appropriately nervous about accidentally changing pixel values and therefore compromising your image's integrity. If in doubt, you'll always calculate histograms or other measurements before and after trying out something new, to check whether the pixels have been changed.
de: Hoffentlich sind Sie inzwischen entsprechend besorgt, dass Sie versehentlich Pixelwerte ändern und dadurch die Integrität Ihres Bildes gefährden könnten. Im Zweifelsfall berechnen Sie vor und nach dem Ausprobieren von etwas Neuem immer Histogramme oder andere Messungen, um zu überprüfen, ob sich die Pixel verändert haben.
es: Esperemos que a estas alturas estés apropiadamente nervioso por cambiar accidentalmente los valores de los píxeles y, por lo tanto, comprometer la integridad de tu imagen. En caso de duda, siempre calcularás histogramas u otras medidas antes y después de probar algo nuevo, para comprobar si los píxeles han cambiado.
pt_br: Esperamos que agora você esteja nervoso com a possibilidade de alterar acidentalmente os valores dos pixels e, portanto, comprometer a integridade da sua imagem. Em caso de dúvida, você sempre calculará histogramas ou outras medidas antes e depois de experimentar algo novo, para verificar se os pixels foram alterados.

source: This chapter explores pixels in more detail, including how they are arranged within an image and how they relate to things in the physical world.
de: In diesem Kapitel werden Pixel detaillierter untersucht, einschließlich ihrer Anordnung innerhalb eines Bildes und ihrer Beziehung zu Dingen in der physischen Welt.
es: Este capítulo explora los píxeles a más detalle, incluyendo cómo se organizan dentro de una imagen y cómo se relacionan con las cosas del mundo físico.
pt_br: Este capítulo explora os pixels com mais detalhes, incluindo como eles são organizados em uma imagem e como se relacionam com as coisas no mundo físico.

source: Pixel size
de: Pixel Größe
es: Tamaño de píxel
pt_br: Tamanho dos pixels

source: **How big is a pixel?**
de: **Wie groß ist ein Pixel?**
es: **¿Qué tamaño tiene un píxel?**
pt_br: **Qual o tamanho de um pixel?**

source: In one sense, a pixel is just a number: it doesn't really have a size at all. However, if we don't get too philosophical about it[^philosophy], we intuitively know that the things depicted in our images usually have a size in real life.
de: In gewisser Hinsicht ist ein Pixel nur eine Zahl: Es hat eigentlich überhaupt keine Größe. Wenn wir jedoch nicht zu philosophisch damit umgehen[^Philosophie], wissen wir intuitiv, dass die auf unseren Bildern dargestellten Dinge normalerweise eine Größe im wirklichen Leben haben.
es: En cierto sentido, un píxel es sólo un número: en realidad no tiene tamaño alguno. Sin embargo, si no nos ponemos demasiado filosóficos al respecto[^filosofía], sabemos intuitivamente que las cosas representadas en nuestras imágenes generalmente tienen un tamaño en la vida real.
pt_br: Em certo sentido, um pixel é apenas um número: na verdade, não tem tamanho algum. Porém, se não formos muito filosóficos sobre isso [^filosofia], sabemos intuitivamente que as coisas retratadas em nossas imagens geralmente têm um tamanho na vida real.

source: The 'pixel size' is an idea that helps us translate measurements we make in images to the sizes and positions of things in real life. We often need to know the pixel size for our images if our analysis results are be meaningful.
de: Die „Pixelgröße“ ist eine Idee, die uns hilft, Messungen, die wir in Bildern vornehmen, auf die Größen und Positionen von Dingen im wirklichen Leben zu übertragen. Wir müssen oft die Pixelgröße unserer Bilder kennen, damit unsere Analyseergebnisse aussagekräftig sind.
es: El 'tamaño de píxel' es una idea que nos ayuda a traducir las medidas que hacemos en imágenes a los tamaños y posiciones de las cosas en la vida real. A menudo necesitamos saber el tamaño de píxel de nuestras imágenes para que los resultados de nuestro análisis sean significativos.
pt_br: O ‘tamanho do pixel’ é uma ideia que nos ajuda a traduzir as medidas que fazemos nas imagens para os tamanhos e posições das coisas na vida real. Freqüentemente, precisamos saber o tamanho do pixel de nossas imagens para que os resultados de nossa análise sejam significativos.

source: One way to think about this in microscopy is to consider the **field of view** of an image, i.e. the width and height of the area that has been imaged. We can divide the width and height in physical units (often µm) by the number of pixels along that dimension, as shown in {numref}`fig-px_sizes`.
de: Eine Möglichkeit, dies in der Mikroskopie zu berücksichtigen, besteht darin, das **Sichtfeld** eines Bildes zu berücksichtigen, d. h. die Breite und Höhe des abgebildeten Bereichs. Wir können die Breite und Höhe in physikalischen Einheiten (häufig µm) durch die Anzahl der Pixel entlang dieser Dimension dividieren, wie in {numref}`fig-px_sizes` gezeigt.
es: Una forma de pensar en esto en microscopía es considerar el **campo de visión** de una imagen, es decir, el ancho y el alto del área de la que se ha tomado la imagen. Podemos dividir el ancho y el alto en unidades físicas (a menudo µm) por el número de píxeles a lo largo de esa dimensión, como se muestra en {numref}`fig-px_sizes`.
pt_br: Uma maneira de pensar sobre isso em microscopia é considerar o **campo de visão** de uma imagem, ou seja, a largura e a altura da área que foi fotografada. Podemos dividir a largura e a altura em unidades físicas (geralmente µm) pelo número de pixels ao longo dessa dimensão, conforme mostrado em {numref}`fig-px_sizes`.

source: The result is that we have two value in µm/px, corresponding to the **pixel width** and **pixel height**. *Usually* these are the same.
de: Das Ergebnis ist, dass wir zwei Werte in µm/px haben, die der **Pixelbreite** und der **Pixelhöhe** entsprechen. *Normalerweise* sind diese gleich.
es: El resultado es que tenemos dos valores en µm/px, correspondientes al **ancho de píxel** y **alto de píxel**. *Por lo general* estos son iguales.
pt_br: O resultado é que temos dois valores em µm/px, correspondentes à **largura do pixel** e à **altura do pixel**. *Normalmente* são iguais.

source: Images with different pixel sizes. Whenever the field of view remains the same, the pixel size increases as the number of pixels in the image decreases.
de: Bilder mit unterschiedlichen Pixelgrößen. Bleibt das Sichtfeld gleich, nimmt die Pixelgröße zu, wenn die Anzahl der Pixel im Bild abnimmt.
es: Imágenes con diferentes tamaños de píxeles. Siempre que el campo visual sigue siendo el mismo, el tamaño de píxel aumenta a medida que disminuye el número de píxeles de la imagen.
pt_br: Imagens com diferentes tamanhos de pixel. Sempre que o campo de visão permanece o mesmo, o tamanho do pixel aumenta à medida que o número de pixels na imagem diminui.

source: [A Pixel is *Not* a Little Square](http://alvyray.com/Memos/CG/Microsoft/6_pixel.pdf)
de: [Ein Pixel ist *kein* ein kleines Quadrat](http://alvyray.com/Memos/CG/Microsoft/6_pixel.pdf)
es: [Un píxel *no* es un pequeño cuadrado](http://alvyray.com/Memos/CG/Microsoft/6_pixel.pdf)
pt_br: [Um pixel *não* é um pequeno quadrado](http://alvyray.com/Memos/CG/Microsoft/6_pixel.pdf)

source: Pixel squareness
de: Pixelquadratheit
es: Cuadratura de píxeles
pt_br: Quadratura de pixels

source: Talking of pixels as having (usually) equal widths and heights makes them sound very square-like, but previously I stated that pixels are not squares -- they are just displayed using squares.
de: Wenn man von Pixeln spricht, die (normalerweise) die gleiche Breite und Höhe haben, klingt das sehr quadratisch, aber ich habe bereits zuvor gesagt, dass Pixel keine Quadrate sind – sie werden nur durch Quadrate dargestellt.
es: Hablar de píxeles como si tuvieran (generalmente) valores iguales de ancho y alto hace que parezcan muy cuadrados, pero anteriormente dije que los píxeles no son cuadrados: simplemente se muestran usando cuadrados.
pt_br: Falar de pixels como tendo (normalmente) larguras e alturas iguais faz com que eles pareçam muito quadrados, mas anteriormente afirmei que pixels não são quadrados - eles são apenas exibidos usando quadrados.

source: This slightly murky philosophical distinction is considered in Alvy Ray Smith's technical memo (_right_), the title of which gives a good impression of the central argument. In short, pushing the pixels-are-square model too far leads to confusion in the end (e.g. what would happen at their 'edges'?), and does not really match up to the realities of how images are recorded (i.e. pixel values are not determined by detecting light emitted from little square regions, see {ref}`chap_formation_spatial`). Alternative terms, such as _sampling distance_, are often used instead of pixel size -- and are potentially less misleading.
de: Diese etwas unklare philosophische Unterscheidung wird in Alvy Ray Smiths technischem Memo (_right_) behandelt, dessen Titel einen guten Eindruck vom zentralen Argument vermittelt. Kurz gesagt führt eine zu starke Ausweitung des Pixel-sind-Quadrat-Modells am Ende zu Verwirrung (z. B. was würde an ihren „Rändern“ passieren?) und entspricht nicht wirklich der Realität, wie Bilder aufgezeichnet werden (d. h. Pixelwerte). werden nicht durch die Erkennung von Licht bestimmt, das von kleinen quadratischen Bereichen emittiert wird, siehe {ref}`chap_formation_spatial`). Alternative Begriffe wie „Abtastentfernung“ werden häufig anstelle der Pixelgröße verwendet – und sind möglicherweise weniger irreführend.
es: Esta distinción filosófica ligeramente turbia se considera en el memorando técnico de Alvy Ray Smith (_derecha_), cuyo título da una buena impresión del argumento central. En resumen, llevar demasiado lejos el modelo de que los píxeles son cuadrados conduce a confusión al final (por ejemplo, ¿qué pasaría en sus 'bordes'?), y realmente no coincide con la realidad de cómo se registran las imágenes (es decir, valores de píxeles). no se determinan detectando la luz emitida desde pequeñas regiones cuadradas, consulte {ref}`chap_formation_spatial`). A menudo se utilizan términos alternativos, como _distancia de muestreo_, en lugar de tamaño de píxel, y son potencialmente menos engañosos.
pt_br: Esta distinção filosófica ligeiramente obscura é considerada no memorando técnico de Alvy Ray Smith (_à direita_), cujo título dá uma boa impressão do argumento central. Resumindo, levar longe demais o modelo de pixels são quadrados leva à confusão no final (por exemplo, o que aconteceria em suas 'bordas'?), E não corresponde realmente à realidade de como as imagens são gravadas (ou seja, valores de pixel não são determinados pela detecção de luz emitida por pequenas regiões quadradas, consulte {ref}`chap_formation_spatial`). Termos alternativos, como _distância de amostragem_, são frequentemente usados em vez do tamanho do pixel – e são potencialmente menos enganosos.

source: But 'pixel size' is still used commonly in software (including ImageJ), and we will use the term as a useful shorthand.
de: Aber „Pixelgröße“ wird in Software (einschließlich ImageJ) immer noch häufig verwendet, und wir werden den Begriff als nützliche Abkürzung verwenden.
es: Pero el 'tamaño de píxel' todavía se usa comúnmente en software (incluyendo ImageJ), y usaremos el término como una abreviatura útil.
pt_br: Mas 'tamanho de pixel' ainda é comumente usado em software (incluindo ImageJ), e usaremos o termo como uma abreviação útil.

source: Pixel sizes and measurements
de: Pixelgrößen und -maße
es: Tamaños y medidas de píxeles
pt_br: Tamanhos e medidas de pixels

source: Knowing the pixel size makes it possible to calibrate size measurements. For example, if we measure some structure horizontally in the image and find that it is 10 pixels in length, with a pixel size of 0.5µm, we can deduce that its actual length in reality is (approximately!) 10 × 0.5µm = 5µm.
de: Die Kenntnis der Pixelgröße ermöglicht die Kalibrierung von Größenmessungen. Wenn wir beispielsweise eine Struktur horizontal im Bild messen und feststellen, dass sie 10 Pixel lang und eine Pixelgröße von 0,5 µm ist, können wir daraus schließen, dass ihre tatsächliche Länge in Wirklichkeit (ungefähr!) 10 × 0,5 µm = 5 µm beträgt .
es: Conocer el tamaño de píxel permite calibrar las medidas de tamaño. Por ejemplo, si medimos alguna estructura horizontalmente en la imagen y encontramos que tiene 10 píxeles de largo, con un tamaño de píxel de 0,5 µm, podemos deducir que su longitud real en realidad es (¡aproximadamente!) 10 × 0.5 µm = 5 µm .
pt_br: Conhecer o tamanho do pixel torna possível calibrar as medidas de tamanho. Por exemplo, se medirmos alguma estrutura horizontalmente na imagem e descobrirmos que ela tem 10 pixels de comprimento, com tamanho de pixel de 0,5 µm, podemos deduzir que seu comprimento real na realidade é (aproximadamente!) 10 × 0,5 µm = 5 µm .

source: This conversion is often done within the analysis software, but depends upon the pixel size information being present and correct. All being well, appropriate pixel sizes will have been written into an image file during acquisition and subsequently read by the software. Unfortunately, this does not always work out (see {ref}`chap_files`) and so we do always need to check our pixel sizes, and derived measurements of size, for reasonableness.
de: Diese Konvertierung erfolgt häufig innerhalb der Analysesoftware, hängt jedoch davon ab, dass die Informationen zur Pixelgröße vorhanden und korrekt sind. Wenn alles in Ordnung ist, werden bei der Aufnahme geeignete Pixelgrößen in eine Bilddatei geschrieben und anschließend von der Software gelesen. Leider funktioniert dies nicht immer (siehe {ref}`chap_files`) und daher müssen wir immer unsere Pixelgrößen und abgeleiteten Größenmaße auf Angemessenheit überprüfen.
es: Esta conversión a menudo se realiza dentro del software de análisis, pero depende de que la información del tamaño de píxel esté presente y sea correcta. Si todo va bien, se habrán escrito los tamaños de píxeles apropiados en un archivo de imagen durante la adquisición y posteriormente el software los habrá leído. Desafortunadamente, esto no siempre funciona (consulte {ref}`chap_files`) y, por lo tanto, siempre debemos verificar que nuestros tamaños de píxeles y las medidas de tamaño derivadas sean razonables.
pt_br: Essa conversão geralmente é feita no software de análise, mas depende da presença e da correção das informações sobre o tamanho do pixel. Se tudo correr bem, os tamanhos de pixel apropriados terão sido gravados em um arquivo de imagem durante a aquisição e posteriormente lidos pelo software. Infelizmente, isso nem sempre funciona (veja {ref}`chap_files`) e por isso sempre precisamos verificar nossos tamanhos de pixel e medidas derivadas de tamanho, para ver se há razoabilidade.

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: Suppose we detect a structure and we count that it covers an area spanning 10 pixels. Suppose also that the pixel width = 2.0 µm and the pixel height is 2.0 µm.
de: Angenommen, wir erkennen eine Struktur und zählen, dass sie einen Bereich von 10 Pixeln abdeckt. Nehmen wir außerdem an, dass die Pixelbreite = 2,0 µm und die Pixelhöhe 2,0 µm beträgt.
es: Supongamos que detectamos una estructura y contamos que cubre un área que abarca 10 píxeles. Supongamos también que el ancho del píxel = 2.0 µm y la altura del píxel es 2.0 µm.
pt_br: Suponha que detectamos uma estrutura e contamos que ela cobre uma área de 10 pixels. Suponha também que a largura do pixel = 2,0 µm e a altura do pixel seja 2,0 µm.

source: What is the **area** of the structure in µm<sup>2</sup>?
de: Wie groß ist die **Fläche** der Struktur in µm<sup>2</sup>?
es: ¿Cuál es el **área** de la estructura en µm<sup>2</sup>?
pt_br: Qual é a **área** da estrutura em µm<sup>2</sup>?

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: At least that's the answer I was looking for: 10 x 2µm x 2µm = 40µm<sup>2</sup>.
de: Zumindest ist das die Antwort, nach der ich gesucht habe: 10 x 2µm x 2µm = 40µm<sup>2</sup>.
es: Al menos esa es la respuesta que estaba buscando: 10 x 2 µm x 2 µm = 40 µm<sup>2</sup>.
pt_br: Pelo menos essa é a resposta que eu procurava: 10 x 2µm x 2µm = 40µm<sup>2</sup>.

source: If you want to be pedantic about it, you might quibble about whether it makes sense to report 2D areas for 3D structures, or the possible impact of measurement error caused by the diffraction limit.
de: Wenn Sie es pedantisch angehen wollen, könnten Sie darüber streiten, ob es sinnvoll ist, 2D-Bereiche für 3D-Strukturen anzugeben, oder über die möglichen Auswirkungen von Messfehlern, die durch die Beugungsgrenze verursacht werden.
es: Si quieres ser pedante al respecto, podrías tener objeciones sobre si tiene sentido reportar áreas 2D para estructuras 3D o el posible impacto del error de medición causado por el límite de difracción.
pt_br: Se você quiser ser pedante sobre isso, poderá questionar se faz sentido relatar áreas 2D para estruturas 3D ou o possível impacto do erro de medição causado pelo limite de difração.

source: But let's not be pedantic for now.
de: Aber seien wir jetzt nicht pedantisch.
es: Pero no seamos pedantes por ahora.
pt_br: Mas não sejamos pedantes por enquanto.

source: Pixel sizes and detail
de: Pixelgrößen und Details
es: Tamaños de píxeles y detalles
pt_br: Tamanhos e detalhes de pixels

source: In general, if the pixel size in a microscopy image is large then we cannot see very fine detail (see {numref}`fig-px_sizes`). However, the subject becomes complicated by the diffraction of light whenever we are considering scales of hundreds of nanometers, so that acquiring images with smaller pixel sizes does not necessarily bring us extra information -- and might even become a hindrance.
de: Wenn die Pixelgröße in einem Mikroskopiebild groß ist, können wir im Allgemeinen keine sehr feinen Details erkennen (siehe {numref}`fig-px_sizes`). Allerdings wird das Thema durch die Beugung des Lichts kompliziert, wenn wir Skalen von Hunderten von Nanometern betrachten, so dass die Aufnahme von Bildern mit kleineren Pixelgrößen nicht unbedingt zusätzliche Informationen bringt – und sogar hinderlich sein kann.
es: En general, si el tamaño de píxel en una imagen de microscopía es grande, entonces no podemos ver detalles muy finos (consulte {numref}`fig-px_sizes`). Sin embargo, el tema se complica por la difracción de la luz cuando consideramos escalas de cientos de nanómetros, de modo que adquirir imágenes con tamaños de píxeles más pequeños no necesariamente nos aporta información adicional, e incluso podría convertirse en un obstáculo.
pt_br: Em geral, se o tamanho do pixel em uma imagem de microscopia for grande, não poderemos ver detalhes muito finos (consulte {numref}`fig-px_sizes`). Porém, o assunto se complica com a difração da luz sempre que consideramos escalas de centenas de nanômetros, de modo que adquirir imagens com pixels menores não necessariamente nos traz informações extras - e pode até se tornar um obstáculo.

source: This will be explored in more detail in {ref}`chap_formation_spatial` and {ref}`chap_formation_noise`.
de: Dies wird in {ref}`chap_formation_spatial` und {ref}`chap_formation_noise` ausführlicher untersucht.
es: Esto se explorará a más detalle en {ref}`chap_formation_spatial` y {ref}`chap_formation_noise`.
pt_br: Isso será explorado com mais detalhes em {ref}`chap_formation_spatial` e {ref}`chap_formation_noise`.

source: Dimensions
de: Maße
es: Dimensiones
pt_br: Dimensões

source: Identifying dimensions
de: Dimensionen identifizieren
es: Identificando dimensiones
pt_br: Identificando dimensões

source: The concept of **image dimensions** is *mostly* straightforward, although I'm not aware of any universal definition that all people and all software stick to reliably.
de: Das Konzept der **Bildabmessungen** ist *größtenteils* einfach, obwohl mir keine universelle Definition bekannt ist, an die sich alle Menschen und alle Software zuverlässig halten.
es: El concepto de **dimensiones de imagen** es *en su mayoría* sencillo, aunque no conozco ninguna definición universal que todas las personas y todo el software sigan de manera confiable.
pt_br: O conceito de **dimensões de imagem** é *principalmente* direto, embora eu não tenha conhecimento de nenhuma definição universal que todas as pessoas e todos os softwares sigam de forma confiável.

source: The approach we'll take here is to say: **the number of dimensions is the number of pieces of information you need to know to identify an individual pixel.**
de: Der Ansatz, den wir hier verfolgen, besteht darin, zu sagen: **Die Anzahl der Dimensionen ist die Anzahl der Informationen, die Sie kennen müssen, um ein einzelnes Pixel zu identifizieren.**
es: El enfoque que adoptaremos aquí es decir: **el número de dimensiones es el número de datos que necesitas saber para identificar un píxel individual.**
pt_br: A abordagem que adotaremos aqui é dizer: **o número de dimensões é o número de informações que você precisa saber para identificar um pixel individual.**

source: For example, in the most familiar 2D images, we can uniquely identify a pixel if we know its _x_ and _y_ spatial coordinates.
de: Beispielsweise können wir in den bekanntesten 2D-Bildern ein Pixel eindeutig identifizieren, wenn wir seine räumlichen Koordinaten _x_ und _y_ kennen.
es: Por ejemplo, en las imágenes 2D más familiares, podemos identificar de forma única un píxel si conocemos sus coordenadas espaciales _x_ e _y_.
pt_br: Por exemplo, nas imagens 2D mais familiares, podemos identificar exclusivamente um pixel se conhecermos suas coordenadas espaciais _x_ e _y_.
