Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/python.po
Languages: es, pt_br

source: Python: Pixel size & dimensions
es: Python: Tamaño de píxel y dimensiones
pt_br: Python: tamanho e dimensões do pixel

source: This section gives a bit of background on working with pixel sizes and dimensions in Python... which is a bit more complicated than one might first expect.
es: Esta sección proporciona un poco de información sobre cómo trabajar con tamaños de píxel y dimensiones en Python... que es un poco más complicado de lo que uno podría esperar a primera vista.
pt_br: Esta seção fornece algumas informações básicas sobre como trabalhar com tamanhos e dimensões de pixels em Python... o que é um pouco mais complicado do que se poderia esperar à primeira vista.

source: Pixel size
es: Tamaño de píxel
pt_br: Tamanho dos pixels

source: Checking the pixel size in Python has been, in my opinion, a bit of a pain - because the common libraries used to read images don't always make that information very easy to access.
es: Comprobar el tamaño de los píxeles en Python ha sido, en mi opinión, un poco engorroso, porque las bibliotecas habituales utilizadas para leer imágenes no siempre facilitan el acceso a esa información.
pt_br: Verificar o tamanho do pixel em Python tem sido, na minha opinião, um pouco trabalhoso - porque as bibliotecas comuns usadas para ler imagens nem sempre facilitam o acesso a essas informações.

source: The situation is improving though.
es: Sin embargo, la situación está mejorando.
pt_br: A situação está melhorando.

source: Here, we'll look at accessing pixel size information using two popular image-reading libraries:
es: A continuación, veremos cómo acceder a la información sobre el tamaño de los píxeles utilizando dos conocidas bibliotecas de lectura de imágenes:
pt_br: Aqui, veremos como acessar informações de tamanho de pixel usando duas bibliotecas populares de leitura de imagens:

source: [`imageio`](https://pypi.org/project/imageio/) - which very commonly used, and makes reading lots of common image types straightforward
es: [`imageio`](https://pypi.org/project/imageio/) - de uso muy común, facilita la lectura de muchos tipos comunes de imágenes.
pt_br: [`imageio`](https://pypi.org/project/imageio/) - que é muito comumente usado e facilita a leitura de muitos tipos de imagens comuns

source: [`AICSImageIO`](https://pypi.org/project/aicsimageio/3.2.1/) - which is a bit more complex, but has some *extremely* useful features for working with scientific images
es: [`AICSImageIO`](https://pypi.org/project/aicsimageio/3.2.1/) - que es un poco más complejo, pero tiene algunas características *extremadamente* útiles para trabajar con imágenes científicas.
pt_br: [`AICSImageIO`](https://pypi.org/project/aicsimageio/3.2.1/) - que é um pouco mais complexo, mas possui alguns recursos *extremamente* úteis para trabalhar com imagens científicas

source: ImageIO
pt_br: ImagemIO

source: To explore pixel sizes with `imageio`, let's return to the neuron image used in the 'Channels & colors' chapter.
es: Para explorar el tamaño de los píxeles con `imageio`, volvamos a la imagen neuronal utilizada en el capítulo 'Canales y colores'.
pt_br: Para explorar tamanhos de pixels com `imageio`, vamos retornar à imagem do neurônio usada no capítulo 'Canais e cores'.

source: The following code shows how we can read both the pixel values and the metadata.
es: El siguiente código muestra cómo podemos leer tanto los valores de los píxeles como los metadatos.
pt_br: O código a seguir mostra como podemos ler os valores de pixel e os metadados.

source: The metadata contains a lot of info, even including lookup tables.
es: Los metadatos contienen mucha información, incluso tablas de consulta.
pt_br: Os metadados contêm muitas informações, incluindo até tabelas de pesquisa.

source: Printing it a little more nicely (and skipping the LUTs), we get:
es: Imprimiéndolo un poco más bonito (y saltándonos las LUTs), obtenemos:
pt_br: Imprimindo um pouco melhor (e ignorando os LUTs), obtemos:

source: This metadata is actually quite ImageJ-specific, and other TIFFs may give quite different metadata.
es: En realidad, estos metadatos son bastante específicos de ImageJ, y otros TIFF pueden proporcionar metadatos muy diferentes.
pt_br: Na verdade, esses metadados são bastante específicos do ImageJ e outros TIFFs podem fornecer metadados bem diferentes.

source: We can see the version of ImageJ that wrote the file, but picking out the key thing we want here - the pixel size - is not so easy.
es: Podemos ver la versión de ImageJ que escribió el archivo, pero elegir el elemento clave que queremos aquí - el tamaño de píxel - no es tan fácil.
pt_br: Podemos ver a versão do ImageJ que gravou o arquivo, mas escolher o que queremos aqui - o tamanho do pixel - não é tão fácil.

source: Seeing `unit=um` is encouraging, but not enough.
es: Ver "unit=um" es alentador, pero no suficiente.
pt_br: Ver `unit=um` é encorajador, mas não o suficiente.

source: We can explore a bit more with 'properties', which imageio described as ['a curated set of standardized metadata'](https://imageio.readthedocs.io/en/v2.30.0/reference/userapi.html#metadata).
es: Podemos explorar un poco más con 'propiedades', que imageio describe como ['un conjunto curado de metadatos estandarizados'](https://imageio.readthedocs.io/en/v2.30.0/reference/userapi.html#metadata).
pt_br: Podemos explorar um pouco mais com 'propriedades', que imageio descreveu como ['um conjunto curado de metadados padronizados'](https://imageio.readthedocs.io/en/v2.30.0/reference/userapi.html#metadata) .

source: Here, the `spacing=(6.25, 6.25)` seems promising.
es: Aquí, el `spacing=(6.25, 6.25)` parece prometedor.
pt_br: Aqui, o `spacing=(6.25, 6.25)` parece promissor.

source: It's tempting to suppose that means the pixel width and height are both 6.25 µm - *however* if I check the same image in ImageJ itself, I see the pixel width and height are actually 0.16 µm... which happens to equal 1.0/6.25 µm.
es: Es tentador suponer que eso significa que la anchura y la altura del píxel son ambas de 6.25 µm - *sin embargo* si compruebo la misma imagen en el propio ImageJ, veo que la anchura y la altura del píxel son en realidad de 0.16 µm... lo que resulta ser igual a 1.0/6.25 µm.
pt_br: É tentador supor que isso significa que a largura e a altura do pixel são ambas de 6,25 µm - *no entanto* se eu verificar a mesma imagem no próprio ImageJ, vejo que a largura e a altura do pixel são na verdade 0,16 µm... o que é igual a 1,0/6,25 µm.

source: Therefore the information **is** in the metadata, but it's very easy to misinterpret - and it isn't even guaranteed to be correct if the image was written by some other software.
es: Por lo tanto, la información **está** en los metadatos, pero es muy fácil malinterpretarla, y ni siquiera está garantizado que sea correcta si la imagen fue escrita por algún otro software.
pt_br: Portanto, a informação **está** nos metadados, mas é muito fácil de ser mal interpretada - e nem mesmo é garantido que esteja correta se a imagem foi escrita por algum outro software.

source: So while `imageio` is excellent for reading images easily - generally just a quick `im = imread(path)` - it's not necessarily the best thing to use when pixel sizes (or other metadata) matter.
es: Así que mientras `imageio` es excelente para leer imágenes fácilmente - generalmente sólo un rápido `im = imread(path)` - no es necesariamente lo mejor para usar cuando el tamaño de los píxeles (u otros metadatos) importan.
pt_br: Portanto, embora `imageio` seja excelente para ler imagens facilmente - geralmente apenas um rápido `im = imread(path)` - não é necessariamente a melhor coisa a ser usada quando tamanhos de pixels (ou outros metadados) são importantes.

source: Using AICSImageIO
es: Uso de AICSImageIO
pt_br: Usando AICSImageIO

source: The best alternative I know for working with scientific (especially biomedical) images is [**AICSImageIO**](https://github.com/AllenCellModeling/aicsimageio). This is a really useful Python library that standardizes reading and writing multiple file formats - and, depending upon how it's installed, can even access lots more awkward proprietary file formats with the help of [Bio-Formats](http://www.openmicroscopy.org/bio-formats/).
es: La mejor alternativa que conozco para trabajar con imágenes científicas (especialmente biomédicas) es [**AICSImageIO**](https://github.com/AllenCellModeling/aicsimageio). Se trata de una biblioteca de Python realmente útil que estandariza la lectura y escritura de múltiples formatos de archivo - y, dependiendo de cómo esté instalada, puede incluso acceder a muchos más formatos raros de archivo con la ayuda de [Bio-Formats](http://www.openmicroscopy.org/bio-formats/).
pt_br: A melhor alternativa que conheço para trabalhar com imagens científicas (especialmente biomédicas) é [**AICSImageIO**](https://github.com/AllenCellModeling/aicsimageio). Esta é uma biblioteca Python realmente útil que padroniza a leitura e gravação de vários formatos de arquivo - e, dependendo de como for instalada, pode até acessar muitos formatos de arquivo proprietários mais estranhos com a ajuda de [Bio-Formats](http://www.openmicroscopy .org/bio-formatos/).

source: Although it's possible to use a version of `imread` with AICSImageIO, it's worth learning the alternative way of doing things by creating an `AICSImage` object. This provides us with a way to access pixels and lots of other useful things whenever we need them.
es: Aunque es posible utilizar una versión de `imread` con AICSImageIO, vale la pena aprender la forma alternativa de hacer las cosas creando un objeto `AICSImage`. Esto nos proporciona una forma de acceder a los píxeles y a muchas otras cosas útiles siempre que las necesitemos.
pt_br: Embora seja possível usar uma versão do `imread` com AICSImageIO, vale a pena aprender a maneira alternativa de fazer as coisas criando um objeto `AICSImage`. Isso nos fornece uma maneira de acessar pixels e muitas outras coisas úteis sempre que precisarmos deles.

source: From this, we can immediately see the attribute that will provide us with pixel sizes directly.
es: A partir de aquí, podemos ver inmediatamente el atributo que nos proporcionará directamente el tamaño de los píxeles.
pt_br: A partir disso, podemos ver imediatamente o atributo que nos fornecerá diretamente os tamanhos dos pixels.

source: One perhaps non-obvious thing to know when using AICSImageIO is that the `AICSImage` isn't a regular NumPy array of the kind that `imageio.imread` would return. Rather, if you want that, you need to request the data.
es: Una cosa quizás no obvia que hay que saber al usar AICSImageIO es que `AICSImage` no es un array NumPy normal del tipo que devolvería `imageio.imread`. Más bien, si quieres eso, tienes que solicitar los datos.
pt_br: Uma coisa talvez não óbvia a saber ao usar AICSImageIO é que `AICSImage` não é um array NumPy regular do tipo que `imageio.imread` retornaria. Em vez disso, se você quiser, precisará solicitar os dados.

source: Using this knowledge, we can check that we have the same mean pixel value for both - as a quick way to ascertain that the actual pixel values are likely to match.
es: A partir de este conocimiento, podemos comprobar que tenemos el mismo valor medio de píxel para ambos, como una forma rápida de asegurarnos de que los valores reales de píxel probablemente coincidan.
pt_br: Usando esse conhecimento, podemos verificar se temos o mesmo valor médio de pixel para ambos - como uma maneira rápida de verificar se os valores reais de pixel provavelmente corresponderão.

source: Dimensions
es: Dimensiones
pt_br: Dimensões

source: Array shapes and dimensions
es: Formas y dimensiones de las matrices
pt_br: Formas e dimensões da matriz

source: We've seen how two different libraries can enable us to read the same pixel values as NumPy arrays and extract pixel size information.
es: Hemos visto cómo dos librerías diferentes pueden permitirnos leer los mismos valores de píxeles como matrices NumPy y extraer información sobre el tamaño de los píxeles.
pt_br: Vimos como duas bibliotecas diferentes podem nos permitir ler os mesmos valores de pixel que arrays NumPy e extrair informações de tamanho de pixel.

source: We might well expect that the NumPy arrays representing the pixel values are the same, but in fact we can't count on that.
es: Podríamos esperar que las matrices NumPy que representan los valores de los píxeles fueran iguales, pero en realidad no podemos contar con ello.
pt_br: Poderíamos muito bem esperar que as matrizes NumPy que representam os valores dos pixels sejam as mesmas, mas na verdade não podemos contar com isso.

source: NumPy is incredibly flexible when it comes to handling multidimensional arrays. And while that flexibility can be really helpful, it can also complicate things.
es: NumPy es increíblemente flexible cuando se trata de manejar matrices multidimensionales. Y aunque esa flexibilidad puede ser realmente útil, también puede complicar las cosas.
pt_br: NumPy é incrivelmente flexível quando se trata de lidar com arrays multidimensionais. E embora essa flexibilidade possa ser muito útil, também pode complicar as coisas.

source: To see it in action, let's check the dimensions of the images we read using imageio and AICSImageIO.
es: Para verlo en acción, comprobemos las dimensiones de las imágenes que leemos utilizando imageio y AICSImageIO.
pt_br: Para ver isso em ação, vamos verificar as dimensões das imagens que lemos usando imageio e AICSImageIO.

source: We can see the number of pixels are the same, but there are some extra 'singleton' dimensions stuck into the results from AICSImageIO (i.e. with length `1`).
es: Podemos ver que el número de píxeles es el mismo, pero hay algunas dimensiones 'unicas' adicionales metidas en los resultados de AICSImageIO (es decir, con longitud `1`).
pt_br: Podemos ver que o número de pixels é o mesmo, mas há algumas dimensões extras 'singleton' presas nos resultados do AICSImageIO (ou seja, com comprimento `1`).

source: Fortunately, we can easily remove them with an `np.squeeze` - and end up with the same arrays.
es: Afortunadamente, podemos eliminarlos fácilmente con un `np.squeeze` - y acabar con las mismas matrices.
pt_br: Felizmente, podemos removê-los facilmente com um `np.squeeze` - e acabar com os mesmos arrays.

source: So a natural question is: **why has AICSImageIO snuck in some extra dimensions?**
es: Así que una pregunta natural es: **¿Por qué AICSImageIO ha introducido algunas dimensiones extra?
pt_br: Portanto, uma pergunta natural é: **por que o AICSImageIO se infiltrou em algumas dimensões extras?**

source: Before answering that, we should ask ourselves something else. **What exactly do we _have_ along the dimension of length `5`?**
es: Antes de responder a eso, deberíamos preguntarnos otra cosa. **¿Qué tenemos exactamente a lo largo de la dimensión "5"?
pt_br: Antes de responder a isso, deveríamos nos perguntar outra coisa. **O que exatamente _temos_ ao longo da dimensão de comprimento `5`?**

source: And this is where things aren't terribly clear with imageio.
es: Y aquí es donde las cosas no están muy claras con Imageio.
pt_br: E é aqui que as coisas não ficam muito claras com o imageio.

source: `5` *could* be the width of the image, height of the image, number of channels, number of z-slices, or number of timepoints.
es: `5` *podría ser* la anchura de la imagen, la altura de la imagen, el número de canales, el número de secciones z o el número de puntos temporales.
pt_br: `5` *pode* ser a largura da imagem, altura da imagem, número de canais, número de fatias z ou número de pontos no tempo.

source: Based upon our knowledge of images and the other dimensions, we'd be justified in expecting that the `5` doesn't correspond to the image width or height - `512` seems more likely for those - so it's probably one of the others.
es: Basándonos en nuestro conocimiento de las imágenes y de las otras dimensiones, podemos suponer que el "5" no corresponde a la anchura ni a la altura de la imagen (el "512" parece más probable), por lo que probablemente sea una de las otras.
pt_br: Com base em nosso conhecimento de imagens e outras dimensões, estaríamos justificados em esperar que o `5` não corresponda à largura ou altura da imagem - `512` parece mais provável para essas - então é provavelmente uma das outras .

source: But the problem is that **we have no way of knowing** without further information. If we don't have some external source to tell us, we need to poke around the metadata or look at the contents to figure out the answer.
es: Pero el problema es que **no tenemos forma de saberlo** sin más información. Si no tenemos una fuente externa que nos lo diga, tenemos que hurgar en los metadatos o mirar el contenido para averiguar la respuesta.
pt_br: Mas o problema é que **não temos como saber** sem mais informações. Se não tivermos alguma fonte externa para nos informar, precisamos vasculhar os metadados ou examinar o conteúdo para descobrir a resposta.

source: To me, that looks very much like we have 5 different channels. I'm making some assumptions there... but they seem pretty safe assumptions.
es: A mí me parece que tenemos 5 canales diferentes. Estoy haciendo algunas suposiciones... pero parecen suposiciones bastante seguras.
pt_br: Para mim, parece que temos 5 canais diferentes. Estou fazendo algumas suposições... mas parecem suposições bastante seguras.

source: However AICSImageIO removes this ambiguity in a couple of ways.
es: Sin embargo, AICSImageIO elimina esta ambigüedad de un par de maneras.
pt_br: No entanto, o AICSImageIO elimina essa ambigüidade de duas maneiras.

source: You can expect `AICSImage` to return a 5D array, with the dimensions in a consistent order: `TCZYX` (although there is at least one caveat in the next section!)
es: Puedes esperar que `AICSImage` devuelva un array 5D, con las dimensiones en un orden consistente: TCZYX` (aunque hay al menos una advertencia en la siguiente sección).
pt_br: Você pode esperar que `AICSImage` retorne um array 5D, com as dimensões em uma ordem consistente: `TCZYX` (embora haja pelo menos uma ressalva na próxima seção!)

source: You can easily query the dimensions and order to be sure
es: Puede consultar fácilmente las dimensiones y el orden para estar seguro
pt_br: Você pode consultar facilmente as dimensões e fazer o pedido para ter certeza

source: Where are my channels?!?
es: ¿Dónde están mis canales?
pt_br: Cadê meus canais?!?

source: We've seen above that imageio can return a 5-channel image with the channels first. Our question here is: does it always do that?
es: Hemos visto anteriormente que imageio puede devolver una imagen de 5 canales con los canales en primer lugar. Nuestra pregunta aquí es: ¿lo hace siempre?
pt_br: Vimos acima que o imageio pode retornar uma imagem de 5 canais com os canais primeiro. Nossa pergunta aqui é: isso sempre acontece?

source: The answer, alas, is no. The location of the channels dimensions is painfully uncertain in Python, and often different tools expect it to be in different places.
es: La respuesta, por desgracia, es no. La ubicación de las dimensiones de los canales es dolorosamente incierta en Python, y a menudo diferentes herramientas esperan que esté en diferentes lugares.
pt_br: A resposta, infelizmente, é não. A localização das dimensões dos canais é dolorosamente incerta em Python, e muitas vezes ferramentas diferentes esperam que ela esteja em lugares diferentes.

source: Or sometimes the *same* tool might put it in a different place.
es: O a veces la *misma* herramienta puede ponerlo en un lugar diferente.
pt_br: Ou às vezes a *mesma* ferramenta pode colocá-lo em um lugar diferente.

source: To see that in action, let's read a simple RGB image with imageio.
es: Para verlo en acción, vamos a leer una simple imagen RGB con imageio.
pt_br: Para ver isso em ação, vamos ler uma imagem RGB simples com imageio.

source: An RGB image has 3 channels - red, green and blue - but it seems that suddenly we have the channels dimension last.
es: Una imagen RGB tiene 3 canales - rojo, verde y azul - pero parece que de repente tenemos la dimensión de los canales en último lugar.
pt_br: Uma imagem RGB possui 3 canais – vermelho, verde e azul – mas parece que de repente temos a dimensão dos canais por último.

source: Why?
es: ¿Por qué?
pt_br: Por que?

source: I don't have a very satisfying explanation, except to say that for RGB that's often what you want because matplotlib expects the channels to be last, and we often use matplotlib to show images.
es: No tengo una explicación muy satisfactoria, excepto decir que para RGB eso es a menudo lo que quieres porque matplotlib espera que los canales sean los últimos, y a menudo usamos matplotlib para mostrar imágenes.
pt_br: Não tenho uma explicação muito satisfatória, exceto para dizer que, para RGB, geralmente é isso que você deseja, porque o matplotlib espera que os canais sejam os últimos, e geralmente usamos o matplotlib para mostrar imagens.

source: It's not *always* what you want though, and if you get enough deep learning then you'll find the 'channels-first' or 'channels-last' question coming up often.
es: Sin embargo, no es *siempre* lo que quieres, y si consigues un aprendizaje profundo suficiente, te encontrarás a menudo con la pregunta "canales primero" o "canales después".
pt_br: Porém, nem sempre é o que você deseja, e se você obtiver um aprendizado profundo o suficiente, encontrará a pergunta 'canais primeiro' ou 'canais por último' surgindo com frequência.

source: With that in mind, we can use NumPy to shift from so-called 'channels-last' to 'channels-first' - but matplotlib won't like that very much.
es: Con esto en mente, podemos usar NumPy para cambiar de los llamados 'canales-últimos' a 'canales-primeros' - pero a matplotlib no le gustará mucho.
pt_br: Com isso em mente, podemos usar o NumPy para mudar dos chamados 'canais últimos' para 'canais primeiros' - mas o matplotlib não vai gostar muito disso.

source: So imageio might get channels at the start or the end. For RGB, it seems to prefer the end.
es: Así que imageio puede obtener canales al principio o al final. Para RGB, parece preferir el final.
pt_br: Portanto, o imageio pode obter canais no início ou no final. Para RGB, parece preferir o final.

source: What does AICSImageIO do?
es: ¿Qué hace AICSImageIO?
pt_br: O que o AICSImageIO faz?

source: Since I said AICSImageIO is consistent, I'd like to say it puts the channels in the same place for the RGB and 5-channel image... but no. It also treats RGB as a special case.
es: Ya que dije que AICSImageIO es consistente, me gustaría decir que pone los canales en el mismo lugar para la imagen RGB y la de 5 canales... pero no. También trata RGB como un caso especial.
pt_br: Já que eu disse que o AICSImageIO é consistente, gostaria de dizer que ele coloca os canais no mesmo lugar para a imagem RGB e de 5 canais... mas não. Também trata o RGB como um caso especial.
