Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/5-pixel_size/python.po
Languages: es, pt_br

source: It's a little hard to find, but the AICSImageIO documentation mentions that [you can expect 5 dimensions for non-RGB images, but RGB images have 6 dimensions](https://allencellmodeling.github.io/aicsimageio/aicsimageio.readers.html#aicsimageio.readers.bioformats_reader.BioFile.to_numpy) - where the sixth is called `S` for `Samples`.
es: Es un poco difícil de encontrar, pero la documentación de AICSImageIO menciona que [se pueden esperar 5 dimensiones para imágenes no RGB, pero las imágenes RGB tienen 6 dimensiones](https://allencellmodeling.github.io/aicsimageio/aicsimageio.readers.html#aicsimageio.readers.bioformats_reader.BioFile.to_numpy) - donde la sexta se llama `S` para `Samples`.
pt_br: É um pouco difícil de encontrar, mas a documentação do AICSImageIO menciona que [você pode esperar 5 dimensões para imagens não RGB, mas as imagens RGB têm 6 dimensões](https://allencellmodeling.github.io/aicsimageio/aicsimageio.readers.html #aicsimageio.readers.bioformats_reader.BioFile.to_numpy) - onde o sexto é chamado `S` para `Samples`.

source: The good thing is that, assuming you don't have anything else going on with the first 3 dimensions - i.e. they are just `(1, 1, 1)` - a simple `np.squeeze` is enough to convert the pixel array into a matplotlib-friendly channels-last RGB format.
es: Lo bueno es que, suponiendo que no tienes nada más en marcha con las 3 primeras dimensiones - es decir, son sólo `(1, 1, 1)` - un simple `np.squeeze` es suficiente para convertir la matriz de píxeles en un formato RGB de último canal, que sea amigable con matplotlib.
pt_br: O bom é que, supondo que você não tenha mais nada acontecendo com as 3 primeiras dimensões - ou seja, elas são apenas `(1, 1, 1)` - um simples `np.squeeze` é suficiente para converter a matriz de pixels em um formato RGB de último canal compatível com matplotlib.

source: More dimensions
es: Más dimensiones
pt_br: Mais dimensões

source: We'll end this section by looking at an image with 2 channels and 25 z-slices.
es: Terminaremos esta sección analizando una imagen con 2 canales y 25 cortes z.
pt_br: Encerraremos esta seção observando uma imagem com 2 canais e 25 fatias z.

source: Since you now know how to explore the dimensions in detail, I'll use my `load_image` helper function for convenience... which returns a NumPy array that's pre-squeezed to remove any singleton dimensions.
es: Ya que ahora sabes cómo explorar las dimensiones a detalle, usaré mi función de ayuda `load_image` por conveniencia... que devuelve un array NumPy que está pre-exprimido para eliminar cualquier dimensión única (singleton).
pt_br: Como agora você sabe como explorar as dimensões em detalhes, usarei minha função auxiliar `load_image` por conveniência... que retorna um array NumPy que é pré-comprimido para remover quaisquer dimensões singleton.

source: Since we already considered how to view multichannel images in the last chapter, let's extract a single channel here.
es: Como ya hemos visto cómo visualizar imágenes multicanal en el último capítulo, vamos a extraer aquí un solo canal.
pt_br: Como já consideramos como visualizar imagens multicanais no capítulo anterior, vamos extrair aqui um único canal.

source: At this point, NumPy becomes quite fun - because it is *so easy* to do stuff along different dimensions.
es: En este punto, NumPy se vuelve bastante divertido - porque es *tan fácil* hacer cosas a lo largo de diferentes dimensiones.
pt_br: Neste ponto, o NumPy se torna bastante divertido - porque é *muito fácil* fazer coisas em diferentes dimensões.

source: For example, we can rapidly generate different z-projections.
es: Por ejemplo, podemos generar rápidamente diferentes proyecciones z.
pt_br: Por exemplo, podemos gerar rapidamente diferentes projeções z.

source: But we're not limited to projecting along z - we can just switch the `axis` value and project along some other dimension.
es: Pero no estamos limitados a proyectar a lo largo de z - podemos simplemente cambiar el valor del `eje` y proyectar a lo largo de alguna otra dimensión.
pt_br: Mas não estamos limitados a projetar ao longo de z - podemos simplesmente mudar o valor do `eixo` e projetar ao longo de alguma outra dimensão.

source: Note that this won't do any correction for differences in pixel size in xy vs. z. With only 25 z-slices, these projections look extremely squashed.
es: Ten en cuenta que esto no hará ninguna corrección para las diferencias en el tamaño de píxel en xy vs z. Con sólo 25 secciones z, estas proyecciones se ven muy aplastadas.
pt_br: Observe que isso não fará nenhuma correção para diferenças no tamanho do pixel em xy vs. Com apenas 25 fatias z, essas projeções parecem extremamente comprimidas.

source: And we can also slice wherever we like as well, to obtain orthogonal views.
es: Y también podemos cortar donde queramos para obtener vistas ortogonales.
pt_br: E também podemos fatiar onde quisermos, para obter vistas ortogonais.
