Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/0-preamble/preface/preface.po
Languages: pt_br

source: Preface
pt_br: Prefácio

source: **I find bioimage analysis hard.**
pt_br: **Acho difícil a análise de bioimagem.**

source: After working in the field for over 15 years, developing algorithms, software and workshops, I feel like I *should* have amassed some level of expertise -- but I still find pretty much every new project I attempt to be difficult. It remains common to find me wandering around the house, mumbling and grumbling to myself, while grappling with some tricky analysis problem whose solution eludes me.
pt_br: Depois de trabalhar na área por mais de 15 anos, desenvolvendo algoritmos, software e workshops, sinto que *deveria* ter acumulado algum nível de conhecimento - mas ainda acho que praticamente todos os novos projetos que tento são difíceis. Ainda é comum me encontrar vagando pela casa, resmungando e resmungando para mim mesmo, enquanto me deparo com algum problema de análise complicado cuja solução me escapa.

source: If you want to read a book by someone who is pretty confident in their ability to quantitatively analyse whatever images come their way, this isn't the one for you.
pt_br: Se você quiser ler um livro de alguém que está bastante confiante em sua capacidade de analisar quantitativamente quaisquer imagens que surjam em seu caminho, este não é o livro para você.

source: I'm self-reflective enough to recognize that I might just not be very good at what I (try to) do. Perhaps I'm ill-suited to a career that I tumbled into almost entirely by accident. However, I take some comfort in the fact that, as I get to know more and more image analysts, it seems that most (if not all?) of us find many aspects of our work pretty difficult.
pt_br: Sou auto-reflexivo o suficiente para reconhecer que posso simplesmente não ser muito bom no que (tento) fazer. Talvez eu não seja adequado para uma carreira na qual caí quase inteiramente por acidente. No entanto, sinto algum conforto no fato de que, à medida que conheço cada vez mais analistas de imagem, parece que a maioria (se não todos?) de nós acha muitos aspectos do nosso trabalho bastante difíceis.

source: This isn't to say that *no one* finds analysing biological and biomedical images easy. I've encountered plenty of people who believe it's really quite simple: you can see the stuff in the image, now just detect it and quantify it. With ImageJ. Or AI. Or something. Set a threshold? Do whatever they did in that paper. Just have the summary plots for the group meeting next week, ok?
pt_br: Isso não quer dizer que *ninguém* ache fácil analisar imagens biológicas e biomédicas. Encontrei muitas pessoas que acreditam que é realmente muito simples: você pode ver o que está na imagem, agora é só detectá-lo e quantificá-lo. Com ImageJ. Ou IA. Ou alguma coisa. Definir um limite? Faça o que eles fizeram naquele jornal. Basta ter os enredos resumidos para a reunião do grupo na próxima semana, ok?

source: The trouble is that, in my experience at least, this attitude tends to be found exclusively among people who are either too early or too late in their careers to actually have to sit in front of a computer and wrestle meaningful information from a billion uncooperative pixels. Those of us who *do* need to sit at the computer know that it's not that straightforward.
pt_br: O problema é que, pelo menos na minha experiência, esta atitude tende a ser encontrada exclusivamente entre pessoas que estão muito cedo ou muito tarde em suas carreiras para realmente terem que sentar na frente de um computador e extrair informações significativas de um bilhão de pixels não cooperativos. . Aqueles de nós que *precisam* sentar em frente ao computador sabem que não é tão simples.

source: But I don't want to get too gloomy. Image analysis is hard, but there are good reasons not to give up.
pt_br: Mas não quero ficar muito sombrio. A análise de imagens é difícil, mas há bons motivos para não desistir.

source: I would argue that the problem is *not* that the concepts are difficult. In fact, the most important ones are remarkably straightforward -- once you know about them. A lot of the maths is basic arithmetic.
pt_br: Eu diria que o problema *não* é que os conceitos sejam difíceis. Na verdade, os mais importantes são notavelmente simples – uma vez que você os conheça. Grande parte da matemática é aritmética básica.

source: Rather, I'd say that image analysis is hard for two main reasons:
pt_br: Em vez disso, eu diria que a análise de imagens é difícil por dois motivos principais:

source: **Images in biology are *enormously* varied.** Almost nothing 'just works'. I might find a paper describing a marvellous method to detect, classify and track cells -- but there is no guarantee the method will work to detect, classify and track *my* cells. Maybe I have a different type of cell. Imaged on a different kind of microscope. At a different spatial and temporal resolution. To answer a different question. In short, I have a very different computational challenge from the one described in the paper -- even if the shared theme of 'tracking cells' initially made it sound similar.
pt_br: **As imagens em biologia são *enormemente* variadas.** Quase nada 'simplesmente funciona'. Posso encontrar um artigo descrevendo um método maravilhoso para detectar, classificar e rastrear células - mas não há garantia de que o método funcionará para detectar, classificar e rastrear *minhas* células. Talvez eu tenha um tipo diferente de célula. Fotografado em um tipo diferente de microscópio. Em uma resolução espacial e temporal diferente. Para responder a uma pergunta diferente. Em suma, tenho um desafio computacional muito diferente daquele descrito no artigo – mesmo que o tema partilhado de “rastrear células” inicialmente o tenha feito parecer semelhante.

source: **Bioimage analysis involves a lot of disciplines**. Analysing images in a scientifically justifiable way typically requires (at least a bit of) knowledge across a lot of domains. Of course it's necessary to know about the scientific question, e.g. the biology. But to really understand the data, you also need to know about the experimental setup, the imaging hardware, fundamental limits like noise and diffraction, and also how digital images are represented, stored and (sometimes) compressed. Then there are a plethora of image processing techniques that might help answer your scientific questions. You need to know not only what these are, but also how to assemble them together into a sequence of steps that work reliably and with minimal bias -- either using existing software or by writing new computer code. And finally statistics to bring it all together. It's a lot.
pt_br: **A análise de bioimagem envolve muitas disciplinas**. Analisar imagens de uma forma cientificamente justificável normalmente requer (pelo menos um pouco de) conhecimento em vários domínios. Claro que é necessário saber sobre a questão científica, por ex. A biologia. Mas para realmente entender os dados, você também precisa saber sobre a configuração experimental, o hardware de imagem, limites fundamentais como ruído e difração, e também como as imagens digitais são representadas, armazenadas e (às vezes) comprimidas. Depois, há uma infinidade de técnicas de processamento de imagens que podem ajudar a responder às suas questões científicas. Você precisa saber não apenas o que são, mas também como montá-los em uma sequência de etapas que funcionem de maneira confiável e com o mínimo de preconceitos - seja usando software existente ou escrevendo um novo código de computador. E, finalmente, estatísticas para reunir tudo. Isso é muito.

source: But amidst all this variety lurk some of the positive things about image analysis: it's **creative**, it's **challenging** (most of the time in a good way), and -- because it's rare for any individual to be an expert in all the related domains -- it's usually **collaborative** (or at least it should be).
pt_br: Mas em meio a toda essa variedade escondem-se algumas das coisas positivas sobre a análise de imagens: é **criativa**, é **desafiadora** (na maioria das vezes no bom sentido) e - porque é raro que qualquer indivíduo seja um especialista em todos os domínios relacionados - geralmente é **colaborativo** (ou pelo menos deveria ser).

source: The fact that bioimage analysis is so cross-disciplinary means that pretty much everyone can have valuable insights to contribute.
pt_br: O fato de a análise de bioimagem ser tão interdisciplinar significa que praticamente todos podem ter informações valiosas para contribuir.

source: This underpins my motivation in writing this book: I want to explain the concepts I use every day as an image analyst to people who spend their days differently. No matter who you are, you know a huge amount of stuff I don't know. My hope is that if we put the stuff we know together, we'll do better research, faster.
pt_br: Isto sustenta minha motivação ao escrever este livro: quero explicar os conceitos que uso todos os dias como analista de imagens para pessoas que passam seus dias de maneira diferente. Não importa quem você seja, você sabe uma quantidade enorme de coisas que eu não sei. Minha esperança é que, se juntarmos o que sabemos, faremos pesquisas melhores e mais rápidas.

source: The one instruction is: **be prepared to think hard.**
pt_br: A única instrução é: **esteja preparado para pensar muito.**

source: When I'm confronted by an image analysis problem, my goal is never really to find the *right* way to do the analysis. That generally doesn't exist.
pt_br: Quando sou confrontado com um problema de análise de imagem, meu objetivo nunca é realmente encontrar a maneira *certa* de fazer a análise. Isso geralmente não existe.

source: Instead, my goal is to find the *least wrong* way to do the analysis -- and to be able to understand and explain whatever lingering limitations and biases can't be entirely overcome. It can be frustrating, I still don't feel terribly good at it, but it is -- in its own strange way -- kind of *enjoyable*. There's always something new to learn, and some new angle from which to look at the problem. And each new angle can help us wring more drops of knowledge out of our data.
pt_br: Em vez disso, meu objetivo é encontrar a maneira *menos errada* de fazer a análise – e ser capaz de compreender e explicar quaisquer limitações e preconceitos persistentes que não possam ser totalmente superados. Pode ser frustrante, ainda não me sinto muito bem nisso, mas é - à sua maneira estranha - meio *agradável*. Sempre há algo novo para aprender e algum novo ângulo para analisar o problema. E cada novo ângulo pode nos ajudar a extrair mais informações de nossos dados.

source: My hope is that this book will help introduce others find the weird, frustrating pleasure of thinking more deeply about scientific images. Through this, I hope it might make a small contribution towards helping us do image analysis a bit better.
pt_br: Minha esperança é que este livro ajude a apresentar a outras pessoas o estranho e frustrante prazer de pensar mais profundamente sobre imagens científicas. Com isso, espero que possa dar uma pequena contribuição para nos ajudar a fazer uma análise de imagens um pouco melhor.
