Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/4-filters/filters.po
Languages: pt_br

source: The result of applying a median filter is often similar to that of applying a mean filter, but has the major advantage of removing isolated extreme values completely, _without allowing them to have an impact upon surrounding pixels_. This is in contrast to a mean filter, which cannot ignore extreme pixels but rather will smooth them out into occupying larger regions ({numref}`fig-processing_filters_speckled`).
pt_br: O resultado da aplicação de um filtro de mediana é muitas vezes semelhante ao da aplicação de um filtro de média, mas tem a principal vantagem de remover completamente os valores extremos isolados, _sem permitir que eles tenham impacto nos pixels circundantes_. Isto contrasta com um filtro médio, que não pode ignorar pixels extremos, mas sim suavizá-los para ocupar regiões maiores ({numref}`fig-processing_filters_speckled`).

source: However, a disadvantage of a median filter is that it can seem to introduce patterns or textures that were not present in the original image, at least whenever the size of the filter increases (see {numref}`fig-processing_filters`D below). Another disadvantage is that large median filters tend to be slow.
pt_br: No entanto, uma desvantagem de um filtro mediano é que ele pode parecer introduzir padrões ou texturas que não estavam presentes na imagem original, pelo menos sempre que o tamanho do filtro aumenta (consulte {numref}`fig-processing_filters`D abaixo). Outra desvantagem é que filtros medianos grandes tendem a ser lentos.

source: Applying 3×3 mean and median filters to an image containing isolated extreme values (known as _salt and pepper noise_). A mean filter reduces the intensity of the extreme values but spreads out their influence. A small median filter is capable of removing the outliers completely, with a minimal effect upon the rest of the image.
pt_br: Aplicando filtros de média e mediana 3×3 a uma imagem contendo valores extremos isolados (conhecido como _ruído de sal e pimenta_). Um filtro médio reduz a intensidade dos valores extremos, mas espalha a sua influência. Um pequeno filtro mediano é capaz de remover completamente os valores discrepantes, com um efeito mínimo no restante da imagem.

source: Other rank filters include the **minimum** and **maximum filters**, which replace each pixel value with the minimum or maximum value in the surrounding neighborhood respectively ({numref}`fig-processing_filters_rank`). They will become more important when we discuss [morphological operations](chap_morph).
pt_br: Outros filtros de classificação incluem os filtros **mínimo** e **máximo**, que substituem cada valor de pixel pelo valor mínimo ou máximo na vizinhança circundante, respectivamente ({numref}`fig -processing_filters_rank`). Elas se tornarão mais importantes quando discutirmos [operações morfológicas](chap_morph).

source: The result of applying 3×3 rank filters. The original noise-free image is shown below in {numref}`fig-processing_filters`A.
pt_br: O resultado da aplicação de filtros de classificação 3×3. A imagem original sem ruído é mostrada abaixo em {numref}`fig-processing_filters`A.

source: What would happen if you subtract a minimum filtered image (e.g. {numref}`fig-processing_filters_rank`C) from a maximum filtered image (Figure {numref}`fig-processing_filters_rank`B)?
pt_br: O que aconteceria se você subtraísse uma imagem filtrada mínima (por exemplo, {numref}`fig-processing_filters_rank`C) de uma imagem filtrada máxima (Figura {numref}`fig-processing_filters_rank`B)?

source: Subtracting a minimum from a maximum filtered image would be another way to accent the edges:
pt_br: Subtrair um mínimo de uma imagem filtrada máxima seria outra maneira de acentuar as bordas:

source: Gaussian filters
pt_br: Filtros gaussianos

source: Filters from Gaussian functions
pt_br: Filtros de funções gaussianas

source: We conclude this chapter with one fantastically important linear filter, and some variants based upon it.
pt_br: Concluímos este capítulo com um filtro linear fantasticamente importante e algumas variantes baseadas nele.

source: A **Gaussian filter** is a linear filter that also smooths an image and reduces noise. However, unlike a mean filter -- for which even the furthest away pixels in the neighborhood influence the result by the same amount as the closest pixels -- the smoothing of a Gaussian filter is weighted so that the influence of a pixel decreases with its distance from the filter center. This tends to give a better result in many cases ({numref}`fig-filt_smoothing`).
pt_br: Um **filtro gaussiano** é um filtro linear que também suaviza uma imagem e reduz o ruído. No entanto, ao contrário de um filtro médio - para o qual mesmo os pixels mais distantes na vizinhança influenciam o resultado na mesma proporção que os pixels mais próximos - a suavização de um filtro gaussiano é ponderada de modo que a influência de um pixel diminui com a sua distância. do centro do filtro. Isso tende a dar um resultado melhor em muitos casos ({numref}`fig-filt_smoothing`).

source: Comparing a mean and Gaussian filter. The mean filter can introduce patterns and maxima where previously there were none. For example, the brightest region in (B) is one such maximum – _but the values of all pixels in the same region in (A) were zero!_ By contrast, the Gaussian filter produces a smoother, more visually pleasing result, somewhat less prone to this effect \(C).
pt_br: Comparando um filtro médio e gaussiano. O filtro de média pode introduzir padrões e máximos onde antes não existiam. Por exemplo, a região mais brilhante em (B) é um desses máximos – _mas os valores de todos os pixels na mesma região em (A) eram zero!_ Por outro lado, o filtro gaussiano produz um resultado mais suave e visualmente mais agradável, um pouco menos propenso a esse efeito \(C).

source: The coefficients of a Gaussian filter are determined from a Gaussian function ({numref}`fig-gaussian_2d`)
pt_br: Os coeficientes de um filtro gaussiano são determinados a partir de uma função gaussiana ({numref}`fig-gaussian_2d`)

source: The scaling factor $A$ is used to make the entire volume under the surface equal to 1. In terms of filtering, this means that the coefficients add to 1 and the image will not be unexpectedly scaled. The size of the function is controlled by $\sigma$, rather than a filter radius. $\sigma$ is equivalent to the standard deviation of a normal (i.e. Gaussian) distribution.
pt_br: O fator de escala $A$ é usado para tornar todo o volume sob a superfície igual a 1. Em termos de filtragem, isso significa que os coeficientes somam 1 e a imagem não será dimensionada inesperadamente. O tamanho da função é controlado por $\sigma$, em vez de um raio de filtro. $\sigma$ é equivalente ao desvio padrão de uma distribuição normal (ou seja, gaussiana).

source: Surface plot of a 2D Gaussian function.
pt_br: Gráfico de superfície de uma função gaussiana 2D.

source: A comparison of several filters is shown in {numref}`fig-processing_filters`.
pt_br: Uma comparação de vários filtros é mostrada em {numref}`fig-processing_filters`.

source: The effects of various filters upon a noisy image of a fixed cell.
pt_br: Os efeitos de vários filtros sobre uma imagem ruidosa de uma célula fixa.

source: Filters of varying sizes
pt_br: Filtros de tamanhos variados

source: Gaussian filters have useful properties that make them generally preferable to mean filters, some of which will be mentioned in {ref}`chap_formation_spatial` (others require a trip into Fourier space, beyond the scope of this book). Therefore if you're not sure which filter to use for smoothing, Gaussian is likely to be a safer choice than mean -- particularly if the filter is large. Nevertheless, your decisions are not at an end since the precise size of the filter still needs to be chosen.
pt_br: Os filtros gaussianos têm propriedades úteis que os tornam geralmente preferíveis aos filtros médios, alguns dos quais serão mencionados em {ref}`chap_formation_spatial` (outros requerem uma viagem ao espaço de Fourier, além do escopo de este livro). Portanto, se você não tiver certeza de qual filtro usar para suavização, o Gaussiano provavelmente será uma escolha mais segura do que a média - principalmente se o filtro for grande. No entanto, suas decisões não chegaram ao fim, pois o tamanho preciso do filtro ainda precisa ser escolhido.

source: A small filter will mostly suppress noise, because noise masquerades as tiny random fluctuations at individual pixels. As the filter size increases, Gaussian filtering starts to suppress larger structures occupying multiple pixels -- reducing their intensities and increasing their sizes, until eventually they would be smoothed into surrounding regions ({numref}`fig-gaussian_effects`). By varying the filter size, we can then decide the **scale** at which the processing and analysis should happen.
pt_br: Um filtro pequeno suprimirá principalmente o ruído, porque o ruído se disfarça como pequenas flutuações aleatórias em pixels individuais. À medida que o tamanho do filtro aumenta, a filtragem gaussiana começa a suprimir estruturas maiores que ocupam vários pixels - reduzindo suas intensidades e aumentando seus tamanhos, até que eventualmente sejam suavizadas nas regiões vizinhas ({numref}` fig-gaussian_efeitos`). Variando o tamanho do filtro, podemos então decidir a **escala** em que o processamento e a análise devem acontecer.

source: The effect of Gaussian filtering on the size and intensity of structures.
pt_br: O efeito da filtragem gaussiana no tamanho e intensidade das estruturas.

source: {numref}`fig-edge_sigma` shows an example of when this is useful. Here, gradient magnitude images are computed, similar to what was shown in {numref}`fig-processing_filters_gradient`, but because the original image is now noisy the initial result is not very useful -- with even strong edges being buried amid noise (B). Applying a small Gaussian filter prior to computing the gradient magnitude gives much better results \(C). If we only want the very strongest edges, then apply a larger filter would be better (D).
pt_br: {numref}`fig-edge_sigma` mostra um exemplo de quando isso é útil. Aqui, imagens de magnitude de gradiente são calculadas, semelhante ao que foi mostrado em {numref}`fig-processing_filters_gradient`, mas como a imagem original agora tem ruído, o resultado inicial não é muito útil -- mesmo com bordas fortes sendo enterradas em meio ao ruído (B). Aplicar um pequeno filtro gaussiano antes de calcular a magnitude do gradiente fornece resultados muito melhores \(C). Se quisermos apenas as arestas mais fortes, seria melhor aplicar um filtro maior (D).

source: Applying Gaussian filters before computing the gradient magnitude changes the scale at which edges are enhanced.
pt_br: A aplicação de filtros gaussianos antes de calcular a magnitude do gradiente altera a escala na qual as bordas são aprimoradas.

source: Difference of Gaussians filtering
pt_br: Diferença de filtragem gaussiana

source: So Gaussian filters can be chosen to suppress small structures. But what if we also wish to suppress large structures -- so that we can concentrate on detecting or measuring structures with sizes inside a particular range?
pt_br: Portanto, filtros gaussianos podem ser escolhidos para suprimir pequenas estruturas. Mas e se também quisermos suprimir grandes estruturas – para que possamos nos concentrar na detecção ou medição de estruturas com tamanhos dentro de uma determinada faixa?

source: We already have the pieces necessary to construct one solution.
pt_br: Já temos as peças necessárias para construir uma solução.

source: Suppose we apply one Gaussian filter to reduce small structures. Then we apply a *second* Gaussian filter, bigger than the first, to a duplicate of the original image. This will remove even more structures, while still preserving the largest features in the image.
pt_br: Suponha que apliquemos um filtro gaussiano para reduzir pequenas estruturas. Em seguida, aplicamos um *segundo* filtro gaussiano, maior que o primeiro, a uma duplicata da imagem original. Isso removerá ainda mais estruturas, preservando ao mesmo tempo os maiores recursos da imagem.

source: The trick is that, if we subtract this second filtered image from the first, we are left with an image that contains the information that 'falls between' the two smoothing scales we used.
pt_br: O truque é que, se subtrairmos esta segunda imagem filtrada da primeira, ficamos com uma imagem que contém a informação que “fica entre” as duas escalas de suavização que usamos.

source: This process is called **difference of Gaussians (DoG) filtering**, and it is a technique that I use *all the time*. It is especially useful for detecting small structures, or as an alternative to the gradient magnitude for enhancing edges ({numref}`fig-dog_red_hela`).
pt_br: Esse processo é chamado de **filtragem por diferença de Gaussianas (DoG)** e é uma técnica que uso *o tempo todo*. É especialmente útil para detectar pequenas estruturas ou como alternativa à magnitude do gradiente para realçar bordas ({numref}`fig-dog_red_hela`).

source: Difference of Gaussian filtering of the same image at various scales.
pt_br: Diferença de filtragem gaussiana da mesma imagem em várias escalas.

source: DoG filters
pt_br: Filtros DoG

source: In fact, to get the result of DoG filtering it's not necessary to filter the image twice and subtract the results. We could equally well subtract the coefficients of the larger filter from the smaller first (after making sure both filters are the same size by adding zeros to the edges as required), then apply the resulting filter to the image only once ({numref}`fig-dog_plots`).
pt_br: Na verdade, para obter o resultado da filtragem DoG não é necessário filtrar a imagem duas vezes e subtrair os resultados. Poderíamos igualmente subtrair os coeficientes do filtro maior do menor primeiro (depois de garantir que ambos os filtros tenham o mesmo tamanho adicionando zeros às bordas conforme necessário) e, em seguida, aplicar o filtro resultante à imagem apenas uma vez ({numref}`fig-dog_plots`).

source: Surface plots of two Gaussian filters with small and large $\sigma$, and the result of subtracting the latter from the former. The sum of the coefficients for (A) and (B) is one in each case, while the coefficients of (C) add to zero.
pt_br: Gráficos de superfície de dois filtros gaussianos com $\sigma$ pequeno e grande, e o resultado da subtração do último do primeiro. A soma dos coeficientes de (A) e (B) é um em cada caso, enquanto a soma dos coeficientes de (C) é zero.

source: Laplacian of Gaussian filtering
pt_br: Laplaciano de filtragem gaussiana

source: One minor complication with DoG filtering is the need to select two different values of $\sigma$. A similar operation, which requires only a single $\sigma$ and a single filter, is **Laplacian of Gaussian (LoG) filtering**.
pt_br: Uma pequena complicação com a filtragem DoG é a necessidade de selecionar dois valores diferentes de $\sigma$. Uma operação semelhante, que requer apenas um único $\sigma$ e um único filtro, é a **filtragem Laplaciana de Gaussiana (LoG)**.

source: The appearance of a LoG filter is like an upside-down DoG filter ({numref}`fig-log_plots`), but if the resulting image is [inverted](sec_points_inversion) then the results are comparable [^fn_4].
pt_br: A aparência de um filtro LoG é como um filtro DoG invertido ({numref}`fig-log_plots`), mas se a imagem resultante for [invertida](sec_points_inversion) então os resultados são comparáveis [^fn_4].

source: Surface plot of a LoG filter. This closely resembles {numref}`fig-dog_plots`, but inverted so that the negative values are found in the filter center.
pt_br: Gráfico de superfície de um filtro LoG. Isso se parece muito com {numref}`fig-dog_plots`, mas invertido para que os valores negativos sejam encontrados no centro do filtro.

source: Application of DoG and LoG filtering to an image. Both methods enhance the appearance of spot-like structures, and (to a lesser extent) edges, and result in an image containing both positive and negative values with an overall mean of zero. In the case of LoG filtering, inversion is involved: darker points become bright after filtering.
pt_br: Aplicação de filtragem DoG e LoG a uma imagem. Ambos os métodos melhoram a aparência de estruturas semelhantes a pontos e (em menor grau) de bordas, e resultam em uma imagem contendo valores positivos e negativos com uma média geral de zero. No caso da filtragem LoG, está envolvida a inversão: os pontos mais escuros tornam-se brilhantes após a filtragem.

source: Unsharp masking
pt_br: Máscara de nitidez

source: Finally, a related technique widely-used to enhance the visibility of details in images -- although certainly _not_ advisable for quantitative analysis -- is **unsharp masking**.
pt_br: Finalmente, uma técnica relacionada amplamente utilizada para melhorar a visibilidade de detalhes em imagens - embora certamente _não_ aconselhável para análise quantitativa - é o **mascaramento de nitidez**.

source: This uses a Gaussian filter first to blur the edges of an image, and then subtracts it from the original. But rather than stop there, the subtracted image is multiplied by some weighting factor and _added back_ to the original. This gives an image that looks much the same as the original, but with edges sharpened by an amount dependent upon the chosen weight.
pt_br: Isso usa um filtro gaussiano primeiro para desfocar as bordas de uma imagem e depois subtrai-la do original. Mas, em vez de parar por aí, a imagem subtraída é multiplicada por algum fator de ponderação e _adicionada_ ao original. Isso fornece uma imagem que se parece muito com o original, mas com bordas nítidas em um valor que depende da espessura escolhida.

source: The application of unsharp masking to a blurred image. First a Gaussian-smoothed version of the image ($\sigma = 1$) is subtracted from the original, scaled ($weight = 0.7$) and added back to the original.
pt_br: A aplicação de máscara de nitidez a uma imagem desfocada. Primeiro, uma versão da imagem suavizada por Gauss ($\sigma = 1$) é subtraída do original, dimensionada ($peso = 0,7$) e adicionada de volta ao original.

source: Unsharp masking can improve the visual appearance of an image, but it's important to remember that it modifies the image content in a way that might well be considered suspicious in scientific circles. Therefore, if you apply unsharp masking to any image you intend to share with the world you should have a good justification and certainly admit what you have done. The technique is included here not as a recommendation that you use it, but rather to show how Gaussian filters can be combined with point operations in creative ways.
pt_br: O mascaramento de nitidez pode melhorar a aparência visual de uma imagem, mas é importante lembrar que ele modifica o conteúdo da imagem de uma forma que pode muito bem ser considerada suspeita nos círculos científicos. Portanto, se você aplicar uma máscara de nitidez a qualquer imagem que pretenda compartilhar com o mundo, deverá ter uma boa justificativa e certamente admitir o que fez. A técnica está incluída aqui não como uma recomendação de uso, mas sim para mostrar como os filtros gaussianos podem ser combinados com operações pontuais de maneira criativa.

source: If you want a more theoretically justified method to improve image sharpness in microscopy, it may be worth looking into *'(maximum likelihood) deconvolution'* algorithms.
pt_br: Se você deseja um método mais justificado teoricamente para melhorar a nitidez da imagem em microscopia, pode valer a pena examinar algoritmos de *'(máxima probabilidade) deconvolução'*.

source: I feel obliged to admit that there *is* a subtle difference between convolution and correlation: the kernel is rotated 180° for convolution. This is something we almost never need to care about for two reasons:
pt_br: Sinto-me obrigado a admitir que *existe* uma diferença sutil entre convolução e correlação: o núcleo é girado 180° para convolução. Isso é algo com o qual quase nunca precisamos nos preocupar por dois motivos:

source: Convolution and correlation end up the same if the filter is symmetric -- and most filters we care about are symmetric
pt_br: A convolução e a correlação terminam iguais se o filtro for simétrico - e a maioria dos filtros que nos interessam são simétricos

source: The distinction is often ignored in practice anyway. For example, ImageJ has a {menuselection}`Process --> Filters --> Convolve...` command that (last time I checked) actually implements correlation.
pt_br: De qualquer forma, a distinção é frequentemente ignorada na prática. Por exemplo, ImageJ tem um comando {menuselection}`Process --> Filters --> Convolve...` que (da última vez que verifiquei) realmente implementa correlação.

source: The equation then looks like Pythagoras' theorem: $G_{mag} = \sqrt{G_x^2 + G_y^2}$
pt_br: A equação então se parece com o teorema de Pitágoras: $G_{mag} = \sqrt{G_x^2 + G_y^2}$

source: A LoG filter is also often referred to as a _mexican-hat filter_, although clearly the filter (or the hat-wearer) should be inverted for the name to make more sense
pt_br: Um filtro LoG também é frequentemente chamado de _filtro de chapéu mexicano_, embora claramente o filtro (ou o usuário do chapéu) deva ser invertido para que o nome faça mais sentido
