Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/4-filters/filters.po
Languages: pt_br

source: Default Caption
pt_br: Legenda padrão

source: Filters
pt_br: Filtros

source: Chapter outline
pt_br: Esboço do capítulo

source: **Filtering** can make segmentation much easier by **enhancing features** and **reducing noise**
pt_br: **A filtragem** pode tornar a segmentação muito mais fácil, **aprimorando recursos** e **reduzindo o ruído**

source: **Linear filters** replace each pixel by a weighted sum of surrounding pixels
pt_br: **Filtros lineares** substituem cada pixel por uma soma ponderada dos pixels adjacentes

source: **Nonlinear filters** replace each pixel with the result of another computation using surrounding pixels
pt_br: **Filtros não lineares** substituem cada pixel pelo resultado de outro cálculo usando pixels adjacentes

source: **Gaussian filters** are linear filters with particularly useful properties, making them a good choice for many applications
pt_br: **Filtros Gaussianos** são filtros lineares com propriedades particularmente úteis, o que os torna uma boa escolha para muitas aplicações

source: Introduction
pt_br: Introdução

source: Filters are phenomenally useful. Almost all interesting image analysis involves filtering in some way at some stage. In fact, the analysis of a difficult image can sometimes become (almost) trivial once a suitable filter has been applied to it. It's therefore no surprise that much of the image processing literature is devoted to the topic of designing and testing filters.
pt_br: Os filtros são extremamente úteis. Quase todas as análises interessantes de imagens envolvem filtragem de alguma forma em algum estágio. Na verdade, a análise de uma imagem difícil pode, por vezes, tornar-se (quase) trivial, uma vez que um filtro adequado tenha sido aplicado a ela. Portanto, não é nenhuma surpresa que grande parte da literatura sobre processamento de imagens seja dedicada ao tópico de projeto e teste de filtros.

source: The basic idea of filtering here is that each pixel in an image is assigned a new value depending upon the values of other pixels within some defined region (the pixel's **neighborhood**). Different filters work by applying different calculations to the neighborhood to get their output. Although the plethora of available filters can be intimidating at first, knowing only a few of the most useful filters is already a huge advantage.
pt_br: A ideia básica da filtragem aqui é que cada pixel em uma imagem receba um novo valor dependendo dos valores de outros pixels dentro de alguma região definida (a **vizinhança** do pixel). Diferentes filtros funcionam aplicando diferentes cálculos à vizinhança para obter seus resultados. Embora a infinidade de filtros disponíveis possa ser intimidante no início, conhecer apenas alguns dos filtros mais úteis já é uma enorme vantagem.

source: This chapter begins by introducing several extremely common **linear** and **nonlinear filters** for image processing. It ends by considering in detail some techniques based on one particularly important linear filter.
pt_br: Este capítulo começa apresentando vários **lineares** e **filtros não lineares** extremamente comuns para processamento de imagens. Termina considerando detalhadamente algumas técnicas baseadas em um filtro linear particularmente importante.

source: Linear filters
pt_br: Filtros lineares

source: Linear filters replace each pixel with a **linear combination** ('sum of products') of other pixels. Therefore the only mathematical background they require is the ability to add and multiply.
pt_br: Os filtros lineares substituem cada pixel por uma **combinação linear** ('soma de produtos') de outros pixels. Portanto, a única base matemática necessária é a capacidade de somar e multiplicar.

source: A linear filter is defined using a **filter kernel**, which is like a tiny image in which the pixels are called **filter coefficients**. To filter an image, we center the kernel over each pixel of the input image. We then multiply each filter coefficient by the input image pixel that it overlaps, summing the result to give our filtered pixel value. Some examples should make this clearer.
pt_br: Um filtro linear é definido usando um **kernel de filtro**, que é como uma pequena imagem na qual os pixels são chamados de **coeficientes de filtro**. Para filtrar uma imagem, centralizamos o kernel sobre cada pixel da imagem de entrada. Em seguida, multiplicamos cada coeficiente de filtro pelo pixel da imagem de entrada que ele se sobrepõe, somando o resultado para fornecer o valor do pixel filtrado. Alguns exemplos devem tornar isso mais claro.

source: Mean filters
pt_br: Filtros médios

source: Arguably the simplest linear filter is the **mean filter**. Each pixel value is simply replaced by the average (mean) of itself and its neighbors within a defined area.
pt_br: Indiscutivelmente, o filtro linear mais simples é o **filtro médio**. Cada valor de pixel é simplesmente substituído pela média (média) dele mesmo e de seus vizinhos dentro de uma área definida.

source: A simple **3×3 mean filter** averages each pixel with its 8 immediate neighbors (above, below, left, right and diagonals). The filter kernel contains 9 values, arranged as a 3×3 square. Each coefficient is 1/9, meaning that together all coefficients sum to 1.
pt_br: Um simples **filtro de média 3×3** calcula a média de cada pixel com seus 8 vizinhos imediatos (acima, abaixo, esquerda, direita e diagonais). O kernel do filtro contém 9 valores, organizados como um quadrado 3×3. Cada coeficiente é 1/9, o que significa que juntos todos os coeficientes somam 1.

source: The process of filtering with a 3×3 mean filter kernel is demonstrated below:
pt_br: O processo de filtragem com um kernel de filtro médio 3×3 é demonstrado abaixo:

source: One of the main uses of a 3×3 mean filter is to reduce some common types of image noise, including Gaussian noise and Poisson noise.
pt_br: Um dos principais usos de um filtro médio 3×3 é reduzir alguns tipos comuns de ruído de imagem, incluindo ruído gaussiano e ruído de Poisson.

source: We'll discuss the subject of noise in much more detail in a later chapter, {ref}`chap_formation_noise`, and demonstrate *why* a mean filter works to reduce it. At this point, all we need to know about noise is that it acts like a random (positive or negative) error added to each pixel value, which obscures detail, messes with the histogram, and makes the image look grainy.
pt_br: Discutiremos o assunto do ruído com muito mais detalhes em um capítulo posterior, {ref}`chap_formation_noise`, e demonstraremos *por que* um filtro médio funciona para reduzi-lo. Neste ponto, tudo o que precisamos saber sobre o ruído é que ele atua como um erro aleatório (positivo ou negativo) adicionado a cada valor de pixel, o que obscurece os detalhes, atrapalha o histograma e faz a imagem parecer granulada.

source: {numref}`fig-filt_reduce_noise` provides an illustration of how effectively the 3×3 filter can reduce Gaussian noise in an image.
pt_br: {numref}`fig-filt_reduce_noise` fornece uma ilustração de quão eficazmente o filtro 3×3 pode reduzir o ruído gaussiano em uma imagem.

source: Filters can be used to reduce noise. Applying a 3×3 mean filter makes the image smoother, as is particularly evident in the fluorescence plot made through the image center. Computing the difference between images shows what the filter removed, which was mostly random noise (with a little bit of image detail as well).
pt_br: Filtros podem ser usados para reduzir o ruído. A aplicação de um filtro médio 3×3 torna a imagem mais suave, como é particularmente evidente no gráfico de fluorescência feito através do centro da imagem. O cálculo da diferença entre as imagens mostra o que o filtro removeu, que era principalmente ruído aleatório (com um pouco de detalhe da imagem também).

source: Our simple 3×3 mean filter could be easily modified in at least two ways:
pt_br: Nosso simples filtro médio 3×3 pode ser facilmente modificado de pelo menos duas maneiras:

source: Its size could be increased. For example, instead of using just the pixels immediately adjacent to the one we are interested in, a 5×5 mean filter replaces each pixel by the average of a square containing 25 pixels, still centered on the main pixel of interest.
pt_br: Seu tamanho poderia ser aumentado. Por exemplo, em vez de usar apenas os pixels imediatamente adjacentes àquele que nos interessa, um filtro de média 5×5 substitui cada pixel pela média de um quadrado contendo 25 pixels, ainda centrado no pixel principal de interesse.

source: The average of the pixels in some other shape of region could be computed, not just an _n×n_ square.
pt_br: A média dos pixels em algum outro formato de região poderia ser calculada, não apenas um quadrado _n×n_.

source: Both of these adjustments can be achieved by changing the size of the filter kernel and its coefficients.
pt_br: Ambos os ajustes podem ser conseguidos alterando o tamanho do núcleo do filtro e seus coeficientes.

source: One common change is to make a 'circular' mean filter. We can do this by defining the kernel in such a way that coefficients we want to ignore are set to 0, and the non-zero pixels approximate a circle. The size of the filter is then defined in terms of a radius value ({numref}`fig-filter_shapes`).
pt_br: Uma mudança comum é fazer um filtro de média “circular”. Podemos fazer isso definindo o kernel de tal forma que os coeficientes que queremos ignorar sejam definidos como 0 e os pixels diferentes de zero se aproximem de um círculo. O tamanho do filtro é então definido em termos de um valor de raio ({numref}`fig-filter_shapes`).

source: The kernels used with several mean filters. Note that there's no clearly 'right' way to approximate a circle within a pixel grid, and as a result different software can create circular filters that are slightly different. Here, \(B) and (C) match the 'circular' filters used by ImageJ's {menuselection}`Process --> Filters --> Mean...` command.
pt_br: Os kernels usados com vários filtros médios. Observe que não existe uma maneira claramente “certa” de aproximar um círculo dentro de uma grade de pixels e, como resultado, diferentes softwares podem criar filtros circulares ligeiramente diferentes. Aqui, \(B) e (C) correspondem aos filtros 'circulares' usados pelo comando {menuselection}`Process --> Filters --> Mean...` do ImageJ.

source: Different names for (almost) the same thing
pt_br: Nomes diferentes para (quase) a mesma coisa

source: The world of filtering is full of concepts with multiple names, all meaning pretty much the same thing. For example:
pt_br: O mundo da filtragem está cheio de conceitos com vários nomes, todos significando praticamente a mesma coisa. Por exemplo:

source: **linear filtering** may be called **convolution** (very common) or **correlation**[^fn_conv] (less common)
pt_br: **filtragem linear** pode ser chamada de **convolução** (muito comum) ou **correlação**[^fn_conv] (menos comum)

source: a **filter kernel** might be called a **filter mask**
pt_br: um **kernel de filtro** pode ser chamado de **máscara de filtro**

source: **mean filters** are sometimes referred to as **arithmetic mean filters**, **averaging filters** or **boxcar filters**
pt_br: **filtros de média** são às vezes chamados de **filtros de média aritmética**, **filtros de média** ou **filtros de vagão**

source: Take your pick. It's worth knowing the equivalence to avoid being confused by the literature. In particular, 'convolve' is used often enough as a synonym for 'filter' (with a linear filter) that it's important to remember.
pt_br: Faça sua escolha. Vale a pena conhecer a equivalência para não se confundir com a literatura. Em particular, 'convolve' é usado com frequência como sinônimo de 'filtro' (com um filtro linear) que é importante lembrar.

source: Increasing the size of a mean filter increases its impact. This is not only in terms of reducing noise, but also in terms of reducing detail, i.e. making the image more blurry ({numref}`fig-mean_filter_sizes`). If noise reduction is the primary goal, it's therefore best to avoid unnecessary blurring by using the smallest filter that gives acceptable results.
pt_br: Aumentar o tamanho de um filtro médio aumenta seu impacto. Isso não ocorre apenas em termos de redução de ruído, mas também em termos de redução de detalhes, ou seja, tornando a imagem mais desfocada ({numref}`fig-mean_filter_sizes`). Se a redução de ruído for o objetivo principal, é melhor evitar desfoques desnecessários usando o menor filtro que forneça resultados aceitáveis.

source: Smoothing an image using circular mean filters with different radii.
pt_br: Suavização de uma imagem usando filtros de média circular com raios diferentes.

source: Question
pt_br: Pergunta

source: In ImageJ, creating a mean filter with *Radius = 6* results in a circular filter that replaces each pixel with the mean of 121 pixels. Using a square 11×11 filter would also replace each pixel with the mean of 121 pixels.
pt_br: No ImageJ, criar um filtro médio com *Radius = 6* resulta em um filtro circular que substitui cada pixel pela média de 121 pixels. Usar um filtro quadrado 11×11 também substituiria cada pixel pela média de 121 pixels.

source: Can you think of any advantages in using the circular filter rather than the square filter?
pt_br: Você consegue pensar em alguma vantagem em usar o filtro circular em vez do filtro quadrado?

source: Answer
pt_br: Responder

source: Circles are more 'compact'. Every point on the perimeter of a circle is the same distance from the center. Therefore using a circular filter involves calculating the mean of all pixels a distance of $\leq$ *Radius* pixels away from the center.
pt_br: Os círculos são mais 'compactos'. Cada ponto no perímetro de um círculo está à mesma distância do centro. Portanto, usar um filtro circular envolve calcular a média de todos os pixels a uma distância de $\leq$ *Radius* pixels do centro.

source: For a square filter, pixels that are further away in diagonal directions than horizontal or vertical directions are allowed to influence the results. If a pixel is further away, it's more likely to have a very different value because it is part of some other structure. Averaging across structures can blur them into one another, so is best avoided.
pt_br: Para um filtro quadrado, os pixels que estão mais distantes nas direções diagonais do que nas direções horizontal ou vertical podem influenciar os resultados. Se um pixel estiver mais distante, é mais provável que tenha um valor muito diferente porque faz parte de alguma outra estrutura. A média entre as estruturas pode confundi-las umas com as outras, por isso é melhor evitá-las.

source: Gradient filters
pt_br: Filtros gradientes

source: Linear filters can do much more than simply compute local averages. We only need to define a new filter kernel with different coefficients.
pt_br: Os filtros lineares podem fazer muito mais do que simplesmente calcular médias locais. Precisamos apenas definir um novo kernel de filtro com coeficientes diferentes.

source: Often, we want to detect structures in an image that are distinguishable from the background because of their edges. Being able to detect the edges could therefore be useful. Because an edge is usually characterized by a relatively sharp transition in pixel values -- i.e. by a steep increase or decrease in the profile across the image -- **gradient filters** can be used to help.
pt_br: Freqüentemente, queremos detectar estruturas em uma imagem que sejam distinguíveis do fundo por causa de suas bordas. Ser capaz de detectar as bordas pode, portanto, ser útil. Como uma borda geralmente é caracterizada por uma transição relativamente nítida nos valores de pixel, ou seja, por um aumento ou diminuição acentuada no perfil da imagem, **filtros de gradiente** podem ser usados para ajudar.

source: A very simple gradient filter has the coefficients *-1, 0, 1*. Applied to an image, this replaces every pixel with the difference between the pixel to the right and the pixel to the left. The output is positive whenever the pixel values are increasing horizontally, negative when the pixel values are decreasing, and zero if the values are constant -- _no matter what the original constant value was_, so that flat areas are zero in the gradient image irrespective of their original brightness. We can also rotate the filter by 90 and get a vertical gradient image ({numref}`fig-processing_filters_gradient`).
pt_br: Um filtro gradiente muito simples possui os coeficientes *-1, 0, 1*. Aplicado a uma imagem, substitui cada pixel pela diferença entre o pixel à direita e o pixel à esquerda. A saída é positiva sempre que os valores dos pixels estão aumentando horizontalmente, negativa quando os valores dos pixels estão diminuindo e zero se os valores forem constantes - _não importa qual seja o valor constante original_, de modo que as áreas planas sejam zero na imagem gradiente, independentemente de seu brilho original. Também podemos girar o filtro em 90 e obter uma imagem de gradiente vertical ({numref}`fig-processing_filters_gradient`).

source: Using gradient filters and the gradient magnitude for edge enhancement.
pt_br: Usando filtros de gradiente e a magnitude do gradiente para aprimoramento de bordas.

source: Having two gradient images with positive and negative values can be somewhat hard to work with. We can combine filtering with [point operations](chap_point_operations) to generate a single image representing the __gradient magnitude__ [^fn_3]. The gradient magnitude has high values around edges (regardless of their orientation), and low values everywhere else.
pt_br: Ter duas imagens gradientes com valores positivos e negativos pode ser um tanto difícil de trabalhar. Podemos combinar a filtragem com [operações pontuais](chap_point_operações) para gerar uma única imagem representando a __magnitude do gradiente__ [^fn_3]. A magnitude do gradiente tem valores altos em torno das bordas (independentemente de sua orientação) e valores baixos em todos os outros lugares.

source: The process of calculating the gradient magnitude is:
pt_br: O processo de cálculo da magnitude do gradiente é:

source: Apply linear filters to produce the horizontal and vertical gradient images
pt_br: Aplique filtros lineares para produzir imagens gradientes horizontais e verticais

source: *Square* all the pixel values in both gradient images
pt_br: *Quadrar* todos os valores de pixel em ambas as imagens gradientes

source: Add the squared images together
pt_br: Adicione as imagens quadradas

source: Take the square root of the result
pt_br: Tire a raiz quadrada do resultado

source: Suppose the mean pixel value of an image is 100. What will the mean value be after applying a horizontal gradient filter?
pt_br: Suponha que o valor médio do pixel de uma imagem seja 100. Qual será o valor médio após a aplicação de um filtro de gradiente horizontal?

source: Solution
pt_br: Solução

source: After applying a gradient filter, the image mean will be 0: every pixel is added once and subtracted once when calculating the result.
pt_br: Depois de aplicar um filtro gradiente, a média da imagem será 0: cada pixel é adicionado uma vez e subtraído uma vez no cálculo do resultado.

source: (Note that the mean value of a *gradient magnitude* image will be ≥ 0, because all pixels have either positive values or are equal to zero.)
pt_br: (Observe que o valor médio de uma imagem de *magnitude do gradiente* será ≥ 0, porque todos os pixels têm valores positivos ou são iguais a zero.)

source: Filtering at image boundaries
pt_br: Filtrando nos limites da imagem

source: If a filter consists of more than one coefficient, the neighborhood will extend beyond the image boundaries when filtering some pixels nearby. We need to handle this somehow. There are several common approaches.
pt_br: Se um filtro consistir em mais de um coeficiente, a vizinhança se estenderá além dos limites da imagem ao filtrar alguns pixels próximos. Precisamos lidar com isso de alguma forma. Existem várias abordagens comuns.

source: The boundary pixels could simply be ignored and left with their original values, but for large neighborhoods this would result in much of the image being unfiltered. Alternative options include treating every pixel beyond the boundary as zero, replicating the closest valid pixel, treating the image as if it is part of a periodic tiling, or mirroring the internal values ({numref}`fig-filter_boundaries`).
pt_br: Os pixels limite poderiam simplesmente ser ignorados e deixados com seus valores originais, mas para vizinhanças grandes isso resultaria na não filtragem de grande parte da imagem. As opções alternativas incluem tratar cada pixel além do limite como zero, replicar o pixel válido mais próximo, tratar a imagem como se fosse parte de um mosaico periódico ou espelhar os valores internos ({numref} `fig-filter_boundaries`).

source: Methods for determining suitable values for pixels beyond image boundaries when filtering.
pt_br: Métodos para determinar valores adequados para pixels além dos limites da imagem durante a filtragem.

source: Different software can handle boundaries in different ways. Often, if you are using an image processing library to code your own filtering operation you will be able to specify the boundary operation.
pt_br: Softwares diferentes podem lidar com limites de maneiras diferentes. Muitas vezes, se você estiver usando uma biblioteca de processamento de imagens para codificar sua própria operação de filtragem, poderá especificar a operação de limite.

source: Nonlinear filters
pt_br: Filtros não lineares

source: Linear filters involve taking neighborhoods of pixels, scaling them by the filter coefficients, and adding the results to get new pixel values. **Nonlinear filters** also make use of neighborhoods of pixels, but can use any other type of calculation to obtain the output. Here we'll consider one especially important family of nonlinear filters.
pt_br: Os filtros lineares envolvem pegar vizinhanças de pixels, escalá-las pelos coeficientes do filtro e adicionar os resultados para obter novos valores de pixel. **Filtros não lineares** também utilizam vizinhanças de pixels, mas podem usar qualquer outro tipo de cálculo para obter a saída. Aqui consideraremos uma família especialmente importante de filtros não lineares.

source: Rank filters
pt_br: Filtros de classificação

source: **Rank filters** effectively sort the values of all the neighboring pixels in ascending order, and then choose the output based upon this ordered list.
pt_br: **Filtros de classificação** classificam efetivamente os valores de todos os pixels vizinhos em ordem crescente e, em seguida, escolhem a saída com base nessa lista ordenada.

source: Perhaps the most common example is the **median filter**, in which the pixel value at the center of the list is used for the filtered output.
pt_br: Talvez o exemplo mais comum seja o **filtro mediano**, no qual o valor do pixel no centro da lista é usado para a saída filtrada.

source: Results of different 3×3 rank filters when processing a single neighborhood in an image. The output of a 3×3 mean filter in this case would also be 15.
pt_br: Resultados de diferentes filtros de classificação 3×3 ao processar uma única vizinhança em uma imagem. A saída de um filtro médio 3×3 neste caso também seria 15.
