Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/4-filters/imagej.po
Languages: es, pt_br

source: ImageJ: Filters
es: ImagenJ: Filtros
pt_br: ImagemJ: Filtros

source: Introduction
es: Introducción
pt_br: Introdução

source: Most of the filters we've considered are available through the {menuselection}`Process --> Filters` submenu. This section adds a little more information about their implementation in ImageJ, and asks a few questions.
es: La mayoría de los filtros que hemos considerado están disponibles a través del submenú {menuselection}`Proceso --> Filtros`. Esta sección agrega un poco más de información sobre su implementación en ImageJ y plantea algunas preguntas.
pt_br: A maioria dos filtros que consideramos estão disponíveis no submenu {menuselection}`Processo --> Filtros`. Esta seção adiciona um pouco mais de informações sobre sua implementação no ImageJ e faz algumas perguntas.

source: Linear filters
es: Filtros lineales
pt_br: Filtros lineares

source: Mean filters
es: Filtros medios
pt_br: Filtros médios

source: The easiest way to apply a 3×3 mean filter in ImageJ is through the {menuselection}`Process --> Smooth` command. The fact that the shortcut is {kbd}`Shift+S` can almost make this *too* easy, as I find myself accidentally smoothing when I really wanted to save my image. Take care.
es: La forma más sencilla de aplicar un filtro de media de 3 × 3 en ImageJ es mediante el comando {menuselection}`Proceso --> Suavizar`. El hecho de que el atajo sea {kbd}`Shift+S` casi puede hacer que esto sea *demasiado* fácil, ya que me encuentro suavizando accidentalmente cuando realmente quería guardar mi imagen. Cuidarse.
pt_br: A maneira mais fácil de aplicar um filtro de média 3×3 no ImageJ é através do comando {menuselection}`Process --> Smooth`. O fato de o atalho ser {kbd}`Shift+S` pode quase tornar isso *muito* fácil, pois me pego suavizando acidentalmente quando realmente queria salvar minha imagem. Tomar cuidado.

source: To apply larger mean filters, the command is {menuselection}`Process --> Filters --> Mean...`. It uses approximately circular neighborhoods, and the neighborhood size is adjusted by choosing a {guilabel}`Radius` value. The {menuselection}`Process --> Filters --> Show Circular Masks` command displays the neighborhoods used for different values of {guilabel}`Radius`. If you happen to choose *Radius = 1*, you get a 3×3 filter -- and the same results as using {menuselection}`Smooth`.
es: Para aplicar filtros de media más grandes, el comando es {menuselection}`Proceso --> Filtros --> Media...`. Utiliza vecindades aproximadamente circulares y el tamaño de la vecindad se ajusta eligiendo un valor de {guilabel}`Radio`. El comando {menuselection}`Proceso --> Filtros --> Mostrar máscaras circulares` muestra las vecindades utilizadas para diferentes valores de {guilabel}` Radio`. Si elige *Radio = 1*, obtendrá un filtro de 3×3, y los mismos resultados que usando {menuselection}`Smooth`.
pt_br: Para aplicar filtros de média maiores, o comando é {menuselection}`Process --> Filters --> Mean...`. Ele usa vizinhanças aproximadamente circulares, e o tamanho da vizinhança é ajustado escolhendo um valor de {guilabel}`Radius`. O comando {menuselection}`Process --> Filters --> Show Circular Masks` exibe as vizinhanças usadas para diferentes valores de {guilabel}` Raio`. Se você escolher *Radius = 1*, você obterá um filtro 3×3 -- e os mesmos resultados de usar {menuselection}`Smooth`.

source: Gaussian filters
es: Filtros gaussianos
pt_br: Filtros gaussianos

source: {menuselection}`Process --> Filters --> Gaussian Blur...` is the command that implements a Gaussian filter.
es: {menuselection}`Proceso --> Filtros --> Desenfoque Gaussiano...` es el comando que implementa un filtro Gaussiano.
pt_br: {menuselection}`Process --> Filters --> Gaussian Blur...` é o comando que implementa um filtro Gaussiano.

source: In the event that you want a Gaussian filter that isn't isotropic (i.e. has a different size along different dimensions), {menuselection}`Process --> Filters --> Gaussian Blur 3D...` can be used.
es: En el caso de que desee un filtro gaussiano que no sea isotrópico (es decir, que tenga un tamaño diferente en diferentes dimensiones), {menuselection}`Process --> Filters --> Gaussian Blur 3D ...` se puede utilizar.
pt_br: Caso você queira um filtro gaussiano que não seja isotrópico (ou seja, que tenha tamanhos diferentes em dimensões diferentes), {menuselection}`Process --> Filters --> Gaussian Blur 3D ...` pode ser usado.

source: Although not *really* recommended, unsharp masking is available through {menuselection}`Process --> Filters --> Unsharp mask...`.
es: Aunque no *realmente* se recomienda, la máscara de enfoque está disponible a través de {menuselection}`Proceso --> Filtros --> Máscara de enfoque...`.
pt_br: Embora não seja *realmente* recomendado, o mascaramento de nitidez está disponível através de {menuselection}`Processo --> Filtros --> Máscara de nitidez...`.

source: Difference of Gaussians
es: Diferencia de gaussianos
pt_br: Diferença de Gaussianos

source: There's currently no direct command in ImageJ to implement difference of Gaussians filtering, rather the steps need to be pieced together with image duplication and subtraction. However {ref}`chap_macro_dog` describes how to generate a macro for DoG filtering.
es: Actualmente no existe un comando directo en ImageJ para implementar la diferencia de filtrado gaussiano, sino que los pasos deben unirse con la duplicación y resta de imágenes. Sin embargo, {ref}`chap_macro_dog` describe cómo generar una macro para el filtrado de perros.
pt_br: Atualmente não há comando direto no ImageJ para implementar a diferença de filtragem gaussiana; em vez disso, as etapas precisam ser reunidas com duplicação e subtração de imagens. No entanto, {ref}`chap_macro_dog` descreve como gerar uma macro para filtragem DoG.

source: Custom linear filters
es: Filtros lineales personalizados
pt_br: Filtros lineares personalizados

source: {menuselection}`Process --> Filters --> Convolve...` makes it possible to define any custom linear filter by entering the values of the desired coefficients, separated by spaces and arranged in rows and columns. If you {guilabel}`Normalize Kernel` is selected, then the coefficients are scaled so that they add to 1, by dividing by the sum of all the coefficients -- unless the sum is 0, in which case requesting normalizion does nothing.
es: {menuselection}`Proceso --> Filtros --> Convolución...` permite definir cualquier filtro lineal personalizado ingresando los valores de los coeficientes deseados, separados por espacios y ordenados en filas y columnas. Si {guilabel}selecciona `Normalize Kernel`, entonces los coeficientes se escalan para que sumen 1, dividiéndolos por la suma de todos los coeficientes, a menos que la suma sea 0. , en cuyo caso solicitar la normalización no hace nada.
pt_br: {menuselection}`Process --> Filters --> Convolve...` torna possível definir qualquer filtro linear personalizado inserindo os valores dos coeficientes desejados, separados por espaços e organizados em linhas e colunas. Se você {guilabel}`Normalize Kernel` estiver selecionado, os coeficientes serão escalonados para que somem 1, dividindo pela soma de todos os coeficientes - a menos que a soma seja 0 , nesse caso, solicitar a normalização não faz nada.

source: Question
es: Pregunta
pt_br: Pergunta

source: When defining an _n_×_n_ filter kernel with {menuselection}`Convolve...`, ImageJ insists that __n__ is an odd number. Why?
es: Al definir un núcleo de filtro _n_×_n_ con {menuselection}`Convolve...`, ImageJ insiste en que __n__ es un número impar. ¿Por qué?
pt_br: Ao definir um kernel de filtro _n_×_n_ com {menuselection}`Convolve...`, ImageJ insiste que __n__ é um número ímpar. Por que?

source: Answer
es: Respuesta
pt_br: Responder

source: If *n* is an odd number, the filter has a clear central pixel. This makes it possible to center the filter kernel on a pixel on the image.
es: Si *n* es un número impar, el filtro tiene un píxel central claro. Esto hace posible centrar el núcleo del filtro en un píxel de la imagen.
pt_br: Se *n* for um número ímpar, o filtro terá um pixel central claro. Isso torna possível centralizar o núcleo do filtro em um pixel da imagem.

source: Predict what happens when you convolve an image using a filter that consists of a single coefficient with a value -1 in the following cases:
es: Predice qué sucede cuando convolucionas una imagen usando un filtro que consta de un único coeficiente con un valor -1 en los siguientes casos:
pt_br: Preveja o que acontece quando você convolve uma imagem usando um filtro que consiste em um único coeficiente com valor -1 nos seguintes casos:

source: {guilabel}`Normalize Kernel` is checked
es: {guilabel}`Normalizar kernel` está marcado
pt_br: {guilabel}`Normalizar Kernel` está marcado

source: You have a 32-bit image, {guilabel}`Normalize Kernel` is unchecked
es: Tienes una imagen de 32 bits, {guilabel}`Normalize Kernel` no está marcado
pt_br: Você tem uma imagem de 32 bits, {guilabel}`Normalize Kernel` está desmarcado

source: You have an 8-bit image, {guilabel}`Normalize Kernel` is unchecked
es: Tienes una imagen de 8 bits, {guilabel}`Normalize Kernel` no está marcado
pt_br: Você tem uma imagem de 8 bits, {guilabel}`Normalize Kernel` está desmarcado

source: The results of convolving with a single -1 coefficient in different circumstances:
es: Los resultados de convolucionar con un único coeficiente -1 en diferentes circunstancias:
pt_br: Os resultados da convolução com um único coeficiente -1 em diferentes circunstâncias:

source: _{guilabel}`Normalize Kernel` is checked_: Nothing at all happens. The normalization makes the filter just a single 1... and convolving with a single 1 leaves the image unchanged.
es: _{guilabel}`Normalize Kernel` está marcado_: No sucede nada en absoluto. La normalización hace que el filtro sea solo un 1... y la convolución con un solo 1 deja la imagen sin cambios.
pt_br: _{guilabel}`Normalize Kernel` está marcado_: Nada acontece. A normalização torna o filtro apenas um único 1... e a convolução com um único 1 deixa a imagem inalterada.

source: _You have a 32-bit image ({guilabel}`Normalize Kernel` unchecked)_: The pixel values become negative, and the image looks inverted.
es: _Tienes una imagen de 32 bits ({guilabel}`Normalize Kernel` sin marcar)_: Los valores de píxeles se vuelven negativos y la imagen parece invertida.
pt_br: _Você tem uma imagem de 32 bits ({guilabel}`Normalize Kernel` desmarcado)_: Os valores dos pixels tornam-se negativos e a imagem parece invertida.

source: _You have an 8-bit image ({guilabel}`Normalize Kernel` unchecked)_: The pixel values would become negative, but then cannot be stored in an 8-bit unsigned integer form. Therefore, all pixels simply become clipped to zero.
es: _Tiene una imagen de 8 bits ({guilabel}`Normalize Kernel` sin marcar)_: Los valores de píxeles se volverían negativos, pero luego no se pueden almacenar en un formato entero de 8 bits sin signo. Por lo tanto, todos los píxeles simplemente se recortan a cero.
pt_br: _Você tem uma imagem de 8 bits ({guilabel}`Normalize Kernel` desmarcado)_: Os valores de pixel se tornariam negativos, mas não poderiam ser armazenados em um formato inteiro não assinado de 8 bits. Portanto, todos os pixels simplesmente ficam reduzidos a zero.

source: Practical
es: Práctico
pt_br: Prático

source: Using any image, work out which of the methods for dealing with boundaries shown in {numref}`fig-filter_boundaries` is used by ImageJ's {menuselection}`Convolve...` command.
es: Utilizando cualquier imagen, determine cuál de los métodos para tratar los límites que se muestran en {numref}`fig-filter_boundaries` es utilizado por <span class='notranslate'>{menuselection}</span de ImageJ. > comando `Convolucionar...`.
pt_br: Usando qualquer imagem, descubra qual dos métodos para lidar com limites mostrados em {numref}`fig-filter_boundaries` é usado pelo <span class='notranslate'>{menuselection}</span do ImageJ > `Convolver...` comando.

source: **Note:** This requires a bit of creativity. It will certainly help to use an image with some variation at the image boundary. I used {menuselection}`File --> Open Samples --> Blobs`.
es: **Nota:** Esto requiere un poco de creatividad. Sin duda será útil utilizar una imagen con alguna variación en el límite de la imagen. Usé {menuselection}`Archivo --> Abrir muestras --> Blobs`.
pt_br: **Observação:** Isso requer um pouco de criatividade. Certamente ajudará usar uma imagem com alguma variação nos limites da imagem. Usei {menuselection}`Arquivo --> Abrir amostras --> Blobs`.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https://gist.github.com/petebankhead/cbbb6f210d173c8488247799efc3b970)
es: [![lanzamiento ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https:/ /gist.github.com/petebankhead/cbbb6f210d173c8488247799efc3b970)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https:/ /gist.github.com/petebankhead/cbbb6f210d173c8488247799efc3b970)

source: launch ImageJ.JS
es: lanzar ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
es: Solución
pt_br: Solução

source: Replication of boundary pixels is the default method used by {menuselection}`Process --> Filters --> Convolve...` in ImageJ (although other filtering plugins by different authors might use different methods).
es: La replicación de píxeles de límite es el método predeterminado utilizado por {menuselection}`Proceso --> Filtros --> Convolución...` en ImageJ (aunque otros complementos de filtrado de diferentes autores pueden usar diferentes métodos).
pt_br: A replicação de pixels de limite é o método padrão usado por {menuselection}`Process --> Filters --> Convolve...` no ImageJ (embora outros plugins de filtragem de diferentes autores possam usar diferentes métodos).

source: My approach to test this involved using {menuselection}`Convolve...` with a filter that consisting of a 1 followed by a lot of zeros (e.g. `1 0 0 0 0 0 0 0 0 0 0 0 0...`). This basically shifts the image to the right, bringing whatever is outside the image boundary into view.
es: Mi enfoque para probar esto implicó usar {menuselection}`Convolve...` con un filtro que consiste en un 1 seguido de muchos ceros (por ejemplo, `1 0 0 0 0 0 0 0 0 0 0 0 0...`). Básicamente, esto desplaza la imagen hacia la derecha, mostrando todo lo que está fuera del límite de la imagen.
pt_br: Minha abordagem para testar isso envolveu usar {menuselection}`Convolve...` com um filtro que consiste em 1 seguido por muitos zeros (por exemplo, `1 0 0 0 0 0 0 0 0 0 0 0 0...`). Isso basicamente desloca a imagem para a direita, exibindo tudo o que está fora dos limites da imagem.

source: Gradient magnitude
es: Magnitud del gradiente
pt_br: Magnitude do gradiente

source: Practice using the commands we've met so far by determining the **gradient magnitude** of an image, as described [here](sec_filters_gradient).
es: Practique usando los comandos que hemos conocido hasta ahora determinando la **magnitud del gradiente** de una imagen, como se describe [aquí](sec_filters_gradient).
pt_br: Pratique o uso dos comandos que conhecemos até agora, determinando a **magnitude do gradiente** de uma imagem, conforme descrito [aqui](sec_filters_gradient).

source: You will need to use
es: Necesitarás usar
pt_br: Você precisará usar

source: {menuselection}`Image --> Duplicate...`
es: {menuselection}`Imagen --> Duplicado...`
pt_br: {menuselection}`Imagem --> Duplicar...`

source: {menuselection}`Process --> Filters --> Convolve...`
es: {menuselection}`Proceso --> Filtros --> Convolución...`
pt_br: {menuselection}`Processar --> Filtros --> Convolver...`

source: {menuselection}`Process --> Image Calculator...`
es: {menuselection}`Proceso --> Calculadora de imágenes...`
pt_br: {menuselection}`Processo --> Calculadora de imagem...`

source: Several commands in the {menuselection}`Process --> Math` submenu
es: Varios comandos en el submenú {menuselection}`Proceso --> Matemáticas`
pt_br: Vários comandos no submenu {menuselection}`Process --> Math`

source: Something else we've used before... possibly
es: Algo más que hemos usado antes... posiblemente
pt_br: Outra coisa que usamos antes... possivelmente

source: If you need a sample image, you can use {menuselection}`File --> Open samples --> Blobs (25K)`. _(Be sure to pay attention to the bit-depth!)_
es: Si necesita una imagen de muestra, puede usar {menuselection}`Archivo --> Abrir muestras --> Blobs (25K)`. _(¡Asegúrese de prestar atención a la profundidad de bits!)_
pt_br: Se precisar de uma imagem de amostra, você pode usar {menuselection}`Arquivo --> Abrir amostras --> Blobs (25K)`. _(Certifique-se de prestar atenção à profundidade de bits!)_

source: The process to calculate the gradient magnitude is:
es: El proceso para calcular la magnitud del gradiente es:
pt_br: O processo para calcular a magnitude do gradiente é:

source: Convert the image to 32-bit (if it isn't already 32-bit)
es: Convierta la imagen a 32 bits (si aún no es de 32 bits)
pt_br: Converta a imagem para 32 bits (se ainda não for de 32 bits)

source: Duplicate the image
es: Duplicar la imagen
pt_br: Duplicar a imagem

source: Convolve one copy of the image with the horizontal gradient filter, and one with the vertical (i.e. coefficients `-1 0 1` arranged as a row or column)
es: Convolucione una copia de la imagen con el filtro de degradado horizontal y otra con el vertical (es decir, coeficientes `-1 0 1` organizados como una fila o columna)
pt_br: Convolver uma cópia da imagem com o filtro de gradiente horizontal e outra com o vertical (ou seja, coeficientes `-1 0 1` organizados como uma linha ou coluna)

source: Compute the square of both images ({menuselection}`Process --> Math --> Square`)
es: Calcula el cuadrado de ambas imágenes ({menuselection}`Proceso --> Matemáticas --> Cuadrado`)
pt_br: Calcule o quadrado de ambas as imagens ({menuselection}`Process --> Math --> Square`)

source: Use the image calculator to add the images together
es: Utilice la calculadora de imágenes para sumar las imágenes.
pt_br: Use a calculadora de imagens para somar as imagens

source: Compute the square root of the resulting image ({menuselection}`Process --> Math --> Square Root`)
es: Calcule la raíz cuadrada de la imagen resultante ({menuselection}`Proceso --> Matemáticas --> Raíz cuadrada`)
pt_br: Calcule a raiz quadrada da imagem resultante ({menuselection}`Process --> Math --> Square Root`)

source: Here's a macro that implements these steps:
es: Aquí hay una macro que implementa estos pasos:
pt_br: Aqui está uma macro que implementa estas etapas:

source: The convolution results in negative values, which is why the 32-bit conversion is needed.
es: La convolución da como resultado valores negativos, por lo que es necesaria la conversión de 32 bits.
pt_br: A convolução resulta em valores negativos, por isso a conversão de 32 bits é necessária.

source: **Note:** This is (almost) what is done by the command {menuselection}`Process --> Find Edges`, except the gradient filters are slightly different.
es: **Nota:** Esto es (casi) lo que hace el comando {menuselection}`Proceso --> Buscar bordes`, excepto que los filtros de degradado son ligeramente diferentes.
pt_br: **Nota:** Isto é (quase) o que é feito pelo comando {menuselection}`Process --> Find Edges`, exceto que os filtros de gradiente são ligeiramente diferentes.

source: The 'Edges' LUT
es: El LUT de los 'bordes'
pt_br: A LUT das 'bordas'

source: ImageJ has a LUT called **edges** under {menuselection}`Image --> Lookup Tables --> Edges`. Applied to {menuselection}`File --> Open samples --> Blobs (25K)`, it does a rather good job of highlighting edges -- without actually changing the pixels at all.
es: ImageJ tiene una LUT llamada **bordes** en {menuselection}`Imagen --> Tablas de búsqueda --> Bordes`. Aplicado a {menuselection}`Archivo --> Abrir muestras --> Blobs (25K)`, hace un trabajo bastante bueno al resaltar los bordes, sin cambiar los píxeles en absoluto.
pt_br: ImageJ tem uma LUT chamada **edges** em {menuselection}`Image --> Lookup Tables --> Edges`. Aplicado a {menuselection}`File --> Open samples --> Blobs (25K)`, ele faz um bom trabalho ao destacar bordas - sem realmente alterar os pixels.

source: How does it work? Does it apply a filter?
es: ¿Como funciona? ¿Aplica un filtro?
pt_br: Como funciona? Aplica filtro?

source: The {menuselection}`edges` LUT shows most low and high pixel values as black -- and uses lighter shades of gray only for a small range of values in between (see {menuselection}`Image --> Color --> Edit LUT...`). In any image with a good separation of background and foreground pixels, but which still has a somewhat smooth transition between them, this means everything but the edges can appear black.
es: La LUT {menuselection}`edges` muestra la mayoría de los valores de píxeles altos y bajos en negro, y utiliza tonos de gris más claros solo para un pequeño rango de valores intermedios (consulte {menuselection}`Imagen --> Color --> Editar LUT...`). En cualquier imagen con una buena separación entre los píxeles de fondo y de primer plano, pero que aún tenga una transición algo suave entre ellos, esto significa que todo, excepto los bordes, puede aparecer negro.
pt_br: A LUT {menuselection}`edges` mostra a maioria dos valores de pixels baixos e altos como preto - e usa tons mais claros de cinza apenas para uma pequena faixa de valores intermediários (consulte {menuselection}`Imagem --> Cor --> Editar LUT...`). Em qualquer imagem com uma boa separação entre pixels de fundo e primeiro plano, mas que ainda tenha uma transição um tanto suave entre eles, isso significa que tudo, exceto as bordas, pode parecer preto.

source: All this is achieved by a LUT: no pixels were harmed, there was no filtering applied.
es: Todo esto se logra mediante una LUT: no se dañaron píxeles ni se aplicó ningún filtrado.
pt_br: Tudo isso é conseguido por uma LUT: nenhum pixel foi danificado, não houve filtragem aplicada.

source: Nonlinear filters
es: Filtros no lineales
pt_br: Filtros não lineares

source: Rank filters
es: Filtros de clasificación
pt_br: Filtros de classificação

source: The main rank filters are to be found exactly where you might expect them:
es: Los principales filtros de clasificación se encuentran exactamente donde podría esperarlos:
pt_br: Os principais filtros de classificação podem ser encontrados exatamente onde você os espera:

source: {menuselection}`Process --> Filters --> Median...`
es: {menuselection}`Proceso --> Filtros --> Mediana...`
pt_br: {menuselection}`Processo --> Filtros --> Mediana...`

source: {menuselection}`Process --> Filters --> Minimum...`
es: {menuselection}`Proceso --> Filtros --> Mínimo...`
pt_br: {menuselection}`Processo --> Filtros --> Mínimo...`

source: {menuselection}`Process --> Filters --> Maximum...`
es: {menuselection}`Proceso --> Filtros --> Máximo...`
pt_br: {menuselection}`Processo --> Filtros --> Máximo...`

source: ImageJ uses circular neighborhoods with its built-in rank filters, similar to how mean filters are implemented. We will meet these filters again in {ref}`chap_morph`.
es: ImageJ utiliza vecindades circulares con sus filtros de clasificación integrados, de forma similar a cómo se implementan los filtros medios. Volveremos a encontrarnos con estos filtros en {ref}`chap_morph`.
pt_br: ImageJ usa vizinhanças circulares com seus filtros de classificação integrados, semelhante à forma como os filtros médios são implementados. Encontraremos esses filtros novamente em {ref}`chap_morph`.

source: Removing outliers
es: Eliminando valores atípicos
pt_br: Removendo valores discrepantes
