Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/4-filters/imagej.po
Languages: es, pt_br

source: {numref}`fig-processing_filters_speckled` shows that median filtering is much better than mean filtering for removing outliers. We might encounter this if something in the microscope is not quite functioning as expected or if dark noise is a problem, but otherwise we expect the noise in fluorescence microscopy images to produce few really extreme values (see {ref}`chap_formation_noise`).
es: {numref}`fig-processing_filters_speckled` muestra que el filtrado mediano es mucho mejor que el filtrado medio para eliminar valores atípicos. Podríamos encontrarnos con esto si algo en el microscopio no funciona como se esperaba o si el ruido oscuro es un problema, pero por lo demás esperamos que el ruido en las imágenes de microscopía de fluorescencia produzca pocos valores realmente extremos (consulte {ref} `chap_formation_noise`).
pt_br: {numref}`fig-processing_filters_speckled` mostra que a filtragem mediana é muito melhor do que a filtragem média para remover valores discrepantes. Poderemos encontrar isso se algo no microscópio não estiver funcionando como esperado ou se o ruído escuro for um problema, mas, caso contrário, esperamos que o ruído nas imagens de microscopia de fluorescência produza poucos valores realmente extremos (consulte {ref} `chap_formation_noise`).

source: Nevertheless, {menuselection}`Process --> Noise --> Remove Outliers...` provides an alternative if isolated bright values are present. This is a nonlinear filter that inserts median values _only whenever a pixel is found that is further away from the local median than some adjustable threshold_.
es: Sin embargo, {menuselection}`Proceso --> Ruido --> Eliminar valores atípicos...` proporciona una alternativa si hay valores brillantes aislados. Este es un filtro no lineal que inserta valores medianos _solo cuando se encuentra un píxel que está más alejado de la mediana local que algún umbral ajustable_.
pt_br: No entanto, {menuselection}`Process --> Noise --> Remove Outliers...` fornece uma alternativa se valores brilhantes isolados estiverem presentes. Este é um filtro não linear que insere valores medianos _somente sempre que é encontrado um pixel que está mais distante da mediana local do que algum limite ajustável_.

source: It's therefore like a more selective median filter that will only modify the image at pixels where it is considered really necessary.
es: Es por tanto como un filtro mediano más selectivo que sólo modificará la imagen en los píxeles donde se considere realmente necesario.
pt_br: É, portanto, como um filtro mediano mais seletivo que só modificará a imagem nos pixels onde for considerado realmente necessário.
