Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/bit_depths.po
Languages: de, pt_br

source: For example, what is the maximum value in a 16-bit image that was acquired using a camera with a 12-bit output?
de: Wie hoch ist beispielsweise der maximale Wert in einem 16-Bit-Bild, das mit einer Kamera mit 12-Bit-Ausgang aufgenommen wurde?
pt_br: Por exemplo, qual é o valor máximo em uma imagem de 16 bits que foi adquirida usando uma câmera com saída de 12 bits?

source: And what is the maximum value in a 8-bit image acquired using a camera with a 14-bit output?
de: Und wie hoch ist der maximale Wert in einem 8-Bit-Bild, das mit einer Kamera mit 14-Bit-Ausgang aufgenommen wurde?
pt_br: E qual é o valor máximo em uma imagem de 8 bits adquirida usando uma câmera com saída de 14 bits?

source: Assume unsigned integers are used in both cases.
de: Gehen Sie davon aus, dass in beiden Fällen ganze Zahlen ohne Vorzeichen verwendet werden.
pt_br: Suponha que números inteiros sem sinal sejam usados em ambos os casos.

source: The maximum value of a 16-bit image obtained using a 12-bit camera is 4095 (i.e. 2<sup>12</sup>-1).
de: Der Höchstwert eines 16-Bit-Bildes, das mit einer 12-Bit-Kamera aufgenommen wurde, beträgt 4095 (d. h. 2<sup>12</sup>-1).
pt_br: O valor máximo de uma imagem de 16 bits obtida usando uma câmera de 12 bits é 4.095 (ou seja, 2<sup>12</sup>-1 ).

source: The maximum value of an 8-bit image obtained using a 14-bit camera is 255 – the extra bits of the camera do not change this. But if the image was saved in 16-bit instead, the maximum value would be 16383.
de: Der Höchstwert eines 8-Bit-Bildes, das mit einer 14-Bit-Kamera aufgenommen wurde, beträgt 255 - die zusätzlichen Bits der Kamera ändern daran nichts. Würde das Bild stattdessen in 16-Bit gespeichert, wäre der Höchstwert 16383.
pt_br: O valor máximo de uma imagem de 8 bits obtida com uma câmera de 14 bits é 255 – os bits extras da câmera não alteram isso. Mas se a imagem fosse salva em 16 bits, o valor máximo seria 16383.

source: So be aware that the actual range of possible values depends upon the acquisition equipment as well as the bit-depth of the image itself. The lower bit-depth will dominate.
de: Beachten Sie also, dass der tatsächliche Bereich möglicher Werte sowohl von der Aufnahmeausrüstung als auch von der Bittiefe des Bildes selbst abhängt. Die geringere Bittiefe wird überwiegen.
pt_br: Portanto, esteja ciente de que a faixa real de valores possíveis depende do equipamento de aquisição, bem como da profundidade de bits da própria imagem. A menor profundidade de bits dominará.

source: Rounding errors
de: Rundungsfehler
pt_br: Erros de arredondamento

source: Rounding is a more subtle problem than clipping. Again it is relevant as early as acquisition.
de: Rundung ist ein subtileres Problem als Abschneiden. Auch hier ist es bereits bei der Akquisition relevant.
pt_br: O arredondamento é um problema mais sutil do que o recorte. Novamente, é relevante já na aquisição.

source: For example, suppose you are acquiring an image in which there really are 1000 distinct and quantifiable levels of light being emitted from different parts of a sample. These could not possibly be given different pixel values within an 8-bit image, but could normally be fit into a 16-bit or 32-bit image with lots of room to spare. If our image is 8-bit, and we want to avoid clipping, then we would need to scale the original photon counts down first – resulting in pixels with different photon counts being rounded to have the same values, and their original differences being lost.
de: Nehmen wir zum Beispiel an, Sie nehmen ein Bild auf, in dem es tatsächlich 1000 verschiedene und quantifizierbare Lichtpegel gibt, die von verschiedenen Teilen einer Probe emittiert werden. Diese können in einem 8-Bit-Bild unmöglich mit unterschiedlichen Pixelwerten versehen werden, lassen sich aber normalerweise in einem 16- oder 32-Bit-Bild mit viel Spielraum unterbringen. Wenn unser Bild 8-Bit groß ist und wir Beschneidungen vermeiden wollen, müssen wir zunächst die ursprüngliche Photonenzahl herunterskalieren, was dazu führt, dass Pixel mit unterschiedlicher Photonenzahl auf denselben Wert gerundet werden und ihre ursprünglichen Unterschiede verloren gehen.
pt_br: Por exemplo, suponha que você esteja adquirindo uma imagem na qual existem realmente 1.000 níveis distintos e quantificáveis de luz sendo emitidos por diferentes partes de uma amostra. Eles não poderiam receber valores de pixel diferentes em uma imagem de 8 bits, mas normalmente poderiam caber em uma imagem de 16 ou 32 bits com muito espaço de sobra. Se a nossa imagem for de 8 bits e quisermos evitar cortes, precisaríamos primeiro reduzir a contagem original de fótons - resultando em pixels com contagens de fótons diferentes sendo arredondados para terem os mesmos valores e suas diferenças originais sendo perdidas.

source: Nevertheless, rounding errors during acquisition are usually small: it may not *really* matter if we can't tell the difference between detecting 1,000 photons and 1,003 photons.
de: Dennoch sind Rundungsfehler bei der Erfassung in der Regel gering: Es ist vielleicht nicht *wirklich* wichtig, wenn wir keinen Unterschied zwischen der Erfassung von 1.000 Photonen und 1.003 Photonen feststellen können.
pt_br: No entanto, os erros de arredondamento durante a aquisição são geralmente pequenos: pode não ter *realmente* importância se não conseguirmos dizer a diferença entre a detecção de 1.000 fótons e 1.003 fótons.

source: Rounding can be a bigger problem when it comes to processing operations like filtering, which often involve computing averages over many pixels (see {ref}`chap_filters`). The good news is that at this post-acquisition stage we can convert our data to floating point and then get fractions if we need them.
de: Das Runden kann ein größeres Problem darstellen, wenn es um Verarbeitungsvorgänge wie das Filtern geht, bei denen oft Durchschnittswerte über viele Pixel berechnet werden (siehe {ref}`chap_filters`). Die gute Nachricht ist, dass wir in diesem Stadium nach der Erfassung unsere Daten in Fließkommazahlen umwandeln und dann Brüche erhalten können, wenn wir sie brauchen.
pt_br: O arredondamento pode ser um problema maior quando se trata de operações de processamento como filtragem, que geralmente envolvem o cálculo de médias sobre muitos pixels (consulte {ref}`chap_filters`). A boa notícia é que nesta fase pós-aquisição podemos converter nossos dados em ponto flutuante e então obter frações se precisarmos delas.

source: Floating point rounding errors
de: Rundungsfehler bei Fließkommazahlen
pt_br: Erros de arredondamento de ponto flutuante

source: As a full disclosure, I should admit that using floating point types is only a partial solution to rounding issues. Even a 64-bit floating point image cannot store all useful pixel values with perfect precision, and seemingly straightforward numbers like 0.1 are only imprecisely represented.
de: Ich muss zugeben, dass die Verwendung von Fließkommatypen nur eine Teillösung für Rundungsprobleme ist. Selbst ein 64-Bit-Fließkommabild kann nicht alle nützlichen Pixelwerte mit perfekter Präzision speichern, und scheinbar einfache Zahlen wie 0,1 werden nur ungenau dargestellt.
pt_br: Como divulgação completa, devo admitir que o uso de tipos de ponto flutuante é apenas uma solução parcial para problemas de arredondamento. Mesmo uma imagem de ponto flutuante de 64 bits não pode armazenar todos os valores úteis de pixel com precisão perfeita, e números aparentemente simples como 0,1 são representados apenas de forma imprecisa.

source: But this is not really unexpected: this binary limitation is similar to how we cannot write 1/3 in decimal exactly. We can write 0.3333333 but our level of precision will depend upon our willingness to continue adding 3’s after the decimal point.
de: Aber das ist nicht wirklich unerwartet: Diese binäre Beschränkung ist ähnlich wie die Tatsache, dass wir 1/3 im Dezimalsystem nicht genau schreiben können. Wir können zwar 0,3333333 schreiben, aber die Genauigkeit hängt davon ab, ob wir bereit sind, nach dem Dezimalpunkt weiterhin 3er zu addieren.
pt_br: Mas isso não é realmente inesperado: essa limitação binária é semelhante a como não podemos escrever exatamente 1/3 em decimal. Podemos escrever 0,3333333, mas o nosso nível de precisão dependerá da nossa vontade de continuar a adicionar 3 após a vírgula decimal.

source: In any case, rounding 0.1 to 0.100000001490116119384765625 (a possible floating point representation) is not so bad as rounding it to 0 (an integer representation), and the imprecisions of floating point numbers in image analysis are *usually* small enough to be disregarded.
de: In jedem Fall ist das Runden von 0,1 auf 0,100000001490116119384765625 (eine mögliche Fließkommadarstellung) nicht so schlimm wie das Runden auf 0 (eine Ganzzahlendarstellung), und die Ungenauigkeiten von Fließkommazahlen in der Bildanalyse sind *normalerweise* klein genug, um vernachlässigt zu werden.
pt_br: Em qualquer caso, arredondar 0,1 para 0,100000001490116119384765625 (uma possível representação de ponto flutuante) não é tão ruim quanto arredondar para 0 (uma representação inteira), e as imprecisões dos números de ponto flutuante na análise de imagens são *geralmente* pequenas o suficiente para serem desconsideradas.

source: See <https://xkcd.com/217/> for more information.
de: Siehe <https://xkcd.com/217/> für weitere Informationen.
pt_br: Consulte <https://xkcd.com/217/> para obter mais informações.

source: More bits are better (usually)
de: Mehr Bits sind besser (normalerweise)
pt_br: Mais bits são melhores (geralmente)

source: From considering both clipping and rounding, the simple rule of bit-depths emerges: if you want the maximum information and precision in your images, more bits are better. This is depicted in {numref}`fig-blocks_and_bits`.
de: Aus der Betrachtung von Beschneidung und Rundung ergibt sich die einfache Regel der Bittiefe: Wenn Sie ein Maximum an Informationen und Präzision in Ihren Bildern wünschen, sind mehr Bits besser. Dies wird in {numref}`fig-blocks_and_bits` dargestellt.
pt_br: Ao considerar o recorte e o arredondamento, surge a regra simples da profundidade de bits: se você deseja o máximo de informação e precisão em suas imagens, mais bits são melhores. Isso é representado em {numref}`fig-blocks_and_bits`.

source: When given the option of acquiring a 16-bit or 8-bit image, most of the time you should opt for the former.
de: Wenn Sie die Wahl haben, ein 16-Bit- oder ein 8-Bit-Bild zu erfassen, sollten Sie sich in den meisten Fällen für Ersteres entscheiden.
pt_br: Ao ter a opção de adquirir uma imagem de 16 ou 8 bits, na maioria das vezes você deve optar pela primeira.

source: **Illustration of the comparative accuracy of *(left to right)* 8-bit, 16-bit and 32-bit images.** If an 8-bit image is like creating a sculpture out of large building blocks, a 16-bit image is more like using Lego and a 32-bit floating point image resembles using clay. Anything that can be created with the blocks can also be made from the Lego; anything made from the Lego can also be made from the clay. This does not work in reverse: some complex creations can only be represented properly by clay, and building blocks permit only a crude approximation at best. On the other hand, if you only need something blocky, it’s not really worth the extra effort of Lego or clay. And, from a very great distance, it might be hard to tell the difference.
de: **Veranschaulichung der vergleichenden Genauigkeit von *(von links nach rechts)* 8-Bit-, 16-Bit- und 32-Bit-Bildern.** Ein 8-Bit-Bild ist wie eine Skulptur aus großen Bauklötzen, ein 16-Bit-Bild ähnelt eher der Verwendung von Lego und ein 32-Bit-Fließkommabild ähnelt der Verwendung von Ton. Alles, was mit den Klötzen gemacht werden kann, kann auch aus Lego gemacht werden; alles, was aus Lego gemacht wird, kann auch aus Ton gemacht werden. Umgekehrt funktioniert das nicht: Manche komplexen Gebilde lassen sich nur mit Knete richtig darstellen, und Bausteine erlauben bestenfalls eine grobe Annäherung. Andererseits lohnt sich der Mehraufwand für Lego oder Knete nicht wirklich, wenn man nur etwas Klötzchen braucht. Und aus großer Entfernung ist es vielleicht schwer, den Unterschied zu erkennen.
pt_br: **Ilustração da precisão comparativa de *(da esquerda para a direita)* imagens de 8 bits, 16 bits e 32 bits.** Se uma imagem de 8 bits é como criar uma escultura a partir de grandes blocos de construção, uma imagem de 16 bits é como criar uma escultura a partir de grandes blocos de construção. imagem de bits é mais parecida com Lego e uma imagem de ponto flutuante de 32 bits é parecida com argila. Tudo o que pode ser criado com os blocos também pode ser feito com Lego; qualquer coisa feita de Lego também pode ser feita de barro. Isto não funciona ao contrário: algumas criações complexas só podem ser representadas adequadamente por argila, e os blocos de construção permitem apenas uma aproximação grosseira, na melhor das hipóteses. Por outro lado, se você só precisa de algo em blocos, não vale a pena o esforço extra de Lego ou argila. E, de uma distância muito grande, pode ser difícil perceber a diferença.

source: Although *more bits are better* is a simple rule of thumb we can share with those who do not know the subtleties of bit-depths, it should not be held completely rigorously.
de: Obwohl *mehr Bits sind besser* eine einfache Faustregel ist, die wir mit denjenigen teilen können, die die Feinheiten der Bittiefen nicht kennen, sollte sie nicht völlig rigoros eingehalten werden.
pt_br: Embora *mais bits, melhor* seja uma regra simples que podemos compartilhar com aqueles que não conhecem as sutilezas da profundidade de bits, ela não deve ser mantida com total rigor.

source: Can you think of any circumstances when more bits might *not* be better?
de: Können Sie sich einen Fall vorstellen, in dem mehr Bits *nicht* besser sein könnten?
pt_br: Você consegue pensar em alguma circunstância em que mais bits podem *não* ser melhores?

source: Reasons why a lower bit depth is *sometimes* preferable to a higher one include:
de: Unter anderem gibt es Gründe, warum eine geringere Bittiefe *manchmal* einer höheren vorzuziehen ist:
pt_br: As razões pelas quais uma profundidade de bits menor é *às vezes* preferível a uma maior incluem:

source: A higher bit-depth leads to larger file sizes, and potentially slower processing. For very large datasets, this might be a bigger issue that any loss of precision found in using fewer bits.
de: Eine höhere Bittiefe führt zu einer größeren Dateigröße und möglicherweise zu einer langsameren Verarbeitung. Bei sehr großen Datensätzen könnte dies ein größeres Problem darstellen als der Verlust an Präzision, der durch die Verwendung von weniger Bits entsteht.
pt_br: Uma profundidade de bits maior leva a tamanhos de arquivo maiores e a um processamento potencialmente mais lento. Para conjuntos de dados muito grandes, isso pode ser um problema maior do que qualquer perda de precisão encontrada no uso de menos bits.

source: The amount of light detected per pixel might be so low that thousands of possible values are not required for its accurate storage, and 8-bits (or even fewer) would be enough. For the light-levels in biological fluorescence microscopy, going beyond 16-bits would seldom bring any benefit.
de: Die pro Pixel erfasste Lichtmenge könnte so gering sein, dass für ihre genaue Speicherung nicht Tausende möglicher Werte erforderlich sind und 8 Bits (oder noch weniger) ausreichen würden. Bei den Lichtpegeln in der biologischen Fluoreszenzmikroskopie würde es kaum einen Vorteil bringen, über 16 Bits hinauszugehen.
pt_br: A quantidade de luz detectada por pixel pode ser tão baixa que milhares de valores possíveis não são necessários para seu armazenamento preciso, e 8 bits (ou até menos) seriam suficientes. Para os níveis de luz na microscopia de fluorescência biológica, ir além de 16 bits raramente traria qualquer benefício.

source: But with smallish datasets for which processing and storage costs are not a problem, it is safest to err on the side of more bits than we strictly need.
de: Bei kleineren Datenmengen, bei denen die Verarbeitungs- und Speicherkosten kein Problem darstellen, ist es jedoch am sichersten, mehr Bits zu verwenden als unbedingt erforderlich.
pt_br: Mas com conjuntos de dados pequenos para os quais os custos de processamento e armazenamento não são um problema, é mais seguro errar e preferir mais bits do que o estritamente necessário.
