Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/bit_depths.po
Languages: de, pt_br

source: Lots of permutations of bit-depth and type are possible, but in practice three are most common for images:
de: Es sind viele Kombinationen von Bittiefe und Typ möglich, aber in der Praxis sind drei für Bilder am gebräuchlichsten:
pt_br: Muitas permutações de profundidade de bits e tipo são possíveis, mas na prática três são mais comuns para imagens:

source: 8-bit unsigned integer
de: 8-Bit-Ganzzahl ohne Vorzeichen
pt_br: Inteiro não assinado de 8 bits

source: 16-bit unsigned integer
de: 16-Bit-Ganzzahl ohne Vorzeichen
pt_br: Inteiro não assinado de 16 bits

source: 32-bit floating point
de: 32-Bit-Gleitkomma
pt_br: Ponto flutuante de 32 bits

source: The representations above are sufficiently ubiquitous that the type is often assumed. Unless otherwise specified, any 8-bit or 16-bit image is most likely to use unsigned integers, while a 32-bit image is probably using floating point pixels.
de: Die oben genannten Darstellungen sind so allgegenwärtig, dass der Typ oft vorausgesetzt wird. Wenn nicht anders angegeben, wird ein 8-Bit- oder 16-Bit-Bild höchstwahrscheinlich Ganzzahlen ohne Vorzeichen verwenden, während ein 32-Bit-Bild wahrscheinlich Fließkommapixel verwendet.
pt_br: As representações acima são suficientemente onipresentes para que o tipo seja frequentemente assumido. A menos que especificado de outra forma, qualquer imagem de 8 ou 16 bits provavelmente usará inteiros não assinados, enquanto uma imagem de 32 bits provavelmente usará pixels de ponto flutuante.

source: Conceivably you *can* have a 32-bit signed/unsigned integer image, or even a 16-bit floating point image, but these are less common in the wild.
de: Denkbar ist auch ein 32-Bit-Ganzzahlbild mit und ohne Vorzeichen oder sogar ein 16-Bit-Gleitkomma-Bild, aber diese sind in der Praxis weniger verbreitet.
pt_br: É concebível que você *pode* ter uma imagem inteira assinada/não assinada de 32 bits, ou até mesmo uma imagem de ponto flutuante de 16 bits, mas elas são menos comuns no mundo.

source: The pixels shown on the right all belong to different images.
de: Die rechts abgebildeten Pixel gehören alle zu verschiedenen Bildern.
pt_br: Os pixels mostrados à direita pertencem todos a imagens diferentes.

source: In each case, identify what *possible* type an image could have in order to represent the value of the pixel. There can be more than one possible type for each pixel.
de: Geben Sie in jedem Fall an, welchen *möglichen* Typ ein Bild haben könnte, um den Wert des Pixels darzustellen. Für jedes Pixel kann es mehr als einen möglichen Typ geben.
pt_br: Em cada caso, identifique que tipo *possível* uma imagem poderia ter para representar o valor do pixel. Pode haver mais de um tipo possível para cada pixel.

source: Your type options are:
de: Sie können zwischen folgenden Typen wählen:
pt_br: Suas opções de tipo são:

source: Signed integer
de: Ganzzahl mit Vorzeichen
pt_br: Inteiro assinado

source: Unsigned integer
de: Ganzzahl ohne Vorzeichen
pt_br: Inteiro não assinado

source: Floating point
de: Fließkomma
pt_br: Ponto flutuante

source: The possible image types, from left to right:
de: Die möglichen Bildtypen, von links nach rechts:
pt_br: Os possíveis tipos de imagem, da esquerda para a direita:

source: Signed integer or floating point
de: Ganzzahl mit Vorzeichen oder Gleitkomma
pt_br: Inteiro assinado ou ponto flutuante

source: Unsigned integer, signed integer or floating point
de: Ganzzahl ohne Vorzeichen, Ganzzahl mit Vorzeichen oder Gleitkomma
pt_br: Inteiro não assinado, inteiro assinado ou ponto flutuante

source: Note that 'floating point' is an option in all cases: it's the most flexible representation.
de: Beachten Sie, dass "Gleitkomma" in allen Fällen eine Option ist: Es ist die flexibelste Darstellung.
pt_br: Observe que 'ponto flutuante' é uma opção em todos os casos: é a representação mais flexível.

source: What is the maximum pixel value that can be stored in a *16-bit, unsigned integer* image?
de: Wie hoch ist der maximale Pixelwert, der in einem *16-Bit, vorzeichenlosen Ganzzahl*-Bild gespeichert werden kann?
pt_br: Qual é o valor máximo de pixel que pode ser armazenado em uma imagem *inteira não assinada* de 16 bits?

source: The maximum value that can be stored in a 16-bit, unsigned integer image is 2<sup>16</sup>-1 = 65535.
de: Der maximale Wert, der in einem 16-Bit-Ganzzahlbild ohne Vorzeichen gespeichert werden kann, ist 2<sup>16</sup>-1 = 65535.
pt_br: O valor máximo que pode ser armazenado em uma imagem inteira sem sinal de 16 bits é 2<sup>16</sup>-1 = 65535.

source: What would be the maximum pixel value that can be stored in a *16-bit, signed integer* image?
de: Wie hoch ist der maximale Pixelwert, der in einem *16-Bit-Bild mit Vorzeichen* gespeichert werden kann?
pt_br: Qual seria o valor máximo de pixel que pode ser armazenado em uma imagem *inteira assinada* de 16 bits?

source: The maximum value that can be stored in a 16-bit, signed integer image is 2<sup>15</sup>-1 = 32767 (since one of the bits is used for the sign, we have 15 remaining).
de: Der maximale Wert, der in einem vorzeichenbehafteten 16-Bit-Ganzzahlbild gespeichert werden kann, ist 2<sup>15</sup>-1 = 32767 (da eines der Bits für das Vorzeichen verwendet wird, bleiben 15 übrig).
pt_br: O valor máximo que pode ser armazenado em uma imagem inteira assinada de 16 bits é 2<sup>15</sup>-1 = 32767 ( como um dos bits é usado para o sinal, temos 15 restantes).

source: An image as a matrix of numbers, or just ones and zeros?
de: Ein Bild als Matrix von Zahlen oder nur Einsen und Nullen?
pt_br: Uma imagem como matriz de números ou apenas uns e zeros?

source: You may recall how {numref}`fig-image_array` showed an image as being a matrix of numbers. That is already a slightly high level abstraction of how the image is actually represented. It's more accurate to see the image (or, indeed, any digital data) as simply being a long stream of ones and zeros, such as
de: Sie erinnern sich vielleicht daran, wie {numref}`fig-image_array` ein Bild als eine Matrix von Zahlen darstellte. Das ist bereits eine etwas hochgradige Abstraktion davon, wie das Bild tatsächlich dargestellt wird. Es ist genauer, das Bild (oder überhaupt alle digitalen Daten) einfach als einen langen Strom von Einsen und Nullen zu betrachten, wie zum Beispiel
pt_br: Você deve se lembrar de como {numref}`fig-image_array` mostrou uma imagem como sendo uma matriz de números. Isso já é uma abstração de alto nível de como a imagem é realmente representada. É mais preciso ver a imagem (ou, na verdade, qualquer dado digital) simplesmente como sendo um longo fluxo de uns e zeros, como

source: {glue:}`binary_string`
de: {Kleber:}`binary_string`
pt_br: {cola:}`binary_string`

source: More information is needed about how the pixel values of the image are encoded to interpret these ones and zeros. This includes how should the ones and zeros be split up to represent different values (e.g. in chunks of 8, 16, or some other number?).
de: Es werden weitere Informationen darüber benötigt, wie die Pixelwerte des Bildes kodiert werden, um diese Einsen und Nullen zu interpretieren. Dazu gehört auch die Frage, wie die Einsen und Nullen aufgeteilt werden sollen, um verschiedene Werte darzustellen (z. B. in 8er-, 16er- oder andere Zahlenabschnitte?).
pt_br: São necessárias mais informações sobre como os valores de pixel da imagem são codificados para interpretar esses uns e zeros. Isso inclui como os uns e os zeros devem ser divididos para representar valores diferentes (por exemplo, em pedaços de 8, 16 ou algum outro número?).

source: The bit-depth is what tells us how big the chunks are, and the type tells us how to convert each chunk into a decimal number.
de: Die Bit-Tiefe gibt an, wie groß die Chunks sind, und der Typ gibt an, wie jeder Chunk in eine Dezimalzahl umgewandelt werden kann.
pt_br: A profundidade de bits é o que nos diz o tamanho dos pedaços, e o tipo nos diz como converter cada pedaço em um número decimal.

source: When bits go bad
de: Wenn Bits schlecht werden
pt_br: Quando os bits vão mal

source: We're now ready to discuss why you absolutely do need to know the basics of bit-depths and image types when working with scientific images.
de: Jetzt können wir besprechen, warum Sie unbedingt die Grundlagen der Bittiefen und Bildtypen kennen müssen, wenn Sie mit wissenschaftlichen Bildern arbeiten.
pt_br: Agora estamos prontos para discutir por que você realmente precisa conhecer o básico sobre profundidade de bits e tipos de imagens ao trabalhar com imagens científicas.

source: The main point of {ref}`chap_pixels` is that we need to keep control of our pixel values so that our final analysis is justifiable. There are two main bit-related things that can go wrong when trying to store a pixel value in an image:
de: Der Hauptpunkt von {ref}`chap_pixels` ist, dass wir die Kontrolle über unsere Pixelwerte behalten müssen, damit unsere endgültige Analyse vertretbar ist. Es gibt zwei wichtige bit-bezogene Dinge, die schief gehen können, wenn man versucht, einen Pixelwert in einem Bild zu speichern:
pt_br: O ponto principal de {ref}`chap_pixels` é que precisamos manter o controle de nossos valores de pixel para que nossa análise final seja justificável. Existem duas coisas principais relacionadas a bits que podem dar errado ao tentar armazenar um valor de pixel em uma imagem:

source: **Clipping:** We try to store a number outside the range supported, so that the closest valid value is stored instead. For example, if we try to store -10 in an 8-bit unsigned integer image then the closest value we can actually store is 0. Similarly, if we try to store 500 then the closest valid value is 255.
de: **Beschneiden:** Wir versuchen, eine Zahl außerhalb des unterstützten Bereichs zu speichern, so dass stattdessen der nächstgelegene gültige Wert gespeichert wird. Wenn wir z. B. versuchen, -10 in einem 8-Bit-Ganzzahlbild ohne Vorzeichen zu speichern, ist der nächstgelegene Wert, den wir tatsächlich speichern können, 0. Wenn wir versuchen, 500 zu speichern, ist der nächstgelegene gültige Wert 255.
pt_br: **Recorte:** Tentamos armazenar um número fora do intervalo suportado, para que o valor válido mais próximo seja armazenado. Por exemplo, se tentarmos armazenar -10 em uma imagem inteira sem sinal de 8 bits, o valor mais próximo que podemos armazenar é 0. Da mesma forma, se tentarmos armazenar 500, o valor válido mais próximo será 255.

source: **Rounding:** We try to store a number that cannot be represented exactly, and so it must be rounded to the closest possible value. For example, if we want to store 6.4 in an 8-bit unsigned integer image then this is not possible; rather, we would need to store 6 instead.
de: **Rundung:** Wir versuchen, eine Zahl zu speichern, die nicht exakt dargestellt werden kann, und müssen sie daher auf den nächstmöglichen Wert runden. Wenn wir zum Beispiel 6,4 in einem 8-Bit-Ganzzahlbild ohne Vorzeichen speichern wollen, ist dies nicht möglich; stattdessen müssten wir 6 speichern.
pt_br: **Arredondamento:** Tentamos armazenar um número que não pode ser representado com exatidão e, portanto, deve ser arredondado para o valor mais próximo possível. Por exemplo, se quisermos armazenar 6,4 em uma imagem inteira sem sinal de 8 bits, isso não será possível; em vez disso, precisaríamos armazenar 6.

source: Data clipping
de: Datenbeschneidung
pt_br: Recorte de dados

source: Of the two problems, clipping is usually the more serious, as shown in {numref}`fig-bits_clipping`. A clipped image contains pixels with values equal to the maximum or minimum supported by that bit-depth, and it's no longer possible to tell what values those pixels *should* have. **The information is irretrievably lost.**
de: Von den beiden Problemen ist das Clipping in der Regel das schwerwiegendere, wie {numref}`fig-bits_clipping` zeigt. Ein beschnittenes Bild enthält Pixel mit Werten, die dem von der Bittiefe unterstützten Maximum oder Minimum entsprechen, und es ist nicht mehr möglich zu sagen, welche Werte diese Pixel haben *sollten*. **Die Information ist unwiederbringlich verloren.
pt_br: Dos dois problemas, o clipping é geralmente o mais sério, como mostrado em {numref}`fig-bits_clipping`. Uma imagem recortada contém pixels com valores iguais ao máximo ou mínimo suportado por aquela profundidade de bits, e não é mais possível dizer quais valores esses pixels *deveriam* ter. **A informação está irremediavelmente perdida.**

source: Clipping often occurs whenever an image is converted to have a lower bit-depth. During this conversion, not all the original pixel values may be preserved -- in which case they must be somehow transformed into the range permitted by the output bit-depth.
de: Clipping tritt häufig auf, wenn ein Bild in eine geringere Bittiefe konvertiert wird. Bei dieser Konvertierung bleiben möglicherweise nicht alle ursprünglichen Pixelwerte erhalten - in diesem Fall müssen sie irgendwie in den von der Ausgabe-Bittiefe erlaubten Bereich transformiert werden.
pt_br: O recorte geralmente ocorre sempre que uma imagem é convertida para ter uma profundidade de bits menor. Durante esta conversão, nem todos os valores originais dos pixels podem ser preservados - nesse caso eles devem ser de alguma forma transformados no intervalo permitido pela profundidade de bits de saída.

source: This transformation could simply involve clipping the unsupported values (usually very bad), or it could involve rescaling the pixel values first (usually less bad).
de: Bei dieser Umwandlung können die nicht unterstützten Werte einfach abgeschnitten werden (was in der Regel sehr schlecht ist), oder die Pixelwerte müssen zunächst neu skaliert werden (was in der Regel weniger schlecht ist).
pt_br: Essa transformação pode simplesmente envolver o recorte dos valores não suportados (geralmente muito ruins) ou pode envolver o redimensionamento dos valores de pixel primeiro (geralmente menos ruins).

source: Storing an image using a lower bit-depth, either by clipping or by scaling the values. The top row shows all images with the same minimum and maximum values to determine the contrast, while the second row shows shows the same images with the maximum set to the highest pixel value actually present (the images are the same, only the LUTs are different). The bottom rows show both a plot of the pixel values through the center of each image and histograms of all the image pixel values. One may infer that information has been lost in both of the 8-bit images, but more much horrifically when clipping was applied. Scaling squeezes the data into a narrow range, which might result in some rounding errors -- but most of the information remains intact, with the shapes of the profile plot and histogram remaining similar.
de: Speichern eines Bildes mit einer geringeren Bittiefe, entweder durch Beschneidung oder durch Skalierung der Werte. Die obere Reihe zeigt alle Bilder mit denselben Minimal- und Maximalwerten zur Bestimmung des Kontrasts, während die zweite Reihe dieselben Bilder zeigt, bei denen das Maximum auf den höchsten tatsächlich vorhandenen Pixelwert gesetzt wurde (die Bilder sind gleich, nur die LUTs sind unterschiedlich). Die unteren Reihen zeigen sowohl eine Darstellung der Pixelwerte durch die Mitte jedes Bildes als auch Histogramme aller Bildpixelwerte. Man kann daraus schließen, dass in beiden 8-Bit-Bildern Informationen verloren gegangen sind, aber noch viel mehr, als das Clipping angewendet wurde. Durch die Skalierung werden die Daten in einen engen Bereich gequetscht, was zu einigen Rundungsfehlern führen kann - die meisten Informationen bleiben jedoch erhalten, und die Formen des Profildiagramms und des Histogramms bleiben ähnlich.
pt_br: Armazenar uma imagem usando uma profundidade de bits menor, seja por recorte ou dimensionamento dos valores. A linha superior mostra todas as imagens com os mesmos valores mínimo e máximo para determinar o contraste, enquanto a segunda linha mostra as mesmas imagens com o máximo definido para o maior valor de pixel realmente presente (as imagens são iguais, apenas os LUTs são diferentes ). As linhas inferiores mostram um gráfico dos valores de pixel através do centro de cada imagem e histogramas de todos os valores de pixel da imagem. Pode-se inferir que a informação foi perdida em ambas as imagens de 8 bits, mas de forma ainda mais horrível quando o recorte foi aplicado. O dimensionamento comprime os dados em um intervalo estreito, o que pode resultar em alguns erros de arredondamento - mas a maior parte das informações permanece intacta, com as formas do gráfico de perfil e do histograma permanecendo semelhantes.

source: Clipping of high pixel values during acquisition is also called **saturation**.
de: Das Abschneiden von hohen Pixelwerten während der Aufnahme wird auch als **Sättigung** bezeichnet.
pt_br: O recorte de valores de pixel altos durante a aquisição também é chamado de **saturação**.

source: However, it's important to know that **clipping can already occur during image acquisition**. In fluorescence microscopy, this depends upon three main factors:
de: Es ist jedoch wichtig zu wissen, dass **das Clipping bereits während der Bildaufnahme** auftreten kann. In der Fluoreszenzmikroskopie hängt dies von drei Hauptfaktoren ab:
pt_br: No entanto, é importante saber que **o recorte já pode ocorrer durante a aquisição da imagem**. Na microscopia de fluorescência, isso depende de três fatores principais:

source: **The amount of light being emitted.** Because pixel values depend upon how much light is detected, a sample emitting very little light is less likely to require the ability to store very large values. Although it still *might* because of...
de: **Da die Pixelwerte davon abhängen, wie viel Licht erkannt wird, ist es unwahrscheinlich, dass eine Probe, die sehr wenig Licht aussendet, sehr große Werte speichern muss. Trotzdem *könnte* es wegen der...
pt_br: **A quantidade de luz emitida.** Como os valores dos pixels dependem da quantidade de luz detectada, é menos provável que uma amostra que emite muito pouca luz exija a capacidade de armazenar valores muito grandes. Embora ainda *poderia* por causa de...

source: **The gain of the microscope.** Quantifying very tiny amounts of light accurately has practical difficulties. A microscope’s gain effectively amplifies the amount of detected light to help overcome this before turning it into a pixel value (see {ref}`chap_microscope_types`). However, if the gain is too high, even a small number of detected photons could end up being over-amplified until clipping occurs.
de: **Die Verstärkung des Mikroskops.** Die genaue Quantifizierung sehr kleiner Lichtmengen ist in der Praxis schwierig. Die Verstärkung eines Mikroskops verstärkt die Menge des erfassten Lichts effektiv, um dieses Problem zu überwinden, bevor es in einen Pixelwert umgewandelt wird (siehe {ref}`chap_microscope_types`). Wenn die Verstärkung jedoch zu hoch ist, kann selbst eine kleine Anzahl von erkannten Photonen überverstärkt werden, bis es zu einer Übersteuerung kommt.
pt_br: **O ganho do microscópio.** Quantificar com precisão quantidades muito pequenas de luz apresenta dificuldades práticas. O ganho de um microscópio amplifica efetivamente a quantidade de luz detectada para ajudar a superar isso antes de transformá-la em um valor de pixel (consulte {ref}`chap_microscope_types`). No entanto, se o ganho for muito alto, mesmo um pequeno número de fótons detectados pode acabar sendo superamplificado até que ocorra o corte.

source: **The offset of the microscope.** This effectively acts as a constant being added to every pixel. If this is too high, or even negative, it can also push the pixels outside the permissible range.
de: **Der Offset des Mikroskops.** Dieser wirkt wie eine Konstante, die zu jedem Pixel addiert wird. Wenn dieser Wert zu hoch oder sogar negativ ist, kann er die Pixel auch außerhalb des zulässigen Bereichs verschieben.
pt_br: **O deslocamento do microscópio.** Isso atua efetivamente como uma constante sendo adicionada a cada pixel. Se for muito alto, ou mesmo negativo, também poderá empurrar os pixels para fora da faixa permitida.

source: Avoid clipping your data!
de: Vermeiden Sie die Beschneidung Ihrer Daten!
pt_br: Evite cortar seus dados!

source: If clipping occurs, we no longer know what is happening in the brightest or darkest parts of the image -- which can thwart any later analysis. Therefore **during image acquisition, any available controls should be adjusted to make sure clipping is avoided.**
de: Wenn es zu Überschneidungen kommt, wissen wir nicht mehr, was in den hellsten und dunkelsten Teilen des Bildes passiert, was jede spätere Analyse vereiteln kann. Daher sollten **während der Bildaufnahme alle verfügbaren Kontrollen angepasst werden, um sicherzustellen, dass Clipping vermieden wird.**
pt_br: Se ocorrer recorte, não saberemos mais o que está acontecendo nas partes mais claras ou mais escuras da imagem – o que pode impedir qualquer análise posterior. Portanto **durante a aquisição de imagens, quaisquer controles disponíveis devem ser ajustados para garantir que o recorte seja evitado.**

source: When acquiring an 8-bit unsigned integer image, is it fair to say your data is fine so long as your minimum pixel value is 0 and your maximum value is 255?
de: Kann man bei der Erfassung eines 8-Bit-Bildes mit vorzeichenloser Ganzzahl sagen, dass die Daten in Ordnung sind, solange der minimale Pixelwert 0 und der maximale Wert 255 beträgt?
pt_br: Ao adquirir uma imagem inteira não assinada de 8 bits, é justo dizer que seus dados estão corretos, desde que o valor mínimo de pixel seja 0 e o valor máximo seja 255?

source: No! At least, not really.
de: Nein! Zumindest nicht wirklich.
pt_br: Não! Pelo menos, não realmente.

source: You *cannot* store pixels outside the range 0–255. If your image contains pixels with either of those extreme values, *you cannot be certain whether or not clipping has occurred*. Therefore, you should ensure images you acquire do not contain any pixels with the most extreme values permitted by the image bit-depth. To be confident your 8-bit data is not clipped, the maximum range would be 1–254.
de: Sie *können* keine Pixel außerhalb des Bereichs 0-255 speichern. Wenn Ihr Bild Pixel mit einem dieser Extremwerte enthält, *können Sie nicht sicher sein, ob ein Clipping aufgetreten ist oder nicht*. Daher sollten Sie sicherstellen, dass Bilder, die Sie erwerben, keine Pixel mit den extremsten Werten enthalten, die die Bild-Bittiefe zulässt. Um sicher zu sein, dass Ihre 8-Bit-Daten nicht beschnitten sind, liegt der maximale Bereich bei 1-254.
pt_br: Você *não* pode armazenar pixels fora do intervalo de 0 a 255. Se a sua imagem contém pixels com qualquer um desses valores extremos, *você não pode ter certeza se ocorreu ou não recorte*. Portanto, você deve garantir que as imagens adquiridas não contenham pixels com os valores mais extremos permitidos pela profundidade de bits da imagem. Para ter certeza de que seus dados de 8 bits não serão cortados, o intervalo máximo seria de 1 a 254.

source: The bit-depth of an image is probably some multiple of 8, but the bit-depth that a [detector (e.g. CCD)](chap_microscope_types) can support might not be.
de: Die Bittiefe eines Bildes ist wahrscheinlich ein Vielfaches von 8, aber die Bittiefe, die ein [Detektor (z. B. CCD)](chap_microscope_types) unterstützen kann, ist es möglicherweise nicht.
pt_br: A profundidade de bits de uma imagem é provavelmente um múltiplo de 8, mas a profundidade de bits que um [detector (por exemplo, CCD)](chap_microscope_types) pode suportar pode não ser.
