Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/bit_depths.po
Languages: de, pt_br

source: Default Caption
de: Standard-Beschriftung
pt_br: Legenda padrão

source: Types & bit-depths
de: Typen und Bit-Tiefen
pt_br: Tipos e profundidades de bits

source: Chapter outline
de: Gliederung des Kapitels
pt_br: Esboço do capítulo

source: The **bit-depth** & **type** of an image determine what pixel values it can contain
de: Die **Bit-Tiefe** und der **Typ** eines Bildes bestimmen, welche Pixelwerte es enthalten kann
pt_br: A **profundidade de bits** e o **tipo** de uma imagem determinam quais valores de pixel ela pode conter

source: An image with a **higher bit-depth** can (potentially) contain **more information**
de: Ein Bild mit einer **höheren Bit-Tiefe** kann (potenziell) **mehr Informationen** enthalten
pt_br: Uma imagem com **maior profundidade de bits** pode (potencialmente) conter **mais informações**

source: During acquisition, most images have the type **unsigned integer**
de: Während der Erfassung haben die meisten Bilder den Typ **Ganzzahl ohne Vorzeichen**
pt_br: Durante a aquisição, a maioria das imagens tem o tipo **inteiro não assinado**

source: During processing, it's often better to use **floating point** types
de: Bei der Verarbeitung ist es oft besser, **Fließkomma**-Typen zu verwenden
pt_br: Durante o processamento, geralmente é melhor usar tipos de **ponto flutuante**

source: Attempting to store values outside the range permitted by the type & bit-depth leads to **clipping** -- which is usually **very bad indeed**
de: Der Versuch, Werte außerhalb des vom Typ und der Bittiefe erlaubten Bereichs zu speichern, führt zum **Abschneiden** - was normalerweise **sehr schlecht ist**.
pt_br: A tentativa de armazenar valores fora do intervalo permitido pelo tipo e profundidade de bits leva ao **recorte** - o que geralmente é **muito ruim, de fato**

source: Introduction
de: Einführung
pt_br: Introdução

source: As described in {ref}`chap_pixels`, each pixel has a numerical value – but a pixel cannot typically have just *any* numerical value it likes. Instead, it works under the constraints of the image **type** and **bit-depth**.
de: Wie in {ref}`chap_pixels` beschrieben, hat jedes Pixel einen numerischen Wert - aber ein Pixel kann normalerweise nicht einfach *jeden* numerischen Wert haben, den es will. Stattdessen arbeitet es unter den Beschränkungen des Bildes **Typ** und **Bit-Tiefe**.
pt_br: Conforme descrito em {ref}`chap_pixels`, cada pixel tem um valor numérico – mas um pixel normalmente não pode ter *qualquer* valor numérico que desejar. Em vez disso, ele funciona sob as restrições do **tipo** e da **profundidade de bits** da imagem.

source: Ultimately the pixels are stored in some binary format: a sequence of **bits** (**bi**nary digi**ts**), i.e. ones and zeros. The bit-depth determines how many of these ones and zeros are available to store each pixel. The type determines how these bits are interpreted.
de: Letztendlich werden die Pixel in einem binären Format gespeichert: eine Folge von **Bits** (**bi**näre Digi**ts**), d. h. Einsen und Nullen. Die Bittiefe bestimmt, wie viele dieser Einsen und Nullen zur Speicherung jedes Pixels zur Verfügung stehen. Der Typ bestimmt, wie diese Bits interpretiert werden.
pt_br: Em última análise, os pixels são armazenados em algum formato binário: uma sequência de **bits** (**bi**digi**ts**), ou seja, uns e zeros. A profundidade de bits determina quantos desses uns e zeros estão disponíveis para armazenar cada pixel. O tipo determina como esses bits são interpretados.

source: Representing numbers with bits
de: Darstellung von Zahlen mit Bits
pt_br: Representando números com bits

source: Bob devising his code.
de: Bob entwirft seinen Code.
pt_br: Bob elaborando seu código.

source: Suppose Bob is developing a secret code to store numbers, but in which he is only allowed to write ones and zeros. If he is only allowed a single one or zero (i.e. a single bit), he doesn't have many options.
de: Nehmen wir an, Bob entwickelt einen Geheimcode zum Speichern von Zahlen, in den er aber nur Einsen und Nullen schreiben darf. Wenn er nur eine einzige Eins oder Null (d. h. ein einziges Bit) schreiben darf, hat er nicht viele Möglichkeiten.
pt_br: Suponha que Bob esteja desenvolvendo um código secreto para armazenar números, mas no qual ele só pode escrever uns e zeros. Se ele só tiver permissão para um ou zero (ou seja, um único bit), ele não terá muitas opções.

source: Assuming he wants his encoded numbers to be consecutive integers starting from zero, this means he can only represent two different numbers: one and zero.
de: Angenommen, er möchte, dass seine kodierten Zahlen aufeinanderfolgende ganze Zahlen sind, die bei Null beginnen, bedeutet dies, dass er nur zwei verschiedene Zahlen darstellen kann: Eins und Null.
pt_br: Supondo que ele queira que seus números codificados sejam inteiros consecutivos começando em zero, isso significa que ele só pode representar dois números diferentes: um e zero.

source: If he is allowed an extra bit, suddenly he can represent 4 numbers by combining the ones and zeros differently.
de: Wenn ihm ein zusätzliches Bit zugestanden wird, kann er plötzlich 4 Zahlen darstellen, indem er die Einsen und Nullen unterschiedlich kombiniert.
pt_br: Se lhe for permitido um bit extra, de repente ele poderá representar 4 números combinando uns e zeros de maneira diferente.

source: Clearly, the more bits Bob is allowed, the more unique combinations he can have -- and therefore the more different numbers he can represent in his code.
de: Je mehr Bits Bob zur Verfügung stehen, desto mehr einzigartige Kombinationen kann er haben - und desto mehr verschiedene Zahlen kann er in seinem Code darstellen.
pt_br: Claramente, quanto mais bits são permitidos a Bob, mais combinações exclusivas ele pode ter - e, portanto, mais números diferentes ele pode representar em seu código.

source: With 8 bits are his disposal, Bob can combine the bits in 256 different ways to represent 256 different numbers.
de: Mit 8 Bits, die ihm zur Verfügung stehen, kann Bob die Bits auf 256 verschiedene Arten kombinieren, um 256 verschiedene Zahlen darzustellen.
pt_br: Com 8 bits à sua disposição, Bob pode combinar os bits de 256 maneiras diferentes para representar 256 números diferentes.

source: The pixel values in an image are stored using a code just like this. Each possible value is represented in binary as a unique combination of bits.
de: Die Pixelwerte in einem Bild werden mit einem solchen Code gespeichert. Jeder mögliche Wert wird im Binärformat als eindeutige Kombination von Bits dargestellt.
pt_br: Os valores de pixel em uma imagem são armazenados usando um código como este. Cada valor possível é representado em binário como uma combinação única de bits.

source: Image bit-depth
de: Bild-Bit-Tiefe
pt_br: Profundidade de bits da imagem

source: The **bit-depth** of an image is the number of bits used to represent each pixel. A bit-depth of 8 would indicate that 8 bits are used to represent a single pixel value.
de: Die **Bit-Tiefe** eines Bildes ist die Anzahl der Bits, die zur Darstellung jedes Pixels verwendet werden. Eine Bittiefe von 8 würde bedeuten, dass 8 Bits verwendet werden, um einen einzelnen Pixelwert darzustellen.
pt_br: A **profundidade de bits** de uma imagem é o número de bits usados para representar cada pixel. Uma profundidade de bits de 8 indicaria que 8 bits são usados para representar um único valor de pixel.

source: The bit-depth imposes a limit upon the pixel values that are possible. A lower bit-depth implies that fewer different pixel values are available, which can result in an image that contains less information.
de: Die Bittiefe legt eine Grenze für die möglichen Pixelwerte fest. Eine geringere Bittiefe bedeutet, dass weniger verschiedene Pixelwerte zur Verfügung stehen, was zu einem Bild führen kann, das weniger Informationen enthält.
pt_br: A profundidade de bits impõe um limite aos valores de pixel possíveis. Uma profundidade de bits menor implica que menos valores de pixel diferentes estão disponíveis, o que pode resultar em uma imagem que contém menos informações.

source: Representing an image using different bit-depths.
de: Darstellung eines Bildes mit unterschiedlichen Bittiefen.
pt_br: Representando uma imagem usando diferentes profundidades de bits.

source: As shown in {numref}`fig-bit_depths_demo`, a 1-bit image can contain only two values: here, shown as black or white pixels. Such **binary images** are extremely limited in the information that they can contain, although will turn out to be [very useful later](chap_thresholding) when processing images.
de: Wie in {numref}`fig-bit_depths_demo` gezeigt, kann ein 1-Bit-Bild nur zwei Werte enthalten: hier dargestellt als schwarze oder weiße Pixel. Solche **Binärbilder** sind hinsichtlich der Informationen, die sie enthalten können, äußerst begrenzt, obwohl sie sich später bei der Bildverarbeitung als [sehr nützlich](chap_thresholding) erweisen werden.
pt_br: Conforme mostrado em {numref}`fig-bit_profundidades_demo`, uma imagem de 1 bit pode conter apenas dois valores: aqui, mostrados como pixels pretos ou brancos. Essas **imagens binárias** são extremamente limitadas nas informações que podem conter, embora venham a ser [muito úteis mais tarde](chap_thresholding) ao processar imagens.

source: A 2-bit image is not much better, containing at most only 4 different values. A 4-bit image can have 16 values. When visualized with a grayscale LUT, this is a substantial improvement. In fact, the eye is not particularly good at distinguishing different shades of gray -- making it difficult to see much difference between a 4-bit and 8-bit image. However, the histograms reveal that the 8-bit image contains more fine-grained information.
de: Ein 2-Bit-Bild ist nicht viel besser, es enthält höchstens 4 verschiedene Werte. Ein 4-Bit-Bild kann 16 Werte enthalten. Bei der Visualisierung mit einer Graustufen-LUT ist dies eine wesentliche Verbesserung. Tatsächlich ist das Auge nicht besonders gut in der Lage, verschiedene Grautöne zu unterscheiden, so dass es schwierig ist, einen großen Unterschied zwischen einem 4-Bit- und einem 8-Bit-Bild zu erkennen. Aus den Histogrammen geht jedoch hervor, dass das 8-Bit-Bild mehr feinkörnige Informationen enthält.
pt_br: Uma imagem de 2 bits não é muito melhor, contendo no máximo apenas 4 valores diferentes. Uma imagem de 4 bits pode ter 16 valores. Quando visualizado com uma LUT em tons de cinza, esta é uma melhoria substancial. Na verdade, o olho não é particularmente bom em distinguir diferentes tons de cinza – tornando difícil ver muita diferença entre uma imagem de 4 e 8 bits. No entanto, os histogramas revelam que a imagem de 8 bits contém informações mais refinadas.

source: In practice, computers tend to work with groups of 8 bits, with each group of 8 bits known as a **byte**. Microscopes that acquire 8-bit images are still reasonably common, and these permit 2<sup>8</sup> = 256 different pixel values, which fall in the range 0–255. The next step up is a 16-bit image, which can contain 2<sup>16</sup> = 65536 values: a dramatic improvement (0–65535).
de: In der Praxis arbeiten Computer meist mit Gruppen von 8 Bits, wobei jede Gruppe von 8 Bits als **Byte** bezeichnet wird. Mikroskope, die 8-Bit-Bilder aufnehmen, sind immer noch recht verbreitet, und diese erlauben 2<sup>8</sup> = 256 verschiedene Pixelwerte, die in den Bereich 0-255 fallen. Die nächste Stufe ist ein 16-Bit-Bild, das 2<sup>16</sup> = 65536 Werte enthalten kann: eine dramatische Verbesserung (0-65535).
pt_br: Na prática, os computadores tendem a trabalhar com grupos de 8 bits, sendo cada grupo de 8 bits conhecido como **byte**. Microscópios que adquirem imagens de 8 bits ainda são razoavelmente comuns e permitem 2<sup>8</sup> = 256 valores de pixels diferentes, o que cair no intervalo 0–255. A próxima etapa é uma imagem de 16 bits, que pode conter 2<sup>16</sup> = 65536 valores: uma melhoria dramática ( 0–65535).

source: Question
de: Frage
pt_br: Pergunta

source: What impact would you expect bit-depth to have on the file size of a saved image?
de: Welche Auswirkungen hat die Bittiefe auf die Dateigröße eines gespeicherten Bildes?
pt_br: Que impacto você esperaria que a profundidade de bits tivesse no tamanho do arquivo de uma imagem salva?

source: For example, would you expect an 8-bit image to have a larger, smaller or (roughly) equivalent file size to a 16-bit image of the same scene? You can assume the two images have the same number of pixels.
de: Würden Sie zum Beispiel erwarten, dass ein 8-Bit-Bild eine größere, kleinere oder (ungefähr) gleiche Dateigröße hat wie ein 16-Bit-Bild der gleichen Szene? Sie können davon ausgehen, dass die beiden Bilder die gleiche Anzahl von Pixeln haben.
pt_br: Por exemplo, você esperaria que uma imagem de 8 bits tivesse um tamanho de arquivo maior, menor ou (aproximadamente) equivalente a uma imagem de 16 bits da mesma cena? Você pode assumir que as duas imagens têm o mesmo número de pixels.

source: Answer
de: Antwort
pt_br: Responder

source: In general, the file size required to store an image is expected to be higher with a higher bit-depth.
de: Im Allgemeinen wird die für die Speicherung eines Bildes erforderliche Dateigröße bei einer höheren Bittiefe höher ausfallen.
pt_br: Em geral, espera-se que o tamanho do arquivo necessário para armazenar uma imagem seja maior com uma profundidade de bits maior.

source: Assuming that the image isn't [compressed](sec_files_compression), a 16-bit image would require roughly twice as much storage space as a corresponding 8-bit image.
de: Unter der Annahme, dass das Bild nicht [komprimiert] ist (sec_files_compression), würde ein 16-Bit-Bild etwa doppelt so viel Speicherplatz benötigen wie ein entsprechendes 8-Bit-Bild.
pt_br: Supondo que a imagem não esteja [compactada](sec_files_compression), uma imagem de 16 bits exigiria aproximadamente o dobro de espaço de armazenamento que uma imagem correspondente de 8 bits.

source: If you have a 1024 x 1024 pixel image that is 8-bit, that should take roughly 1 MB to store. The corresponding 16-bit image would require approximately 2 MB.
de: Wenn Sie ein 1024 x 1024 Pixel großes 8-Bit-Bild haben, sollte es etwa 1 MB zum Speichern benötigen. Das entsprechende 16-Bit-Bild würde etwa 2 MB benötigen.
pt_br: Se você tiver uma imagem de 1024 x 1024 pixels de 8 bits, isso deverá levar aproximadamente 1 MB para armazenar. A imagem correspondente de 16 bits exigiria aproximadamente 2 MB.

source: Image type
de: Bildtyp
pt_br: Tipo de imagem

source: At this point, you might be wondering: what about fractions? Or negative numbers?
de: An dieser Stelle fragen Sie sich vielleicht: Was ist mit Brüchen? Oder mit negativen Zahlen?
pt_br: Neste ponto, você deve estar se perguntando: e as frações? Ou números negativos?

source: In reality, the bit-depth is only part of the story. The **type** of the image is what determines how the bits are interpreted.
de: In Wirklichkeit ist die Bit-Tiefe nur ein Teil der Geschichte. Der **Typ** des Bildes bestimmt, wie die Bits interpretiert werden.
pt_br: Na realidade, a profundidade de bits é apenas parte da história. O **tipo** da imagem é o que determina como os bits são interpretados.

source: Until now, we have assumed that 8 bits would be used to represent whole numbers in the range 0 -- 255, because we have 2<sup>8</sup> = 256 different combinations of 8 bits. This is an **unsigned integer** representation.
de: Bisher sind wir davon ausgegangen, dass 8 Bits verwendet werden, um ganze Zahlen im Bereich von 0 bis 255 darzustellen, da wir 2<sup>8</sup> = 256 verschiedene Kombinationen von 8 Bits haben. Dies ist eine **ganzzahlige Darstellung ohne Vorzeichen**.
pt_br: Até agora, presumimos que 8 bits seriam usados para representar números inteiros no intervalo de 0 a 255, porque temos 2<sup>8 </sup> = 256 combinações diferentes de 8 bits. Esta é uma representação de **número inteiro sem sinal**.

source: But suppose we dedicate one of our bits to represent whether the number should be interpreted as positive or negative, with the remaining seven bits providing the magnitude of the number. An image using this approach has the type **signed integer**. Typically, an 8-bit signed integer can be in the range -128 -- 127. Including 0, that still leaves 256 distinct possibilities.
de: Nehmen wir jedoch an, dass wir eines unserer Bits dafür verwenden, um darzustellen, ob die Zahl als positiv oder negativ zu interpretieren ist, während die verbleibenden sieben Bits den Betrag der Zahl angeben. Ein Bild mit diesem Ansatz hat den Typ **Ganzzahl mit Vorzeichen**. Normalerweise kann eine 8-Bit-Ganzzahl mit Vorzeichen im Bereich von -128 bis 127 liegen. Einschließlich 0 bleiben immer noch 256 verschiedene Möglichkeiten.
pt_br: Mas suponha que dedicamos um dos nossos bits para representar se o número deve ser interpretado como positivo ou negativo, com os sete bits restantes fornecendo a magnitude do número. Uma imagem usando essa abordagem tem o tipo **inteiro assinado**. Normalmente, um número inteiro assinado de 8 bits pode estar no intervalo -128 - 127. Incluindo 0, isso ainda deixa 256 possibilidades distintas.

source: Although the images we acquire are normally composed of unsigned integers, we will later explore the immense benefits of processing operations such as averaging or subtracting pixel values, in which case the resulting pixels may be negative or contain fractional parts. **Floating point** type images make it possible to store these new, not-necessarily-integer values in an efficient way. That can be important, because we could lose a lot of information if we always had to round pixel values to integers.
de: Obwohl die Bilder, die wir aufnehmen, normalerweise aus ganzen Zahlen ohne Vorzeichen bestehen, werden wir später die immensen Vorteile von Verarbeitungsvorgängen wie der Mittelwertbildung oder der Subtraktion von Pixelwerten erkunden, bei denen die resultierenden Pixel negativ sein oder Bruchteile enthalten können. Bilder vom Typ **Fließkomma** ermöglichen es, diese neuen, nicht notwendigerweise ganzzahligen Werte auf effiziente Weise zu speichern. Das kann wichtig sein, denn wir könnten viele Informationen verlieren, wenn wir die Pixelwerte immer auf ganze Zahlen runden müssten.
pt_br: Embora as imagens que adquirimos sejam normalmente compostas de números inteiros sem sinal, exploraremos mais tarde os imensos benefícios das operações de processamento, como calcular a média ou subtrair valores de pixels, caso em que os pixels resultantes podem ser negativos ou conter partes fracionárias. Imagens do tipo **ponto flutuante** possibilitam armazenar esses novos valores, não necessariamente inteiros, de maneira eficiente. Isso pode ser importante, porque poderíamos perder muitas informações se sempre tivéssemos que arredondar os valores dos pixels para números inteiros.

source: Floating point images also allow us to store three special values: $+\infty$, $-\infty$ and `NaN`. The last of these stands for *Not a Number*, and can represent a missing or impossible value, e.g. the result of 0/0.
de: Bei Fließkommabildern können wir auch drei spezielle Werte speichern: $+\infty$, $-\infty$ und `NaN`. Letzteres steht für *Nicht eine Zahl* und kann einen fehlenden oder unmöglichen Wert darstellen, z. B. das Ergebnis von 0/0.
pt_br: Imagens de ponto flutuante também nos permitem armazenar três valores especiais: $+\infty$, $-\infty$ e `NaN`. O último deles significa *Not a Number* e pode representar um valor ausente ou impossível, por exemplo. o resultado de 0/0.

source: Key message
de: Kernaussage
pt_br: Mensagem chave

source: The bit-depth and type of an image determine what pixel values are possible.
de: Die Bit-Tiefe und der Typ eines Bildes bestimmen, welche Pixelwerte möglich sind.
pt_br: A profundidade de bits e o tipo de uma imagem determinam quais valores de pixel são possíveis.

source: How & why points can float
de: Wie und warum Punkte schweben können
pt_br: Como e por que os pontos podem flutuar

source: Floating point pixel values have variable precision depending upon whether they are representing very small or very large numbers.
de: Fließkomma-Pixelwerte haben eine unterschiedliche Genauigkeit, je nachdem, ob sie sehr kleine oder sehr große Zahlen darstellen.
pt_br: Os valores de pixel de ponto flutuante têm precisão variável dependendo se representam números muito pequenos ou muito grandes.

source: Representing a number in binary using floating point is analogous to writing it out in standard form, i.e. something like 3.14×10<sup>8</sup>, which may be written as 3.14e8. In this case, we have managed to represent 314000000 using only 4 digits: 314 and 8 (the 10 is already baked in to the representation).
de: Die Darstellung einer Zahl im Binärformat unter Verwendung von Fließkommazahlen ist analog zur Darstellung in der Standardform, d. h. etwa 3,14×10<sup>8</sup>, was als 3,14e8 geschrieben werden kann. In diesem Fall haben wir es geschafft, 314000000 mit nur 4 Ziffern darzustellen: 314 und 8 (die 10 ist bereits in der Darstellung enthalten).
pt_br: Representar um número em binário usando ponto flutuante é análogo a escrevê-lo no formato padrão, ou seja, algo como 3,14×10<sup>8</sup>, que pode ser escrito como 3.14e8. Neste caso, conseguimos representar 314000000 usando apenas 4 dígitos: 314 e 8 (o 10 já está incorporado na representação).

source: In the binary case, the form is more properly something like ± 2<sup>**M**</sup>×N: we have one bit devoted to the sign, a fixed number of additional bits for the exponent *M*, and the rest to the main number *N* (called the fraction).
de: Im binären Fall ist die Form eher etwas wie ± 2<sup>**M**</sup>×N: ein Bit ist dem Vorzeichen gewidmet, eine feste Anzahl zusätzlicher Bits dem Exponenten *M* und der Rest der Hauptzahl *N* (genannt Bruch).
pt_br: No caso binário, a forma é mais apropriadamente algo como ± 2<sup>**M**</sup>×N: temos um bit dedicado ao sinal, um número fixo de bits adicionais para o expoente *M* e o restante para o número principal *N* (chamado de fração).

source: A 32-bit floating point number typically uses 1 bit for the sign, 8 bits for the exponent and 23 bits for the fraction, allowing us to store a very wide range of positive and negative numbers. A 64-bit floating point number uses 1 bit for the sign, 11 bits for the exponent and 52 for the fraction, thereby allowing both an even wider range and greater precision. But again these require more storage space than 8- and 16-bit images.
de: Bei einer 32-Bit-Gleitkommazahl wird in der Regel 1 Bit für das Vorzeichen, 8 Bit für den Exponenten und 23 Bit für den Bruch verwendet, so dass ein sehr großer Bereich von positiven und negativen Zahlen gespeichert werden kann. Bei einer 64-Bit-Gleitkommazahl wird 1 Bit für das Vorzeichen, 11 Bit für den Exponenten und 52 Bit für den Bruch verwendet, was sowohl einen noch größeren Bereich als auch eine höhere Präzision ermöglicht. Aber auch hier wird mehr Speicherplatz benötigt als bei 8- und 16-Bit-Bildern.
pt_br: Um número de ponto flutuante de 32 bits normalmente usa 1 bit para o sinal, 8 bits para o expoente e 23 bits para a fração, o que nos permite armazenar uma ampla gama de números positivos e negativos. Um número de ponto flutuante de 64 bits usa 1 bit para o sinal, 11 bits para o expoente e 52 para a fração, permitindo assim um intervalo ainda mais amplo e maior precisão. Mas, novamente, elas exigem mais espaço de armazenamento do que imagens de 8 e 16 bits.

source: Common image types & bit-depths
de: Gängige Bildtypen und Bit-Tiefen
pt_br: Tipos de imagens comuns e profundidade de bits
