Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/python.po
Languages: es, pt_br

source: Python: Types & bit-depths
es: Python: Tipos y profundidad de bits
pt_br: Python: tipos e profundidade de bits

source: In this section, we will explore how bit-depths and image types are represented in Python. We'll look in particular at where things can go wrong when converting between bit-depths, and how to apply the tricks from previous chapters to identify problems.
es: En esta sección exploraremos cómo se representan en Python las profundidades de bits y los tipos de imagen. Veremos en particular dónde pueden salir mal las cosas al convertir entre profundidades de bits, y cómo aplicar los trucos de los capítulos anteriores para identificar problemas.
pt_br: Nesta seção, exploraremos como a profundidade de bits e os tipos de imagem são representados em Python. Veremos em particular onde as coisas podem dar errado ao converter entre profundidades de bits e como aplicar os truques dos capítulos anteriores para identificar problemas.

source: Bit-depths and dtype
es: Profundidad de bits y dtype
pt_br: Profundidades de bits e dtype

source: The bit-depth of a **NumPy array** is encoded in its **data type** - or **dtype** for short.
es: La profundidad de bits de una matriz **NumPy** está codificada en su **tipo de datos** - o **tipo de datos** para abreviar.
pt_br: A profundidade de bits de uma **matriz NumPy** é codificada em seu **tipo de dados** - ou **dtype** para abreviar.

source: ImageJ is focussed on on 8-bit and 16-bit unsigned integer images, as well as 32-bit floating point images.
es: ImageJ se centra en imágenes de enteros sin signo de 8 y 16 bits, así como en imágenes de coma flotante de 32 bits.
pt_br: ImageJ é focado em imagens inteiras não assinadas de 8 e 16 bits, bem como em imagens de ponto flutuante de 32 bits.

source: NumPy, on the other hand, offers a much wider range of data types. The code for a Numpy dtype isn't hard to crack, with a `uint` standing for 'unsigned integer' and `float` for floating-point.
es: NumPy, por otro lado, ofrece una gama mucho más amplia de tipos de datos. El código para un tipo de dato Numpy no es difícil de descifrar, con `uint` para 'entero sin signo' y `float` para punto flotante.
pt_br: O NumPy, por outro lado, oferece uma gama muito mais ampla de tipos de dados. O código para um dtype Numpy não é difícil de decifrar, com `uint` significando 'inteiro não assinado' e `float` para ponto flutuante.

source: Type
es: Tipo
pt_br: Tipo

source: Bit-depth
es: Profundidad de bits
pt_br: Profundidade de bits

source: dtype
pt_br: tipo d

source: Unsigned integer
es: Entero sin signo
pt_br: Inteiro não assinado

source: Signed integer
es: Entero con signo
pt_br: Inteiro assinado

source: Floating point
es: Punto flotante
pt_br: Ponto flutuante

source: The `dtype` for any array is easy to check:
es: El `dtype` de cualquier array es fácil de comprobar:
pt_br: O `dtype` para qualquer array é fácil de verificar:

source: We can print some basic statistics, as before. In particular, we can check that the minimum and maximum values fall inside the expected range.
es: Podemos imprimir algunas estadísticas básicas, como antes. En particular, podemos comprobar que los valores mínimo y máximo están dentro del intervalo esperado.
pt_br: Podemos imprimir algumas estatísticas básicas, como antes. Em particular, podemos verificar se os valores mínimo e máximo estão dentro do intervalo esperado.

source: Fun with float32
es: Diversión con float32
pt_br: Diversão com float32

source: If we want to change the type, that is easy to do as well.
es: Si queremos cambiar el tipo, también es fácil hacerlo.
pt_br: Se quisermos alterar o tipo, isso também é fácil de fazer.

source: This makes use of the line `import numpy as np` to give us access to more NumPy properties & functions.
es: Esto hace uso de la línea `import numpy as np` para darnos acceso a más propiedades y funciones de NumPy.
pt_br: Isso faz uso da linha `import numpy as np` para nos dar acesso a mais propriedades e funções do NumPy.

source: This should convert our image into 32-bit floating point.
es: Esto debería convertir nuestra imagen en coma flotante de 32 bits.
pt_br: Isso deve converter nossa imagem em ponto flutuante de 32 bits.

source: However, when trying out a new command it is always a good idea to check it does what was expected. We can do that by showing the image and printing statistics again.
es: Sin embargo, cuando se prueba un nuevo comando siempre es una buena idea comprobar que hace lo que se esperaba. Podemos hacerlo mostrando la imagen e imprimiendo de nuevo las estadísticas.
pt_br: Porém, ao experimentar um novo comando é sempre uma boa ideia verificar se ele faz o que era esperado. Podemos fazer isso mostrando a imagem e imprimindo as estatísticas novamente.

source: That looks fine to me, but let's be extra careful and have NumPy check if the values are really identical.
es: A mí me parece bien, pero seamos muy cuidadosos y hagamos que NumPy compruebe si los valores son realmente idénticos.
pt_br: Isso parece bom para mim, mas vamos ser extremamente cuidadosos e fazer com que o NumPy verifique se os valores são realmente idênticos.

source: One way we might do that is with `==`.
es: Una forma de hacerlo es con `==`.
pt_br: Uma maneira de fazer isso é com `==`.

source: Hmmm, that looks quite convincing - it gives us an image that has either `True` or `False` for every single pixel. But because of the limits of what is printing, it really only shows that the pixels at the corners of our image match.
es: Hmmm, parece bastante convincente - nos da una imagen que tiene `Verdadero` o `Falso` para cada píxel. Pero debido a los límites de lo que se imprime, en realidad sólo muestra que los píxeles de las esquinas de nuestra imagen coinciden.
pt_br: Hmmm, isso parece bastante convincente - nos dá uma imagem que tem `True` ou `False` para cada pixel. Mas devido aos limites do que é impresso, isso realmente mostra apenas que os pixels nos cantos da nossa imagem correspondem.

source: If we want to ensure that *all* pixels are the same, we can use `np.all`
es: Si queremos asegurarnos de que *todos* los píxeles son iguales, podemos utilizar `np.all`.
pt_br: Se quisermos garantir que *todos* os pixels sejam iguais, podemos usar `np.all`

source: **Success!**
es: **¡Éxito!**
pt_br: **Sucesso!**

source: But... skepticism belongs in science - particularly in image analysis - and it's always worth testing things from multiple angles, just in case. So let's check the statistics as well:
es: Pero... el escepticismo es propio de la ciencia -sobre todo del análisis de imágenes- y siempre merece la pena comprobar las cosas desde varios ángulos, por si acaso. Así que comprobemos también las estadísticas:
pt_br: Mas... o ceticismo pertence à ciência - particularmente à análise de imagens - e sempre vale a pena testar as coisas de vários ângulos, só para garantir. Então, vamos verificar as estatísticas também:

source: Uh-oh... that was unexpected.
es: Uh-oh... eso fue inesperado.
pt_br: Uh-oh... isso foi inesperado.

source: **Somehow, we have two images with exactly the same pixel values - and yet they have a different mean value??!**
es: **De alguna manera, tenemos dos imágenes con exactamente los mismos valores de píxeles y, sin embargo, tienen un valor medio diferente.
pt_br: **De alguma forma, temos duas imagens com exatamente os mesmos valores de pixel - e ainda assim elas têm um valor médio diferente??!**

source: It doesn't seem to make sense. We need to investigate by printing the actual values:
es: No parece tener sentido. Tenemos que investigar imprimiendo los valores reales:
pt_br: Não parece fazer sentido. Precisamos investigar imprimindo os valores reais:

source: Ok, so the means are actually very very close - and we need to go a long way after the decimal point before there is a difference.
es: De acuerdo, las medias están muy muy próximas, y tenemos que ir mucho más allá del punto decimal para que haya una diferencia.
pt_br: Ok, então as médias são na verdade muito próximas - e precisamos percorrer um longo caminho após a vírgula antes que haja uma diferença.

source: This is an example of a **precision error**.
es: Este es un ejemplo de **error de precisión**.
pt_br: Este é um exemplo de **erro de precisão**.

source: Precisions errors are common when coding, and we need to always be on our guard against them. They can occur in the midst of calculations because intermediate results aren't stored with perfect precision, but rather rounded to a value that is close.
es: Los errores de precisión son habituales al programar, y debemos estar siempre en guardia contra ellos. Pueden producirse en medio de los cálculos porque los resultados intermedios no se almacenan con una precisión perfecta, sino que se redondean a un valor cercano.
pt_br: Erros de precisão são comuns durante a codificação e precisamos estar sempre atentos contra eles. Eles podem ocorrer no meio de cálculos porque os resultados intermediários não são armazenados com precisão perfeita, mas sim arredondados para um valor próximo.

source: This happens both with integer and floating-point types - but of course it is more severe when working with integers. As an illustration using decimal values (since it's harder for most of us to think in binary), let's consider dividing a number by 3 and then multiplying the result by 3. Mathematically, we *should* get the same result.
es: Esto ocurre tanto con los tipos enteros como con los de coma flotante, pero, por supuesto, es más grave cuando se trabaja con enteros. Para ilustrarlo con valores decimales (ya que para la mayoría de nosotros es más difícil pensar en binario), dividamos un número por 3 y multipliquemos el resultado por 3. Matemáticamente, *deberíamos* obtener el mismo resultado.
pt_br: Isso acontece tanto com tipos inteiros quanto com pontos flutuantes - mas é claro que é mais grave quando se trabalha com números inteiros. Como ilustração usando valores decimais (já que é mais difícil para a maioria de nós pensar em binário), vamos considerar dividir um número por 3 e depois multiplicar o resultado por 3. Matematicamente, *deveríamos* obter o mesmo resultado.

source: However, if we do our calculations using only with integers we instead see
es: Sin embargo, si realizamos nuestros cálculos utilizando únicamente números enteros, veremos que
pt_br: No entanto, se fizermos nossos cálculos usando apenas números inteiros, veremos

source: \begin{align} \frac{10}{3} & \approx 3 \\ \\ 3 \times 3 & = 9 \end{align}
es: \COMENZAR{align} \frac{10}{3} &amp; \approx 3 \frac \\ 3 veces 3 &amp; = 9 \fin{align}
pt_br: \begin{align} \frac{10}{3} & \aproximadamente 3 \\ \\ 3 \vezes 3 & = 9 \end{align}

source: On the other hand, if we use floating point (to three decimal places for illustration) we would get
es: Por otro lado, si utilizamos coma flotante (con tres decimales para ilustrar) obtendríamos
pt_br: Por outro lado, se usarmos ponto flutuante (com três casas decimais para ilustração), obteríamos

source: \begin{align} \frac{10}{3} & \approx 3.333 \\ \\ 3.333 \times 3 & = 9.999 \end{align}
es: \COMENZAR{align} \frac{10}{3} &amp; \approx 3.333 \frac \\ 3.333 veces 3 &amp; = 9.999 \fin{align}
pt_br: \begin{align} \frac{10}{3} & \aproximadamente 3,333 \\ \\ 3,333 \vezes 3 & = 9,999 \end{align}

source: *Neither* gives the mathematically 'correct' final result of 10, because of the precision errors.
es: *Ninguno* da el resultado final matemáticamente "correcto" de 10, debido a los errores de precisión.
pt_br: *Nenhum dos dois* fornece o resultado final matematicamente 'correto' de 10, devido aos erros de precisão.

source: Consequently, rather than checking whether non-integer values are identical with one another by using `==`, we often need to check if they are very close to one another. We can use `np.allclose` for that.
es: En consecuencia, en lugar de comprobar si los valores no enteros son idénticos entre sí utilizando `==`, a menudo necesitamos comprobar si están muy próximos entre sí. Para ello podemos utilizar `np.allclose`.
pt_br: Consequentemente, em vez de verificar se os valores não inteiros são idênticos entre si usando `==`, muitas vezes precisamos verificar se eles estão muito próximos um do outro. Podemos usar `np.allclose` para isso.

source: Towards 8-bit
es: Hacia los 8 bits
pt_br: Em direção a 8 bits

source: Previously, we had an image with a low bit depth and we increased the bit-depth. This was fine.
es: Anteriormente, teníamos una imagen con una profundidad de bits baja y aumentamos la profundidad de bits. Esto estaba bien.
pt_br: Anteriormente, tínhamos uma imagem com profundidade de bits baixa e aumentamos a profundidade de bits. Isso foi bom.

source: Time now to go the opposite direction, and again check that it works.
es: Ahora es el momento de ir en la dirección opuesta y comprobar de nuevo que funciona.
pt_br: Agora é hora de ir na direção oposta e verificar novamente se funciona.

source: Oh dear. This is categorically **not** all right.
es: Oh, vaya. Esto categóricamente no está bien.
pt_br: Oh céus. Isso categoricamente **não** está certo.

source: Our minimum and maximum values are in the range 0-255 - which is all that's permitted in an unsigned integer, 8-bit image, so that makes sense. But the appearance doesn't make much sense at first look.
es: Nuestros valores mínimo y máximo están en el rango 0-255 - que es todo lo que se permite en un entero sin signo, imagen de 8 bits, así que tiene sentido. Pero la apariencia no tiene mucho sentido a primera vista.
pt_br: Nossos valores mínimo e máximo estão no intervalo de 0 a 255 - que é tudo o que é permitido em um número inteiro não assinado, imagem de 8 bits, então faz sentido. Mas a aparência não faz muito sentido à primeira vista.

source: Whenever we reduce the bit-depth of an image, we know that the pixel values will need to fit into the new range. In the main text, we considered two ways that could happen: by clipping or by rescaling.
es: Siempre que reducimos la profundidad de bits de una imagen, sabemos que los valores de los píxeles tendrán que encajar en el nuevo rango. En el texto principal, hemos considerado dos formas de que esto ocurra: por recorte o por reescalado.
pt_br: Sempre que reduzimos a profundidade de bits de uma imagem, sabemos que os valores dos pixels precisarão se ajustar ao novo intervalo. No texto principal, consideramos duas formas de isso acontecer: por recorte ou por redimensionamento.

source: Here, we are meeting a slight idiosyncracy of NumPy that we really need to be careful about: *by default, it will neither clip nor rescale!*
es: Aquí, nos encontramos con una ligera idiosincrasia de NumPy con la que realmente tenemos que tener cuidado: *por defecto, no recortará ni reescalará!*
pt_br: Aqui, estamos encontrando uma ligeira idiossincrasia do NumPy com a qual realmente precisamos ter cuidado: *por padrão, ele não irá cortar nem redimensionar!*

source: But what *does* it do? Rather than googling or crawling around the NumPy docs, we can experiment.
es: Pero, ¿qué *hace*? En lugar de buscar en Google o rastrear los documentos de NumPy, podemos experimentar.
pt_br: Mas o que isso faz? Em vez de pesquisar no Google ou vasculhar os documentos do NumPy, podemos experimentar.

source: So it seems that NumPy *wraps around*: when converting 256 to `uint8` it becomes 0, 257 becomes 1 and so on.
es: Así que parece que NumPy *envuelve alrededor*: al convertir 256 a `uint8` se convierte en 0, 257 se convierte en 1 y así sucesivamente.
pt_br: Então parece que o NumPy *contorna*: ao converter 256 para `uint8` torna-se 0, 257 torna-se 1 e assim por diante.

source: This means that, to convert an image to `uint8`, we need to take matters into our own hands to reduce data loss. To begin, let's clip.
es: Esto significa que, para convertir una imagen a `uint8`, tenemos que tomar cartas en el asunto para reducir la pérdida de datos. Para empezar, vamos a recortar.
pt_br: Isso significa que, para converter uma imagem para `uint8`, precisamos resolver o problema com nossas próprias mãos para reduzir a perda de dados. Para começar, vamos recortar.

source: Converting with clipping
es: Conversión con recorte
pt_br: Convertendo com recorte

source: The trick is to clip the image this *before* converting it with `astype`:
es: El truco consiste en recortar la imagen *antes* de convertirla con `astype`:
pt_br: O truque é recortar a imagem *antes* de convertê-la com `astype`:

source: This has worked in a sense, but not a very good one. Our pixels are in the range 0-255, but recall from the histogram above that almost all the pixels were originally above 255 in value. When we clipped, these pixels all simply became 255 - and all further distinction was lost.
es: Esto ha funcionado en cierto sentido, pero no muy bien. Nuestros píxeles están en el rango 0-255, pero recordemos que en el histograma anterior casi todos los píxeles tenían originalmente un valor superior a 255. Cuando recortamos, estos píxeles se convirtieron en 255, y se perdió toda distinción. Cuando recortamos, todos estos píxeles se convirtieron en 255 y se perdió toda distinción.
pt_br: Isso funcionou em certo sentido, mas não muito bom. Nossos pixels estão na faixa de 0 a 255, mas lembre-se do histograma acima que quase todos os pixels estavam originalmente acima de 255 em valor. Quando cortamos, todos esses pixels simplesmente tornaram-se 255 - e toda a distinção adicional foi perdida.

source: Converting with rescaling
es: Conversión con reescalado
pt_br: Convertendo com redimensionamento

source: We can calculate the maximum possible value of an unsigned integer for a specific bit depth $N$ as $2^{N}-1$.
es: Podemos calcular el valor máximo posible de un entero sin signo para una profundidad de bits específica $N$ como $2^{N}-1$.
pt_br: Podemos calcular o valor máximo possível de um número inteiro sem sinal para uma profundidade de bits específica $N$ como $2^{N}-1$.

source: With Numpy, we can use the `**` operator for this.
es: Con Numpy, podemos utilizar el operador `**` para esto.
pt_br: Com Numpy, podemos usar o operador `**` para isso.

source: Therefore, to convert our 16-bit image to 8-bit by rescaling, we could multiply the pixel values by the ratio of these maximum values, i.e. by $\frac{255}{65535}$
es: Por lo tanto, para convertir nuestra imagen de 16 bits a 8 bits mediante reescalado, podríamos multiplicar los valores de los píxeles por el cociente de estos valores máximos, es decir, por $\frac{255}{65535} $.
pt_br: Portanto, para converter nossa imagem de 16 bits em 8 bits por redimensionamento, poderíamos multiplicar os valores dos pixels pela proporção desses valores máximos, ou seja, por $\frac{255}{65535}$

source: This has *kind of* worked, but note that the maximum pixel value is very low. We have lost a *lot* of information: squeezing our values into a very small range of integers, much less than the full 256 available to us.
es: Esto ha funcionado *más o menos*, pero hay que tener en cuenta que el valor máximo del píxel es muy bajo. Hemos perdido *mucha* información: exprimiendo nuestros valores en un rango muy pequeño de enteros, mucho menos que los 256 disponibles.
pt_br: Isso *meio que* funcionou, mas observe que o valor máximo do pixel é muito baixo. Perdemos *muita* informação: comprimindo nossos valores em um intervalo muito pequeno de números inteiros, muito menos do que os 256 completos disponíveis para nós.

source: Ideally, we would usually like to rescale our image while preserving as much of the information as possible. We would like the values in our output image to fill the full range of 0-255.
es: Lo ideal sería reescalar la imagen conservando la mayor cantidad de información posible. Nos gustaría que los valores de nuestra imagen de salida llenaran todo el rango de 0-255.
pt_br: Idealmente, normalmente gostaríamos de redimensionar nossa imagem preservando o máximo de informações possível. Gostaríamos que os valores em nossa imagem de saída preenchessem todo o intervalo de 0 a 255.

source: We can do this in five steps:
es: Podemos hacerlo en cinco pasos:
pt_br: Podemos fazer isso em cinco etapas:

source: Convert the image to floating point (so that we don't lose info to rounding)
es: Convertir la imagen a coma flotante (para no perder información por redondeo)
pt_br: Converta a imagem em ponto flutuante (para não perdermos informações devido ao arredondamento)

source: Subtract the minimum value, so that the minimum becomes zero
es: Restar el valor mínimo, para que el mínimo se convierta en cero
pt_br: Subtraia o valor mínimo, para que o mínimo se torne zero

source: Divide by the new maximum value, so that the maximum becomes one
es: Divide por el nuevo valor máximo, de forma que el máximo se convierta en uno
pt_br: Divida pelo novo valor máximo, para que o máximo se torne um

source: Multiply by 255
es: Multiplicar por 255
pt_br: Multiplique por 255

source: Convert to 8-bit
es: Convertir a 8 bits
pt_br: Converter para 8 bits

source: As conversions to 8-bit go, rescaling certainly looks like it was more successful than simply clipping, and the output fills the full range available.
es: En cuanto a las conversiones a 8 bits, el reescalado parece más acertado que el simple recorte, y la salida llena toda la gama disponible.
pt_br: À medida que as conversões para 8 bits avançam, o redimensionamento certamente parece ter sido mais bem-sucedido do que simplesmente recortar, e a saída preenche toda a gama disponível.

source: Nevertheless, **don't forget that the statistics are different, and we have changed the pixel values!**
es: No obstante, **no olvides que las estadísticas son diferentes y que hemos cambiado los valores de los píxeles**.
pt_br: No entanto, **não se esqueça que as estatísticas são diferentes e alteramos os valores dos pixels!**

source: Therefore this isn't something we should do without a very good reason.
es: Por lo tanto, no es algo que debamos hacer sin una buena razón.
pt_br: Portanto, isso não é algo que devemos fazer sem uma boa razão.

source: Summary
es: Resumen
pt_br: Resumo

source: **The key message here is that it is very easy to change the bit-depth and type of an image - but also very easy for things to go wrong.**
es: **El mensaje clave aquí es que es muy fácil cambiar la profundidad de bits y el tipo de una imagen, pero también es muy fácil que las cosas salgan mal.
pt_br: **A principal mensagem aqui é que é muito fácil alterar a profundidade de bits e o tipo de uma imagem - mas também é muito fácil que algo dê errado.**

source: Sometimes these are small precision errors. Sometimes they are big, data, destroying errors.
es: A veces se trata de pequeños errores de precisión. A veces son grandes errores que destruyen datos.
pt_br: Às vezes, esses são pequenos erros de precisão. Às vezes eles são grandes, dados, destruindo erros.

source: But if you know how to show images, make measurements and generate histograms, you can always check what is happening to the data at each step. This can help you make sure nothing is being lost along the way.
es: Pero si sabes cómo mostrar imágenes, hacer mediciones y generar histogramas, siempre puedes comprobar qué ocurre con los datos en cada paso. Esto puede ayudarte a asegurarte de que no se está perdiendo nada por el camino.
pt_br: Mas se você souber mostrar imagens, fazer medições e gerar histogramas, poderá sempre verificar o que está acontecendo com os dados em cada etapa. Isso pode ajudá-lo a garantir que nada seja perdido ao longo do caminho.
