Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/2-measurements/imagej.po
Languages: de

source: Using the ROI Manager, you can craft your ROIs into more complex shapes: adding or removing other ROIs.
de: Mit dem ROI-Manager können Sie Ihre ROIs in komplexere Formen umwandeln: indem Sie andere ROIs hinzufügen oder entfernen.

source: To do this, first add the main ROIs you want to work with to the manager. Then select them, and choose from among the options:
de: Fügen Sie dazu zunächst die Haupt-ROIs, mit denen Sie arbeiten möchten, zum Manager hinzu. Wählen Sie sie dann aus und wählen Sie aus den folgenden Optionen:

source: {guilabel}`AND` – create a ROI containing only the regions where the selected ROIs overlap
de: {guilabel}„AND“ – Erstellen Sie einen ROI, der nur die Regionen enthält, in denen sich die ausgewählten ROIs überlappen

source: {guilabel}`OR` – create a single ROI composed by combining all the selected ROIs
de: {guilabel}`OR` – Erstellen Sie einen einzelnen ROI, der aus der Kombination aller ausgewählten ROIs besteht

source: {guilabel}`XOR` – create a single ROI containing all the selected ROIs, _except_ the places where they overlap ('eXclusive OR')
de: {guilabel}`XOR` – Erstellen Sie einen einzelnen ROI, der alle ausgewählten ROIs enthält, _außer_ die Stellen, an denen sie sich überlappen („eXclusive OR“)

source: The *ROI Manager* with two ROIs
de: Der *ROI Manager* mit zwei ROIs

source: For {numref}`fig-rois_mask`, I used the ROI Manager to create a ROI with a hole in it.
de: Für {numref}`fig-rois_mask` habe ich den ROI-Manager verwendet, um einen ROI mit einem Loch darin zu erstellen.

source: To do this in *happy_cell.tif*, you can
de: Dies können Sie in *happy_cell.tif* tun

source: Draw one ROI around the full cell, and add it to the ROI Manager
de: Zeichnen Sie einen ROI um die gesamte Zelle und fügen Sie ihn dem ROI-Manager hinzu

source: Draw a second ROI around the nucleus, and add it to the ROI Manager
de: Zeichnen Sie einen zweiten ROI um den Kern und fügen Sie ihn dem ROI-Manager hinzu

source: Then you can select both ROIs and use *one* of the combine operations -- {guilabel}`AND`, {guilabel}`OR`, {guilabel}`XOR` -- to subtract the nucleus ROI from the cell ROI. The end result is a ROI representing the cytoplasm, with the nucleus removed.
de: Dann können Sie beide ROIs auswählen und *eine* der Kombinationsoperationen verwenden – {guilabel}`AND`, {guilabel}`OR` , {guilabel}`XOR` – um den Kern-ROI vom Zell-ROI zu subtrahieren. Das Endergebnis ist ein ROI, der das Zytoplasma mit entferntem Zellkern darstellt.

source: Which combine operation do you need to achieve this?
de: Welche Mähdrescheroperation benötigen Sie, um dies zu erreichen?

source: **Tip:** Remember {menuselection}`Edit --> Selection --> Create Mask` will let you see which pixels are inside and which pixels are outside the ROI.
de: **Tipp:** Denken Sie daran, dass Sie mit {menuselection}„Bearbeiten --> Auswahl --> Maske erstellen“ sehen können, welche Pixel sich innerhalb und welche außerhalb des ROI befinden.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https: //github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)

source: {guilabel}`XOR` ('exclusive OR') provides a ROI that contains pixels that are inside the cell OR inside the nucleus, but NOT both.
de: {guilabel}„XOR“ („exklusives ODER“) liefert einen ROI, der Pixel enthält, die sich innerhalb der Zelle ODER innerhalb des Zellkerns befinden, aber NICHT beides.

source: Overlays
de: Überlagerungen

source: {kbd}`B` for _**B**overlay_: shortcut to add a ROI to an overlay
de: {kbd}`B` für _**B**overlay_: Verknüpfung zum Hinzufügen eines ROI zu einem Overlay

source: Overlays also contain a list of ROIs that are shown simultaneously on the image. However, unlike with the ROI Manager, ROIs stored on an overlay do _not_ usually affect the {guilabel}`Measure` command.
de: Overlays enthalten außerdem eine Liste von ROIs, die gleichzeitig auf dem Bild angezeigt werden. Anders als beim ROI-Manager wirken sich auf einem Overlay gespeicherte ROIs jedoch normalerweise nicht auf den Befehl „Measure“ aus.

source: Overlays are therefore suitable for storing annotations for visualization purposes. You can think of them as existing on their own separate layer, so that adding and removing the overlay does not mess up the underlying pixel values ({numref}`fig-rois`).
de: Overlays eignen sich daher zum Speichern von Anmerkungen zu Visualisierungszwecken. Sie können sich vorstellen, dass sie auf einer eigenen separaten Ebene vorhanden sind, sodass das Hinzufügen und Entfernen der Überlagerung die zugrunde liegenden Pixelwerte nicht durcheinander bringt ({numref}`fig-rois`).

source: The main commands for working with overlays are found in the {menuselection}`Image --> Overlay -->` submenu, where you can get started by drawing a ROI and choosing {guilabel}`Add Selection` (or simply press {kbd}`B`). The same submenu also provides commands to transfer ROIs between the overlay and the ROI Manager.
de: Die Hauptbefehle für die Arbeit mit Overlays finden Sie im Untermenü {menuselection}`Image --> Overlay -->`, wo Sie beginnen können, indem Sie einen ROI zeichnen und <span class auswählen ='notranslate'>{guilabel}</span>`Auswahl hinzufügen` (oder drücken Sie einfach {kbd}`B`). Das gleiche Untermenü bietet auch Befehle zum Übertragen von ROIs zwischen dem Overlay und dem ROI-Manager.

source: You can 'reactivate' a ROI on an overlay by clicking it with the {kbd}`Alt` key pressed (provided a suitable ROI tool is selected), and then edit or reposition it.
de: Sie können einen ROI auf einem Overlay „reaktivieren“, indem Sie mit gedrückter {kbd}Alt-Taste darauf klicken (vorausgesetzt, ein geeignetes ROI-Werkzeug ist ausgewählt) und ihn dann bearbeiten oder neu positionieren.

source: Note that if a ROI on an overlay has been 'reactivated' in this way, then it *does* influence measurements.
de: Beachten Sie, dass, wenn ein ROI auf einem Overlay auf diese Weise „reaktiviert“ wurde, dies Auswirkungen auf die Messungen hat.

source: Saving ROIs
de: ROIs sparen

source: Individual ROIs, currently active on an image, can be saved simply by choosing {menuselection}`File --> Save As --> Selection...`
de: Einzelne ROIs, die derzeit auf einem Bild aktiv sind, können einfach durch Auswahl von {menuselection}`Datei --> Speichern unter --> Auswahl...“ gespeichert werden

source: The ROI Manager also has a {guilabel}`Save...` command (under {guilabel}`More`), which will save whichever ROIs are currently selected in the manager (or, if none are selected, all of them).
de: Der ROI-Manager verfügt außerdem über den Befehl {guilabel}„Speichern...“ (unter {guilabel}„Mehr“), der alles speichert Derzeit sind im Manager ROIs ausgewählt (oder, falls keine ausgewählt sind, alle).

source: Overlays are fixed to specific images and do not have their own special save command, but will nonetheless be included if you save the image as a TIFF file (ImageJ's default format). Any currently-active ROI will also be saved in a TIFF.
de: Überlagerungen sind auf bestimmte Bilder festgelegt und verfügen nicht über einen eigenen speziellen Speicherbefehl, werden aber dennoch einbezogen, wenn Sie das Bild als TIFF-Datei (das Standardformat von ImageJ) speichern. Alle derzeit aktiven ROIs werden ebenfalls in einem TIFF gespeichert.

source: This is all fine if you work only in ImageJ or Fiji, but unfortunately if you try to view your ROIs in other software it is highly unlikely to work properly. The ROI format is specific to ImageJ.
de: Das ist alles in Ordnung, wenn Sie nur in ImageJ oder Fiji arbeiten. Wenn Sie jedoch versuchen, Ihre ROIs in einer anderen Software anzuzeigen, ist es höchst unwahrscheinlich, dass dies ordnungsgemäß funktioniert. Das ROI-Format ist spezifisch für ImageJ.

source: The way around this is to use the {menuselection}`Image --> Overlay --> Flatten` command. This creates an _RGB copy of the image in which the pixel values have been changed_ so that any ROIs or overlays will appear whenever you open the image elsewhere. Therefore you may well want to use this command when creating figures or presentations, but you do _not_ want to subsequently apply your analysis to the image you have flattened – always use the original instead.
de: Um dies zu umgehen, verwenden Sie den Befehl {menuselection}`Image --> Overlay --> Flatten`. Dadurch wird eine _RGB-Kopie des Bildes erstellt, in der die Pixelwerte geändert wurden_, sodass alle ROIs oder Überlagerungen angezeigt werden, wenn Sie das Bild an anderer Stelle öffnen. Daher möchten Sie diesen Befehl möglicherweise beim Erstellen von Abbildungen oder Präsentationen verwenden, möchten Ihre Analyse jedoch _nicht_ anschließend auf das Bild anwenden, das Sie reduziert haben – verwenden Sie stattdessen immer das Original.

source: For more details on the impact of converting an image to RGB, see {ref}`chap_colors`.
de: Weitere Einzelheiten zu den Auswirkungen der Konvertierung eines Bildes in RGB finden Sie unter {ref}`chap_colors`.

source: ROIs and overlays are displayed on top of images, and so can be removed easily without having any effect upon the pixel values. Flattened images may appear the same on screen, but are invariably RGB (see {ref}`chap_colors`) and have had their pixel values permanently changed to show any annotations.
de: ROIs und Überlagerungen werden über Bildern angezeigt und können daher problemlos entfernt werden, ohne dass sich dies auf die Pixelwerte auswirkt. Reduzierte Bilder sehen möglicherweise gleich auf dem Bildschirm aus, sind jedoch ausnahmslos RGB (siehe {ref}`chap_colors`) und ihre Pixelwerte wurden dauerhaft geändert, um etwaige Anmerkungen anzuzeigen.

source: Open the images *Annotated_Cyclists_1.tif* and *Annotated_Cyclists_2.tif*, which depict the 3 main cyclist characteristics I found most disconcerting as a pedestrian in Heidelberg.
de: Öffnen Sie die Bilder *Annotated_Cyclists_1.tif* und *Annotated_Cyclists_2.tif*, die die drei Hauptmerkmale von Radfahrern darstellen, die mich als Fußgänger in Heidelberg am meisten beunruhigten.

source: The images should initially look the same, but in one the text is an overlay, while in the other the image has been flattened. Which is which? Try to think of several ways to investigate this.
de: Die Bilder sollten zunächst gleich aussehen, aber in einem ist der Text eine Überlagerung, während in dem anderen das Bild abgeflacht wurde. Welcher ist welcher? Überlegen Sie sich mehrere Möglichkeiten, dies zu untersuchen.

source: **Tip:** Zooming in may help. So might searching the menus for overlay-related commands (aided by {kbd}`L`).
de: **Tipp:** Das Vergrößern kann hilfreich sein. Das gilt auch für die Suche in den Menüs nach Overlay-bezogenen Befehlen (unterstützt durch {kbd}`L`).

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_2.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_2.tif)

source: *Annotated_Cyclists_1.tif* is the one with the overlay.
de: *Annotated_Cyclists_1.tif* ist die mit dem Overlay.

source: Five ways to determine whether an annotation is an overlay or not:
de: Fünf Möglichkeiten, um festzustellen, ob eine Anmerkung eine Überlagerung ist oder nicht:

source: Zoom in very closely to the region containing the annotation. If it becomes 'blocky', i.e. made up of pixels, it is not an overlay. If it remains smooth, then it is an overlay.
de: Vergrößern Sie den Bereich, der die Anmerkung enthält, ganz genau. Wenn es „blockig“ wird, also aus Pixeln besteht, handelt es sich nicht um eine Überlagerung. Bleibt es glatt, handelt es sich um eine Auflage.

source: Move your cursor over the region where the annotation appears, and look at the pixel values. If the values are all the same where the annotation is present, but different elsewhere, then it is unlikely to be an overlay: the annotation is influencing the pixel values.
de: Bewegen Sie den Cursor über den Bereich, in dem die Anmerkung angezeigt wird, und sehen Sie sich die Pixelwerte an. Wenn die Werte dort, wo die Anmerkung vorhanden ist, alle gleich sind, an anderen Stellen jedoch unterschiedlich sind, ist es unwahrscheinlich, dass es sich um eine Überlagerung handelt: Die Anmerkung beeinflusst die Pixelwerte.

source: Using the paintbrush <img src="../../../images/imagej/icons/brush.png" /> tool from the toolbar, try putting some other color where the annotation appears. If the annotation remains visible on top of where you drew, it must be on an overlay.
de: Versuchen Sie mit dem Pinselwerkzeug <img src="../../../images/imagej/icons/brush.png" /> aus der Symbolleiste, eine andere Farbe an der Stelle zu platzieren, an der die Anmerkung angezeigt wird. Wenn die Anmerkung über der von Ihnen gezeichneten Stelle sichtbar bleibt, muss sie sich auf einer Überlagerung befinden.

source: Choose {menuselection}`Image --> Overlay --> Hide Overlay` and see if the annotation disappears.
de: Wählen Sie {menuselection}`Bild --> Überlagerung --> Überlagerung ausblenden' und prüfen Sie, ob die Anmerkung verschwindet.

source: Choose {menuselection}`Image --> Overlay --> To ROI Manager` and see if anything happens at all.
de: Wählen Sie {menuselection}`Image --> Overlay --> To ROI Manager' und prüfen Sie, ob überhaupt etwas passiert.

source: Using the cyclist image containing the overlay from the previous practical, rearrange the annotations so that they are each positioned next to different cyclists.
de: Ordnen Sie die Anmerkungen mithilfe des Radfahrerbilds, das die Überlagerung aus dem vorherigen Praktikum enthält, so an, dass sie jeweils neben verschiedenen Radfahrern positioniert sind.

source: You could do this by deleting the overlay and starting again, but there are other, faster possibilities (using a technique mentioned before, or the {menuselection}`Image --> Overlay --> To ROI Manager` command).
de: Sie könnten dies tun, indem Sie das Overlay löschen und erneut beginnen, aber es gibt auch andere, schnellere Möglichkeiten (mit einer zuvor erwähnten Technik oder dem {menuselection}`Image --> Overlay -->). Zum ROI-Manager-Befehl).

source: Click the annotation while holding down the {kbd}`Alt` key, to bring it to life so it can be moved around again. This only works if certain tools are selected, e.g. {guilabel}`Rectangle` or {guilabel}`Text`, because some other tools have more overriding functions, such as zooming in or scrolling.
de: Klicken Sie auf die Anmerkung, während Sie die Alt-Taste gedrückt halten, um sie zum Leben zu erwecken, damit sie erneut verschoben werden kann. Dies funktioniert nur, wenn bestimmte Tools ausgewählt sind, z.B. {guilabel}`Rectangle` oder {guilabel}`Text`, da einige andere Tools mehr übergeordnete Funktionen haben, wie z. B. Vergrößern oder Scrollen.

source: Generating histograms
de: Histogramme erstellen

source: Creating a histogram in ImageJ, via {menuselection}`Analyze --> Histogram` or simply pressing {kbd}`H`, results in a new histogram window being created. Like with {menuselection}`Analyze --> Measure`, this will use a ROI if it is available; otherwise it will use the full image.
de: Das Erstellen eines Histogramms in ImageJ über {menuselection}`Analyze --> Histogram` oder einfach durch Drücken von {kbd}`H` führt zu einem Neues Histogrammfenster wird erstellt. Wie bei {menuselection}`Analyze --> Measure` wird hier ein ROI verwendet, sofern dieser verfügbar ist; andernfalls wird das vollständige Bild verwendet.

source: An ImageJ histogram is displayed above some basic summary statistics and four intriguing buttons:
de: Über einigen grundlegenden zusammenfassenden Statistiken und vier interessanten Schaltflächen wird ein ImageJ-Histogramm angezeigt:

source: {guilabel}`List` -- to list the actual bins and counts associated with the histogram
de: {guilabel}`List` – um die tatsächlichen Bins und Zählungen aufzulisten, die dem Histogramm zugeordnet sind

source: {guilabel}`Copy` -- to copy the list above to the clipboard
de: {guilabel}`Kopieren` – um die obige Liste in die Zwischenablage zu kopieren

source: {guilabel}`Log` -- to change the y axis to show the log of the counts for each bin; this is helpful to distinguish between counts that are very small
de: {guilabel}`Log` – um die y-Achse zu ändern, um das Protokoll der Zählungen für jedes Bin anzuzeigen; Dies ist hilfreich, um zwischen sehr kleinen Zählungen zu unterscheiden

source: {guilabel}`Live` -- to make the histogram responsive to whatever you do with the image -- including changing the LUT, or any ROI
de: {guilabel}„Live“ – damit das Histogramm auf alles reagiert, was Sie mit dem Bild tun – einschließlich der Änderung der LUT oder eines beliebigen ROI

source: An image with its histogram in ImageJ.
de: Ein Bild mit seinem Histogramm in ImageJ.

source: A histogram of an image... and an image of a histogram
de: Ein Histogramm eines Bildes... und ein Bild eines Histogramms

source: A slightly odd feature of ImageJ histograms is that *the histogram is also an image*. That means you can draw ROIs and even make measurements on it. We will revisit this in {ref}`chap_pixel_size`.
de: Ein etwas seltsames Merkmal von ImageJ-Histogrammen ist, dass *das Histogramm auch ein Bild ist*. Das bedeutet, dass Sie ROIs zeichnen und sogar Messungen daran vornehmen können. Wir werden darauf in {ref}`chap_pixel_size` noch einmal zurückkommen.

source: If you have a stack, you also may need to explore {guilabel}`More >> Options...` to define whether all ROIs are shown on all slices, or only on the slices on which they were first created.
de: Wenn Sie einen Stapel haben, müssen Sie möglicherweise auch {guilabel}`Weitere >> Optionen...` erkunden, um zu definieren, ob alle ROIs auf allen Slices oder nur auf den Slices angezeigt werden auf dem sie erstmals erstellt wurden.
