Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/2-measurements/imagej.po
Languages: de

source: ImageJ: Measurements & histograms
de: ImageJ: Messungen und Histogramme

source: Introduction
de: Einführung

source: ImageJ makes generating basic measurements and histograms *extremely* easy:
de: ImageJ macht die Erstellung grundlegender Messungen und Histogramme *extrem* einfach:

source: Press {kbd}`M` to make **M**easurements
de: Drücken Sie {kbd}`M`, um **M**-Messungen vorzunehmen

source: This is the shortcut to run {menuselection}`Analyze --> Measure`.
de: Dies ist die Verknüpfung zum Ausführen von {menuselection}`Analyze --> Measure`.

source: Press {kbd}`H` to create a **H**istogram
de: Drücken Sie {kbd}`H`, um ein **H**-Istogramm zu erstellen

source: This is the shortcut to run {menuselection}`Analyze --> Histogram`.
de: Dies ist die Verknüpfung zum Ausführen von {menuselection}`Analyze --> Histogram`.

source: Assuming your image is 2D and there is no ROI active (we will explore [dimensions](chap_dimensions) and [ROIs](sec_imagej_rois) later), both of these commands will use all the pixels in the image.
de: Angenommen, Ihr Bild ist 2D und es ist kein ROI aktiv (wir werden [Abmessungen](chap_dimensions) und [ROIs](sec_imagej_rois) später untersuchen), verwenden beide Befehle alle Pixel im Bild.

source: We'll explore how to customize the regions being measured and exactly what measurements are made later in this section, but already it should be possible to answer the following questions.
de: Wir werden später in diesem Abschnitt untersuchen, wie Sie die zu messenden Regionen anpassen und welche Messungen genau durchgeführt werden. Die folgenden Fragen sollten jedoch bereits beantwortet werden können.

source: Practical
de: Praktisch

source: *similar_1.tif*, *similar_2.tif*, *similar_3.tif* and *similar_4.tif* are all, well, similar. However only two contain *identical* pixel values.
de: *similar_1.tif*, *similar_2.tif*, *similar_3.tif* und *similar_4.tif* sind alle, nun ja, ähnlich. Allerdings enthalten nur zwei *identische* Pixelwerte.

source: Which two images contain the same values?
de: Welche zwei Bilder enthalten die gleichen Werte?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_3.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_4.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/similar_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_2.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/similar_3.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_4.tif)

source: launch ImageJ.JS
de: Starten Sie ImageJ.JS

source: Solution
de: Lösung

source: Only *similar_1.tif* and *similar_3.tif* can contain the same values. An easy way to determine this is to compute the mean (average) of all pixels in each of the images. Only those two images share the same mean value.
de: Nur *similar_1.tif* und *similar_3.tif* können dieselben Werte enthalten. Eine einfache Möglichkeit, dies zu ermitteln, besteht darin, den Mittelwert (Durchschnitt) aller Pixel in jedem der Bilder zu berechnen. Nur diese beiden Bilder haben den gleichen Mittelwert.

source: *disguise_matching.tif* has lost its match.
de: *disguise_matching.tif* hat sein Match verloren.

source: Which of the following three images have the same pixel values as *disguise_matching.tif*?
de: Welches der folgenden drei Bilder hat die gleichen Pixelwerte wie *disguise_matching.tif*?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/disguise_matching.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_3.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/disguise_matching.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_1.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/disguised_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_3.tif)

source: *disguised_3.tif* is the matching image.
de: *disguised_3.tif* ist das passende Bild.

source: Measuring images
de: Bilder messen

source: When using {menuselection}`Analyze --> Measure`, the measurements are added to a *Results table*.
de: Bei Verwendung von {menuselection}`Analyze --> Measure` werden die Messungen zu einer *Ergebnistabelle* hinzugefügt.

source: By default, the mean, minimum and maximum pixel values are provided, along with the area of the image... and that's all. It's not a lot.
de: Standardmäßig werden die mittleren, minimalen und maximalen Pixelwerte zusammen mit der Bildfläche bereitgestellt ... und das ist alles. Es ist nicht viel.

source: Furthermore, if you make multiple measurements then they are added to the *same* results table, without any identifiers. This is especially confusing if you have several images open at the same time, and have no clue which row of the results table corresponds to measurements from which image.
de: Wenn Sie außerdem mehrere Messungen durchführen, werden diese ohne Kennungen zur *gleichen* Ergebnistabelle hinzugefügt. Dies ist besonders verwirrend, wenn Sie mehrere Bilder gleichzeitig geöffnet haben und nicht wissen, welche Zeile der Ergebnistabelle den Messungen aus welchem Bild entspricht.

source: {menuselection}`Analyze --> Set Measurements...` makes it possible to address both of these limitations. It not only provides many more measurements that can be selected, it includes a crucial {guilabel}`Display label` option that will cause the title of the image to be included in the results table ({numref}`fig-measure`).
de: {menuselection}`Analysieren --> Messungen festlegen...` ermöglicht es, diese beiden Einschränkungen zu beseitigen. Es bietet nicht nur viele weitere auswählbare Messungen, sondern enthält auch eine wichtige {guilabel}Option „Beschriftung anzeigen“, die dafür sorgt, dass der Titel des Bildes in die Ergebnistabelle aufgenommen wird ( {numref}`fig-measure`).

source: Measurement units matter -- but aren't displayed!
de: Maßeinheiten sind wichtig – werden aber nicht angezeigt!

source: The results table does not include units for measurements, even though these are essential. Seeing an area of 10 *might* mean 10 pixels<sup>2</sup>, or 10 µm<sup>2</sup>... or something else entirely.
de: Die Ergebnistabelle enthält keine Maßeinheiten, obwohl diese unbedingt erforderlich sind. Eine Fläche von 10 zu sehen *könnte* 10 Pixel<sup>2</sup> oder 10 µm bedeuten <sup>2</sup>... oder etwas ganz anderes.

source: See {ref}`chap_pixel_size` for more information about why that matters for any measurements of size (area, length etc.), and how to check the units.
de: Weitere Informationen darüber, warum dies für Größenmessungen (Fläche, Länge usw.) wichtig ist und wie Sie die Einheiten überprüfen, finden Sie unter {ref}`chap_pixel_size`.

source: Measurements made on an image are added to a results table. The choice of measurements to make can be changed using the {menuselection}`Analyze --> Set Measurements...` command.
de: An einem Bild vorgenommene Messungen werden einer Ergebnistabelle hinzugefügt. Die Auswahl der durchzuführenden Messungen kann mit dem Befehl {menuselection}`Analyze --> Set Measurements...` geändert werden.

source: The 'One True Results Table' & its imposters
de: Die „One True Results Table“ und ihre Betrüger

source: A small idiosyncrasy to be aware of is that, as far as ImageJ is concerned, there is only ever one 'official' results table -- the one with the title {guilabel}`Results`.
de: Eine kleine Besonderheit, die Sie beachten sollten, besteht darin, dass es für ImageJ immer nur eine „offizielle“ Ergebnistabelle gibt – die mit dem Titel {guilabel}„Ergebnisse“. .

source: Different, similar-looking tables can be created by different commands, or by duplicating an existing results table with {menuselection}`File --> Duplicate...`. Nevertheless, any new measurements you make with the {menuselection}`Measure` command will *only* be added to the original, official table. This also has an extra {guilabel}`Results` entry in its menu bar that other tables lack.
de: Verschiedene, ähnlich aussehende Tabellen können durch unterschiedliche Befehle oder durch Duplizieren einer vorhandenen Ergebnistabelle mit {menuselection}`Datei --> Duplizieren...` erstellt werden. Dennoch werden alle neuen Messungen, die Sie mit dem Befehl „Measure“ vornehmen, *nur* zur ursprünglichen, offiziellen Tabelle hinzugefügt. Außerdem gibt es in der Menüleiste einen zusätzlichen {guilabel}Eintrag „Ergebnisse“, der anderen Tabellen fehlt.

source: Choosing which measurements to select
de: Auswahl der auszuwählenden Maße

source: Some options within {menuselection}`Analyze --> Set Measurements...` are so universally useful that they should pretty much always be set. Conversely, some options are manifestly confusing and dangerous and should be used rarely -- or not at all.
de: Einige Optionen in {menuselection}`Analyze --> Set Measurements...` sind so universell nützlich, dass sie praktisch immer festgelegt werden sollten. Umgekehrt sind einige Optionen offensichtlich verwirrend und gefährlich und sollten nur selten oder gar nicht genutzt werden.

source: Options to **always** select:
de: Optionen zur **immer** Auswahl:

source: {guilabel}`Area`, {guilabel}`Mean gray value`, {guilabel}`Standard deviation`, {guilabel}`Min & max gray value` -- basic summary values
de: {guilabel}`Fläche`, {guilabel}`Mittlerer Grauwert`, {guilabel}` Standardabweichung, {guilabel}Min. und Max. Grauwert – grundlegende Zusammenfassungswerte

source: {guilabel}`Display label` -- includes the image title
de: {guilabel}`Display label` – enthält den Bildtitel

source: {guilabel}`Stack Position` -- includes the 2D plane that has been measured in an image with {ref}`more dimensions <chap_dimensions>`.
de: {guilabel}„Stapelposition“ – umfasst die 2D-Ebene, die in einem Bild mit {ref}`mehr Dimensionen <span class gemessen wurde ='notranslate'><chap_dimensions></span>`.

source: Options to **avoid**:
de: Zu **vermeidende** Optionen:

source: {guilabel}`Limit to threshold` -- restricts the region being measured according to any {ref}`threshold <chap_thresholding>` that has been set; don't do this routinely, instead convert your threshold to a ROI and use that instead.
de: {guilabel}„Auf Schwellenwert beschränken“ – schränkt die zu messende Region gemäß einem beliebigen {ref}`Schwellenwert <span class='notranslate' ein. ><chap_thresholding></span>`, das eingestellt wurde; Tun Sie dies nicht routinemäßig, sondern wandeln Sie Ihren Schwellenwert in einen ROI um und verwenden Sie diesen stattdessen.

source: {guilabel}`Redirect to` -- measures a different image from the one that's selected. It sounds weird, but it's intended for cases where you have two corresponding images; one in which you can identify a region to measure, and one that contains the pixel values you should measure.
de: {guilabel}„Weiterleiten zu“ – misst ein anderes Bild als das ausgewählte. Es klingt seltsam, ist aber für Fälle gedacht, in denen Sie zwei entsprechende Bilder haben. eine, in der Sie einen zu messenden Bereich identifizieren können, und eine, die die Pixelwerte enthält, die Sie messen sollten.

source: The two options that I think you should avoid can both result in something unexpected being measured if you don't know (or have forgotten) that either was selected under {menuselection}`Analyze --> Set Measurements...`.
de: Die beiden Optionen, die Sie meiner Meinung nach vermeiden sollten, können beide dazu führen, dass etwas Unerwartetes gemessen wird, wenn Sie nicht wissen (oder vergessen haben), dass eine von beiden unter {menuselection}„Analysieren –“ ausgewählt wurde. > Maße festlegen...`.

source: Fortunately, they are not really needed if you master the art of generating, managing and transferring regions of interest between images.
de: Glücklicherweise werden sie nicht wirklich benötigt, wenn Sie die Kunst beherrschen, interessante Bereiche zwischen Bildern zu erstellen, zu verwalten und zu übertragen.

source: Regions Of Interest
de: Interessante Regionen

source: **Regions Of Interest (ROIs)** can be used to define specific parts of an image that should be processed independently or measured. Only pixels within any ROI we draw will be included in the calculations when we run {menuselection}`Analyze --> Measure`.
de: **Regions Of Interest (ROIs)** können verwendet werden, um bestimmte Teile eines Bildes zu definieren, die unabhängig verarbeitet oder gemessen werden sollen. Nur Pixel innerhalb eines von uns gezeichneten ROI werden in die Berechnungen einbezogen, wenn wir {menuselection}`Analyze --> Measure` ausführen.

source: ROI drawing tools are found on the left side of the ImageJ tool bar (A). The ROI in (B) was created by drawing one rectangular and two circular ROIs, holding down the {kbd}`Shift` key between each so that the regions were combined.
de: ROI-Zeichenwerkzeuge finden Sie auf der linken Seite der ImageJ-Symbolleiste (A). Der ROI in (B) wurde erstellt, indem ein rechteckiger und zwei kreisförmige ROIs gezeichnet wurden, wobei zwischen beiden die Umschalttaste gedrückt gehalten wurde, sodass die Regionen kombiniert wurden.

source: ROIs of different types (e.g. rectangles, circles, lines, points, polygons, freehand shapes) can be drawn using the commands in the tool bar ({numref}`fig-roi_drawing`), and are invariably 2D. Right-clicking the tools often provides access to related tools, while double-clicking may give additional options. When drawing a ROI, pressing {kbd}`Shift` or {kbd}`Control` before releasing the mouse button adds the ROI being drawn to any existing ROI already present.
de: ROIs verschiedener Typen (z. B. Rechtecke, Kreise, Linien, Punkte, Polygone, Freihandformen) können mit den Befehlen in der Symbolleiste ({numref}`fig-roi_drawing`) gezeichnet werden. und sind ausnahmslos zweidimensional. Ein Rechtsklick auf die Werkzeuge bietet häufig Zugriff auf verwandte Werkzeuge, während ein Doppelklick möglicherweise zusätzliche Optionen bietet. Wenn Sie beim Zeichnen eines ROI die Umschalttaste oder die Strg-Taste drücken, bevor Sie die Maustaste loslassen, wird der ROI hinzugefügt, zu dem gezeichnet wird eventuell vorhandener ROI bereits vorhanden.

source: **ROIs** in ImageJ are sometimes called **selections** -- meaning the same thing
de: **ROIs** in ImageJ werden manchmal **Auswahlen** genannt – was dasselbe bedeutet

source: Somewhat confusingly, ROIs are sometimes referred to as **selections** in ImageJ. This is why some extra commands to create or adjust ROIs appear under the {menuselection}`Edit --> Selection` submenu.
de: Etwas verwirrend ist, dass ROIs in ImageJ manchmal als **Auswahl** bezeichnet werden. Aus diesem Grund werden einige zusätzliche Befehle zum Erstellen oder Anpassen von ROIs im Untermenü {menuselection}`Bearbeiten --> Auswahl` angezeigt.

source: One such command is {menuselection}`Edit --> Selection --> Create Mask`. This creates a new [binary](chap_binary) (black and white) image that differentiates between the pixels that are inside and outside the ROI.
de: Ein solcher Befehl ist {menuselection}`Edit --> Selection --> Create Mask`. Dadurch wird ein neues [binary](chap_binary) (Schwarzweiß-)Bild erstellt, das zwischen den Pixeln unterscheidet, die sich innerhalb und außerhalb des ROI befinden.

source: A ROI representing an area is usually depicted using yellow lines drawn on an image, but sometimes it isn't clear which pixels are inside or outside the ROI. {menuselection}`Edit --> Selection --> Create Mask` can help clarify this.
de: Ein ROI, der einen Bereich darstellt, wird normalerweise durch gelbe Linien auf einem Bild dargestellt, aber manchmal ist nicht klar, welche Pixel sich innerhalb oder außerhalb des ROI befinden. {menuselection}„Bearbeiten --> Auswahl --> Maske erstellen“ kann dabei helfen, dies zu klären.

source: {menuselection}`Process --> Binary --> Options...`
de: {menuselection}`Prozess --> Binär --> Optionen...`

source: Interpreting 'Create Mask'
de: Interpretieren von „Maske erstellen“

source: Unfortunately, when using {menuselection}`Edit --> Selection --> Create Mask` it is not *entirely certain* whether black means 'inside' or 'outside'. This depends upon whether {guilabel}`Black background` is selected within {menuselection}`Process --> Binary --> Options...`.
de: Leider ist es bei der Verwendung von {menuselection}`Edit --> Selection --> Create Mask` nicht *völlig sicher*, ob Schwarz „innen“ oder „außen“ bedeutet. Dies hängt davon ab, ob {guilabel}„Schwarzer Hintergrund“ unter {menuselection}„Prozess – Binär – Optionen“ ausgewählt ist. `.

source: This doesn't usually matter in practice, because it tends to be clear from the context; ROIs usually cover a small region of the image, so the background color is the one seen in the majority of pixels.
de: Dies spielt in der Praxis normalerweise keine Rolle, da es in der Regel aus dem Kontext klar hervorgeht. ROIs decken normalerweise einen kleinen Bereich des Bildes ab, daher ist die Hintergrundfarbe diejenige, die in den meisten Pixeln zu sehen ist.

source: An exception to this is if {menuselection}`Edit --> Selection --> Make Inverse` has been used to flip a ROI to represent all the background pixels of the original, with the foreground removed.
de: Eine Ausnahme hiervon ist, wenn {menuselection}`Edit --> Selection --> Make Inverse" verwendet wurde, um einen ROI umzudrehen, um alle Hintergrundpixel des Originals darzustellen, mit dem Vordergrund entfernt.

source: Don't overestimate the accuracy of measurements
de: Überschätzen Sie nicht die Genauigkeit der Messungen

source: Although ImageJ can measure very exactly whatever regions it is told to measure _within an image_, keep in mind that in light microscopy images any size measurements will not exactly correspond to sizes of structures _in real life_. This is especially true at very small scales (hundreds of nanometers or smaller), for resolution-related reasons that will be described in {ref}`chap_formation_spatial`.
de: Obwohl ImageJ alle Regionen, die es _innerhalb eines Bilds_ messen soll, sehr genau messen kann, bedenken Sie, dass in Lichtmikroskopiebildern die Größenmessungen nicht genau den Größen von Strukturen _im wirklichen Leben_ entsprechen. Dies gilt insbesondere bei sehr kleinen Maßstäben (Hunderte von Nanometern oder kleiner) aus Gründen der Auflösung, die in {ref}`chap_formation_spatial` beschrieben werden.

source: Working with multiple ROIs
de: Arbeiten mit mehreren ROIs

source: Normally, only a single ROI can be 'active' in ImageJ (i.e. affecting measurements) at any one time. If you need control over multiple ROIs, there are two places in which you can store them. These differ according to purpose:
de: Normalerweise kann immer nur ein einzelner ROI in ImageJ „aktiv“ sein (d. h. Messungen beeinflussen). Wenn Sie die Kontrolle über mehrere ROIs benötigen, gibt es zwei Orte, an denen Sie diese speichern können. Diese unterscheiden sich je nach Zweck:

source: **The ROI Manager:** for most ROIs that you want to be able to edit and use for measurements
de: **Der ROI-Manager:** für die meisten ROIs, die Sie bearbeiten und für Messungen verwenden möchten

source: **The image overlay:** for ROIs that you only want to display
de: **Die Bildüberlagerung:** für ROIs, die Sie nur anzeigen möchten

source: The ROI Manager
de: Der ROI-Manager

source: {kbd}`T` for _**T**roy manager_: shortcut to add ROI to the ROI Manager
de: {kbd}`T` für _**T**roy manager_: Verknüpfung zum Hinzufügen von ROI zum ROI-Manager

source: ImageJ's *ROI Manager* provides a convenient way to store multiple ROIs in a list, allowing you to easily access, edit and measure them.
de: Der *ROI Manager* von ImageJ bietet eine praktische Möglichkeit, mehrere ROIs in einer Liste zu speichern, sodass Sie einfach darauf zugreifen, sie bearbeiten und messen können.

source: The slow way to open the ROI Manager is to choose {menuselection}`Analyze --> Tools --> ROI Manager...`. The fast way is just to draw a ROI and press {kbd}`T`.
de: Der langsamste Weg, den ROI-Manager zu öffnen, besteht darin, {menuselection}`Analysieren --> Extras --> ROI-Manager...“ auszuwählen. Der schnelle Weg besteht darin, einfach einen ROI zu zeichnen und {kbd}`T` zu drücken.

source: The additional {guilabel}`Measure` command within the manager is then like applying {menuselection}`Analyze --> Measure` to each ROI in turn. If you happen to want to show all the ROIs simultaneously, you can select the {guilabel}`Show All` option [^fn_1].
de: Der zusätzliche Befehl {guilabel}`Measure` im Manager entspricht dann der Anwendung von {menuselection}`Analyze --> Measure` auf jeden ROI in drehen. Wenn Sie alle ROIs gleichzeitig anzeigen möchten, können Sie die Option {guilabel}„Alle anzeigen“ [^fn_1] auswählen.

source: Because ROIs in the ROI Manager are represented independently of the image on which they were defined, you can create a ROI on one image, add it to the ROI manager, select a different image and then click on the ROI in the ROI Manager to place it on the second image. This provides one way to transfer a ROI from one image to another.
de: Da ROIs im ROI-Manager unabhängig von dem Bild dargestellt werden, auf dem sie definiert wurden, können Sie einen ROI auf einem Bild erstellen, ihn zum ROI-Manager hinzufügen, ein anderes Bild auswählen und dann im ROI-Manager auf den ROI klicken, um ihn zu platzieren es auf dem zweiten Bild. Dies bietet eine Möglichkeit, einen ROI von einem Bild auf ein anderes zu übertragen.

source: Measurements made from the ROI Manager always use the most recently-selected image, so be careful if you have several images open at the same time. This is another reason why choosing {guilabel}`Display label` under {menuselection}`Analyze --> Set Measurements...` is so important.
de: Bei Messungen mit dem ROI-Manager wird immer das zuletzt ausgewählte Bild verwendet. Seien Sie also vorsichtig, wenn Sie mehrere Bilder gleichzeitig geöffnet haben. Dies ist ein weiterer Grund, warum die Auswahl von {guilabel}„Beschriftung anzeigen“ unter {menuselection}„Analysieren --> Maße festlegen...“ so sinnvoll ist wichtig.

source: Transferring individual ROIs
de: Übertragung einzelner ROIs

source: A faster way to transfer a single ROI between images without using the ROI Manager is to click on the second image and press {kbd}`Shift+E` (the shortcut for {menuselection}`Edit --> Selection --> Restore Selection`)
de: Eine schnellere Möglichkeit, einen einzelnen ROI zwischen Bildern zu übertragen, ohne den ROI-Manager zu verwenden, besteht darin, auf das zweite Bild zu klicken und {kbd}`Shift+E` (die Tastenkombination für {menuselection}`Bearbeiten --> Auswahl --> Auswahl wiederherstellen`)

source: Expert ROI manipulation with the ROI Manager
de: Kompetente ROI-Manipulation mit dem ROI-Manager
