Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/2-measurements/measurements.po
Languages: es

source: Default Caption
es: Título predeterminado

source: Measurements & histograms
es: Medidas e histogramas

source: Chapter outline
es: Bosquejo del capítulo

source: **Measurements** can be made in images by calculating statistics from the pixel values
es: Se pueden realizar **mediciones** en imágenes calculando estadísticas a partir de los valores de píxeles

source: **Histograms** show the distribution of pixel values in an image, and are extremely useful to compare images & diagnose problems
es: Los **histogramas** muestran la distribución de los valores de píxeles en una imagen y son extremadamente útiles para comparar imágenes y diagnosticar problemas.

source: Introduction
es: Introducción

source: {ref}`chap_pixels` demonstrated how looks can be deceiving: the visual appearance of an image isn't enough to determine what data it contains.
es: {ref}`chap_pixels` demostró cómo las apariencias pueden engañar: la apariencia visual de una imagen no es suficiente para determinar qué datos contiene.

source: Because scientific image analysis depends upon having the right pixel values in the first place, this leads to the important admonition:
es: Debido a que el análisis científico de imágenes depende, en primer lugar, de tener los valores de píxeles correctos, esto lleva a una importante advertencia:

source: Keep your original pixel values safe!
es: ¡Mantenga seguros sus valores de píxeles originales!

source: The pixel values in your original image are your raw data: it's essential to protect these from unwanted changes.
es: Los valores de píxeles de su imagen original son sus datos sin procesar: es esencial protegerlos de cambios no deseados.

source: This is really important because there are lots of ways to accidentally compromise the raw data of an image -- such as by using the wrong software to adjust the brightness and contrast, or saving the files [in the wrong format](chap_files). This can cause the results of analysis to be wrong.
es: Esto es realmente importante porque hay muchas maneras de comprometer accidentalmente los datos sin procesar de una imagen, como usar el software incorrecto para ajustar el brillo y el contraste, o guardar los archivos [en el formato incorrecto] (chap_files). Esto puede provocar que los resultados del análisis sean erróneos.

source: What makes this especially tricky is that trustworthy and untrustworthy images can *look* identical. Therefore, we need a way to see beyond LUTs to compare the content of images easily and efficiently.
es: Lo que hace que esto sea especialmente complicado es que las imágenes confiables y las no confiables pueden *parecer* idénticas. Por lo tanto, necesitamos una forma de ver más allá de las LUT para comparar el contenido de las imágenes de manera fácil y eficiente.

source: Comparing histograms & statistics
es: Comparación de histogramas y estadísticas

source: In principle, if we want to compare two images we could check that every corresponding pixel value is identical in both images. We will use this approach later, but isn't always necessary.
es: En principio, si queremos comparar dos imágenes podríamos comprobar que cada valor de píxel correspondiente es idéntico en ambas imágenes. Usaremos este enfoque más adelante, pero no siempre es necesario.

source: There are two other things we can do, which are often much faster and easier:
es: Hay otras dos cosas que podemos hacer, que suelen ser mucho más rápidas y sencillas:

source: Calculate some **summary statistics** from the pixel values, such as the average (mean) pixel value, standard deviation, minimum and maximum values.
es: Calcule algunas **estadísticas resumidas** a partir de los valores de píxeles, como el valor promedio (media) de píxeles, la desviación estándar y los valores mínimo y máximo.

source: Check out the image **histogram**. This graphically depicts the distribution of pixel values in the image.
es: Mira la imagen **histograma**. Esto representa gráficamente la distribución de los valores de píxeles en la imagen.

source: Putting these into action, we can recreate {numref}`fig-images_look_same` but this time add
es: Al activar estos elementos, podemos recrear {numref}`fig-images_look_same` pero esta vez agrega

source: the LUT (shown as a colored bar below the image)
es: la LUT (que se muestra como una barra de color debajo de la imagen)

source: a histogram
es: un histograma

source: summary statistics
es: un resumen estadístico

source: Recreation of {numref}`fig-images_look_same` showing images that *look* the same, but contain *different* pixels values -- this time with measurements and histograms included.
es: Recreación de {numref}`fig-images_look_same` que muestra imágenes que *lucen* iguales, pero contienen valores de píxeles *diferentes*, esta vez con medidas e histogramas incluidos.

source: With the additional information at our disposal, we can immediately see that the images really **do** contain different underlying values -- and therefore potentially quite different information -- despite their initial similar appearance. We can also see that the LUTs are different; they show the same colors (shades of gray), but in each case these map to different values.
es: Con la información adicional a nuestra disposición, podemos ver inmediatamente que las imágenes realmente **contienen** valores subyacentes diferentes y, por lo tanto, información potencialmente bastante diferente, a pesar de su apariencia inicial similar. También podemos ver que las LUT son diferentes; muestran los mismos colores (tonos de gris), pero en cada caso se asignan a valores diferentes.

source: By contrast, when we apply the same steps to {numref}`fig-images_look_different` we see that the histograms and statistics are identical -- only the LUT has been changed in each case. This suggests that any analysis we perform on each of these images should give the same results, since the pixel values remain intact.
es: Por el contrario, cuando aplicamos los mismos pasos a {numref}`fig-images_look_ different` vemos que los histogramas y las estadísticas son idénticos: solo se ha cambiado la LUT en cada caso. Esto sugiere que cualquier análisis que realicemos en cada una de estas imágenes debería dar los mismos resultados, ya que los valores de los píxeles permanecen intactos.

source: Recreation of {numref}`fig-images_look_different` showing images that *look* different, but contain *the same* pixel values -- this time with measurements and histograms included.
es: Recreación de {numref}`fig-images_look_ different` que muestra imágenes que *parecen* diferentes, pero contienen *los mismos* valores de píxeles, esta vez con medidas e histogramas incluidos.

source: Question
es: Pregunta

source: If two images have identical histograms and summary statistics (mean, min, max, standard deviation), does this **prove** that the images are identical?
es: Si dos imágenes tienen histogramas y estadísticas resumidas idénticas (media, mínimo, máximo, desviación estándar), ¿esto **prueba** que las imágenes son idénticas?

source: Answer
es: Respuesta

source: No! For example, we might have the same pixel values in a different arrangement. If I randomly shuffle the pixels in the image then the basic statistics and histogram remain unchanged -- but the image itself is very different.
es: ¡No! Por ejemplo, podríamos tener los mismos valores de píxeles en una disposición diferente. Si mezclo aleatoriamente los píxeles de la imagen, las estadísticas básicas y el histograma permanecen sin cambios, pero la imagen en sí es muy diferente.

source: This means that, technically, we can only really use histograms and summary measurements to prove that images are definitely *not* the same.
es: Esto significa que, técnicamente, sólo podemos usar histogramas y mediciones resumidas para demostrar que las imágenes definitivamente *no* son iguales.

source: However, in practice this is usually enough. If two images have identical histograms and summary statistics *and* look similar, it is *very likely* that they are the same.
es: Sin embargo, en la práctica esto suele ser suficiente. Si dos imágenes tienen histogramas y estadísticas resumidas idénticas *y* parecen similares, es *muy probable* que sean iguales.

source: Conceivably, someone might try to deceive us by making some very subtle change to an image that preserves the statistics, such as as swapping two pixels amongst millions so that we don't notice the difference. Later, we'll see how to overcome even that by checking every single pixel -- but such elaborate trickery probably isn't a very real risk for most of us.
es: Es posible que alguien intente engañarnos haciendo algún cambio muy sutil en una imagen que conserve las estadísticas, como intercambiar dos píxeles entre millones para que no notemos la diferencia. Más adelante veremos cómo superar incluso eso comprobando cada píxel, pero un engaño tan elaborado probablemente no sea un riesgo muy real para la mayoría de nosotros.

source: Most of the time, when things go wrong with scientific images the histogram and statistics will be compromised in an obvious way -- we just need to remember to check for these changes.
es: La mayoría de las veces, cuando las cosas van mal con las imágenes científicas, el histograma y las estadísticas se verán comprometidos de manera obvia; sólo debemos recordar verificar estos cambios.

source: The ability to quickly generate and interpret histograms is an essential skill for any image analyst. We will use histograms a lot throughout this text, both to help diagnose problems with the data and to figure out which techniques we should use.
es: La capacidad de generar e interpretar histogramas rápidamente es una habilidad esencial para cualquier analista de imágenes. Usaremos mucho histogramas a lo largo de este texto, tanto para ayudar a diagnosticar problemas con los datos como para determinar qué técnicas debemos usar.

source: Make histograms a habit!
es: ¡Haz de los histogramas un hábito!

source: When working with new images, it's a good habit to *always* check histograms. This can give a deeper understanding of the data, and help flag up potential problems.
es: Cuando se trabaja con imágenes nuevas, es un buen hábito *siempre* comprobar los histogramas. Esto puede brindar una comprensión más profunda de los datos y ayudar a detectar problemas potenciales.
