Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/2-measurements/python.po
Languages: de, es, pt_br

source: Python: Measurements & histograms
de: Python: Messungen und Histogramme
es: Python: medidas e histogramas
pt_br: Python: medições e histogramas

source: Here, we will explore how to make measurements and generate histograms with Python.
de: Hier werden wir untersuchen, wie man mit Python Messungen durchführt und Histogramme erstellt.
es: Aquí, exploraremos cómo realizar mediciones y generar histogramas con Python.
pt_br: Aqui, exploraremos como fazer medições e gerar histogramas com Python.

source: Introduction to NumPy arrays
de: Einführung in NumPy-Arrays
es: Introducción a las matrices NumPy
pt_br: Introdução às matrizes NumPy

source: The images we are working with in Python are **NumPy arrays** - https://numpy.org
de: Die Bilder, mit denen wir in Python arbeiten, sind **NumPy-Arrays** - https://numpy.org
es: Las imágenes con las que estamos trabajando en Python son **NumPy arrays** o matrices NumPy - https://numpy.org
pt_br: As imagens com as quais estamos trabalhando em Python são **matrizes NumPy** - https://numpy.org

source: Rather than plotting the image with `plt.imshow`, we can also simply print its values. Since there can be a *lot* of values (i.e. millions of pixels per image), only a few are shown by default.
de: Anstatt das Bild mit `plt.imshow` zu plotten, können wir auch einfach die Werte ausgeben. Da es eine *große* Anzahl von Werten geben kann (d.h. Millionen von Pixeln pro Bild), werden standardmäßig nur einige wenige angezeigt.
es: En lugar de trazar la imagen con `plt.imshow`, también podemos simplemente imprimir sus valores. Dado que puede haber muchos valores (es decir, millones de píxeles por imagen), solo se muestran unos pocos de forma predeterminada.
pt_br: Em vez de plotar a imagem com `plt.imshow`, também podemos simplesmente imprimir seus valores. Como pode haver muitos valores (ou seja, milhões de pixels por imagem), apenas alguns são mostrados por padrão.

source: If we want to know how many values are in an image, we can query its `shape`.
de: Wenn wir wissen wollen, wie viele Werte in einem Bild enthalten sind, können wir seine "Form" abfragen.
es: Si queremos saber cuántos valores hay en una imagen, podemos consultar su "forma".
pt_br: Se quisermos saber quantos valores existem em uma imagem, podemos consultar sua `forma`.

source: This returns the size in the order `(height, width)`.
de: Dies gibt die Größe in der Reihenfolge `(Höhe, Breite)` zurück.
es: Esto nos da el tamaño en el orden "(alto, ancho)".
pt_br: Isso retorna o tamanho na ordem `(altura, largura)`.

source: Whenever we have a 2D NumPy array, we can easily transpose it - which will switch the width and height values.
de: Wann immer wir ein 2D-NumPy-Array haben, können wir es einfach transponieren - was die Werte für Breite und Höhe vertauscht.
es: Siempre que tengamos una matriz NumPy 2D, podemos transponerla fácilmente, lo que cambiará los valores de ancho y alto.
pt_br: Sempre que tivermos um array NumPy 2D, podemos transpô-lo facilmente - o que mudará os valores de largura e altura.

source: Calculating statistics
de: Berechnung von Statistiken
es: Calcular estadísticas
pt_br: Calculando estatísticas

source: A more meaningful benefit of working with NumPy arrays, for our purposes at least, is that they enable us to calculate some summary statistics *extremely* easily.
de: Ein bedeutenderer Vorteil der Arbeit mit NumPy-Arrays, zumindest für unsere Zwecke, ist, dass wir damit einige zusammenfassende Statistiken *extrem* einfach berechnen können.
es: Un beneficio más significativo de trabajar con matrices NumPy, al menos para nuestros propósitos, es que nos permiten calcular algunas estadísticas resumidas de forma *extremadamente* fácilmente.
pt_br: Um benefício mais significativo de trabalhar com arrays NumPy, pelo menos para nossos propósitos, é que eles nos permitem calcular algumas estatísticas resumidas *extremamente* facilmente.

source: For example, to compute the average (mean) pixel value we can simply use `im.mean()`.
de: Um zum Beispiel den durchschnittlichen (mittleren) Pixelwert zu berechnen, können wir einfach `im.mean()` verwenden.
es: Por ejemplo, para calcular el valor promedio (medio) de píxel, simplemente podemos usar `im.mean()`.
pt_br: Por exemplo, para calcular o valor médio (médio) do pixel, podemos simplesmente usar `im.mean()`.

source: If that's the last thing we add to a code cell, then the result will be displayed in our notebook.
de: Wenn das das Letzte ist, was wir in eine Codezelle einfügen, wird das Ergebnis in unserem Notizbuch angezeigt.
es: Si eso es lo último que agregamos a una celda de código, entonces el resultado se mostrará en nuestro cuaderno.
pt_br: Se essa for a última coisa que adicionarmos a uma célula de código, o resultado será exibido em nosso notebook.

source: However, if we want to print multiple values - and multiple statistics - in quick succession we should use the `print` function again.
de: Wenn wir jedoch mehrere Werte - und mehrere Statistiken - in schneller Folge ausgeben wollen, sollten wir wieder die Funktion `print` verwenden.
es: Sin embargo, si queremos imprimir múltiples valores -y múltiples estadísticas- en rápida sucesión, debemos usar la función "imprimir" nuevamente.
pt_br: No entanto, se quisermos imprimir vários valores - e múltiplas estatísticas - em rápida sucessão, devemos usar a função `print` novamente.

source: Formatting output
de: Formatierung der Ausgabe
es: Formatear el output
pt_br: Formatando saída

source: Things become more readable if we add some extra text, rather than just printing numbers.
de: Die Dinge werden besser lesbar, wenn wir etwas zusätzlichen Text hinzufügen, anstatt nur Zahlen zu drucken.
es: Las cosas se vuelven más legibles si agregamos texto adicional, en lugar de simplemente imprimir números.
pt_br: As coisas ficam mais legíveis se adicionarmos algum texto extra, em vez de apenas imprimir números.

source: One of the easiest ways to do this is to use an 'f-string', which is in the form `f'Some text {some_variable}`.
de: Eine der einfachsten Möglichkeiten, dies zu tun, ist die Verwendung einer "f-Zeichenkette", die die Form "f'Some text {some_variable}" hat.
es: Una de las formas más sencillas de hacer esto es utilizar una 'cadena f', que tiene el formato `f'algun texto {alguna_variable}`.
pt_br: Uma das maneiras mais fáceis de fazer isso é usar uma 'string-f', que está no formato `f'Some text {some_variable}`.

source: The part between the braces `{}` can be a calculation, and if you add `:.2f` at the end this will optionally limit the number of decimal places (here, to two).
de: Der Teil zwischen den geschweiften Klammern `{}` kann eine Berechnung sein, und wenn Sie am Ende `:.2f` hinzufügen, begrenzt dies optional die Anzahl der Dezimalstellen (hier auf zwei).
es: La parte entre llaves `{}` puede ser un cálculo, y si agrega `:.2f` al final, esto limitará opcionalmente el número de decimales (aquí, a dos).
pt_br: A parte entre chaves `{}` pode ser um cálculo, e se você adicionar `:.2f` no final, isso limitará opcionalmente o número de casas decimais (aqui, para duas).

source: Generating histograms
de: Erzeugen von Histogrammen
es: Generando histogramas
pt_br: Gerando histogramas

source: We can now try to generate image histograms, using `plt.hist`.
de: Wir können nun versuchen, mit "plt.hist" Bildhistogramme zu erzeugen.
es: Ahora podemos intentar generar histogramas de imágenes usando `plt.hist`.
pt_br: Agora podemos tentar gerar histogramas de imagens, usando `plt.hist`.

source: You might expect `plt.hist(im)` to work, just as `plt.imshow(im)` did previously. However, the result can be a bit surprising.
de: Man könnte erwarten, dass `plt.hist(im)` funktioniert, so wie es `plt.imshow(im)` zuvor tat. Das Ergebnis kann jedoch ein wenig überraschend sein.
es: Es posible que esperes que `plt.hist(im)` funcione, tal como lo hizo anteriormente `plt.imshow(im)`. Sin embargo, el resultado puede parecer un poco sorprendente.
pt_br: Você pode esperar que `plt.hist(im)` funcione, assim como `plt.imshow(im)` funcionou anteriormente. No entanto, o resultado pode ser um pouco surpreendente.

source: The problem is that the image is 2D, and `plt.hist` is expecting just a single 1D list of values. We can generate that with a call to `.flatten()`, and use the flattened array to create the histogram.
de: Das Problem ist, dass das Bild 2D ist und `plt.hist` nur eine einzelne 1D-Liste von Werten erwartet. Wir können das mit einem Aufruf von "flatten()" erzeugen und das geglättete Array verwenden, um das Histogramm zu erstellen.
es: El problema es que la imagen es 2D y `plt.hist` espera solo una lista de valores 1D. Podemos generar eso con una llamada a `.flatten()` y usar la matriz aplanada para crear el histograma.
pt_br: O problema é que a imagem é 2D e `plt.hist` espera apenas uma única lista de valores 1D. Podemos gerar isso com uma chamada para `.flatten()` e usar o array achatado para criar o histograma.

source: As with `plt.imshow`, we have lots of options to customize the histogram. This includes the ability to set the color or number of histogram bins.
de: Wie bei `plt.imshow` haben wir viele Optionen, um das Histogramm anzupassen. Dazu gehört die Möglichkeit, die Farbe oder die Anzahl der Histogramm-Bins festzulegen.
es: Al igual que con `plt.imshow`, tenemos muchas opciones para personalizar el histograma. Esto incluye la capacidad de establecer el color o la cantidad de contenedores de histograma.
pt_br: Tal como acontece com `plt.imshow`, temos muitas opções para personalizar o histograma. Isso inclui a capacidade de definir a cor ou o número de caixas do histograma.

source: **Parentheses**
es: **Paréntesis**
pt_br: **Parênteses**

source: It may initially be confusing why we sometimes need parentheses `()` and sometimes we don't, e.g. `im.flatten()` vs. `im.shape`.
de: Es mag zunächst verwirrend sein, warum wir manchmal Klammern `()` brauchen und manchmal nicht, z.B. `im.flatten()` vs. `im.shape`.
es: Inicialmente puede resultar confuso por qué a veces necesitamos paréntesis `()` y otras no, p.e. `im.flatten()` frente a `im.shape`.
pt_br: Inicialmente pode ser confuso porque às vezes precisamos de parênteses `()` e às vezes não, por exemplo. `im.flatten()` vs.

source: As a general rule, parentheses indicate that we're calling a method that *does* something (e.g. prints a value, calculates an average, flattens an array).
de: In der Regel zeigen Klammern an, dass wir eine Methode aufrufen, die etwas *tut* (z. B. einen Wert ausgibt, einen Durchschnitt berechnet, ein Array glättet).
es: Como regla general, los paréntesis indican que estamos llamando a un método que *hace* algo (por ejemplo, imprime un valor, calcula un promedio, aplana una matriz).
pt_br: Como regra geral, parênteses indicam que estamos chamando um método que *faz* algo (por exemplo, imprime um valor, calcula uma média, nivela um array).

source: When we don't see parentheses, this indicates that we're accessing a field or property (e.g. the shape of an array).
de: Wenn keine Klammern zu sehen sind, bedeutet dies, dass auf ein Feld oder eine Eigenschaft zugegriffen wird (z. B. die Form eines Arrays).
es: Cuando no vemos paréntesis, esto indica que estamos accediendo a un campo o propiedad (por ejemplo, la forma de una matriz).
pt_br: Quando não vemos parênteses, isso indica que estamos acessando um campo ou propriedade (por exemplo, o formato de um array).

source: In practice, the distinction can sometimes be a bit murky as you get deeper into Python - but it helps as a general guide.
de: In der Praxis kann die Unterscheidung manchmal etwas undeutlich sein, wenn man tiefer in Python einsteigt - aber sie ist als allgemeiner Leitfaden hilfreich.
es: En la práctica, la distinción a veces puede resultar un poco confusa a medida que se profundiza en Python, pero sirve como guía general.
pt_br: Na prática, a distinção às vezes pode ser um pouco obscura à medida que você se aprofunda no Python - mas ajuda como um guia geral.
