Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/imagej.po
Languages: es

source: One way to measure in 3D is to use the {menuselection}`Histogram` command and specify that the entire stack should be included – this provides some basic statistics, including the total number, mean, minimum, maximum and standard deviation of the pixels [^fn_2]. This will respect the boundaries of a 2D ROI if one has been drawn.
es: Una forma de medir en 3D es utilizar el comando {menuselection}`Histograma` y especificar que se debe incluir toda la pila; esto proporciona algunas estadísticas básicas, incluyendo el número total, la media, desviación mínima, máxima y estándar de los píxeles [^fn_2]. Esto respetará los límites de un ROI 2D si se ha dibujado uno.

source: This is a start, but it will not adjust to changes in the object boundary on each 2D plane. A better approach could be to use {menuselection}`Image --> Adjust --> Threshold...` to set a threshold that identifies the object – but do _not_ press {guilabel}`Apply` to generate a binary image. Rather, under {menuselection}`Analyze --> Set Measurements...` select {guilabel}`Limit to threshold`. Then when you compute the stack histogram (or press {menuselection}`Measure` for 2D) only above-threshold pixels will be included in the statistics. Just be sure to reset {guilabel}`Limit to threshold` later.
es: Este es un comienzo, pero no se ajustará a los cambios en los límites del objeto en cada plano 2D. Un mejor enfoque podría ser usar {menuselection}`Image --> Adjust --> Threshold...` para establecer un umbral que identifique el objeto, pero _no_ presione {guilabel}`Apply` para generar una imagen binaria. Más bien, en {menuselection}`Analyze --> Set Measurements...` selecciona {guilabel}`Limit to threshold`. Luego, cuando calcules el histograma de la pila (o presiones {menuselection}`Measure` para 2D), solo se incluirán en las estadísticas los píxeles por encima del umbral. Solo asegúrate de restablecer el {guilabel}`Limit to threshold` más adelante.

source: How can you translate the total number of pixels in an object into its volume, e.g. in µm<sup>3</sup>? Give some thought to how accurate your method will be.
es: ¿Cómo se puede traducir el número total de píxeles de un objeto a su volumen, p.ej. en µm<sup>3</sup>? Piensa un poco en qué tan preciso será tu método.

source: You could treat each pixel as a rectangular cuboid, with a volume equal to _pixel width_×_pixel height_×_voxel depth_ (as given in {menuselection}`Image --> Properties...`). Then multiply this by the number of pixels within the object. This is what the {ref}`3D Objects Counter<sec_multidimensional_counter>` plugin does when measuring volumes.
es: Podrías tratar cada píxel como un cuboide rectangular, con un volumen igual a _ancho de píxel_×_alto de píxel_×_profundidad de voxel_ (como se indica en {menuselection}`Image --> Properties...` ). Luego multiplica esto por la cantidad de píxeles dentro del objeto. Esto es lo que hace el plugin {ref}`3D Objects Counter<sec_multidimensional_counter>` al medir volúmenes.

source: Whenever you want to compare object sizes across images acquired with different pixel sizes, this is certainly better than just taking the raw pixel counts as measures of volume. However, it is unlikely to be very accurate – and volume measurements obtained this way should not be trusted too much, especially when dealing with very small sizes. They are also likely to be quite sensitive to spacing.
es: Siempre que desees comparar tamaños de objetos entre imágenes adquiridas con diferentes tamaños de píxeles, esto es ciertamente mejor que simplemente tomar los recuentos de píxeles sin procesar como medidas de volumen. Sin embargo, es poco probable que sea muy preciso y no se debe confiar demasiado en las mediciones de volumen obtenidas de esta manera, especialmente cuando se trata de tamaños muy pequeños. También es probable que sean bastante sensibles al espaciado.

source: Using NaNs
es: Usando NaNs

source: I am not a fan of {guilabel}`Limit to threshold`, because I am likely to forget to reset it afterwards and may subsequently measure the wrong things for days thereafter.
es: No soy un fanático de {guilabel}`Limit to threshold`, porque es probable que me olvide de restablecerlo después y posteriormente pueda medir cosas incorrectas durante los días siguientes.

source: An alternative that I prefer is to set my threshold on a 32-bit copy of the image I am working with, and then {guilabel}`Apply` the threshold using the {guilabel}`Set Background Pixels to NaN` option. Then all below-threshold pixels will automatically be excluded from any measurements I make on the result, since they are 'no longer numbers' (see {ref}`Thresholding <sec_thresholding_nans>` for more details).
es: Una alternativa que prefiero es establecer mi umbral en una copia de 32 bits de la imagen con la que estoy trabajando y luego {guilabel}`Apply` el umbral usando la opcion {guilabel}`Set Background Pixels to NaN`. Luego, todos los píxeles por debajo del umbral se excluirán automáticamente de cualquier medición que realice en el resultado, ya que "ya no son números" (consulte {ref}`Thresholding <sec_thresholding_nans>` para más detalles).

source: The 3D Objects Counter
es: El contador de objetos 3D

source: Currently, the closest thing to {menuselection}`Analyze Particles...` for measuring connected objects in 3D built-in to Fiji is the 3D Objects Counter ({menuselection}`Analyze --> 3D Objects Counter`) [^fn_3]. Its settings (analogous to {menuselection}`Set Measurements...`) are under {menuselection}`Analyze --> 3D OC Options`. In addition to various measurements, it provides labelled images as output, either of the entire objects or only their central pixels – optionally with labels, or expanded to be more visible.
es: Actualmente, lo más parecido a {menuselection}`Analyze Particles...` para medir objetos conectados en 3D integrado en Fiji es el contador de objetos 3D ({menuselection}`Analyze --> 3D Objects Counter`) [^fn_3]. Su configuración (análoga a {menuselection}`Set Measurements...`) está en {menuselection}`Analyze --> 3D OC Options` . Además de varias mediciones, proporciona imágenes etiquetadas como resultado, ya sea de los objetos completos o solo de sus píxeles centrales, opcionalmente con etiquetas o ampliadas para que sean más visibles.

source: Find Connected Regions
es: Encuentra regiones conectadas

source: {menuselection}`Plugins --> Process --> Find Connected Regions` is a command primarily for creating labelled images from thresholded 3D data, which can also give the total number of pixels per object. If the main thing you want is the labelled image without many more results, it may be faster than {menuselection}`3D Objects Counter`.
es: {menuselection}`Plugins --> Process --> Find Connected Regions` es un comando principalmente para crear imágenes anotadas a partir de datos 3D con umbrales, que también pueden proporcionar el número total de píxeles por objeto. Si lo principal que deseas es la imagen anotada sin muchos más resultados, puede ser más rápido que {menuselection}`3D Objects Counter`.

source: Additional 3D tools
es: Herramientas adicionales 3D

source: For working with 3D data, it may be very useful to download the '3D ImageJ Suite' from https://imagej.net/plugins/3d-imagej-suite/. his not only includes a range of fast filters and commands for segmentation, but also a 3D version of the ROI Manager.
es: Para trabajar con datos 3D, puede resultar muy útil descargar '3D ImageJ Suite' desde https://imagej.net/plugins/3d-imagej-suite/. Esto no sólo incluye una gama de filtros rápidos y comandos para la segmentación, sino también una versión 3D del ROI Manager.

source: While created for bone image analysis, _BoneJ_ (https://bonej.org) also includes some components that are useful for general applications –- including a fast [3D Particle Analyser](https://bonej.org/particles) (another alternative to the 3D Objects Counter) and a tool to [interpolate ROIs across image slices](https://bonej.org/utilities).
es: Si bien se creó para el análisis de imágenes óseas, _BoneJ_ (https://bonej.org) también incluye algunos componentes que son útiles para aplicaciones generales, incluyendo un rápido [Analizador de partículas 3D](https://bonej.org/particles) (otro alternativa al contador de objetos 3D) y una herramienta para [interpolar ROI en cortes de imagen] (https://bonej.org/utilities).

source: See https://imagej.net/Bleach_Correction
es: Ver https://imagej.net/Bleach_Correction

source: Be careful! If you have multiple channels, these should be split first
es: ¡Ten cuidado! Si tienes varios canales, estos deben dividirse primero.

source: See See S Bolte and F P Cordelières. “A guided tour into subcellular colocalization analysis in light microscopy.” Journal of Microscopy 224.Pt 3 (Dec. 2006), pp. 213–32. url: https://pubmed.ncbi.nlm.nih.gov/17210054/
es: Véase S Bolte y F P Cordelières. "A guided tour into subcellular colocalization analysis in light microscopy.” Journal of Microscopy 224.Pt 3 (Dec. 2006), pp. 213–32. url: https://pubmed.ncbi.nlm.nih.gov/17210054/
