Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/imagej.po
Languages: es

source: ImageJ: Multidimensional processing
es: ImageJ: procesamiento multidimensional

source: Work in progress!
es: ¡Trabajo en progreso!

source: This section isn't complete yet. It's really just a scattered collection of thoughts for now.
es: Esta sección aún no está completa. En realidad, por ahora es sólo una colección dispersa de pensamientos.

source: Introduction
es: Introducción

source: This section gives a brief overview of some things to think about when working with z-stacks and time series in ImageJ.
es: Esta sección ofrece una breve descripción general de algunas cosas en las que pensar cuando se trabaja con pilas z y series de tiempo en ImageJ.

source: Point operations, contrast & conversion
es: Operaciones de puntos, contraste y conversión.

source: Point operations are straightforward: they depend only on individual pixels, so the number of dimensions is unimportant. Image arithmetic involving a 3D stack and a 2D image can also be carried out in ImageJ using the {menuselection}`Process --> Image Calculator`, where the operation involving the 2D image is applied to each slice of the 3D stack in turn. Other options, such as filtering and thresholding, are possible, but bring with them extra considerations -- and often significantly higher computational costs.
es: Las operaciones puntuales son sencillas: dependen sólo de píxeles individuales, por lo que el número de dimensiones no es importante. La aritmética de imágenes que involucra una pila 3D y una imagen 2D también se puede realizar en ImageJ usando {menuselection}`Process --> Image Calculator`, donde se aplica la operación que involucra la imagen 2D. a cada porción de la pila 3D por turno. Otras opciones, como el filtrado y el establecimiento de umbrales, son posibles, pero conllevan consideraciones adicionales y, a menudo, costos computacionales significativamente más altos.

source: Setting the LUT of a 3D image requires particular care. The normal {menuselection}`Brightness/Contrast...` tool only takes the currently-displayed slice into consideration when pressing {guilabel}`Reset` or {guilabel}`Auto`. Optimizing the display for a single slice does not necessarily mean the rest of the stack will look reasonable if the brightness changes much. {menuselection}`Process --> Enhance Contrast...` is a better choice, since here you can specify that the information in the entire stack should be used. You can also specify the percentage of pixels that should be saturated (clipped) _for display_, i.e. those that should be shown with the first or last colors in the LUT. So long as {guilabel}`Normalize` and {guilabel}`Equalize histogram` are not selected, the pixel values shouldn't be changed.
es: Configurar la LUT de una imagen 3D requiere especial cuidado. La herramienta normal {menuselection}`Brightness/Contrast...` solo toma en consideración el segmento que se muestra actualmente al presionar {guilabel}`Reset ` o {guilabel}`Auto`. Optimizar la pantalla para un solo segmento no significa necesariamente que el resto de la pila se verá razonable si el brillo cambia mucho. {menuselection}`Process --> Enhance Contrast...` es una mejor opción, ya que aquí puedes especificar que se debe utilizar la información de toda la pila. También puedes especificar el porcentaje de píxeles que deben saturarse (recortarse) _para su visualización_, es decir, aquellos que deben mostrarse con el primer o último color en la LUT. Mientras {guilabel}`Normalize` y {guilabel}`Equalize histogram` no estén seleccionados, los valores de píxeles no se deben cambiar.

source: Question
es: Pregunta

source: By default, the percentage of saturated pixels in {menuselection}`Enhance Contrast...` is set to 0.4. Why might this be chosen instead of 0?
es: De forma predeterminada, el porcentaje de píxeles saturados en {menuselection}`Enhance Contrast...` está establecido en 0.4. ¿Por qué se podría elegir esto en lugar de 0?

source: Answer
es: Respuesta

source: If the percentage of saturated pixels is 0, then the minimum and maximum pixel values throughout the image will be given the first and last LUT colors respectively, with all other colors devoted to values in between. This is sensitive to outliers, and often results in images that have poor contrast. It's usually better to accept some small amount of visual saturation, in order to give more LUT colors to the pixel values between the extremes.
es: Si el porcentaje de píxeles saturados es 0, entonces los valores mínimo y máximo de píxeles en toda la imagen recibirán el primer y último color LUT respectivamente, y todos los demás colores se dedicarán a valores intermedios. Esto es sensible a los valores atípicos y, a menudo, da como resultado imágenes con poco contraste. Generalmente es mejor aceptar una pequeña cantidad de saturación visual para dar más colores LUT a los valores de píxeles entre los extremos.

source: Converting bit-depths of multidimensional images
es: Conversión de profundidades de bits de imágenes multidimensionales

source: As described in {ref}`Types & bit-depths<sec_bit_depths_converting>`, the minimum and maximum display range values are used by default when reducing the bit-depth of an image. To minimize the information lost, these should usually be set to the minimum and maximum pixel values within the image – otherwise values will be clipped.
es: Como se describe en {ref}`Types & bit-depths<sec_bit_depths_converting>`, los valores de rango de visualización mínimo y máximo se utilizan de forma predeterminada al reducir la profundidad de bits de una imagen. Para minimizar la pérdida de información, estos normalmente deben establecerse en los valores de píxeles mínimo y máximo dentro de la imagen; de lo contrario, los valores se recortarán.

source: In 2D it's enough to press {guilabel}`Reset` in the {menuselection}`Brightness/Contrast` window, _but in 3D this will only work if the minimum and maximum values from the entire stack happen to appear on the current slice!_
es: En 2D es suficiente presionar {guilabel}`Reset` en la ventana {menuselection}`Brightness/Contrast`, ¡pero en 3D esto solo funciona si los valores mínimo y máximo de toda la pila aparecen en el segmento actual!

source: For this reason, it's good practice to run {menuselection}`Enhance Contrast...` prior to reducing bit-depths of stacks, setting the saturation to 0 and using the entire stack. This means no pixels will be clipped in the output (although rescaling and rounding will still occur).
es: Por esta razón, es una buena práctica ejecutar {menuselection}`Enhance Contrast...` antes de reducir la profundidad de bits de las pilas, establecer la saturación en 0 y usar toda la pila. Esto significa que no se recortarán píxeles en el output (aunque se seguirán produciendo cambios de escala y redondeo).

source: 3D filtering
es: Filtrado 3D

source: Many filters naturally lend themselves to being applied to as many dimensions as are required. For example, a 3×3 mean filter can easily become a 3×3×3 filter if averaging across slices is allowed. Importantly, it then replaces each pixel by the average of 27 values, rather than 9.
es: Naturalmente, muchos filtros se prestan a aplicarse en tantas dimensiones como sea necesario. Por ejemplo, un filtro medio de 3×3 puede convertirse fácilmente en un filtro de 3×3×3 si se permite el promedio entre secciones. Es importante destacar que luego reemplaza cada píxel por el promedio de 27 valores, en lugar de 9.

source: This implies the reduction in noise is *somewhat* similar to that of applying a 5×5 filter (25 values), but with a little less blurring in 2D and a little more along the third dimension instead. Several 3D filters are available under the {menuselection}`Plugins --> Process -->` submenu.
es: Esto implica que la reducción de ruido es *algo* similar a la de aplicar un filtro de 5×5 (25 valores), pero con un poco menos de desenfoque en 2D y un poco más en la tercera dimensión. Varios filtros 3D están disponibles en el submenú {menuselection}`Plugins --> Process -->`.

source: Fast, separable filters
es: Filtros rápidos y separables

source: {menuselection}`Process --> Filters --> Gaussian Blur 3D...` uses this approach.
es: {menuselection}`Process --> Filters --> Gaussian Blur 3D...` utiliza este enfoque.

source: Fast filters & the Fourier transform
es: Filtros rápidos y la transformada de Fourier

source: Not all linear filters are separable, and applying a large, non-separable linear filter can also be extremely time-consuming. However, when this is the case a whole other method can be used to get the same result using the Fourier transform – where the speed no longer has the same dependence upon the filter size. Unfortunately, the Fourier method cannot be used for non-linear filters such as the median filter.
es: No todos los filtros lineales son separables y la aplicación de un filtro lineal grande y no separable también puede llevar mucho tiempo. Sin embargo, cuando este es el caso, se puede utilizar un método completamente diferente para obtener el mismo resultado utilizando la transformada de Fourier, donde la velocidad ya no depende tanto del tamaño del filtro. Desafortunadamente, el método de Fourier no se puede utilizar para filtros no lineales como el filtro de mediana.

source: Dimensions & isotropy
es: Dimensiones e isotropía

source: If applying a filter in 3D instead of 2D, it may seem natural to define it as having the same size in the third dimension as in the original two. But for a __z__-stack, the spacing between slices is usually larger than the width and height of a pixel. And if the third dimension is time, then it uses another scale entirely. Therefore more thought usually needs to be given to what sizes make most sense.
es: Si se aplica un filtro en 3D en lugar de 2D, puede parecer natural definirlo con el mismo tamaño en la tercera dimensión que en las dos originales. Pero para una pila __z__, el espacio entre cortes suele ser mayor que el ancho y el alto de un píxel. Y si la tercera dimensión es el tiempo, entonces utiliza otra escala completamente diferente. Por lo tanto, normalmente es necesario pensar más en qué tamaños tienen más sentido.

source: In some commands (e.g. {menuselection}`Plugins --> Process --> Smooth (3D)`), there is a {guilabel}`Use calibration` option to determine whether the values you enter are defined in terms of the units found in the {menuselection}`Properties...` and therefore corrected for the stored pixel dimensions. Elsewhere (e.g. {menuselection}`Gaussian Blur 3D...`) the units are pixels, slices and time points – and so you are responsible for figuring out how to compensate for different scales and units.
es: En algunos comandos (por ejemplo, {menuselection}`Plugins --> Process --> Smooth (3D)`), hay una opcion {guilabel}'Use calibration' para determinar si los valores que ingresas están definidos en términos de las unidades que se encuentran en {menuselection}`Properties...` y, por lo tanto, corregidos según las dimensiones de píxeles almacenadas. En otros lugares (por ejemplo, {menuselection}`Gaussian Blur 3D...`) las unidades son píxeles, secciones en z, y puntos de tiempo, por lo que tu eres responsable de descubrir cómo compensar las diferentes escalas y unidades.

source: Thresholding multidimensional data
es: Umbral de datos multidimensionales

source: When thresholding an image with more than 2 dimensions using the {menuselection}`Threshold...` command, it is necessary to choose whether the threshold should be determined from the histogram of the entire stack, or from the currently-visible 2D slice only. If the latter, you will also be asked whether the same threshold should be used for every slice, or if it should be calculated anew for each slice based upon the slice histogram. In some circumstances, these choices can have a very large impact upon the result.
es: Al establecer un umbral en una imagen con más de 2 dimensiones usando el comando {menuselection}`Threshold...`, es necesario elegir si el umbral debe determinarse a partir del histograma de toda la pila, o solo desde el corte 2D actualmente visible. En este último caso, también se te preguntará si se debe utilizar el mismo umbral para cada segmento o si se debe calcular de nuevo para cada segmento según el histograma del segmento. En algunas circunstancias, estas elecciones pueden tener un impacto muy grande en el resultado.

source: When you threshold a stack, you have an option to choose {guilabel}`Stack Histogram`. Then, when you choose {guilabel}`Apply` you are asked if you want to {guilabel}`Calculate Threshold for Each Image`. What difference do you expect these two options to make, and what combinations would you use for:
es: Cuando estableces el umbral de una pila, tienes la opción de elegir {guilabel}`Stack Histogram`. Luego, cuando eliges {guilabel}`Apply`, se te preguntará si deseas {guilabel}`Calculate Threshold for Each Image`. ¿Qué diferencia esperas que hagan estas dos opciones y qué combinaciones usarías para:

source: a stack consisting of 2D images from different color channels
es: una pila que consta de imágenes 2D de diferentes canales de color

source: a __z__-stack
es: una pila __z__

source: a time series
es: una serie de tiempo

source: _Note:_ Have a look at what happens when you click {guilabel}`Auto` while scrolling through one channel of the stack {menuselection}`File --> Open samples --> Mitosis (26 MB, 5D Stack)`, with and without {guilabel}`Stack Histogram` selected. You will have to split the channels for this because ImageJ currently refuses to threshold multichannel images with extra dimensions (which helps avoid some confusion). {guilabel}`Dark Background` should always be selected here.
es: _Nota:_ Echa un vistazo a lo que sucede cuando haces click en {guilabel}`Auto` mientras te desplaza por un canal de la pila {menuselection}` File --> Open samples --> Mitosis (26 MB, 5D Stack)`, con y sin {guilabel}`Stack Histogram` seleccionado. Tendrás que dividir los canales para esto porque ImageJ actualmente se niega a establecer un umbral para imágenes multicanal con dimensiones adicionales (lo que ayuda a evitar cierta confusión). {guilabel}`Dark Background` siempre debe estar seleccionado aquí.

source: If {guilabel}`Stack Histogram` is checked, the thresholds are computed from a histogram of all the pixels in the entire image stack; otherwise, the histogram of only the currently-displayed image slice is used.
es: Si se marca {guilabel}`Stack Histogram`, los umbrales se calculan a partir de un histograma de todos los píxeles de toda la pila de imágenes; de lo contrario, se utiliza únicamente el histograma del segmento de imagen que se muestra actualmente.

source: BUT! If {guilabel}`Calculate Threshold for Each Image` is chosen, then this is ignored: the threshold is always determined by the selected automatic method using the histogram of the corresponding slice only.
es: ¡PERO! Si se elige {guilabel}`Calculate Threshold for Each Image`, esto se ignora: el umbral siempre lo determina el método automático seleccionado utilizando únicamente el histograma del segmento correspondiente.

source: Therefore, the most sensible combinations of thresholding options to use depend upon the type of data.
es: Por lo tanto, las combinaciones más sensatas de opciones de umbral a utilizar dependen del tipo de datos.

source: _color channels_ – There is often no good reason to suppose the amount of fluorescence in different color channels will be similar, and so thresholds should be calculated from each channel independently.
es: _canales de color_: a menudo no hay una buena razón para suponer que la cantidad de fluorescencia en diferentes canales de color será similar, por lo que los umbrales deben calcularse a partir de cada canal de forma independiente.

source: _z-Stacks_ – It is normally a good idea to use the stack histogram with __z__-stacks. If you do not, then your threshold will be affected by whatever slice you happen to be viewing at the time of thresholding – introducing a potentially weird source of variability in the results. It is probably _not_ a good idea to calculate a new threshold for each slice, because this would lead to at least _something_ being detected on every slice. But in the outer slices there may well only be blur and noise – in which case nothing _should_ be detected!
es: _z-Stacks_: normalmente es una buena idea utilizar el histograma de pila con __z__-stacks. Si no lo haces, tu umbral se verá afectado por cualquier segmento que estés viendo en el momento del umbral, lo que introduce una fuente de variabilidad potencialmente extraña en los resultados. Probablemente _no_ sea una buena idea calcular un nuevo umbral para cada segmento, porque esto llevaría a que se detecte al menos _algo_ en cada segmento. Pero en los cortes exteriores puede que sólo haya desenfoque y ruido, ¡en cuyo caso no debería detectarse nada!

source: _Time series_ – In a time series, bleaching can sometimes cause the image to darken over time. In such a case, using the stack histogram might cause fewer pixels to exceed the threshold at later time points simply for this reason, and recalculating the threshold for each image may be better. On the other hand, if images were previously normalized somehow to compensate for bleaching [^fn_1], then the stack threshold might be preferable again. It's tricky.
es: _Serie temporal_: en una serie temporal, el blanqueamiento a veces puede hacer que la imagen se oscurezca con el tiempo. En tal caso, el uso del histograma de pila podría provocar que menos píxeles superen el umbral en momentos posteriores simplemente por este motivo, y puede ser mejor volver a calcular el umbral para cada imagen. Por otro lado, si las imágenes se normalizaron previamente de alguna manera para compensar el blanqueamiento [^fn_1], entonces el umbral de pila podría ser preferible nuevamente. Es complicado.

source: There is one other implementation issue that needs attention. When {guilabel}`Dark Background` is checked and an automated threshold is computed, then it is only really the low threshold that matters – the high threshold is always set to the maximum in the histogram to ensure that all brighter pixels are designated 'foreground' in the result. However, if not using {guilabel}`Stack Histogram`, then for non-8-bit images the histograms are calculated using the minimum and maximum pixels on the slice, and consequently the high threshold cannot be higher than this maximum value (look at how the high threshold value changes in {menuselection}`Mitosis` as you compute auto thresholds for different slices). This means that any brighter pixels will be _outside_ the threshold range (and therefore 'background') if they occur on a different slice. This can cause holes to appear in the brightest parts of structures, and is probably not what you want. A similar situation occurs with the low threshold when {guilabel}`Dark Background` is unchecked.
es: Hay otra cuestión de implementación que requiere atención. Cuando se marca {guilabel}`Dark Background` y se calcula un umbral automático, lo único que realmente importa es el umbral bajo: el umbral alto siempre se establece en el máximo en el histograma. para garantizar que todos los píxeles más brillantes se designen como "primer plano" en el resultado. Sin embargo, si no se utiliza {guilabel}`Stack Histogram`, entonces, para imágenes que no sean de 8 bits, los histogramas se calculan utilizando los píxeles mínimo y máximo en el corte y, en consecuencia, el umbral alto no puede ser mayor que este valor máximo (observa cómo cambia el valor del umbral alto en {menuselection}`Mitosis` a medida que calculas los umbrales automáticos para diferentes sectores). Esto significa que cualquier píxel más brillante estará _fuera_ del rango de umbral (y, por lo tanto, del "fondo") si se produce en un segmento diferente. Esto puede provocar que aparezcan agujeros en las partes más brillantes de las estructuras y probablemente no sea lo que desea. Una situación similar ocurre con el umbral bajo cuando {guilabel}`Dark Background` no está marcado.

source: Measurements in 3D data
es: Medidas en datos 3D

source: ImageJ has good support for making measurements in 2D, particularly the {menuselection}`Measure` and {menuselection}`Analyze Particles...` commands. The latter can happily handle 3D images, but only by creating and measuring 2D ROIs independently on each slice. Alternatively, {menuselection}`Image --> Stacks --> Plot Z-axis Profile` is like applying {menuselection}`Measure` to each slice independently, making measurements either over the entire image or any ROI. It will also plot the mean pixel values, but even if you do not particularly want this the command can still be useful. However, if single measurements should be made for individual objects that extend across multiple slices, neither of these options would be enough.
es: ImageJ tiene un buen soporte para realizar mediciones en 2D, particularmente los comandos {menuselection}`Measure` y {menuselection}`Analyze Particles...` . Este último puede manejar felizmente imágenes 3D, pero solo creando y midiendo ROI 2D de forma independiente en cada corte. Alternativamente, {menuselection}`Image --> Stacks --> Plot Z-axis Profile` es como aplicar {menuselection}`Measure` a cada corte de forma independiente, realizando mediciones en toda la imagen o en cualquier ROI. También trazará los valores medios de píxeles, pero incluso si no lo deseas especialmente, el comando puede resultar útil. Sin embargo, si se debieran realizar mediciones únicas para objetos individuales que se extienden a lo largo de múltiples cortes, ninguna de estas opciones sería suficiente.

source: Practical
es: Práctico

source: Suppose you have a cell, nucleus or some other large 3D structure in a __z__-stack, and you want to draw the smallest 2D ROI that completely contains it on every slice. An example is shown below for the green structure in the {menuselection}`Confocal Series` sample image.
es: Supongamos que tienes una célula, un núcleo o alguna otra estructura grande en 3D en una pila __z__ y deseas dibujar el ROI 2D más pequeño que lo contenga completamente en cada segmento. A continuación se muestra un ejemplo de la estructura verde en la imagen de muestra {menuselection}`Confocal Series`.

source: How would you create such a ROI, and be confident that it is large enough for all slices?
es: ¿Cómo crearías ese ROI y estarías seguro/a de que es lo suficientemente grande para todos los sectores?

source: launch ImageJ.JS
es: lanzar ImageJ.JS

source: Solution
es: Solución

source: My strategy would be to create a z-projection (max intensity) and then draw the ROI on this – or, preferably, create the ROI by thresholding using {menuselection}`Image --> Adjust --> Threshold` and the {guilabel}`Wand` tool. This ROI can then be transferred over to the original stack, either via the ROI Manager or {menuselection}`Edit --> Selection --> Restore Selection`.
es: Mi estrategia sería crear una proyección z (intensidad máxima) y luego dibujar el ROI en esto o, preferiblemente, crear el ROI mediante un umbral usando {menuselection}`Image --> Adjust --> Threshold` y la herramienta {guilabel}`Wand`. Este ROI luego se puede transferir a la pila original, ya sea a través del ROI Manager o {menuselection}`Edit --> Selection --> Restore Selection`.

source: Histograms & threshold clipping
es: Histogramas y recorte de umbral
