Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/multidimensional_processing.po
Languages: de, es, pt_br

source: Most modern computers capable of image analysis contain multiple processors, which can do multiple things at the same time. Image analysis software that supports **multiprocessing** is able to use these processors to operate on different parts of the data simultaneously. It's more work for the programmer, but better for the user.
de: Die meisten modernen Computer, die für die Bildanalyse geeignet sind, verfügen über mehrere Prozessoren, die mehrere Dinge gleichzeitig tun können. Bildanalysesoftware, die **Multiprocessing** unterstützt, kann diese Prozessoren nutzen, um verschiedene Teile der Daten gleichzeitig zu bearbeiten. Das ist zwar mehr Arbeit für den Programmierer, aber besser für den Benutzer.
es: La mayoría de las computadoras modernas capaces de analizar imágenes contienen múltiples procesadores, que pueden hacer varias cosas al mismo tiempo. El software de análisis de imágenes que admite **multiprocesamiento** puede utilizar estos procesadores para operar en diferentes partes de los datos simultáneamente. Es más trabajo para el programador, pero mejor para el usuario.
pt_br: A maioria dos computadores modernos capazes de análise de imagens contém vários processadores, que podem fazer várias coisas ao mesmo tempo. O software de análise de imagens compatível com **multiprocessamento** é capaz de usar esses processadores para operar em diferentes partes dos dados simultaneamente. É mais trabalhoso para o programador, mas melhor para o usuário.

source: The benefits of multiprocessing can be important, but still tend to be fairly modest. A typical desktop computer today could have between 2 and 8 processors (although particularly powerful machines can have more). However, doubling the numbers of processors doesn't mean that the computation time is likely to be halved, because it's hard for software to keep all the processors occupied. Tasks tend to depend upon one another, and so it's common for one processor to have to lounge around while another processor is completing its part of the job. Our performance aspirations can also be thwarted by other bottlenecks, such as reading or writing images.
de: Die Vorteile des Multiprocessing können erheblich sein, sind aber in der Regel noch recht bescheiden. Ein typischer Desktop-Computer kann heute zwischen 2 und 8 Prozessoren haben (besonders leistungsfähige Rechner können auch mehr haben). Eine Verdoppelung der Anzahl der Prozessoren bedeutet jedoch nicht, dass sich die Rechenzeit halbiert, da es für Software schwierig ist, alle Prozessoren zu beschäftigen. Die Aufgaben hängen in der Regel voneinander ab, und so kommt es häufig vor, dass ein Prozessor sich zurücklehnen muss, während ein anderer Prozessor seinen Teil der Aufgabe erledigt. Unsere Leistungsbestrebungen können auch durch andere Engpässe, wie das Lesen oder Schreiben von Bildern, vereitelt werden.
es: Los beneficios del multiprocesamiento pueden ser importantes, pero aún así tienden a ser bastante modestos. Un ordenador de mesa típico hoy en día podría tener entre 2 y 8 procesadores (aunque las máquinas especialmente potentes pueden tener más). Sin embargo, duplicar el número de procesadores no significa que el tiempo de cálculo se reducirá a la mitad, porque al software le resulta difícil mantener ocupados todos los procesadores. Las tareas tienden a depender unas de otras, por lo que es común que un procesador tenga que holgazanear mientras otro procesador completa su parte del trabajo. Nuestras aspiraciones de rendimiento también pueden verse frustradas por otros obstáculos, como la lectura o la escritura de imágenes.
pt_br: Os benefícios do multiprocessamento podem ser importantes, mas ainda tendem a ser bastante modestos. Um computador desktop típico hoje pode ter entre 2 e 8 processadores (embora máquinas particularmente poderosas possam ter mais). No entanto, duplicar o número de processadores não significa que o tempo de computação provavelmente será reduzido pela metade, porque é difícil para o software manter todos os processadores ocupados. As tarefas tendem a depender umas das outras e, portanto, é comum que um processador fique parado enquanto outro processador completa sua parte do trabalho. Nossas aspirações de desempenho também podem ser frustradas por outros gargalos, como ler ou escrever imagens.

source: To see a **dramatic** improvement in image processing performance, we usually need to look into **Graphics Processing Unit (GPUs)**, aka. **graphics cards**.
de: Um eine **dramatische** Verbesserung der Bildverarbeitungsleistung zu erreichen, müssen wir uns normalerweise mit **Graphics Processing Unit (GPUs)**, auch bekannt als **Grafikkarten**, beschäftigen.
es: Para ver una mejora **dramática** en el rendimiento del procesamiento de imágenes, normalmente debemos analizar las **Unidades de procesamiento de gráficos (GPU)**, también conocidas como. **tarjetas gráficas**.
pt_br: Para ver uma melhoria **dramática** no desempenho do processamento de imagem, geralmente precisamos examinar a **Unidade de Processamento Gráfico (GPUs)**, também conhecida como. **placas gráficas**.

source: A GPU can't do everything that a general-purpose processor can do, but it is very good at what it *can* do -- which includes core operations like image filtering or matrix multiplication.
de: Ein Grafikprozessor kann nicht alles, was ein Allzweckprozessor kann, aber er ist sehr gut in dem, was er *kann* - dazu gehören Kernoperationen wie Bildfilterung oder Matrixmultiplikation.
es: Una GPU no puede hacer todo lo que puede hacer un procesador de propósito general, pero es muy buena en lo que *puede* hacer, lo que incluye operaciones centrales como filtrado de imágenes o multiplicación de matrices.
pt_br: Uma GPU não pode fazer tudo o que um processador de uso geral pode fazer, mas é muito boa no que *pode* fazer - o que inclui operações básicas como filtragem de imagens ou multiplicação de matrizes.

source: Haase, R., Royer, L.A., Steinbach, P. et al. CLIJ: GPU-accelerated image processing for everyone. *Nat Methods* 17, 5–6 (2020). [(DOI)](https://doi.org/10.1038/s41592-019-0650-1)
de: Haase, R., Royer, L.A., Steinbach, P. et al. CLIJ: GPU-beschleunigte Bildverarbeitung für jedermann. *Nat Methods* 17, 5-6 (2020). [(DOI)](https://doi.org/10.1038/s41592-019-0650-1)
pt_br: Haase, R., Royer, LA, Steinbach, P. et al. CLIJ: Processamento de imagem acelerado por GPU para todos. *Métodos Nat* 17, 5–6 (2020). [(DOI)](https://doi.org/10.1038/s41592-019-0650-1)

source: Programming for GPUs is rather specialized, but there are some tools to help. **Robert Haase** has worked extensively on using GPUs for multidimensional bioimage analysis -- I highly recommend checking out [**CLIJ**](https://clij.github.io/) and [**clEsperanto**](https://clesperanto.github.io) for more details.
de: Die Programmierung für GPUs ist ziemlich speziell, aber es gibt einige Tools, die dabei helfen. **Robert Haase** hat sich intensiv mit der Verwendung von GPUs für die multidimensionale Bioimage-Analyse befasst - ich empfehle dringend, [**CLIJ**] (https://clij.github.io/) und [**clEsperanto**] (https://clesperanto.github.io) für weitere Details zu lesen.
es: La programación para GPU es bastante especializada, pero existen algunas herramientas que pueden ayudar. **Robert Haase** ha trabajado extensamente en el uso de GPU para análisis de bioimágenes multidimensionales. Recomiendo encarecidamente consultar [**CLIJ**](https://clij.github.io/) y [**clEsperanto**] (https://clesperanto.github.io) para más detalles.
pt_br: A programação para GPUs é bastante especializada, mas existem algumas ferramentas para ajudar. **Robert Haase** trabalhou extensivamente no uso de GPUs para análise de bioimagem multidimensional. Recomendo fortemente conferir [**CLIJ**](https://clij.github.io/) e [**clEsperanto**] (https://clesperanto.github.io) para mais detalhes.
