Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/multidimensional_processing.po
Languages: de, es, pt_br

source: The situation improves *dramatically* if a filter is **separable**. This means that instead of applying, for example, a single 11×11×11 filter (1331 coefficients) we can instead apply three separate 11×1 filters oriented along each dimension (33 coefficients).
de: Die Situation verbessert sich *dramatisch*, wenn ein Filter **trennbar** ist. Das bedeutet, dass wir statt eines einzigen 11×11×11-Filters (1331 Koeffizienten) drei separate 11×1-Filter anwenden können, die entlang jeder Dimension ausgerichtet sind (33 Koeffizienten).
es: La situación mejora *dramáticamente* si un filtro es **separable**. Esto significa que en lugar de aplicar, por ejemplo, un único filtro de 11×11×11 (1331 coeficientes), podemos aplicar tres filtros separados de 11×1 orientados a lo largo de cada dimensión (33 coeficientes).
pt_br: A situação melhora *dramaticamente* se um filtro for **separável**. Isso significa que em vez de aplicar, por exemplo, um único filtro 11×11×11 (1331 coeficientes), podemos aplicar três filtros 11×1 separados orientados ao longo de cada dimensão (33 coeficientes).

source: Not all linear filters are separable, but many common ones are. This includes mean filters (depending upon neigborhood shape) and Gaussian filters. The result of applying the filter separably should be the same as the result of applying one dense multidimensional filter ({numref}`fig-gauss_separable`). Some small differences may arise through the handling of [rounding and bit-depths](chap_bit_depths), but the improvement in performance is almost certainly worth any tiny error introduced by applying a filter separably.
de: Nicht alle linearen Filter sind trennbar, aber viele gängige Filter sind es. Dazu gehören Mittelwertfilter (abhängig von der Form der Nachbarschaft) und Gauß-Filter. Das Ergebnis der Anwendung eines separablen Filters sollte dasselbe sein wie das Ergebnis der Anwendung eines dichten mehrdimensionalen Filters ({numref}`fig-gauss_separable`). Einige kleine Unterschiede können durch die Behandlung von [Rundung und Bittiefen](chap_bit_depths) entstehen, aber die Leistungsverbesserung ist mit Sicherheit jeden kleinen Fehler wert, der durch die Anwendung eines Filters in getrennter Form entsteht.
es: No todos los filtros lineales son separables, pero muchos de los más comunes sí lo son. Esto incluye filtros medios (según la forma del vecindario) y filtros Gaussianos. El resultado de aplicar el filtro por separado debe ser el mismo que el resultado de aplicar un filtro multidimensional denso ({numref}`fig-gauss_separable`). Pueden surgir algunas pequeñas diferencias a través del manejo de [redondeo y profundidades de bits] (chap_bit_ Depths), pero es casi seguro que la mejora en el rendimiento vale la pena por cualquier pequeño error introducido al aplicar un filtro por separado.
pt_br: Nem todos os filtros lineares são separáveis, mas muitos dos mais comuns são. Isso inclui filtros médios (dependendo do formato da vizinhança) e filtros gaussianos. O resultado da aplicação do filtro separavelmente deve ser igual ao resultado da aplicação de um filtro multidimensional denso ({numref}`fig-gauss_separable`). Algumas pequenas diferenças podem surgir através do tratamento de [arredondamento e profundidade de bits](chap_bit_profundidades), mas a melhoria no desempenho quase certamente compensa qualquer pequeno erro introduzido pela aplicação de um filtro separavelmente.

source: 2D Gaussian smoothing can be applied using a single 2D filter, or by sequentially filtering either rows or columns of the image: the end result is the same (up to rounding error). The order of the separable filtering doesn't matter.
de: Die 2D-Gauß-Glättung kann mit einem einzigen 2D-Filter oder durch sequentielles Filtern von Zeilen oder Spalten des Bildes durchgeführt werden: Das Endergebnis ist das gleiche (bis auf Rundungsfehler). Die Reihenfolge der trennbaren Filterung spielt keine Rolle.
es: El suavizado Gaussiano 2D se puede aplicar usando un único filtro 2D o filtrando secuencialmente filas o columnas de la imagen: el resultado final es el mismo (hasta el error de redondeo). El orden del filtrado separable no importa.
pt_br: A suavização gaussiana 2D pode ser aplicada usando um único filtro 2D ou filtrando sequencialmente linhas ou colunas da imagem: o resultado final é o mesmo (até erro de arredondamento). A ordem da filtragem separável não importa.

source: Considerations are similar for **nonlinear filters**: when we add more dimensions, the neighborhood size can increase quickly and make the calculations slow. Separability can help with some nonlinear filters (e.g. minimum and maximum, depending on window shape), but not all. Median filters in particular are difficult to optimize, and can be *extremely* slow when the neighborhood is large and/or more than 2D.
de: Ähnliche Überlegungen gelten für **nichtlineare Filter**: Wenn wir mehr Dimensionen hinzufügen, kann die Größe der Nachbarschaft schnell zunehmen und die Berechnungen verlangsamen. Die Trennbarkeit kann bei einigen nichtlinearen Filtern (z. B. Minimum und Maximum, abhängig von der Fensterform) helfen, aber nicht bei allen. Insbesondere Medianfilter sind schwer zu optimieren und können *extrem* langsam sein, wenn die Nachbarschaft groß und/oder mehr als 2D ist.
es: Las consideraciones son similares para los **filtros no lineales**: cuando agregamos más dimensiones, el tamaño de la vecindad puede aumentar rápidamente y ralentizar los cálculos. La separabilidad puede ayudar con algunos filtros no lineales (por ejemplo, mínimo y máximo, según la forma de la ventana), pero no con todos. Los filtros de mediana en particular son difíciles de optimizar y pueden ser *extremadamente* lentos cuando la vecindad es grande y/o más de 2D.
pt_br: As considerações são semelhantes para **filtros não lineares**: quando adicionamos mais dimensões, o tamanho da vizinhança pode aumentar rapidamente e tornar os cálculos lentos. A separabilidade pode ajudar com alguns filtros não lineares (por exemplo, mínimo e máximo, dependendo do formato da janela), mas não todos. Os filtros medianos, em particular, são difíceis de otimizar e podem ser *extremamente* lentos quando a vizinhança é grande e/ou mais que 2D.

source: Isotropy and anisotropy
de: Isotropie und Anisotropie
es: Isotropía y anisotropía.
pt_br: Isotropia e anisotropia

source: As discussed {ref}`chap_pixel_size`, the pixel width and height are usually the same. For a *z*-stack, the *z*-spacing *might* be the same as the width and height, in which case the pixels are called **isotropic**. But very often the *z*-spacing is different, meaning that the pixels are **anisotropic**.
de: Wie unter {ref}`chap_pixel_size` beschrieben, sind die Pixelbreite und -höhe normalerweise gleich. Bei einem *z*-Stapel kann der *z*-Abstand *gleich* sein wie die Breite und Höhe, in diesem Fall werden die Pixel **isotrop** genannt. Aber sehr oft ist der *z*-Abstand unterschiedlich, was bedeutet, dass die Pixel **anisotrop** sind.
es: Como se explicó en {ref}`chap_pixel_size`, el ancho y el alto de los píxeles suelen ser los mismos. Para una pila *z*, el espaciado *z* *podría* ser igual que el ancho y el alto, en cuyo caso los píxeles se denominan **isotrópicos**. Pero muy a menudo el espaciado *z* es diferente, lo que significa que los píxeles son **anisotrópicos**.
pt_br: Conforme discutido {ref}`chap_pixel_size`, a largura e a altura do pixel geralmente são as mesmas. Para uma pilha *z*, o espaçamento *z* *pode* ser igual à largura e altura, caso em que os pixels são chamados de **isotrópicos**. Mas muitas vezes o espaçamento *z* é diferente, o que significa que os pixels são **anisotrópicos**.

source: It helps to keep this in mind when choosing filter sizes. For example, I would usually set the $\sigma$ value for a 3D Gaussian filter based upon the pixel size.
de: Es ist hilfreich, dies bei der Auswahl der Filtergrößen zu berücksichtigen. Zum Beispiel würde ich den $\sigma$-Wert für einen 3D-Gauß-Filter in der Regel auf der Grundlage der Pixelgröße festlegen.
es: Es útil tener esto en cuenta al elegir los tamaños de filtro. Por ejemplo, normalmente establecería el valor $\sigma$ para un filtro Gaussiano 3D según el tamaño del píxel.
pt_br: É útil ter isso em mente ao escolher os tamanhos dos filtros. Por exemplo, normalmente eu definiria o valor $\sigma$ para um filtro gaussiano 3D com base no tamanho do pixel.

source: Suppose that the pixel width and height are both 0.5 µm, and the *z*-spacing is 1 µm. I might then choose $\sigma_x$ = 2 px, $\sigma_y$ = 2 px and $\sigma_z$ = 1 px to compensate for the difference.
de: Nehmen wir an, dass die Pixelbreite und -höhe jeweils 0,5 µm und der *z*-Abstand 1 µm beträgt. Ich könnte dann $\sigma_x$ = 2 px, $\sigma_y$ = 2 px und $\sigma_z$ = 1 px wählen, um den Unterschied auszugleichen.
es: Supongamos que el ancho y el alto del píxel son ambos de 0.5 µm y que el espaciado *z* es de 1 µm. Entonces podría elegir $\sigma_x$ = 2 px, $\sigma_y$ = 2 px y $\sigma_z$ = 1 px para compensar la diferencia.
pt_br: Suponha que a largura e a altura do pixel sejam ambas de 0,5 µm e o espaçamento *z* seja de 1 µm. Eu poderia então escolher $\sigma_x$ = 2 px, $\sigma_y$ = 2 px e $\sigma_z$ = 1 px para compensar a diferença.

source: Note that some software may allow you to enter the $\sigma$ in µm directly, and perform the conversion to pixels automatically.
de: Beachten Sie, dass manche Software es Ihnen ermöglicht, das $\sigma$ direkt in µm einzugeben und die Umrechnung in Pixel automatisch durchzuführen.
es: Ten en cuenta que algunos programas pueden permitirte ingresar $\sigma$ en µm directamente y realizar la conversión a píxeles automáticamente.
pt_br: Observe que alguns softwares podem permitir que você insira $\sigma$ em µm diretamente e execute a conversão para pixels automaticamente.

source: A 15×15 minimum filter applied separably.
de: Ein 15×15-Minimalfilter, der getrennt angewendet wird.
es: Un filtro mínimo de 15×15 aplicado de forma separable.
pt_br: Um filtro mínimo de 15×15 aplicado separadamente.

source: Morphological operations
de: Morphologische Operationen
es: Operaciones morfológicas
pt_br: Operações morfológicas

source: Erosion, dilation, opening and closing can all be implemented using minimum and maximum nonlinear filters, so the above considerations apply. Morphological reconstruction can also work in *nD*. Therefore all the new operations and tricks derived from these methods (e.g. creating outlines, finding regional maxima) should work.
de: Erosion, Dilatation, Öffnung und Schließung können mit minimalen und maximalen nichtlinearen Filtern realisiert werden, so dass die obigen Überlegungen gelten. Morphologische Rekonstruktion kann auch in *nD* funktionieren. Daher sollten alle neuen, von diesen Methoden abgeleiteten Operationen und Tricks (z. B. Erstellen von Umrissen, Auffinden regionaler Maxima) funktionieren.
es: La erosión, la dilatación, la apertura y el cierre se pueden implementar utilizando filtros no lineales mínimos y máximos, por lo que se aplican las consideraciones anteriores. La reconstrucción morfológica también puede funcionar en *nD*. Por lo tanto, todas las nuevas operaciones y trucos derivados de estos métodos (por ejemplo, crear contornos, encontrar máximos regionales) deberían funcionar.
pt_br: Erosão, dilatação, abertura e fechamento podem ser implementados usando filtros não lineares mínimo e máximo, portanto as considerações acima se aplicam. A reconstrução morfológica também pode funcionar em *nD*. Portanto, todas as novas operações e truques derivados destes métodos (por exemplo, criar contornos, encontrar máximos regionais) deverão funcionar.

source: Thinning algorithms are often designed to work in 3D, although not usually higher dimensions.
de: Ausdünnungsalgorithmen sind häufig für die Arbeit in 3D ausgelegt, wenn auch in der Regel nicht in höheren Dimensionen.
es: Los algoritmos de adelgazamiento suelen estar diseñados para funcionar en 3D, aunque normalmente no en dimensiones más altas.
pt_br: Algoritmos de afinamento geralmente são projetados para funcionar em 3D, embora geralmente não em dimensões superiores.

source: Image transforms
de: Bildtransformationen
es: Tranformada de imagen
pt_br: Transformações de imagem

source: The distance and watershed transforms extend readily to 3D, but require a little caution.
de: Die Abstands- und Wasserscheibentransformationen lassen sich ohne weiteres auf 3D übertragen, erfordern aber ein wenig Vorsicht.
es: Las transformadas de distancia y watershed se extienden fácilmente al 3D, pero requieren un poco de precaución.
pt_br: As transformações de distância e bacia hidrográfica estendem-se facilmente para 3D, mas requerem um pouco de cuidado.

source: One thing to look out for, especially with the distance transform, is whether pixel anisotropy is taken into consideration. If not, the the distance transform will not be capable of properly identifying the 'nearest' foreground or background pixel in calibrated units, but rather only in pixel units.
de: Vor allem bei der Abstandstransformation ist darauf zu achten, ob die Pixelanisotropie berücksichtigt wird. Wenn dies nicht der Fall ist, kann die Abstandstransformation den "nächstgelegenen" Vordergrund- oder Hintergrundpixel nicht in kalibrierten Einheiten, sondern nur in Pixeleinheiten identifizieren.
es: Algo que debe considerarse, especialmente con la transformada de distancia, es si se tiene en cuenta la anisotropía de los píxeles. Si no, la transformada de distancia no será capaz de identificar correctamente el píxel de primer plano o de fondo "más cercano" en unidades calibradas, sino solo en unidades de píxeles.
pt_br: Uma coisa a observar, especialmente com a transformação de distância, é se a anisotropia dos pixels é levada em consideração. Caso contrário, a transformação da distância não será capaz de identificar adequadamente o pixel de primeiro plano ou de fundo 'mais próximo' em unidades calibradas, mas apenas em unidades de pixel.

source: A cumbersome workaround may be to resize the image so that the pixels *are* isotropic, but that may make every other analysis step more complicated and/or require a huge amount more memory to store the image. A preferable approach is to try to find a distance transform implementation that incorporates pixel size information into its calculations.
de: Eine umständliche Lösung könnte darin bestehen, die Größe des Bildes so zu ändern, dass die Pixel *isotrop* sind, aber das kann jeden anderen Analyseschritt komplizierter machen und/oder sehr viel mehr Speicherplatz zum Speichern des Bildes erfordern. Ein besserer Ansatz ist es, eine Implementierung der Distanztransformation zu finden, die Informationen über die Pixelgröße in ihre Berechnungen einbezieht.
es: Una solución engorrosa puede ser cambiar el tamaño de la imagen para que los píxeles *sean* isotrópicos, pero eso puede hacer que cualquier otro paso del análisis sea más complicado y/o requerir una mayor cantidad de memoria para almacenar la imagen. Un enfoque preferible es tratar de encontrar una implementación de transformación de distancia que incorpore información del tamaño de los píxeles en sus cálculos.
pt_br: Uma solução alternativa complicada pode ser redimensionar a imagem para que os pixels *sejam* isotrópicos, mas isso pode tornar todas as outras etapas da análise mais complicadas e/ou exigir muito mais memória para armazenar a imagem. Uma abordagem preferível é tentar encontrar uma implementação de transformação de distância que incorpore informações de tamanho de pixel em seus cálculos.

source: Accelerating analysis
de: Beschleunigte Analyse
es: Acelerar el análisis
pt_br: Acelerando a análise

source: One of the common themes of processing multidimensional images is performance.
de: Eines der gemeinsamen Themen bei der Verarbeitung mehrdimensionaler Bilder ist die Leistung.
es: Uno de los temas comunes en el procesamiento de imágenes multidimensionales es el rendimiento.
pt_br: Um dos temas comuns do processamento de imagens multidimensionais é o desempenho.

source: Even though *conceptually* most of the image processing techniques we've discussed can be extended to 3D and beyond, it's usually not easy to do from the programmer's perspective. As someone who writes software, I can attest that I don't tend to support more dimensions than I have to because extra dimensions make the task of coding, debugging and optimizing much, much harder.
de: Auch wenn die meisten der besprochenen Bildverarbeitungstechniken *konzeptionell* auf 3D und darüber hinaus ausgedehnt werden können, ist es aus der Sicht des Programmierers in der Regel nicht einfach, dies zu tun. Als jemand, der Software schreibt, kann ich bestätigen, dass ich nicht dazu neige, mehr Dimensionen als nötig zu unterstützen, weil zusätzliche Dimensionen die Aufgabe der Codierung, Fehlersuche und Optimierung viel, viel schwieriger machen.
es: Aunque *conceptualmente* la mayoría de las técnicas de procesamiento de imágenes que hemos discutido se pueden extender a 3D y más allá, generalmente no es fácil hacerlo desde la perspectiva del programador. Como alguien que escribe software, puedo dar fe de que no tiendo a admitir más dimensiones de las necesarias porque las dimensiones adicionales hacen que la tarea de codificar, depurar y optimizar sea mucho, mucho más difícil.
pt_br: Embora *conceitualmente* a maioria das técnicas de processamento de imagem que discutimos possam ser estendidas para 3D e além, geralmente não é fácil de fazer do ponto de vista do programador. Como alguém que escreve software, posso atestar que não costumo oferecer suporte a mais dimensões do que o necessário, porque dimensões extras tornam a tarefa de codificação, depuração e otimização muito, muito mais difícil.

source: 'Optimizing' really matters because, as mentioned above, computational requirements can increase quickly and dramatically with multidimensional data. That doesn't just mean the software itself needs to be optimized to run fast: the user plays a huge role in choosing what they ask the software to do. Keep in mind:
de: Optimieren" ist deshalb so wichtig, weil, wie bereits erwähnt, die Rechenanforderungen bei multidimensionalen Daten schnell und drastisch ansteigen können. Das bedeutet nicht nur, dass die Software selbst optimiert werden muss, damit sie schnell läuft: Der Benutzer spielt eine große Rolle bei der Auswahl der Aufgaben, die er der Software stellt. Denken Sie daran:
es: La "optimización" realmente importa porque, como se mencionó anteriormente, los requisitos computacionales pueden aumentar rápida y dramáticamente con datos multidimensionales. Eso no significa sólo que el software en sí debe optimizarse para funcionar rápidamente: el usuario desempeña un papel muy importante a la hora de elegir lo que le pide al software que haga. Ten en cuenta:
pt_br: A 'otimização' é realmente importante porque, como mencionado acima, os requisitos computacionais podem aumentar rápida e dramaticamente com dados multidimensionais. Isso não significa apenas que o software em si precisa ser otimizado para funcionar rapidamente: o usuário desempenha um papel importante na escolha do que pede ao software. Tenha em mente:

source: The most important performance consideration is the algorithm!
de: Der wichtigste Leistungsaspekt ist der Algorithmus!
es: ¡La consideración de rendimiento más importante es el algoritmo!
pt_br: A consideração de desempenho mais importante é o algoritmo!

source: Before investing in a bigger computer to try to speed up a slow analysis workflow, look for ways to make it more efficient without compromising accuracy.
de: Bevor Sie in einen größeren Computer investieren, um einen langsamen Analyse-Workflow zu beschleunigen, sollten Sie nach Möglichkeiten suchen, ihn effizienter zu gestalten, ohne die Genauigkeit zu beeinträchtigen.
es: Antes de invertir en una computadora más grande para intentar acelerar un flujo de trabajo de análisis lento, busca formas de hacerlo más eficiente sin comprometer la precisión.
pt_br: Antes de investir em um computador maior para tentar acelerar um fluxo de trabalho de análise lento, procure maneiras de torná-lo mais eficiente sem comprometer a precisão.

source: For example, do you really need to apply a 49×49×49 pixel filter to a large image, at a cost of 117,649 multiplications & additions for *every pixel*? If a separable filter can be used instead, you can shrink that figure to 147 (~0.12%). Perhaps the calculation can also be performed on a lower resolution image, saving even more effort.
de: Müssen Sie zum Beispiel wirklich einen Filter mit 49×49×49 Pixeln auf ein großes Bild anwenden, was 117.649 Multiplikationen und Additionen für *jedes Pixel* erfordert? Wenn stattdessen ein trennbarer Filter verwendet werden kann, lässt sich diese Zahl auf 147 (~0,12 %) reduzieren. Vielleicht kann die Berechnung auch mit einem Bild mit geringerer Auflösung durchgeführt werden, was noch mehr Aufwand bedeutet.
es: Por ejemplo, ¿realmente necesitas aplicar un filtro de 49×49×49 píxeles a una imagen grande, a un costo de 117,649 multiplicaciones y sumas por *cada píxel*? Si en su lugar se puede utilizar un filtro separable, se puede reducir esa cifra a 147 (~0,12%). Quizás el cálculo también se pueda realizar en una imagen de menor resolución, ahorrando aún más esfuerzo.
pt_br: Por exemplo, você realmente precisa aplicar um filtro de 49×49×49 pixels a uma imagem grande, a um custo de 117.649 multiplicações e adições para *cada pixel*? Se um filtro separável puder ser usado, você poderá reduzir esse número para 147 (~0,12%). Talvez o cálculo também possa ser realizado em uma imagem de resolução mais baixa, economizando ainda mais esforço.

source: Alternatively, if you find you're applying large minimum or maximum filters to a binary image, perhaps you could instead use a [distance transform for erosion and dilation](fig-morph_distance).
de: Wenn Sie feststellen, dass Sie große Minimum- oder Maximum-Filter auf ein binäres Bild anwenden, können Sie stattdessen auch eine [Abstandstransformation für Erosion und Dilatation](fig-morph_distance) verwenden.
es: Alternativamente, si descubres que estás aplicando filtros mínimos o máximos grandes a una imagen binaria, tal vez podrías usar una [transformación de distancia para erosión y dilatación](fig-morph_distance).
pt_br: Alternativamente, se você achar que está aplicando grandes filtros mínimos ou máximos a uma imagem binária, talvez você possa usar uma [transformação de distância para erosão e dilatação] (fig-morph_distance).

source: When processing is slow, it's worth trying to get the computer to work smarter, not harder.
de: Wenn die Verarbeitung langsam ist, lohnt es sich, den Computer dazu zu bringen, intelligenter und nicht härter zu arbeiten.
es: Cuando el procesamiento es lento, vale la pena intentar que la computadora funcione de manera más inteligente, no más intensa.
pt_br: Quando o processamento é lento, vale a pena tentar fazer com que o computador funcione de maneira mais inteligente, e não mais difícil.

source: Nevertheless, there comes a time when better hardware really can help -- assuming the software can take advantage of it.
de: Dennoch kommt der Zeitpunkt, an dem bessere Hardware wirklich helfen kann - vorausgesetzt, die Software kann sie nutzen.
es: Sin embargo, llega un momento en que un mejor hardware realmente puede ayudar, suponiendo que el software pueda aprovecharlo.
pt_br: No entanto, chega um momento em que um hardware melhor pode realmente ajudar – desde que o software possa tirar vantagem disso.
