Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/multidimensional_processing.po
Languages: de, es, pt_br

source: Default Caption
de: Standard-Beschriftung
es: Leyenda predeterminada
pt_br: Legenda padrão

source: Multidimensional processing
de: Multidimensionale Verarbeitung
es: Procesamiento multidimensional
pt_br: Processamento multidimensional

source: Chapter outline
de: Gliederung des Kapitels
es: Outline del capítulo
pt_br: Esboço do capítulo

source: Many processing operations can be extended **beyond 2 dimensions**
de: Viele Verarbeitungsvorgänge können **über 2 Dimensionen hinaus** erweitert werden
es: Muchas operaciones de procesamiento se pueden ampliar **más allá de 2 dimensiones**
pt_br: Muitas operações de processamento podem ser estendidas **além de 2 dimensões**

source: Adding extra dimensions can greatly increase the **computational requirements**
de: Die Hinzufügung zusätzlicher Dimensionen kann die **Rechenanforderungen** stark erhöhen.
es: Agregar dimensiones adicionales puede aumentar en gran medida los **requisitos computacionales**
pt_br: Adicionar dimensões extras pode aumentar muito os **requisitos computacionais**

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: So far, in terms of image processing we have concentrated only on 2D images. Most of the operations we have considered can also be applied to 3D data -- and sometimes data with more dimensions, in cases where this is meaningful.
de: Bislang haben wir uns bei der Bildverarbeitung nur auf 2D-Bilder konzentriert. Die meisten der von uns betrachteten Operationen können auch auf 3D-Daten angewendet werden - und manchmal auch auf Daten mit mehreren Dimensionen, wenn dies sinnvoll ist.
es: Hasta ahora, en términos de procesamiento de imágenes nos hemos concentrado únicamente en imágenes 2D. La mayoría de las operaciones que hemos considerado también se pueden aplicar a datos 3D y, a veces, a datos con más dimensiones, en los casos en que esto sea significativo.
pt_br: Até agora, em termos de processamento de imagens nos concentramos apenas em imagens 2D. A maioria das operações que consideramos também podem ser aplicadas a dados 3D – e às vezes a dados com mais dimensões, nos casos em que isso seja significativo.

source: This very short overview of multidimensional processing describes a few of the issues to consider when extending analysis beyond two dimensions, and gives some pointers towards specialist tools.
de: Dieser sehr kurze Überblick über die multidimensionale Verarbeitung beschreibt einige der Probleme, die bei der Erweiterung der Analyse über zwei Dimensionen hinaus zu berücksichtigen sind, und gibt einige Hinweise auf spezielle Werkzeuge.
es: Esta breve descripción general del procesamiento multidimensional describe algunas de las cuestiones a considerar al extender el análisis más allá de dos dimensiones y ofrece algunas sugerencias sobre herramientas especializadas.
pt_br: Esta breve visão geral do processamento multidimensional descreve algumas das questões a serem consideradas ao estender a análise além de duas dimensões e fornece algumas dicas sobre ferramentas especializadas.

source: We will focus on 3D images: specifically, on *z*-stacks.
de: Wir werden uns auf 3D-Bilder konzentrieren, insbesondere auf *z*-Stapel.
es: Nos centraremos en imágenes 3D: específicamente, en *z*-stacks.
pt_br: Vamos nos concentrar em imagens 3D: especificamente, em pilhas *z*.

source: What about channels and time?
de: Was ist mit Kanälen und Zeit?
es: ¿Qué pasa con los canales y el tiempo?
pt_br: E quanto aos canais e tempo?

source: The [5 main dimensions](chap_dimensions) commonly encountered in bioimage analysis are *x*, *y*, *z*, *channels*, and *time*. The first three are similar (spatial), whereas the last two are somewhat different.
de: Die [5 Hauptdimensionen](chap_dimensions), die bei der Analyse von Biobildern häufig vorkommen, sind *x*, *y*, *z*, *Kanäle* und *Zeit*. Die ersten drei sind ähnlich (räumlich), während die letzten beiden etwas unterschiedlich sind.
es: Las [5 dimensiones principales](chap_dimensions) que se encuentran comúnmente en el análisis de bioimágenes son *x*, *y*, *z*, *canales* y *tiempo*. Los tres primeros son similares (espaciales), mientras que los dos últimos son algo diferentes.
pt_br: As [5 dimensões principais](chap_dimensions) comumente encontradas na análise de bioimagem são *x*, *y*, *z*, *canais* e *tempo*. Os três primeiros são semelhantes (espaciais), enquanto os dois últimos são um pouco diferentes.

source: Although we considered channels to be another dimension [in previous chapters](chap_dimensions), we don't usually apply operations (e.g. filters, thresholds) *across* channels or time. Rather, we usually split the channels or timepoints during processing (e.g. to detect nuclei from one channel and a cell boundary in a second channel), then combine the ROIs or measurements at the end.
de: Obwohl wir Kanäle [in früheren Kapiteln] als eine weitere Dimension betrachtet haben (chap_dimensions), wenden wir normalerweise keine Operationen (z. B. Filter, Schwellenwerte) *über* Kanäle oder Zeit an. Vielmehr teilen wir die Kanäle oder Zeitpunkte während der Verarbeitung auf (z. B. um Zellkerne in einem Kanal und eine Zellgrenze in einem zweiten Kanal zu erkennen) und kombinieren die ROIs oder Messungen am Ende.
es: Aunque consideramos que los canales son otra dimensión [en capítulos anteriores] (chap_dimensions), generalmente no aplicamos operaciones (por ejemplo, filtros, umbrales) *a través de* canales o tiempo. Más bien, generalmente dividimos los canales o puntos de tiempo durante el procesamiento (por ejemplo, para detectar núcleos de un canal y un límite celular en un segundo canal) y luego combinamos las ROI o las mediciones al final.
pt_br: Embora tenhamos considerado os canais como outra dimensão [nos capítulos anteriores](chap_dimensions), geralmente não aplicamos operações (por exemplo, filtros, limites) *através* de canais ou tempo. Em vez disso, geralmente dividimos os canais ou pontos de tempo durante o processamento (por exemplo, para detectar núcleos de um canal e um limite de célula em um segundo canal) e, em seguida, combinamos os ROIs ou medições no final.

source: Tinevez, J.-Y., et al. (2017). TrackMate: An open and extensible platform for single-particle tracking. *Methods*, 115, 80–90. [(DOI)](https://doi.org/10.1016/j.ymeth.2016.09.016)
pt_br: Tinevez, J.-Y., et al. (2017). TrackMate: Uma plataforma aberta e extensível para rastreamento de partículas únicas. *Métodos*, 115, 80–90. [(DOI)](https://doi.org/10.1016/j.ymeth.2016.09.016)

source: This means that the key processing steps don't require an extra dimension for channels or time.
de: Das bedeutet, dass die wichtigsten Verarbeitungsschritte keine zusätzliche Dimension für Kanäle oder Zeit benötigen.
es: Esto significa que los pasos clave de procesamiento no requieren una dimensión adicional de canales o tiempo.
pt_br: Isso significa que as principais etapas de processamento não exigem uma dimensão extra de canais ou tempo.

source: In the case of time, the 'combining' step may involve linking objects to track them. Tools such as the fantastic [**Trackmate**](https://imagej.net/plugins/trackmate/) can be used for this.
de: Im Falle der Zeit kann der Schritt des "Kombinierens" darin bestehen, Objekte zu verknüpfen, um sie zu verfolgen. Hierfür können Tools wie das fantastische [**Trackmate**] (https://imagej.net/plugins/trackmate/) verwendet werden.
es: En el caso del tiempo, el paso de "combinación" puede implicar vincular objetos para rastrearlos. Para esto se pueden utilizar herramientas como el fantástico [**Trackmate**](https://imagej.net/plugins/trackmate/).
pt_br: No caso do tempo, a etapa de “combinação” pode envolver vincular objetos para rastreá-los. Ferramentas como o fantástico [**Trackmate**](https://imagej.net/plugins/trackmate/) podem ser usadas para isso.

source: nD image analysis
de: nD-Bildanalyse
es: análisis de imágenes nD
pt_br: análise de imagem nD

source: If a technique works for ***nD*** images, this indicates it can handle any number of dimensions. The SciPy [Multidimensional image processing](https://docs.scipy.org/doc/scipy/reference/ndimage.html) package embraces this, being imported as `scipy.ndimage`.
de: Wenn eine Technik für ***nD***-Bilder funktioniert, bedeutet dies, dass sie eine beliebige Anzahl von Dimensionen verarbeiten kann. Das SciPy-Paket [Multidimensionale Bildverarbeitung] (https://docs.scipy.org/doc/scipy/reference/ndimage.html) berücksichtigt dies und wird als "scipy.ndimage" importiert.
es: Si una técnica funciona para imágenes ***nD***, esto indica que puede manejar cualquier cantidad de dimensiones. El paquete SciPy [Procesamiento de imágenes multidimensionales] (https://docs.scipy.org/doc/scipy/reference/ndimage.html) adopta esto y se importa como `scipy.ndimage`.
pt_br: Se uma técnica funcionar para imagens ***nD***, isso indica que ela pode lidar com qualquer número de dimensões. O pacote SciPy [processamento de imagens multidimensionais](https://docs.scipy.org/doc/scipy/reference/ndimage.html) abrange isso, sendo importado como `scipy.ndimage`.

source: Segmentation in 3D
de: Segmentierung in 3D
es: Segmentación en 3D
pt_br: Segmentação em 3D

source: Image segmentation generally involves generating binary and labeled images.
de: Bei der Bildsegmentierung werden im Allgemeinen binäre und beschriftete Bilder erzeugt.
es: La segmentación de imágenes generalmente implica generar imágenes binarias y anotadas.
pt_br: A segmentação de imagens geralmente envolve a geração de imagens binárias e rotuladas.

source: Most of the processing operations we have discussed to help perform image segmentation extend naturally into 3D (and beyond), although there are some extra considerations.
de: Die meisten Verarbeitungsprozesse, die wir für die Bildsegmentierung erörtert haben, lassen sich natürlich auch auf 3D (und darüber hinaus) anwenden, obwohl es einige zusätzliche Überlegungen gibt.
es: La mayoría de las operaciones de procesamiento que hemos analizado para ayudar a realizar la segmentación de imágenes se extienden naturalmente al 3D (y más allá), aunque existen algunas consideraciones adicionales.
pt_br: A maioria das operações de processamento que discutimos para ajudar a realizar a segmentação de imagens se estende naturalmente ao 3D (e além), embora haja algumas considerações extras.

source: Thresholding
de: Schwellenwert
es: Umbral
pt_br: Limiar

source: Thresholds are typically determined using the image histogram. This is computed from all pixels in the image -- the number of dimensions does not really matter.
de: Schwellenwerte werden in der Regel anhand des Bildhistogramms bestimmt. Dieses wird aus allen Pixeln des Bildes berechnet - die Anzahl der Dimensionen spielt dabei keine Rolle.
es: Los umbrales normalmente se determinan mediante el histograma de la imagen. Esto se calcula a partir de todos los píxeles de la imagen; el número de dimensiones realmente no importa.
pt_br: Os limites são normalmente determinados usando o histograma da imagem. Isso é calculado a partir de todos os pixels da imagem – o número de dimensões realmente não importa.

source: The main consideration for thresholding in 3D is whether the other *z*-slices could introduce any kind of sneaky bias. One occasion when that could happen is if the images are acquired with different numbers of slices, e.g. some containing more out-of-focus planes than others ({numref}`fig-multi_thresholds`). These extra planes *could* impact the histogram and image statistics, and therefore any automated thresholds. An image with many out-of-focus slices might be thresholded differently from an image with few slices.
de: Die wichtigste Überlegung bei der Schwellenwertbildung in 3D ist, ob die anderen *z*-Scheiben irgendeine Art von schleichender Verzerrung einführen könnten. Dies könnte beispielsweise der Fall sein, wenn die Bilder mit einer unterschiedlichen Anzahl von Schichten aufgenommen wurden, z. B. wenn einige mehr unscharfe Ebenen enthalten als andere ({numref}`fig-multi_thresholds`). Diese zusätzlichen Ebenen *könnten* sich auf das Histogramm und die Bildstatistiken auswirken und somit auch auf die automatischen Schwellenwerte. Ein Bild mit vielen unscharfen Ebenen wird möglicherweise anders bewertet als ein Bild mit wenigen Ebenen.
es: La consideración principal para el establecimiento de umbrales en 3D es si los otros cortes *z* podrían introducir algún tipo de sesgo furtivo. Una ocasión en la que esto podría suceder es si las imágenes se adquieren con diferentes números de cortes, p.ej. algunos contienen más planos desenfocados que otros ({numref}`fig-multi_thresholds`). Estos planos adicionales *podrían* afectar el histograma y las estadísticas de la imagen y, por lo tanto, cualquier umbral automatizado. Una imagen con muchas secciones desenfocadas puede tener un umbral diferente al de una imagen con pocos sectores.
pt_br: A principal consideração para o limiar em 3D é se as outras fatias *z* poderiam introduzir algum tipo de viés sorrateiro. Uma ocasião em que isso pode acontecer é se as imagens forem adquiridas com diferentes números de fatias, por ex. alguns contendo mais planos fora de foco do que outros ({numref}`fig-multi_thresholds`). Esses planos extras *podem* impactar o histograma e as estatísticas da imagem e, portanto, quaisquer limites automatizados. Uma imagem com muitas fatias fora de foco pode ter limites diferentes de uma imagem com poucas fatias.

source: A solution for that may be to extract a fixed number of slices from each image, for example 10 slices centered upon the volume of interest within the image. This should generally make the images more comparable.
de: Eine Lösung könnte darin bestehen, aus jedem Bild eine feste Anzahl von Schichten zu extrahieren, z. B. 10 Schichten in der Mitte des interessierenden Volumens im Bild. Dadurch sollten die Bilder im Allgemeinen besser vergleichbar werden.
es: Una solución para esto puede ser extraer un número fijo de cortes de cada imagen, por ejemplo, 10 cortes centrados en el volumen de interés dentro de la imagen. En general, esto debería hacer que las imágenes sean más comparables.
pt_br: Uma solução para isso pode ser extrair um número fixo de fatias de cada imagem, por exemplo 10 fatias centradas no volume de interesse da imagem. Isso geralmente deve tornar as imagens mais comparáveis.

source: Thresholding a z-stack can be influenced by the number of out-of-focus slices. Here, an automated threshold determined using [Otsu's method](sec_thresholds_otsu) is applied to two z-stacks showing the same object. The top stack contains few out-of-focus slices, while the bottom stack contains the exact same data plus additional slices that contain only noise. Otsu's method is well-suited to the top stack and performs well, however it fails badly on the bottom stack, where there is a much higher proportion of background pixels -- and so the background peak is more dominant.
de: Die Schwellenwertbildung für einen z-Stapel kann durch die Anzahl der unscharfen Schichten beeinflusst werden. Hier wird ein automatischer Schwellenwert, der mit der [Otsu-Methode] (sec_thresholds_otsu) ermittelt wurde, auf zwei z-Stapel angewendet, die dasselbe Objekt zeigen. Der obere Stapel enthält nur wenige unscharfe Schnitte, während der untere Stapel genau dieselben Daten sowie zusätzliche Schnitte enthält, die nur Rauschen aufweisen. Die Otsu-Methode eignet sich gut für den oberen Stapel und schneidet gut ab, versagt jedoch beim unteren Stapel, der einen viel höheren Anteil an Hintergrundpixeln enthält, so dass die Hintergrundspitze dominanter ist.
es: El umbral de una pila z puede verse influenciado por el número de cortes desenfocados. Aquí, se aplica un umbral automatizado determinado utilizando el [método de Otsu] (sec_thresholds_otsu) a dos pilas z que muestran el mismo objeto. La pila superior contiene algunos sectores desenfocados, mientras que la pila inferior contiene exactamente los mismos datos, y sectores adicionales que solo contienen ruido. El método de Otsu se adapta bien a la pila superior y funciona bien; sin embargo, falla gravemente en la pila inferior, donde hay una proporción mucho mayor de píxeles de fondo, por lo que el pico de fondo es más dominante.
pt_br: O limite de uma pilha z pode ser influenciado pelo número de fatias fora de foco. Aqui, um limite automatizado determinado usando o [método de Otsu](sec_thresholds_otsu) é aplicado a duas pilhas z mostrando o mesmo objeto. A pilha superior contém poucas fatias fora de foco, enquanto a pilha inferior contém exatamente os mesmos dados, além de fatias adicionais que contêm apenas ruído. O método de Otsu é adequado para a pilha superior e tem um bom desempenho, porém falha gravemente na pilha inferior, onde há uma proporção muito maior de pixels de fundo - e portanto o pico de fundo é mais dominante.

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: How would you expect {numref}`fig-multi_thresholds` to differ if the [triangle method](sec_thresholds_triangle) was used to determine the threshold, rather than [Otsu's method](sec_thresholds_otsu)?
de: Welche Unterschiede würden Sie erwarten, wenn {numref}`fig-multi_thresholds` die [Dreiecksmethode](sec_thresholds_triangle) und nicht die [Otsu-Methode](sec_thresholds_otsu) zur Bestimmung der Schwellenwerte verwenden würde?
es: ¿Cómo esperarías que {numref}`fig-multi_thresholds` difiera si se usara el [método del triángulo](sec_thresholds_triangle) para determinar el umbral, en lugar del [método de Otsu](sec_thresholds_otsu)?
pt_br: Como você esperaria que {numref}`fig-multi_thresholds` fosse diferente se o [método do triângulo](sec_thresholds_triangle) fosse usado para determinar o limite, em vez do [método de Otsu](sec_thresholds_otsu)?

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: Here, the triangle method performs well. It sets the threshold appropriately at the foot of the background peak in both cases.
de: Hier schneidet die Dreiecksmethode gut ab. Sie setzt den Schwellenwert in beiden Fällen angemessen am Fuß des Hintergrundpeaks an.
es: En este caso, el método del triángulo funciona bien. En ambos casos, establece el umbral apropiadamente al pie del pico de fondo.
pt_br: Aqui, o método do triângulo tem um bom desempenho. Ele define o limite adequadamente na base do pico de fundo em ambos os casos.

source: Filtering
de: Filtern
es: Filtros
pt_br: Filtragem

source: **Linear filters** can be easily extended to *nD* by defining a filter kernel with the desired number of dimensions. However, this can dramatically increase the computational requirements and so we need to begin considering performance.
de: **Lineare Filter** können leicht auf *nD* erweitert werden, indem ein Filterkern mit der gewünschten Anzahl von Dimensionen definiert wird. Dies kann jedoch die Rechenanforderungen drastisch erhöhen, so dass wir uns Gedanken über die Leistung machen müssen.
es: Los **filtros lineales** se pueden extender fácilmente a *nD* definiendo un núcleo de filtro con el número deseado de dimensiones. Sin embargo, esto puede aumentar drásticamente los requisitos computacionales, por lo que debemos comenzar a considerar el rendimiento.
pt_br: **Filtros lineares** podem ser facilmente estendidos para *nD* definindo um kernel de filtro com o número desejado de dimensões. No entanto, isso pode aumentar drasticamente os requisitos computacionais e por isso precisamos começar a considerar o desempenho.

source: For example, suppose we have a 3×3 filter. Following the algorithm for linear filtering [described previously](sec_filters_linear), we would have to perform 9 multiplications and additions to determine the value for *every* pixel in the output image. If our image is 1000×1000 pixels in size, that suggests 9,000,000 multiplications and additions. This seems quite a lot, but modern computers are fast so we're unlikely to notice it.
de: Nehmen wir zum Beispiel an, wir haben einen 3×3-Filter. Nach dem Algorithmus für lineare Filterung [wie zuvor beschrieben] (sec_filters_linear) müssten wir 9 Multiplikationen und Additionen durchführen, um den Wert für *jedes* Pixel im Ausgangsbild zu bestimmen. Wenn unser Bild 1000×1000 Pixel groß ist, bedeutet das 9.000.000 Multiplikationen und Additionen. Das scheint eine ganze Menge zu sein, aber moderne Computer sind schnell, so dass wir das wahrscheinlich nicht bemerken werden.
es: Por ejemplo, supongamos que tenemos un filtro de 3×3. Siguiendo el algoritmo de filtrado lineal [descrito anteriormente] (sec_filters_linear), tendríamos que realizar 9 multiplicaciones y sumas para determinar el valor de *cada* píxel en la imagen de salida. Si nuestra imagen tiene un tamaño de 1000×1000 píxeles, eso sugiere 9.000.000 de multiplicaciones y sumas. Esto parece mucho, pero las computadoras modernas son rápidas, por lo que es poco probable que lo notemos.
pt_br: Por exemplo, suponha que temos um filtro 3×3. Seguindo o algoritmo de filtragem linear [descrito anteriormente] (sec_filters_linear), teríamos que realizar 9 multiplicações e adições para determinar o valor de *cada* pixel na imagem de saída. Se nossa imagem tiver 1.000 × 1.000 pixels de tamanho, isso sugere 9.000.000 de multiplicações e adições. Isso parece bastante, mas os computadores modernos são rápidos, então é improvável que percebamos isso.

source: However, if we have a 3×3×3 filter then each output pixel depends upon 27 input pixels. And the additional slices mean our image is likely to be bigger; say, 1000×1000×10 pixels. Now we have to perform calculations involving 270,000,000 pixels, i.e. a lot more. Still, even that is probably fast nowadays.
de: Wenn wir jedoch einen 3×3×3-Filter verwenden, hängt jedes Ausgangspixel von 27 Eingangspixeln ab. Und die zusätzlichen Slices bedeuten, dass unser Bild wahrscheinlich größer ist; sagen wir 1000×1000×10 Pixel. Jetzt müssen wir Berechnungen mit 270.000.000 Pixeln durchführen, also mit sehr viel mehr. Aber selbst das ist heutzutage wahrscheinlich schnell.
es: Sin embargo, si tenemos un filtro de 3×3×3, entonces cada píxel de salida depende de 27 píxeles de entrada. Y los cortes adicionales significan que es probable que nuestra imagen sea más grande; digamos, 1000×1000×10 píxeles. Ahora tenemos que realizar cálculos con 270.000.000 píxeles, es decir, muchos más. Aún así, incluso eso probablemente sea rápido hoy en día.
pt_br: No entanto, se tivermos um filtro 3×3×3, cada pixel de saída dependerá de 27 pixels de entrada. E as fatias adicionais significam que nossa imagem provavelmente será maior; digamos, 1000×1000×10 pixels. Agora temos que realizar cálculos envolvendo 270 milhões de pixels, ou seja, muito mais. Ainda assim, mesmo isso provavelmente é rápido hoje em dia.

source: But how big can we go? An 11×11 filter involves 121 pixels. But an 11×11×11 filter involves 1331. For larger filters and images, we can rapidly increase the computations involved until processing *is* very slow.
de: Aber wie groß können wir werden? Ein 11×11-Filter umfasst 121 Pixel. Aber ein 11×11×11-Filter umfasst 1331. Bei größeren Filtern und Bildern können wir die erforderlichen Berechnungen schnell erhöhen, bis die Verarbeitung *sehr* langsam ist.
es: ¿Pero hasta qué punto podemos llegar? Un filtro de 11×11 implica 121 píxeles. Pero un filtro de 11×11×11 implica 1331. Para filtros e imágenes más grandes, podemos aumentar rápidamente los cálculos involucrados hasta que el procesamiento *sea* muy lento.
pt_br: Mas quão grande podemos ir? Um filtro 11×11 envolve 121 pixels. Mas um filtro 11×11×11 envolve 1331. Para filtros e imagens maiores, podemos aumentar rapidamente os cálculos envolvidos até que o processamento *fique* muito lento.
