Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/appendices/next_steps/next_steps.po
Languages: de

source: Beyond this book
de: Über dieses Buch hinaus

source: Starting out in image analysis can feel a bit like learning a language.
de: Der Einstieg in die Bildanalyse kann sich ein wenig wie das Erlernen einer Sprache anfühlen.

source: Initially, everything seems incomprehensible. If you can immerse yourself in the language sufficiently, patterns start to emerge and parts begin to make sense. But even so, speaking it fluently can still feel a long way away.
de: Zunächst scheint alles unverständlich. Wenn Sie ausreichend in die Sprache eintauchen können, beginnen Muster aufzutauchen und Teile beginnen einen Sinn zu ergeben. Aber selbst dann scheint es noch weit entfernt zu sein, es fließend zu sprechen.

source: This book tries to accelerate the process by systematically teaching the basic grammar and core vocabulary of image analysis: the rules, concepts, and tools that (bio)image analysts use every day. It aims to go beyond a superficial overview by describing many of the exceptions, pitfalls and messy realities encountered when working with images: the things I wish I had learned sooner when I started out myself. The things I didn't know that I needed to know, or didn't know even existed.
de: Dieses Buch versucht, den Prozess zu beschleunigen, indem es systematisch die grundlegende Grammatik und das Kernvokabular der Bildanalyse vermittelt: die Regeln, Konzepte und Werkzeuge, die (Bio-)Bildanalytiker täglich verwenden. Ziel ist es, über einen oberflächlichen Überblick hinauszugehen und viele der Ausnahmen, Fallstricke und chaotischen Realitäten zu beschreiben, denen man bei der Arbeit mit Bildern begegnet: Dinge, von denen ich wünschte, ich hätte sie früher gelernt, als ich selbst angefangen habe. Die Dinge, von denen ich nicht wusste, dass ich sie wissen musste oder von denen ich nicht wusste, dass sie überhaupt existierten.

source: The book also covers a couple of major dialects (ImageJ and Python), in case you want to hang out in areas where they are spoken.
de: Das Buch behandelt auch einige wichtige Dialekte (ImageJ und Python), falls Sie sich in Gegenden aufhalten möchten, in denen sie gesprochen werden.

source: If you've worked through the chapters, I hope that they could help you develop a solid basis to understand the language of image analysis. If you want to go further, my advice would be to start using it to communicate with others whenever you can.
de: Wenn Sie die Kapitel durchgearbeitet haben, hoffe ich, dass sie Ihnen dabei helfen können, eine solide Grundlage für das Verständnis der Sprache der Bildanalyse zu entwickeln. Wenn Sie noch weiter gehen möchten, würde ich Ihnen raten, wann immer Sie können damit zu beginnen, mit anderen zu kommunizieren.

source: The **Scientific Community Image Forum** at **https://forum.image.sc** is an *extremely* active and friendly discussion forum, populated by people who speak image analysis with varying levels of fluency. My own career has been shaped by the things I learned on the forum, and the mailing lists that predated it.
de: Das **Scientific Community Image Forum** unter **https://forum.image.sc** ist ein *äußerst* aktives und freundliches Diskussionsforum, das von Leuten bevölkert wird, die Bildanalyse mit unterschiedlichem Sprachniveau beherrschen. Meine eigene Karriere wurde durch die Dinge geprägt, die ich im Forum gelernt habe, und durch die Mailinglisten, die davor existierten.

source: For that reason, I'd suggest participating in in the forum is the best next step. There, you'll find thousands of discussions on many topics related to scientific imaging in general.
de: Aus diesem Grund würde ich vorschlagen, dass die Teilnahme am Forum der beste nächste Schritt ist. Dort finden Sie Tausende von Diskussionen zu vielen Themen rund um die wissenschaftliche Bildgebung im Allgemeinen.

source: One of the most common uses of image.sc is to ask the community for advice on how to solve a particular image analysis problem. As a result, the forum also contains thousands of searchable discussions that delve into the details of specific problems.
de: Eine der häufigsten Anwendungen von image.sc besteht darin, die Community um Rat zur Lösung eines bestimmten Bildanalyseproblems zu bitten. Daher enthält das Forum auch Tausende durchsuchbarer Diskussionen, die sich mit den Details spezifischer Probleme befassen.

source: image.sc also acts as the primary discussion channel for more than 50 open-source software projects, listed as 'Community partners', including ImageJ, Fiji, CellProfiler, scikit-image and QuPath.
de: image.sc fungiert außerdem als primärer Diskussionskanal für mehr als 50 Open-Source-Softwareprojekte, die als „Community-Partner“ aufgeführt sind, darunter ImageJ, Fiji, CellProfiler, scikit-image und QuPath.

source: Community partners at image.sc in January 2022. <br /> There may well be more by the time you read this.
de: Community-Partner bei image.sc im Januar 2022. <br /> Wenn Sie dies lesen, werden es möglicherweise noch mehr sein.

source: It's possible to learn a lot just by lurking (as I did for years...), absorbing new ideas and ways of thinking from the people who post. But I hope that, in the end, you might actively participate: posting your own questions, and also your own insights, opinions and answers.
de: Es ist möglich, viel zu lernen, indem man einfach lauert (wie ich es jahrelang getan habe...) und neue Ideen und Denkweisen von den Leuten aufnehme, die posten. Aber ich hoffe, dass Sie sich am Ende aktiv beteiligen: Ihre eigenen Fragen, aber auch Ihre eigenen Erkenntnisse, Meinungen und Antworten posten.
