Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/imagej.po
Languages: de, pt_br

source: _color channels_ – There is often no good reason to suppose the amount of fluorescence in different color channels will be similar, and so thresholds should be calculated from each channel independently.
de: _Farbkanäle_ - Oft gibt es keinen guten Grund für die Annahme, dass die Fluoreszenzmenge in den verschiedenen Farbkanälen ähnlich ist, so dass die Schwellenwerte für jeden Kanal unabhängig berechnet werden sollten.
pt_br: _canais de cores_ – Muitas vezes não há boas razões para supor que a quantidade de fluorescência em diferentes canais de cores será semelhante e, portanto, os limites devem ser calculados de cada canal de forma independente.

source: _z-Stacks_ – It is normally a good idea to use the stack histogram with __z__-stacks. If you do not, then your threshold will be affected by whatever slice you happen to be viewing at the time of thresholding – introducing a potentially weird source of variability in the results. It is probably _not_ a good idea to calculate a new threshold for each slice, because this would lead to at least _something_ being detected on every slice. But in the outer slices there may well only be blur and noise – in which case nothing _should_ be detected!
de: _z-Stapel_ - Es ist normalerweise eine gute Idee, das Stapelhistogramm mit __z__-Stapeln zu verwenden. Wenn Sie dies nicht tun, wird Ihr Schwellenwert von dem Slice beeinflusst, das Sie zum Zeitpunkt der Schwellenwertberechnung gerade betrachten, was eine potenziell seltsame Quelle der Variabilität in den Ergebnissen darstellt. Es ist wahrscheinlich _keine_ gute Idee, für jedes Slice einen neuen Schwellenwert zu berechnen, da dies dazu führen würde, dass zumindest _etwas_ in jedem Slice entdeckt wird. In den äußeren Slices kann es aber durchaus sein, dass es nur Unschärfe und Rauschen gibt - in diesem Fall _sollte_ nichts erkannt werden!
pt_br: _z-Stacks_ – Normalmente é uma boa ideia usar o histograma de pilha com __z__-stacks. Caso contrário, seu limite será afetado por qualquer fatia que você esteja visualizando no momento do limite – introduzindo uma fonte potencialmente estranha de variabilidade nos resultados. Provavelmente _não_ é uma boa ideia calcular um novo limite para cada fatia, porque isso levaria a pelo menos _alguma_ coisa a ser detectada em cada fatia. Mas nas fatias externas pode haver apenas desfoque e ruído – e nesse caso nada _deve_ ser detectado!

source: _Time series_ – In a time series, bleaching can sometimes cause the image to darken over time. In such a case, using the stack histogram might cause fewer pixels to exceed the threshold at later time points simply for this reason, and recalculating the threshold for each image may be better. On the other hand, if images were previously normalized somehow to compensate for bleaching [^fn_1], then the stack threshold might be preferable again. It's tricky.
de: Zeitreihen_ - In einer Zeitreihe kann das Bleichen manchmal dazu führen, dass das Bild mit der Zeit dunkler wird. In einem solchen Fall kann die Verwendung des Stapelhistogramms dazu führen, dass zu späteren Zeitpunkten weniger Pixel den Schwellenwert überschreiten, und es kann besser sein, den Schwellenwert für jedes Bild neu zu berechnen. Wurden die Bilder hingegen zuvor in irgendeiner Weise normalisiert, um die Ausbleichung zu kompensieren [^fn_1], dann könnte der Stapelschwellenwert wieder vorzuziehen sein. Das ist knifflig.
pt_br: _Série temporal_ – Em uma série temporal, o branqueamento às vezes pode fazer com que a imagem escureça com o tempo. Nesse caso, usar o histograma de pilha pode fazer com que menos pixels excedam o limite em momentos posteriores, simplesmente por esse motivo, e recalcular o limite para cada imagem pode ser melhor. Por outro lado, se as imagens foram previamente normalizadas de alguma forma para compensar o branqueamento [^fn_1], então o limite da pilha pode ser preferível novamente. É complicado.

source: There is one other implementation issue that needs attention. When {guilabel}`Dark Background` is checked and an automated threshold is computed, then it is only really the low threshold that matters – the high threshold is always set to the maximum in the histogram to ensure that all brighter pixels are designated 'foreground' in the result. However, if not using {guilabel}`Stack Histogram`, then for non-8-bit images the histograms are calculated using the minimum and maximum pixels on the slice, and consequently the high threshold cannot be higher than this maximum value (look at how the high threshold value changes in {menuselection}`Mitosis` as you compute auto thresholds for different slices). This means that any brighter pixels will be _outside_ the threshold range (and therefore 'background') if they occur on a different slice. This can cause holes to appear in the brightest parts of structures, and is probably not what you want. A similar situation occurs with the low threshold when {guilabel}`Dark Background` is unchecked.
de: Es gibt noch ein weiteres Problem bei der Implementierung, das beachtet werden muss. Wenn {guilabel}"Dunkler Hintergrund" aktiviert ist und ein automatischer Schwellenwert berechnet wird, ist eigentlich nur der niedrige Schwellenwert von Bedeutung - der hohe Schwellenwert wird immer auf das Maximum im Histogramm gesetzt, um sicherzustellen, dass alle helleren Pixel im Ergebnis als "Vordergrund" bezeichnet werden. Wenn jedoch {guilabel}"Stapelhistogramm" nicht verwendet wird, werden die Histogramme für Nicht-8-Bit-Bilder anhand des minimalen und maximalen Pixels auf der Schicht berechnet, und folglich kann der hohe Schwellenwert nicht höher als dieser Maximalwert sein (sehen Sie sich an, wie sich der hohe Schwellenwert in {menuselection}"Mitosis" ändert, wenn Sie die automatischen Schwellenwerte für verschiedene Schichten berechnen). Das bedeutet, dass alle helleren Pixel _außerhalb_ des Schwellenwertbereichs (und damit im "Hintergrund") liegen, wenn sie in einem anderen Slice auftreten. Dies kann dazu führen, dass in den hellsten Teilen von Strukturen Löcher entstehen, was wahrscheinlich nicht erwünscht ist. Eine ähnliche Situation tritt mit dem niedrigen Schwellenwert auf, wenn {guilabel}`Dark Background` nicht aktiviert ist.
pt_br: Há uma outra questão de implementação que precisa de atenção. Quando {guilabel}`Dark Background` é verificado e um limite automatizado é calculado, então é apenas o limite baixo que importa – o limite alto é sempre definido para o máximo no histograma para garantir que todos os pixels mais brilhantes sejam designados como 'primeiro plano' no resultado. No entanto, se não estiver usando {guilabel}`Stack Histogram`, então, para imagens que não sejam de 8 bits, os histogramas serão calculados usando os pixels mínimo e máximo na fatia e, consequentemente, o limite alto não pode ser maior que esse valor máximo (veja como o valor do limite alto muda em {menuselection}`Mitose` conforme você calcula limites automáticos para fatias diferentes). Isso significa que quaisquer pixels mais brilhantes estarão _fora_ do intervalo de limite (e, portanto, do 'fundo') se ocorrerem em uma fatia diferente. Isso pode fazer com que apareçam buracos nas partes mais brilhantes das estruturas e provavelmente não é o que você deseja. Uma situação semelhante ocorre com o limite baixo quando {guilabel}`Dark Background` está desmarcado.

source: Measurements in 3D data
de: Messungen in 3D-Daten
pt_br: Medições em dados 3D

source: ImageJ has good support for making measurements in 2D, particularly the {menuselection}`Measure` and {menuselection}`Analyze Particles...` commands. The latter can happily handle 3D images, but only by creating and measuring 2D ROIs independently on each slice. Alternatively, {menuselection}`Image --> Stacks --> Plot Z-axis Profile` is like applying {menuselection}`Measure` to each slice independently, making measurements either over the entire image or any ROI. It will also plot the mean pixel values, but even if you do not particularly want this the command can still be useful. However, if single measurements should be made for individual objects that extend across multiple slices, neither of these options would be enough.
de: ImageJ bietet eine gute Unterstützung für 2D-Messungen, insbesondere die Befehle {menuselection}`Measure` und {menuselection}`Analyze Particles...`. Letzterer kann auch mit 3D-Bildern umgehen, aber nur, indem er 2D-ROIs unabhängig auf jeder Schicht erstellt und misst. Alternativ dazu ist {menuselection}`Image --&gt; Stacks --&gt; Plot Z-axis Profile` so, als würde man {menuselection}`Measure` auf jede Schicht unabhängig anwenden und Messungen entweder über das gesamte Bild oder jede ROI durchführen. Es werden auch die mittleren Pixelwerte aufgezeichnet, aber auch wenn Sie das nicht unbedingt wollen, kann der Befehl nützlich sein. Wenn jedoch einzelne Messungen für einzelne Objekte vorgenommen werden sollen, die sich über mehrere Schichten erstrecken, ist keine dieser Optionen ausreichend.
pt_br: ImageJ tem um bom suporte para fazer medições em 2D, particularmente os comandos {menuselection}`Measure` e {menuselection}`Analyze Particles...` . Este último pode lidar facilmente com imagens 3D, mas apenas criando e medindo ROIs 2D independentemente em cada fatia. Alternativamente, {menuselection}`Image --> Stacks --> Plot Z-axis Profile` é como aplicar {menuselection}`Measure` a cada fatia de forma independente, fazendo medições em toda a imagem ou em qualquer ROI. Ele também irá traçar os valores médios dos pixels, mas mesmo que você não queira isso particularmente, o comando ainda pode ser útil. No entanto, se medições únicas fossem feitas para objetos individuais que se estendessem por múltiplas fatias, nenhuma dessas opções seria suficiente.

source: Practical
de: Praktisch
pt_br: Prático

source: Suppose you have a cell, nucleus or some other large 3D structure in a __z__-stack, and you want to draw the smallest 2D ROI that completely contains it on every slice. An example is shown below for the green structure in the {menuselection}`Confocal Series` sample image.
de: Angenommen, Sie haben eine Zelle, einen Zellkern oder eine andere große 3D-Struktur in einem __z__-Stapel, und Sie möchten die kleinste 2D-ROI zeichnen, die sie in jeder Schicht vollständig enthält. Nachfolgend ein Beispiel für die grüne Struktur im Beispielbild {menuselection}"Konfokale Serie".
pt_br: Suponha que você tenha uma célula, núcleo ou alguma outra estrutura 3D grande em uma pilha __z__ e queira desenhar o menor ROI 2D que o contenha completamente em cada fatia. Um exemplo é mostrado abaixo para a estrutura verde na imagem de exemplo {menuselection}`Confocal Series`.

source: How would you create such a ROI, and be confident that it is large enough for all slices?
de: Wie würden Sie einen solchen ROI erstellen und sicher sein, dass er groß genug für alle Scheiben ist?
pt_br: Como você criaria esse ROI e teria certeza de que ele é grande o suficiente para todas as fatias?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https://gist.github.com/petebankhead/55b02288a529512fee0f321fee0da693)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https://gist.github.com/petebankhead/55b02288a529512fee0f321fee0da693)
pt_br: [![lançar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https:/ /gist.github.com/petebankhead/55b02288a529512fee0f321fee0da693)

source: launch ImageJ.JS
de: ImageJ.JS starten
pt_br: iniciar ImageJ.JS

source: Solution
de: Lösung
pt_br: Solução

source: My strategy would be to create a z-projection (max intensity) and then draw the ROI on this – or, preferably, create the ROI by thresholding using {menuselection}`Image --> Adjust --> Threshold` and the {guilabel}`Wand` tool. This ROI can then be transferred over to the original stack, either via the ROI Manager or {menuselection}`Edit --> Selection --> Restore Selection`.
de: Meine Strategie wäre, eine z-Projektion (maximale Intensität) zu erstellen und dann die ROI auf dieser zu zeichnen - oder, vorzugsweise, die ROI durch Schwellenwertbildung mit {menuselection}`Bild --&gt; Anpassen --&gt; Schwellenwert` und dem {guilabel}`Werkzeug` zu erstellen. Diese ROI kann dann auf den ursprünglichen Stapel übertragen werden, entweder über den ROI-Manager oder {menuselection}`Bearbeiten --&gt; Auswahl --&gt; Auswahl wiederherstellen`.
pt_br: Minha estratégia seria criar uma projeção z (intensidade máxima) e, em seguida, desenhar o ROI sobre isso – ou, de preferência, criar o ROI por limite usando {menuselection}`Image --> Ajuste --> Threshold` e a ferramenta {guilabel}`Wand`. Este ROI pode então ser transferido para a pilha original, através do ROI Manager ou {menuselection}`Editar --> Seleção --> Restaurar Seleção`.

source: Histograms & threshold clipping
de: Histogramme und Schwellenwertbeschneidung
pt_br: Histogramas e recorte de limite

source: One way to measure in 3D is to use the {menuselection}`Histogram` command and specify that the entire stack should be included – this provides some basic statistics, including the total number, mean, minimum, maximum and standard deviation of the pixels [^fn_2]. This will respect the boundaries of a 2D ROI if one has been drawn.
de: Eine Möglichkeit, in 3D zu messen, besteht darin, den Befehl {menuselection}"Histogramm" zu verwenden und anzugeben, dass der gesamte Stapel einbezogen werden soll - dies liefert einige grundlegende Statistiken, einschließlich der Gesamtzahl, des Mittelwerts, des Minimums, des Maximums und der Standardabweichung der Pixel [^fn_2]. Dabei werden die Grenzen einer 2D-ROI beachtet, falls eine solche gezeichnet wurde.
pt_br: Uma maneira de medir em 3D é usar o comando {menuselection}`Histograma` e especificar que toda a pilha deve ser incluída – isso fornece algumas estatísticas básicas, incluindo o número total, média, mínimo, máximo e desvio padrão dos pixels [^fn_2]. Isso respeitará os limites de um ROI 2D, caso um tenha sido desenhado.

source: This is a start, but it will not adjust to changes in the object boundary on each 2D plane. A better approach could be to use {menuselection}`Image --> Adjust --> Threshold...` to set a threshold that identifies the object – but do _not_ press {guilabel}`Apply` to generate a binary image. Rather, under {menuselection}`Analyze --> Set Measurements...` select {guilabel}`Limit to threshold`. Then when you compute the stack histogram (or press {menuselection}`Measure` for 2D) only above-threshold pixels will be included in the statistics. Just be sure to reset {guilabel}`Limit to threshold` later.
de: Das ist ein Anfang, aber es passt sich nicht an Änderungen der Objektgrenzen auf jeder 2D-Ebene an. Ein besserer Ansatz könnte sein, {menuselection}`Bild --&gt; Anpassen --&gt; Schwellenwert...` zu verwenden, um einen Schwellenwert festzulegen, der das Objekt identifiziert - aber drücken Sie _nicht_ {guilabel}`Anwenden`, um ein binäres Bild zu erzeugen. Wählen Sie stattdessen unter {menuselection}`Analysieren --&gt; Messungen einstellen...` die Option {guilabel}`Auf Schwellenwert beschränken`. Wenn Sie dann das Stapelhistogramm berechnen (oder {menuselection}`Messen` für 2D drücken), werden nur Pixel oberhalb des Schwellenwerts in die Statistik aufgenommen. Stellen Sie nur sicher, dass Sie {guilabel}"Auf Schwellenwert begrenzen" später zurücksetzen.
pt_br: Isto é um começo, mas não se ajustará às alterações no limite do objeto em cada plano 2D. Uma abordagem melhor poderia ser usar {menuselection}`Image --> Adjust --> Threshold...` para definir um limite que identifique o objeto - mas _não_ pressione {guilabel}`Apply` para gerar uma imagem binária. Em vez disso, em {menuselection}`Analyze --> Set Measurements...` selecione {guilabel}`Limite ao limite`. Então, quando você calcular o histograma da pilha (ou pressionar {menuselection}`Measure` para 2D), apenas pixels acima do limite serão incluídos nas estatísticas. Apenas certifique-se de redefinir {guilabel}`Limite ao limite` mais tarde.

source: How can you translate the total number of pixels in an object into its volume, e.g. in µm<sup>3</sup>? Give some thought to how accurate your method will be.
de: Wie können Sie die Gesamtzahl der Pixel eines Objekts in sein Volumen umrechnen, z. B. in µm<sup>3</sup>? Machen Sie sich Gedanken darüber, wie genau Ihre Methode sein wird.
pt_br: Como você pode traduzir o número total de pixels em um objeto em seu volume, por exemplo? em µm<sup>3</sup>? Pense um pouco sobre a precisão do seu método.

source: You could treat each pixel as a rectangular cuboid, with a volume equal to _pixel width_×_pixel height_×_voxel depth_ (as given in {menuselection}`Image --> Properties...`). Then multiply this by the number of pixels within the object. This is what the {ref}`3D Objects Counter<sec_multidimensional_counter>` plugin does when measuring volumes.
de: Sie könnten jedes Pixel als einen rechteckigen Quader behandeln, mit einem Volumen gleich _Pixelbreite_×_Pixelhöhe_×_Voxeltiefe_ (wie in {menuselection}`Bild --&gt; Eigenschaften...` angegeben). Dann multiplizieren Sie dies mit der Anzahl der Pixel innerhalb des Objekts. Das ist es, was das {ref}`3D Objects Counter<sec_multidimensional_counter>` Plugin macht, wenn es Volumen misst.
pt_br: Você poderia tratar cada pixel como um cubóide retangular, com um volume igual a _pixel width_×_pixel height_×_voxel deep_ (conforme fornecido em {menuselection}`Image --> Properties...` ). Em seguida, multiplique isso pelo número de pixels dentro do objeto. Isso é o que o plug-in {ref}`Contador de objetos 3D<sec_multidimensional_counter>` faz ao medir volumes.

source: Whenever you want to compare object sizes across images acquired with different pixel sizes, this is certainly better than just taking the raw pixel counts as measures of volume. However, it is unlikely to be very accurate – and volume measurements obtained this way should not be trusted too much, especially when dealing with very small sizes. They are also likely to be quite sensitive to spacing.
de: Wenn Sie die Größe von Objekten in Bildern vergleichen wollen, die mit unterschiedlichen Pixelgrößen aufgenommen wurden, ist dies sicherlich besser, als nur die rohen Pixelzahlen als Maß für das Volumen zu nehmen. Es ist jedoch unwahrscheinlich, dass dies sehr genau ist - und den auf diese Weise erhaltenen Volumenmessungen sollte man nicht allzu sehr vertrauen, insbesondere wenn es um sehr kleine Größen geht. Außerdem sind sie wahrscheinlich sehr empfindlich gegenüber Abständen.
pt_br: Sempre que você quiser comparar tamanhos de objetos em imagens adquiridas com diferentes tamanhos de pixels, isso certamente é melhor do que apenas considerar as contagens brutas de pixels como medidas de volume. No entanto, é improvável que seja muito preciso – e as medições de volume obtidas desta forma não devem ser muito confiáveis, especialmente quando se trata de tamanhos muito pequenos. Também é provável que sejam bastante sensíveis ao espaçamento.

source: Using NaNs
de: Verwendung von NaNs
pt_br: Usando NaNs

source: I am not a fan of {guilabel}`Limit to threshold`, because I am likely to forget to reset it afterwards and may subsequently measure the wrong things for days thereafter.
de: Ich bin kein Fan von {guilabel}`Limit to threshold`, weil ich danach wahrscheinlich vergesse, es zurückzusetzen und dann vielleicht tagelang die falschen Dinge messe.
pt_br: Não sou fã de {guilabel}`Limite ao limite`, porque é provável que me esqueça de redefini-lo depois e possa posteriormente medir as coisas erradas nos dias seguintes.

source: An alternative that I prefer is to set my threshold on a 32-bit copy of the image I am working with, and then {guilabel}`Apply` the threshold using the {guilabel}`Set Background Pixels to NaN` option. Then all below-threshold pixels will automatically be excluded from any measurements I make on the result, since they are 'no longer numbers' (see {ref}`Thresholding <sec_thresholding_nans>` for more details).
de: Eine Alternative, die ich bevorzuge, ist, den Schwellenwert auf einer 32-Bit-Kopie des Bildes festzulegen, mit dem ich arbeite, und dann {guilabel}"Anwenden" des Schwellenwerts mit der Option {guilabel}"Hintergrundpixel auf NaN setzen". Dann werden alle Pixel unterhalb des Schwellenwerts automatisch von allen Messungen ausgeschlossen, die ich mit dem Ergebnis durchführe, da sie "keine Zahlen mehr" sind (siehe {ref}`Schwellenwerte <sec_thresholding_nans>` für weitere Einzelheiten).
pt_br: Uma alternativa que prefiro é definir meu limite em uma cópia de 32 bits da imagem com a qual estou trabalhando e, em seguida, {guilabel}`Aplicar` o limite usando {guilabel}Opção `Definir pixels de fundo para NaN`. Então, todos os pixels abaixo do limite serão automaticamente excluídos de quaisquer medições que eu fizer no resultado, uma vez que 'não são mais números' (consulte {ref}`Limite <sec_thresholding_nans>` para mais detalhes).

source: The 3D Objects Counter
de: Der 3D-Objektzähler
pt_br: O contador de objetos 3D

source: Currently, the closest thing to {menuselection}`Analyze Particles...` for measuring connected objects in 3D built-in to Fiji is the 3D Objects Counter ({menuselection}`Analyze --> 3D Objects Counter`) [^fn_3]. Its settings (analogous to {menuselection}`Set Measurements...`) are under {menuselection}`Analyze --> 3D OC Options`. In addition to various measurements, it provides labelled images as output, either of the entire objects or only their central pixels – optionally with labels, or expanded to be more visible.
de: Derzeit kommt {menuselection}`Analyze Particles...` für die Messung von verbundenen Objekten in 3D, die in Fiji eingebaut sind, dem 3D Objects Counter am nächsten ({menuselection}`Analyze --&gt; 3D Objects Counter`) [^fn_3]. Seine Einstellungen (analog zu {menuselection}`Set Measurements...`) finden sich unter {menuselection}`Analyze --&gt; 3D OC Options`. Zusätzlich zu den verschiedenen Messungen werden beschriftete Bilder ausgegeben, entweder von den gesamten Objekten oder nur von ihren zentralen Pixeln - wahlweise mit Beschriftungen oder erweitert, um besser sichtbar zu sein.
pt_br: Atualmente, a coisa mais próxima de {menuselection}`Analyze Particles...` para medir objetos conectados em 3D integrado em Fiji é o Contador de objetos 3D ({menuselection}`Analisar --> Contador de objetos 3D`) [^fn_3]. Suas configurações (análogas a {menuselection}`Set Measurements...`) estão em {menuselection}`Analyze --> 3D OC Options` . Além de diversas medidas, ele fornece imagens rotuladas como saída, seja de objetos inteiros ou apenas de seus pixels centrais – opcionalmente com rótulos ou expandidos para ficarem mais visíveis.

source: Find Connected Regions
de: Verbundene Regionen finden
pt_br: Encontre regiões conectadas
