Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/imagej.po
Languages: de, pt_br

source: ImageJ: Multidimensional processing
de: ImageJ: Mehrdimensionale Verarbeitung
pt_br: ImageJ: Processamento multidimensional

source: Work in progress!
de: In Arbeit!
pt_br: Trabalho em progresso!

source: This section isn't complete yet. It's really just a scattered collection of thoughts for now.
de: Dieser Abschnitt ist noch nicht vollständig. Es ist wirklich nur eine verstreute Sammlung von Gedanken für jetzt.
pt_br: Esta seção ainda não está completa. Na verdade, é apenas uma coleção dispersa de pensamentos por enquanto.

source: Introduction
de: Einführung
pt_br: Introdução

source: This section gives a brief overview of some things to think about when working with z-stacks and time series in ImageJ.
de: Dieser Abschnitt gibt einen kurzen Überblick über einige Dinge, die bei der Arbeit mit z-Stapeln und Zeitreihen in ImageJ zu beachten sind.
pt_br: Esta seção fornece uma breve visão geral de algumas coisas a serem consideradas ao trabalhar com pilhas z e séries temporais no ImageJ.

source: Point operations, contrast & conversion
de: Punktoperationen, Kontrast und Konvertierung
pt_br: Operações pontuais, contraste e conversão

source: Point operations are straightforward: they depend only on individual pixels, so the number of dimensions is unimportant. Image arithmetic involving a 3D stack and a 2D image can also be carried out in ImageJ using the {menuselection}`Process --> Image Calculator`, where the operation involving the 2D image is applied to each slice of the 3D stack in turn. Other options, such as filtering and thresholding, are possible, but bring with them extra considerations -- and often significantly higher computational costs.
de: Punktoperationen sind einfach: Sie hängen nur von einzelnen Pixeln ab, so dass die Anzahl der Dimensionen unwichtig ist. Bildarithmetik mit einem 3D-Stapel und einem 2D-Bild kann in ImageJ auch mit {menuselection}`Process --&gt; Image Calculator` durchgeführt werden, wobei die Operation mit dem 2D-Bild nacheinander auf jede Scheibe des 3D-Stapels angewendet wird. Andere Optionen, wie z.B. Filterung und Schwellenwertbildung, sind möglich, bringen aber zusätzliche Überlegungen mit sich - und oft erheblich höhere Rechenkosten.
pt_br: As operações pontuais são simples: dependem apenas de pixels individuais, portanto o número de dimensões não é importante. A aritmética da imagem envolvendo uma pilha 3D e uma imagem 2D também pode ser realizada no ImageJ usando o {menuselection}`Process --> Image Calculator`, onde a operação envolvendo a imagem 2D é aplicada para cada fatia da pilha 3D por vez. Outras opções, como filtragem e limiar, são possíveis, mas trazem consigo considerações adicionais – e muitas vezes custos computacionais significativamente mais elevados.

source: Setting the LUT of a 3D image requires particular care. The normal {menuselection}`Brightness/Contrast...` tool only takes the currently-displayed slice into consideration when pressing {guilabel}`Reset` or {guilabel}`Auto`. Optimizing the display for a single slice does not necessarily mean the rest of the stack will look reasonable if the brightness changes much. {menuselection}`Process --> Enhance Contrast...` is a better choice, since here you can specify that the information in the entire stack should be used. You can also specify the percentage of pixels that should be saturated (clipped) _for display_, i.e. those that should be shown with the first or last colors in the LUT. So long as {guilabel}`Normalize` and {guilabel}`Equalize histogram` are not selected, the pixel values shouldn't be changed.
de: Die Einstellung der LUT eines 3D-Bildes erfordert besondere Sorgfalt. Das normale {menuselection}`Helligkeit/Kontrast...` Werkzeug berücksichtigt nur die aktuell angezeigte Schicht, wenn Sie {guilabel}`Reset` oder {guilabel}`Auto` drücken. Die Optimierung der Anzeige für einen einzelnen Slice bedeutet nicht unbedingt, dass der Rest des Stapels vernünftig aussieht, wenn sich die Helligkeit stark ändert. {menuselection} Process --&gt; Enhance Contrast..." ist eine bessere Wahl, da Sie hier angeben können, dass die Informationen im gesamten Stapel verwendet werden sollen. Sie können auch den Prozentsatz der Pixel angeben, die _für die Anzeige_ gesättigt (beschnitten) werden sollen, d.h. diejenigen, die mit der ersten oder letzten Farbe in der LUT angezeigt werden sollen. Solange {guilabel}`Normalize` und {guilabel}`Equalize histogram` nicht ausgewählt sind, sollten die Pixelwerte nicht verändert werden.
pt_br: Definir o LUT de uma imagem 3D requer cuidados especiais. A ferramenta normal {menuselection}`Brilho/Contraste...` leva em consideração apenas a fatia exibida no momento ao pressionar {guilabel}`Redefinir ` ou {guilabel}`Auto`. Otimizar a exibição para uma única fatia não significa necessariamente que o restante da pilha parecerá razoável se o brilho mudar muito. {menuselection}`Process --> Enhance Contrast...` é uma escolha melhor, pois aqui você pode especificar que as informações da pilha inteira devem ser usadas. Você também pode especificar a porcentagem de pixels que devem ser saturados (cortados) _para exibição_, ou seja, aqueles que devem ser mostrados com a primeira ou a última cor na LUT. Contanto que {guilabel}`Normalize` e {guilabel}`Equalize histogram` não estejam selecionados, os valores de pixel não deverão ser alterados.

source: Question
de: Frage
pt_br: Pergunta

source: By default, the percentage of saturated pixels in {menuselection}`Enhance Contrast...` is set to 0.4. Why might this be chosen instead of 0?
de: Standardmäßig ist der Prozentsatz der gesättigten Pixel in {menuselection}`Kontrast verstärken...` auf 0,4 eingestellt. Warum sollte dieser Wert anstelle von 0 gewählt werden?
pt_br: Por padrão, a porcentagem de pixels saturados em {menuselection}`Enhance Contrast...` é definida como 0,4. Por que isso pode ser escolhido em vez de 0?

source: Answer
de: Antwort
pt_br: Responder

source: If the percentage of saturated pixels is 0, then the minimum and maximum pixel values throughout the image will be given the first and last LUT colors respectively, with all other colors devoted to values in between. This is sensitive to outliers, and often results in images that have poor contrast. It's usually better to accept some small amount of visual saturation, in order to give more LUT colors to the pixel values between the extremes.
de: Wenn der Prozentsatz der gesättigten Pixel 0 ist, erhalten die minimalen und maximalen Pixelwerte im gesamten Bild die erste bzw. letzte LUT-Farbe, während alle anderen Farben den Werten dazwischen zugewiesen werden. Dies ist empfindlich gegenüber Ausreißern und führt oft zu Bildern mit schlechtem Kontrast. In der Regel ist es besser, eine geringe visuelle Sättigung in Kauf zu nehmen, um den Pixelwerten zwischen den Extremen mehr LUT-Farben zuzuweisen.
pt_br: Se a porcentagem de pixels saturados for 0, então os valores mínimo e máximo de pixels em toda a imagem receberão a primeira e a última cores da LUT, respectivamente, com todas as outras cores dedicadas aos valores intermediários. Isso é sensível a valores discrepantes e geralmente resulta em imagens com baixo contraste. Geralmente é melhor aceitar uma pequena quantidade de saturação visual, para dar mais cores LUT aos valores de pixel entre os extremos.

source: Converting bit-depths of multidimensional images
de: Konvertierung von Bittiefen mehrdimensionaler Bilder
pt_br: Convertendo profundidades de bits de imagens multidimensionais

source: As described in {ref}`Types & bit-depths<sec_bit_depths_converting>`, the minimum and maximum display range values are used by default when reducing the bit-depth of an image. To minimize the information lost, these should usually be set to the minimum and maximum pixel values within the image – otherwise values will be clipped.
de: Wie in {ref}`Typen &amp; Bittiefen<sec_bit_depths_converting>` beschrieben, werden bei der Reduzierung der Bittiefe eines Bildes standardmäßig die Werte für den minimalen und maximalen Anzeigebereich verwendet. Um den Informationsverlust zu minimieren, sollten diese Werte normalerweise auf die minimalen und maximalen Pixelwerte innerhalb des Bildes gesetzt werden - andernfalls werden die Werte abgeschnitten.
pt_br: Conforme descrito em {ref}`Tipos e profundidades de bits<sec_bit_depths_converting>`, os valores mínimo e máximo do intervalo de exibição são usados por padrão ao reduzir a profundidade de bits de uma imagem. Para minimizar a perda de informações, estes geralmente devem ser definidos para os valores mínimo e máximo de pixels na imagem – caso contrário, os valores serão cortados.

source: In 2D it's enough to press {guilabel}`Reset` in the {menuselection}`Brightness/Contrast` window, _but in 3D this will only work if the minimum and maximum values from the entire stack happen to appear on the current slice!_
de: In 2D reicht es aus, {guilabel}`Reset` im {menuselection}`Helligkeit/Kontrast`-Fenster zu drücken, _aber in 3D funktioniert das nur, wenn die Minimal- und Maximalwerte des gesamten Stapels zufällig auf dem aktuellen Slice erscheinen!_
pt_br: Em 2D basta pressionar {guilabel}`Reset` na janela {menuselection}`Brilho/Contraste`, _mas em 3D isso só irá funcionará se os valores mínimo e máximo de toda a pilha aparecerem na fatia atual!_

source: For this reason, it's good practice to run {menuselection}`Enhance Contrast...` prior to reducing bit-depths of stacks, setting the saturation to 0 and using the entire stack. This means no pixels will be clipped in the output (although rescaling and rounding will still occur).
de: Aus diesem Grund ist es ratsam, vor dem Reduzieren der Bittiefe von Stapeln die Funktion {menuselection}"Kontrast verbessern" auszuführen, wobei die Sättigung auf 0 gesetzt und der gesamte Stapel verwendet wird. Dies bedeutet, dass in der Ausgabe keine Pixel abgeschnitten werden (obwohl eine Neuskalierung und Abrundung immer noch stattfindet).
pt_br: Por esse motivo, é uma boa prática executar {menuselection}`Enhance Contrast...` antes de reduzir a profundidade de bits das pilhas, definindo a saturação como 0 e usando a pilha inteira. Isso significa que nenhum pixel será cortado na saída (embora o redimensionamento e o arredondamento ainda ocorram).

source: 3D filtering
de: 3D-Filterung
pt_br: Filtragem 3D

source: Many filters naturally lend themselves to being applied to as many dimensions as are required. For example, a 3×3 mean filter can easily become a 3×3×3 filter if averaging across slices is allowed. Importantly, it then replaces each pixel by the average of 27 values, rather than 9.
de: Viele Filter eignen sich natürlich für die Anwendung auf so viele Dimensionen wie nötig. Beispielsweise kann ein 3×3-Mittelwertfilter leicht zu einem 3×3×3-Filter werden, wenn eine Mittelwertbildung über die Slices zugelassen wird. Wichtig ist, dass dann jedes Pixel durch den Durchschnitt von 27 Werten ersetzt wird, anstatt von 9.
pt_br: Muitos filtros podem naturalmente ser aplicados em tantas dimensões quantas forem necessárias. Por exemplo, um filtro de média 3×3 pode facilmente se tornar um filtro 3×3×3 se a média entre fatias for permitida. É importante ressaltar que ele substitui cada pixel pela média de 27 valores, em vez de 9.

source: This implies the reduction in noise is *somewhat* similar to that of applying a 5×5 filter (25 values), but with a little less blurring in 2D and a little more along the third dimension instead. Several 3D filters are available under the {menuselection}`Plugins --> Process -->` submenu.
de: Dies bedeutet, dass die Verringerung des Rauschens in etwa der Anwendung eines 5×5-Filters (25 Werte) entspricht, allerdings mit etwas weniger Unschärfe in 2D und etwas mehr in der dritten Dimension. Mehrere 3D-Filter sind im Untermenü {menuselection}"Plugins --&gt; Verarbeiten --&gt;" verfügbar.
pt_br: Isto implica que a redução do ruído é *um pouco* semelhante à aplicação de um filtro 5×5 (25 valores), mas com um pouco menos de desfoque em 2D e um pouco mais ao longo da terceira dimensão. Vários filtros 3D estão disponíveis no submenu {menuselection}`Plugins --> Process -->`.

source: Fast, separable filters
de: Schnelle, trennbare Filter
pt_br: Filtros rápidos e separáveis

source: {menuselection}`Process --> Filters --> Gaussian Blur 3D...` uses this approach.
de: {menuselection}Prozess --&gt; Filter --&gt; Gaußscher Weichzeichner 3D..." verwendet diesen Ansatz.
pt_br: {menuselection}`Process --> Filters --> Gaussian Blur 3D...` usa essa abordagem.

source: Fast filters & the Fourier transform
de: Schnelle Filter und die Fourier-Transformation
pt_br: Filtros rápidos e a transformada de Fourier

source: Not all linear filters are separable, and applying a large, non-separable linear filter can also be extremely time-consuming. However, when this is the case a whole other method can be used to get the same result using the Fourier transform – where the speed no longer has the same dependence upon the filter size. Unfortunately, the Fourier method cannot be used for non-linear filters such as the median filter.
de: Nicht alle linearen Filter sind trennbar, und die Anwendung eines großen, nicht trennbaren linearen Filters kann auch extrem zeitaufwendig sein. Wenn dies der Fall ist, kann jedoch eine ganz andere Methode verwendet werden, um das gleiche Ergebnis zu erzielen, nämlich die Fourier-Transformation, bei der die Geschwindigkeit nicht mehr in gleichem Maße von der Filtergröße abhängt. Leider kann die Fourier-Methode nicht für nichtlineare Filter wie den Medianfilter verwendet werden.
pt_br: Nem todos os filtros lineares são separáveis, e a aplicação de um filtro linear grande e inseparável também pode consumir muito tempo. No entanto, quando este for o caso, um método totalmente diferente pode ser usado para obter o mesmo resultado usando a transformada de Fourier – onde a velocidade não tem mais a mesma dependência do tamanho do filtro. Infelizmente, o método de Fourier não pode ser usado para filtros não lineares, como o filtro mediano.

source: Dimensions & isotropy
de: Dimensionen und Isotropie
pt_br: Dimensões e isotropia

source: If applying a filter in 3D instead of 2D, it may seem natural to define it as having the same size in the third dimension as in the original two. But for a __z__-stack, the spacing between slices is usually larger than the width and height of a pixel. And if the third dimension is time, then it uses another scale entirely. Therefore more thought usually needs to be given to what sizes make most sense.
de: Wenn man einen Filter in 3D statt in 2D anwendet, scheint es naheliegend, dass er in der dritten Dimension die gleiche Größe hat wie in den beiden ursprünglichen Dimensionen. Aber bei einem __z__-Stapel ist der Abstand zwischen den Slices normalerweise größer als die Breite und Höhe eines Pixels. Und wenn die dritte Dimension die Zeit ist, dann verwendet sie einen ganz anderen Maßstab. Daher muss man sich in der Regel mehr Gedanken darüber machen, welche Größen am sinnvollsten sind.
pt_br: Se aplicar um filtro em 3D em vez de 2D, pode parecer natural defini-lo como tendo o mesmo tamanho na terceira dimensão que nas duas originais. Mas para uma pilha __z__, o espaçamento entre as fatias geralmente é maior que a largura e a altura de um pixel. E se a terceira dimensão é o tempo, então ela usa outra escala inteiramente. Portanto, geralmente é necessário pensar mais sobre quais tamanhos fazem mais sentido.

source: In some commands (e.g. {menuselection}`Plugins --> Process --> Smooth (3D)`), there is a {guilabel}`Use calibration` option to determine whether the values you enter are defined in terms of the units found in the {menuselection}`Properties...` and therefore corrected for the stored pixel dimensions. Elsewhere (e.g. {menuselection}`Gaussian Blur 3D...`) the units are pixels, slices and time points – and so you are responsible for figuring out how to compensate for different scales and units.
de: In einigen Befehlen (z.B. {menuselection}`Plugins --&gt; Process --&gt; Smooth (3D)`) gibt es eine {guilabel}`Use calibration` Option, um zu bestimmen, ob die Werte, die Sie eingeben, in Bezug auf die Einheiten definiert sind, die in {menuselection}`Properties...` zu finden sind und daher für die gespeicherten Pixelmaße korrigiert werden. Andernorts (z.B. {menuselection}`Gaußsche Unschärfe 3D...`) sind die Einheiten Pixel, Slices und Zeitpunkte - und so sind Sie dafür verantwortlich, herauszufinden, wie Sie unterschiedliche Maßstäbe und Einheiten kompensieren können.
pt_br: Em alguns comandos (por exemplo, {menuselection}`Plugins --> Process --> Smooth (3D)`), há um {guilabel} A opção `Usar calibração` para determinar se os valores inseridos são definidos em termos das unidades encontradas em {menuselection}`Propriedades...` e, portanto, corrigidos para as dimensões de pixel armazenadas. Em outros lugares (por exemplo, {menuselection}`Gaussian Blur 3D...`) as unidades são pixels, fatias e pontos de tempo - e portanto você é responsável por descobrir como compensar diferentes escalas e unidades.

source: Thresholding multidimensional data
de: Schwellenwertbildung bei mehrdimensionalen Daten
pt_br: Limitando dados multidimensionais

source: When thresholding an image with more than 2 dimensions using the {menuselection}`Threshold...` command, it is necessary to choose whether the threshold should be determined from the histogram of the entire stack, or from the currently-visible 2D slice only. If the latter, you will also be asked whether the same threshold should be used for every slice, or if it should be calculated anew for each slice based upon the slice histogram. In some circumstances, these choices can have a very large impact upon the result.
de: Bei der Schwellenwertberechnung eines Bildes mit mehr als 2 Dimensionen mit dem Befehl {menuselection}`Schwellenwert...` muss ausgewählt werden, ob der Schwellenwert aus dem Histogramm des gesamten Stapels oder nur aus der aktuell sichtbaren 2D-Scheibe bestimmt werden soll. Im letzteren Fall werden Sie auch gefragt, ob derselbe Schwellenwert für jedes Slice verwendet werden soll oder ob er für jedes Slice auf der Grundlage des Slice-Histogramms neu berechnet werden soll. Unter Umständen können diese Entscheidungen einen sehr großen Einfluss auf das Ergebnis haben.
pt_br: Ao limitar uma imagem com mais de 2 dimensões usando o comando {menuselection}`Threshold...`, é necessário escolher se o limite deve ser determinado a partir do histograma de toda a pilha , ou apenas da fatia 2D atualmente visível. Neste último caso, você também será questionado se o mesmo limite deve ser usado para cada fatia ou se deve ser calculado novamente para cada fatia com base no histograma da fatia. Em algumas circunstâncias, estas escolhas podem ter um impacto muito grande no resultado.

source: When you threshold a stack, you have an option to choose {guilabel}`Stack Histogram`. Then, when you choose {guilabel}`Apply` you are asked if you want to {guilabel}`Calculate Threshold for Each Image`. What difference do you expect these two options to make, and what combinations would you use for:
de: Wenn Sie einen Schwellenwert für einen Stapel festlegen, haben Sie die Möglichkeit, {guilabel}"Stapelhistogramm" zu wählen. Wenn Sie dann {guilabel}"Anwenden" wählen, werden Sie gefragt, ob Sie {guilabel}"Schwellenwert für jedes Bild berechnen" möchten. Welchen Unterschied erwarten Sie zwischen diesen beiden Optionen, und welche Kombinationen würden Sie verwenden?
pt_br: Ao definir o limite de uma pilha, você tem a opção de escolher {guilabel}`Stack Histogram`. Então, quando você escolher {guilabel}`Aplicar`, será perguntado se você deseja {guilabel}`Calcular Limite para Cada Imagem`. Que diferença você espera que essas duas opções façam e quais combinações você usaria:

source: a stack consisting of 2D images from different color channels
de: ein Stapel aus 2D-Bildern aus verschiedenen Farbkanälen
pt_br: uma pilha que consiste em imagens 2D de diferentes canais de cores

source: a __z__-stack
de: ein __z__-Stapel
pt_br: uma pilha __z__

source: a time series
de: eine Zeitreihe
pt_br: uma série temporal

source: _Note:_ Have a look at what happens when you click {guilabel}`Auto` while scrolling through one channel of the stack {menuselection}`File --> Open samples --> Mitosis (26 MB, 5D Stack)`, with and without {guilabel}`Stack Histogram` selected. You will have to split the channels for this because ImageJ currently refuses to threshold multichannel images with extra dimensions (which helps avoid some confusion). {guilabel}`Dark Background` should always be selected here.
de: Hinweis:_ Schauen Sie sich an, was passiert, wenn Sie auf {guilabel}`Auto` klicken, während Sie durch einen Kanal des Stapels {menuselection}`Datei --&gt; Proben öffnen --&gt; Mitose (26 MB, 5D Stapel)` scrollen, mit und ohne {guilabel}`Stapelhistogramm` ausgewählt. Sie müssen die Kanäle dafür aufteilen, da ImageJ sich derzeit weigert, Mehrkanalbilder mit zusätzlichen Dimensionen zu schwellen (was dazu beiträgt, einige Verwirrungen zu vermeiden). {guilabel} Die Option "Dunkler Hintergrund" sollte hier immer ausgewählt sein.
pt_br: _Nota:_ Dê uma olhada no que acontece quando você clica em {guilabel}`Auto` enquanto rola por um canal da pilha {menuselection}` Arquivo --> Amostras abertas --> Mitose (26 MB, 5D Stack)`, com e sem {guilabel}`Stack Histogram` selecionado. Você terá que dividir os canais para isso porque o ImageJ atualmente se recusa a limitar imagens multicanais com dimensões extras (o que ajuda a evitar alguma confusão). {guilabel}`Fundo escuro` deve sempre ser selecionado aqui.

source: If {guilabel}`Stack Histogram` is checked, the thresholds are computed from a histogram of all the pixels in the entire image stack; otherwise, the histogram of only the currently-displayed image slice is used.
de: Wenn {guilabel}`Stack Histogram` angekreuzt ist, werden die Schwellenwerte aus einem Histogramm aller Pixel im gesamten Bildstapel berechnet; andernfalls wird nur das Histogramm des aktuell angezeigten Bildausschnitts verwendet.
pt_br: Se {guilabel}`Stack Histogram` estiver marcado, os limites serão calculados a partir de um histograma de todos os pixels em toda a pilha de imagens; caso contrário, será usado o histograma apenas da fatia da imagem exibida no momento.

source: BUT! If {guilabel}`Calculate Threshold for Each Image` is chosen, then this is ignored: the threshold is always determined by the selected automatic method using the histogram of the corresponding slice only.
de: ABER! Wenn {guilabel}"Schwellenwert für jedes Bild berechnen" gewählt wird, wird dies ignoriert: der Schwellenwert wird immer durch die gewählte automatische Methode bestimmt, indem nur das Histogramm des entsprechenden Slice verwendet wird.
pt_br: MAS! Se {guilabel}`Calculate Threshold for Each Image` for escolhido, então isso será ignorado: o limite é sempre determinado pelo método automático selecionado usando apenas o histograma da fatia correspondente.

source: Therefore, the most sensible combinations of thresholding options to use depend upon the type of data.
de: Welche Kombinationen von Schwellenwertoptionen am sinnvollsten sind, hängt daher von der Art der Daten ab.
pt_br: Portanto, as combinações mais sensatas de opções de limiares a utilizar dependem do tipo de dados.
