Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/7-multidimensional_processing/imagej.po
Languages: de, pt_br

source: {menuselection}`Plugins --> Process --> Find Connected Regions` is a command primarily for creating labelled images from thresholded 3D data, which can also give the total number of pixels per object. If the main thing you want is the labelled image without many more results, it may be faster than {menuselection}`3D Objects Counter`.
de: {menuselection}Plugins --&gt; Process --&gt; Find Connected Regions` ist ein Befehl, der in erster Linie dazu dient, beschriftete Bilder aus mit Schwellenwerten bewerteten 3D-Daten zu erstellen, und der auch die Gesamtzahl der Pixel pro Objekt angeben kann. Wenn Sie in erster Linie ein beschriftetes Bild ohne viele weitere Ergebnisse haben möchten, kann dieser Befehl schneller sein als {menuselection}`3D Objects Counter`.
pt_br: {menuselection}`Plugins --> Process --> Find Connected Regions` é um comando principalmente para criar imagens rotuladas a partir de dados 3D limitados, que também pode fornecer o número total de pixels por objeto . Se o principal que você deseja é a imagem rotulada sem muito mais resultados, ela pode ser mais rápida que {menuselection}`Contador de objetos 3D`.

source: Additional 3D tools
de: Zusätzliche 3D-Werkzeuge
pt_br: Ferramentas 3D adicionais

source: For working with 3D data, it may be very useful to download the '3D ImageJ Suite' from https://imagej.net/plugins/3d-imagej-suite/. his not only includes a range of fast filters and commands for segmentation, but also a 3D version of the ROI Manager.
de: Für die Arbeit mit 3D-Daten kann es sehr nützlich sein, die "3D ImageJ Suite" von https://imagej.net/plugins/3d-imagej-suite/ herunterzuladen. Sie enthält nicht nur eine Reihe von schnellen Filtern und Befehlen zur Segmentierung, sondern auch eine 3D-Version des ROI-Managers.
pt_br: Para trabalhar com dados 3D, pode ser muito útil baixar o '3D ImageJ Suite' em https://imagej.net/plugins/3d-imagej-suite/. Isso não inclui apenas uma variedade de filtros rápidos e comandos para segmentação, mas também uma versão 3D do ROI Manager.

source: While created for bone image analysis, _BoneJ_ (https://bonej.org) also includes some components that are useful for general applications –- including a fast [3D Particle Analyser](https://bonej.org/particles) (another alternative to the 3D Objects Counter) and a tool to [interpolate ROIs across image slices](https://bonej.org/utilities).
de: Obwohl _BoneJ_ (https://bonej.org) für die Analyse von Knochenbildern entwickelt wurde, enthält es auch einige Komponenten, die für allgemeine Anwendungen nützlich sind - darunter einen schnellen [3D Particle Analyser](https://bonej.org/particles) (eine weitere Alternative zum 3D Objects Counter) und ein Werkzeug zur [Interpolation von ROIs über Bildscheiben](https://bonej.org/utilities).
pt_br: Embora criado para análise de imagens ósseas, _BoneJ_ (https://bonej.org) também inclui alguns componentes que são úteis para aplicações gerais – incluindo um rápido [Analisador de Partículas 3D](https://bonej.org/particles) (outro alternativa ao contador de objetos 3D) e uma ferramenta para [interpolar ROIs em fatias de imagem](https://bonej.org/utilities).

source: See https://imagej.net/Bleach_Correction
de: Siehe https://imagej.net/Bleach_Correction
pt_br: Veja https://imagej.net/Bleach_Correction

source: Be careful! If you have multiple channels, these should be split first
de: Seien Sie vorsichtig! Wenn Sie mehrere Kanäle haben, sollten diese zuerst aufgeteilt werden
pt_br: Tome cuidado! Se você tiver vários canais, eles deverão ser divididos primeiro

source: See See S Bolte and F P Cordelières. “A guided tour into subcellular colocalization analysis in light microscopy.” Journal of Microscopy 224.Pt 3 (Dec. 2006), pp. 213–32. url: https://pubmed.ncbi.nlm.nih.gov/17210054/
de: Siehe S. Bolte und F. P. Cordelières. "A guided tour into subcellular colocalization analysis in light microscopy". Journal of Microscopy 224.Pt 3 (Dec. 2006), S. 213-32. url: https://pubmed.ncbi.nlm.nih.gov/17210054/
pt_br: Veja Veja S Bolte e FP Cordelières. “Uma visita guiada à análise de colocalização subcelular em microscopia óptica.” Journal of Microscopy 224.Pt 3 (dezembro de 2006), pp. URL: https://pubmed.ncbi.nlm.nih.gov/17210054/
