Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/5-morph/morph.po
Languages: de

source: Default Caption
de: Standardbeschriftung

source: Morphological operations
de: Morphologische Operationen

source: Chapter outline
de: Kapitelüberblick

source: **Morphological operations** can be used to refine or modify the shapes of objects in images
de: **Morphologische Operationen** können verwendet werden, um die Formen von Objekten in Bildern zu verfeinern oder zu ändern

source: Many morphological operations can be applied to **binary images** to improve an image segmentation
de: Viele morphologische Operationen können auf **Binärbilder** angewendet werden, um eine Bildsegmentierung zu verbessern

source: **Grayscale morphological operations** can also be used as processing steps before binarization, or to help identify regional maxima and minima
de: **Morphologische Graustufenoperationen** können auch als Verarbeitungsschritte vor der Binarisierung oder zur Identifizierung regionaler Maxima und Minima verwendet werden

source: Introduction
de: Einführung

source: Image filters and thresholds enable us to detect structures of various shapes and sizes for different applications. Nevertheless, despite our best efforts, the binary images produced by our thresholds often still contain inaccurate or undesirable detected regions. They could benefit from some extra cleaning up.
de: Bildfilter und Schwellenwerte ermöglichen uns die Erkennung von Strukturen unterschiedlicher Form und Größe für unterschiedliche Anwendungen. Dennoch enthalten die von unseren Schwellenwerten erzeugten Binärbilder trotz unserer besten Bemühungen häufig immer noch ungenaue oder unerwünschte erkannte Bereiche. Sie könnten von etwas mehr Aufräumarbeiten profitieren.

source: At this stage, we are primarily working with shapes -- morphology -- so most of the techniques we describe here are often called **morphological operations**.
de: In dieser Phase arbeiten wir hauptsächlich mit Formen – der Morphologie – daher werden die meisten der hier beschriebenen Techniken oft als **morphologische Operationen** bezeichnet.

source: Morphological operations using rank filters
de: Morphologische Operationen mit Rangfiltern

source: Overview of erosion, dilation, opening and closing. The original image is shown at the top, while the processed part is at the bottom in each case.
de: Überblick über Erosion, Dilatation, Öffnung und Schließung. Oben wird das Originalbild angezeigt, unten jeweils der bearbeitete Teil.

source: Erosion & dilation
de: Erosion und Dilatation

source: Our first two morphological operations, **erosion** and **dilation**, are actually identical to minimum and maximum filtering respectively, described [in the previous chapter](sec_filters_rank). The names erosion and dilation are used more often when speaking of binary images, but the operations are the same irrespective of the kind of image.
de: Unsere ersten beiden morphologischen Operationen, **Erosion** und **Dilatation**, sind eigentlich identisch mit der Minimal- bzw. Maximalfilterung, die [im vorherigen Kapitel](sec_filters_rank) beschrieben wurde. Die Bezeichnungen Erosion und Dilatation werden häufiger verwendet, wenn von Binärbildern die Rede ist, die Vorgänge sind jedoch unabhängig von der Art des Bildes die gleichen.

source: Structuring elements
de: Strukturierende Elemente

source: The neighborhood used to calculate the result for each pixel is defined by a **structuring element**. This is similar to a [filter kernel](sec_filters_linear), except that it only has values 0 and 1 (for ignoring or including the neighborhood pixel, respectively).
de: Die Nachbarschaft, die zur Berechnung des Ergebnisses für jedes Pixel verwendet wird, wird durch ein **strukturierendes Element** definiert. Dies ähnelt einem [Filterkernel](sec_filters_linear), außer dass er nur die Werte 0 und 1 hat (zum Ignorieren bzw. Einbeziehen des Nachbarschaftspixels).

source: Here, we assume the background value in our binary image is 0 (black) and foreground is 1 (white).
de: Hier gehen wir davon aus, dass der Hintergrundwert in unserem Binärbild 0 (schwarz) und der Vordergrund 1 (weiß) ist.

source: **Erosion** will make objects in the binary image smaller, because a pixel will be set to the background value if _any_ other pixels in the neighborhood are background. This can split single objects into multiple pieces.
de: Durch **Erosion** werden Objekte im Binärbild kleiner, da ein Pixel auf den Hintergrundwert gesetzt wird, wenn _beliebige_ andere Pixel in der Nachbarschaft Hintergrund sind. Dadurch können einzelne Objekte in mehrere Teile zerlegt werden.

source: Conversely, **dilation** makes objects bigger, since the presence of a single foreground pixel anywhere in the neighborhood will result in a foreground output. This can also cause objects to merge.
de: Umgekehrt vergrößert die **Dilatation** Objekte, da das Vorhandensein eines einzelnen Vordergrundpixels irgendwo in der Nachbarschaft zu einer Vordergrundausgabe führt. Dies kann auch zur Verschmelzung von Objekten führen.

source: The effects of erosion and dilation on a binary image of small structures.
de: Die Auswirkungen von Erosion und Dilatation auf ein Binärbild kleiner Strukturen.

source: Opening & closing
de: Öffnen und Schließen

source: The fact that erosion and dilation alone affect sizes can be a problem: we may like their abilities to merge, separate or remove objects, but prefer that they had less impact upon areas and volumes. Combining both operations helps achieve this.
de: Die Tatsache, dass Erosion und Dilatation allein die Größe beeinflussen, kann ein Problem sein: Wir mögen vielleicht ihre Fähigkeit, Objekte zusammenzuführen, zu trennen oder zu entfernen, bevorzugen aber, dass sie weniger Einfluss auf Flächen und Volumina haben. Die Kombination beider Vorgänge trägt dazu bei.

source: **Opening** consists of an erosion followed by a dilation. It therefore first shrinks objects, and then expands whatever remains to _approximately_ its original size.
de: **Öffnung** besteht aus einer Erosion, gefolgt von einer Erweiterung. Daher verkleinert es zunächst Objekte und erweitert dann alles, was übrig bleibt, auf ungefähr seine ursprüngliche Größe.

source: Such a process is not as pointless as it may first sound. If erosion causes very small objects to completely disappear, clearly the dilation cannot make them reappear: they are gone for good. Barely-connected objects separated by erosion are also not reconnected by the dilation step.
de: Ein solcher Prozess ist nicht so sinnlos, wie es zunächst klingen mag. Wenn Erosion dazu führt, dass sehr kleine Objekte vollständig verschwinden, kann die Ausdehnung sie offensichtlich nicht wieder zum Vorschein bringen: Sie sind für immer verschwunden. Auch kaum verbundene Objekte, die durch Erosion getrennt wurden, werden durch den Dilatationsschritt nicht wieder verbunden.

source: **Closing** is the opposite of opening, i.e. a dilation followed by an erosion, and similarly changes the shapes of objects. The dilation can cause almost-connected objects to merge, and these often then remain merged after the erosion step. If you wish to count objects, but they are wrongly subdivided in the segmentation, closing may help make the counts more accurate.
de: **Schließen** ist das Gegenteil von Öffnen, d. h. eine Erweiterung, gefolgt von einer Erosion, und verändert in ähnlicher Weise die Form von Objekten. Die Dilatation kann dazu führen, dass nahezu verbundene Objekte verschmelzen, und diese bleiben nach dem Erosionsschritt häufig verschmolzen. Wenn Sie Objekte zählen möchten, diese aber in der Segmentierung falsch unterteilt sind, kann das Schließen helfen, die Zählungen genauer zu machen.

source: The effects of opening and closing on a binary image of small structures. Unlike when using erosion or dilation alone, the sizes of objects are largely preserved although the contours are modified. Opening has the effect of completely removing the smallest or thinnest objects.
de: Die Auswirkungen des Öffnens und Schließens auf ein binäres Bild kleiner Strukturen. Anders als bei der alleinigen Verwendung von Erosion oder Dilatation bleiben die Größen der Objekte weitgehend erhalten, obwohl die Konturen verändert werden. Durch das Öffnen werden kleinste oder dünnste Gegenstände vollständig entfernt.

source: Boundaries & outlines
de: Grenzen und Umrisse

source: We can make use of the operations above to identify outlines in a binary image. To do this, we first need a clear definition of what we mean by 'outline'.
de: Wir können die oben genannten Operationen nutzen, um Umrisse in einem Binärbild zu identifizieren. Dazu benötigen wir zunächst eine klare Definition dessen, was wir unter „Gliederung“ verstehen.

source: The **inner boundary** may be defined as *the foreground pixels that are adjacent to background pixels*. We can determine the inner boundary by
de: Die **innere Grenze** kann als *die Vordergrundpixel definiert werden, die an Hintergrundpixel angrenzen*. Wir können die innere Grenze bestimmen durch

source: Duplicating the binary image
de: Duplizieren des Binärbilds

source: Eroding with a 3×3 structuring element
de: Erodieren mit einem 3×3 Strukturelement

source: Subtracting the eroded image from the original
de: Subtrahieren des erodierten Bildes vom Original

source: The **outer boundary** may be defined as *the background pixels that are adjacent to foreground pixels*. We can determine the outer boundary by
de: Die **äußere Grenze** kann als *die Hintergrundpixel definiert werden, die an die Vordergrundpixel angrenzen*. Wir können die äußere Grenze bestimmen durch

source: Dilating with a 3×3 structuring element
de: Dilatation mit einem 3×3-Strukturierungselement

source: Subtracting the original image from the dilated image
de: Subtrahieren des Originalbildes vom erweiterten Bild

source: Thicker boundaries
de: Dickere Grenzen

source: There's no reason to limit outlines to being 1 pixel thick. Choosing a larger structuring element makes it possible create thicker outlines. We might also subtract an eroded image from a dilated image to identify a thicker boundary that contains both inner and outer pixels.
de: Es gibt keinen Grund, die Konturen auf eine Dicke von 1 Pixel zu beschränken. Durch die Wahl eines größeren Strukturierungselements können dickere Konturen erstellt werden. Wir könnten auch ein erodiertes Bild von einem erweiterten Bild subtrahieren, um eine dickere Grenze zu identifizieren, die sowohl innere als auch äußere Pixel enthält.

source: One application of creating thick boundaries in microscopy images of cells is to generate a binary image of the nuclei, and then a second binary image representing a ring around the nucleus. This makes it possible to make measurements that are likely to be within the cytoplasm, just outside the nucleus, without the task of identifying the full area of the cell -- which is often difficult if the cell or membrane are not clearly visible.
de: Eine Anwendung zur Erzeugung dicker Grenzen in mikroskopischen Bildern von Zellen besteht darin, ein binäres Bild der Zellkerne und dann ein zweites binäres Bild zu erzeugen, das einen Ring um den Zellkern darstellt. Dadurch ist es möglich, Messungen durchzuführen, die wahrscheinlich innerhalb des Zytoplasmas, direkt außerhalb des Zellkerns, erfolgen, ohne dass die Aufgabe besteht, den gesamten Bereich der Zelle zu identifizieren – was oft schwierig ist, wenn die Zelle oder die Membran nicht deutlich sichtbar sind.

source: Calculating inner and outer boundaries, using erosion or dilation. The radius of the structuring element can be used to tune the boundary thickness.
de: Berechnen innerer und äußerer Grenzen mithilfe von Erosion oder Dilatation. Der Radius des Strukturierungselements kann zur Abstimmung der Grenzdicke verwendet werden.

source: Finding local minima & maxima
de: Lokale Minima und Maxima finden

source: Erosion and dilation can be used to find pixels that are **local maxima** or **local minima** very easily, with the caveat that the results are inexact and often unusable. Nevertheless, the trick works 'well enough' sufficiently often to be worth knowing.
de: Durch Erosion und Dilatation lassen sich sehr leicht Pixel finden, die **lokale Maxima** oder **lokale Minima** sind, mit der Einschränkung, dass die Ergebnisse ungenau und oft unbrauchbar sind. Dennoch funktioniert der Trick so oft „gut genug“, dass es sich lohnt, ihn zu kennen.

source: Here, we focus on maxima; the process for detecting local minima is identical, except that either the image should be inverted or erosion used instead of dilation.
de: Hier konzentrieren wir uns auf Maxima; Der Prozess zur Erkennung lokaler Minima ist identisch, mit der Ausnahme, dass entweder das Bild invertiert werden sollte oder Erosion statt Dilatation verwendet werden sollte.

source: A local maximum can be defined as a pixel with a value greater than all its neighbors, or a connected group of pixels with the same higher value than the surrounding pixels. An easy way to detect these pixels is to dilate the image with 3×3 maximum filter, and check for pixel values that are unchanged (i.e. where the pixel was already a maximum within its neighborhood).
de: Ein lokales Maximum kann als ein Pixel definiert werden, dessen Wert größer als der aller seiner Nachbarn ist, oder als eine verbundene Gruppe von Pixeln mit demselben höheren Wert als die umgebenden Pixel. Eine einfache Möglichkeit, diese Pixel zu erkennen, besteht darin, das Bild mit einem 3×3-Maximumfilter zu erweitern und nach Pixelwerten zu suchen, die unverändert sind (d. h. dort, wo das Pixel in seiner Nachbarschaft bereits ein Maximum aufwies).

source: This is inexact because it does not *only* identify maxima; it also detections some 'plateaus' where pixels have identical values to their neighbors. In practice, this is not always a problem because noise can make plateaus virtually non-existent for many real-world images (at least ones that haven't been clipped).
de: Dies ist ungenau, da es nicht *nur* Maxima identifiziert; Es erkennt auch einige „Plateaus“, bei denen Pixel identische Werte wie ihre Nachbarn haben. In der Praxis ist dies nicht immer ein Problem, da Rauschen dazu führen kann, dass Plateaus für viele Bilder aus der realen Welt (zumindest für solche, die nicht beschnitten wurden) praktisch nicht mehr vorhanden sind.

source: A bigger problem is that the approach often identifies far too many maxima to be useful ({numref}`fig-morph_simple_maxima`).
de: Ein größeres Problem besteht darin, dass der Ansatz oft viel zu viele Maxima identifiziert, um nützlich zu sein ({numref}`fig-morph_simple_maxima`).

source: Identifying local maxima with the help of a 3×3 dilation tends to find too many maxima to be useful.
de: Bei der Identifizierung lokaler Maxima mithilfe einer 3×3-Dilatation werden tendenziell zu viele Maxima gefunden, als dass sie nützlich wären.

source: We can reduce these by either increasing the size of the maximum filter (therefore requiring pixels to be maximal across a larger region), or by pre-smoothing the image (usually with a [Gaussian filter](sec_filters_gaussian)). However, tuning the parameters becomes difficult.
de: Wir können diese reduzieren, indem wir entweder die Größe des Maximalfilters erhöhen (daher müssen die Pixel über einen größeren Bereich maximal sein) oder das Bild vorab glätten (normalerweise mit einem [Gaußfilter](sec_filters_gaussian)). Die Abstimmung der Parameter wird jedoch schwierig.

source: We will see an alternative approach that is often more intuitive in {ref}`sec_h_extrema`.
de: Einen alternativen Ansatz, der oft intuitiver ist, werden wir in {ref}`sec_h_extrema` sehen.

source: Identifying local maxima with the help of a larger dilation (here, 7×7 pixels) can sometimes give better results than using a smaller dilation {numref}`fig-morph_simple_maxima`.
de: Die Identifizierung lokaler Maxima mithilfe einer größeren Dilatation (hier 7×7 Pixel) kann manchmal zu besseren Ergebnissen führen als die Verwendung einer kleineren Dilatation {numref}`fig-morph_simple_maxima`.

source: More morphological operations
de: Weitere morphologische Operationen

source: Area opening
de: Bereichseröffnung

source: **Area opening** is similar to *opening*, except it avoids the need for any kind of maximum or minimum filtering.
de: **Bereichsöffnung** ähnelt der *Öffnung*, außer dass die Notwendigkeit einer maximalen oder minimalen Filterung entfällt.

source: It works by identifying [**connected components** in the binary image](sec_binary_labeled), which are contiguous regions of foreground pixels. For each connected component, the number of pixels is counted to give an area in px². If the area of a component falls below a specified area threshold, the pixels for that component are set to the background, i.e. the component is removed.
de: Es funktioniert durch die Identifizierung von [**verbundenen Komponenten** im Binärbild](sec_binary_labeled), bei denen es sich um zusammenhängende Bereiche von Vordergrundpixeln handelt. Für jede verbundene Komponente wird die Anzahl der Pixel gezählt, um eine Fläche in px² zu ergeben. Wenn die Fläche einer Komponente unter einen angegebenen Flächenschwellenwert fällt, werden die Pixel für diese Komponente auf den Hintergrund gesetzt, d. h. die Komponente wird entfernt.

source: *Area opening* is often preferable to *opening*, because it has *no impact* on the shape of any structures larger than the area threshold. It simply applies a minimum area threshold, removing everything smaller.
de: Die *Flächenöffnung* ist oft der *Öffnung* vorzuziehen, da sie *keinen Einfluss* auf die Form von Strukturen hat, die größer als die Flächenschwelle sind. Es wird lediglich ein Mindestbereichsschwellenwert angewendet und alles Kleinere entfernt.

source: Using area opening to remove small objects.
de: Verwenden Sie die Bereichsöffnung, um kleine Gegenstände zu entfernen.

source: Filling holes
de: Löcher füllen

source: **Filling holes** involves identifying connected components of *background pixels* that are entirely surrounded by foreground pixels. These components are then 'flipped' to become foreground pixels instead.
de: **Das Füllen von Löchern** beinhaltet das Identifizieren verbundener Komponenten von *Hintergrundpixeln*, die vollständig von Vordergrundpixeln umgeben sind. Diese Komponenten werden dann „umgedreht“, um stattdessen zu Vordergrundpixeln zu werden.

source: Should we then want to identify the holes themselves, we can subtract the original image from the filled image.
de: Wenn wir dann die Löcher selbst identifizieren wollen, können wir das Originalbild vom gefüllten Bild subtrahieren.

source: Filling holes in a binary image. Image subtraction makes it possible to extract the holes themselves.
de: Lücken in einem Binärbild füllen. Durch Bildsubtraktion ist es möglich, die Löcher selbst zu extrahieren.

source: Small holes filled.
de: Kleine Löcher gefüllt.

source: Question
de: Frage

source: We don't always want to fill *all* the holes within a binary image, but rather only the smaller ones. Can you think of a way to fill *only holes smaller than 1000 px²*, using area opening?
de: Wir wollen nicht immer *alle* Lücken in einem Binärbild füllen, sondern nur die kleineren. Können Sie sich eine Möglichkeit vorstellen, mithilfe der Flächenöffnung *nur Löcher zu füllen, die kleiner als 1000 px²* sind?

source: You'll need at least one operation described in previous chapter.
de: Sie benötigen mindestens eine im vorherigen Kapitel beschriebene Operation.

source: Answer
de: Antwort

source: One way to fill holes below a fixed size:
de: Eine Möglichkeit, Löcher unterhalb einer festen Größe zu füllen:

source: Invert the binary image
de: Invertieren Sie das Binärbild

source: Perform area opening with an area threshold of 1000 px²
de: Flächeneröffnung mit einer Flächenschwelle von 1000 px² durchführen

source: Invert the result
de: Kehren Sie das Ergebnis um

source: Thinning & skeletonization
de: Ausdünnung und Skelettierung

source: **Thinning** and **skeletonization** are related operations that aim to 'thin down' objects in a binary image to just their centerlines. They are particularly useful with filamental or tube-like structures, such as axons or blood vessels.
de: **Ausdünnung** und **Skelettierung** sind verwandte Operationen, die darauf abzielen, Objekte in einem Binärbild nur auf ihre Mittellinien zu „verdünnen“. Sie sind besonders nützlich bei fadenförmigen oder röhrenförmigen Strukturen wie Axonen oder Blutgefäßen.

source: The effects of thinning and skeletonization on a binary image.
de: Die Auswirkungen von Ausdünnung und Skelettierung auf ein Binärbild.

source: What's the difference between thinning & skeletonization?
de: Was ist der Unterschied zwischen Ausdünnung und Skelettierung?

source: The truth is: I'm not entirely sure. There is quite a bit of overlap in the literature, and I've seen the same algorithm referred to by both names. Furthermore, there are different thinning algorithms that give different results; the situation is similar for skeletonization algorithms.
de: Die Wahrheit ist: Ich bin mir nicht ganz sicher. In der Literatur gibt es ziemlich viele Überschneidungen, und ich habe gesehen, dass derselbe Algorithmus mit beiden Namen bezeichnet wird. Darüber hinaus gibt es verschiedene Ausdünnungsalgorithmen, die unterschiedliche Ergebnisse liefern; Ähnlich verhält es sich mit Skelettierungsalgorithmen.

source: Software occasionally offers both thinning and skeletonization, but often just offers one or the other. It's worth trying any thinning/skeletonization methods available to see which performs best for any particular application.
de: Software bietet gelegentlich sowohl Ausdünnung als auch Skelettierung, häufig jedoch nur das eine oder das andere. Es lohnt sich, alle verfügbaren Ausdünnungs-/Skelettierungsmethoden auszuprobieren, um herauszufinden, welche für eine bestimmte Anwendung am besten geeignet ist.

source: Morphological reconstruction
de: Morphologische Rekonstruktion

source: **Morphological reconstruction** is a somewhat advanced technique that underpins several powerful image processing operations. It's useful with both grayscale and binary images.
de: **Morphologische Rekonstruktion** ist eine etwas fortgeschrittene Technik, die mehreren leistungsstarken Bildverarbeitungsvorgängen zugrunde liegt. Dies ist sowohl bei Graustufen- als auch bei Binärbildern nützlich.

source: Morphological reconstruction requires two images of the same size: a **marker** image and a **mask** image. The pixel in the *mask* image should all have values greater than or equal to the corresponding pixels in the *marker* image.
de: Für die morphologische Rekonstruktion sind zwei Bilder gleicher Größe erforderlich: ein **Markerbild** und ein **Maskenbild**. Die Pixel im *Masken*-Bild sollten alle Werte haben, die größer oder gleich den entsprechenden Pixeln im *Marker*-Bild sind.
