Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/5-morph/morph.po
Languages: de

source: The reconstruction algorithm progressively *dilates* the marker image (e.g. applies a 3×3 maximum filter), while constraining the marker to remain 'within' the mask; that is, the pixel values in the marker are never allowed to exceed the values in the mask. This dilation is repeated iteratively until the marker cannot change any further without exceeding the mask. The output is the new marker image, after all the dilations have been performed.
de: Der Rekonstruktionsalgorithmus *erweitert* das Markierungsbild schrittweise (wendet z. B. einen 3×3-Maximalfilter an), während er die Markierung darauf beschränkt, „innerhalb“ der Maske zu bleiben; Das heißt, die Pixelwerte in der Markierung dürfen niemals die Werte in der Maske überschreiten. Diese Dilatation wird iterativ wiederholt, bis sich der Marker nicht mehr ändern kann, ohne die Maske zu überschreiten. Die Ausgabe ist das neue Markierungsbild, nachdem alle Dilatationen durchgeführt wurden.

source: Some examples will help demonstrate how this works and why it's useful. The crucial difference in the methods below is how the marker and mask images are created.
de: Einige Beispiele sollen zeigen, wie das funktioniert und warum es nützlich ist. Der entscheidende Unterschied zwischen den folgenden Methoden besteht darin, wie die Markierungs- und Maskenbilder erstellt werden.

source: Hysteresis thresholding
de: Hysterese-Schwellenwert

source: One use of morphological reconstruction is to implement a **double threshold**, also known as **hysteresis thresholding**.
de: Eine Verwendung der morphologischen Rekonstruktion besteht in der Implementierung eines **doppelten Schwellenwerts**, auch bekannt als **Hysterese-Schwellenwert**.

source: For *low threshold* and *high threshold*, I assume we're detecting light structures on a dark background.
de: Bei *niedrigem Schwellenwert* und *hohem Schwellenwert* gehe ich davon aus, dass wir helle Strukturen auf dunklem Hintergrund erkennen.

source: This involves defining both a **low threshold** and a **high threshold.** The low threshold operates like any [global threshold](chap_thresholding) to identify regions. However, a region is discarded from the binary image if it does not also contain at least one pixel that exceeds the high threshold.
de: Dazu gehört die Definition eines **niedrigen Schwellenwerts** und eines **hohen Schwellenwerts**. Der untere Schwellenwert funktioniert wie jeder [globale Schwellenwert](chap_thresholding), um Regionen zu identifizieren. Allerdings wird ein Bereich aus dem Binärbild verworfen, wenn er nicht auch mindestens ein Pixel enthält, das den hohen Schwellenwert überschreitet.

source: This is achieved using morphological reconstruction by defining the *marker* as all pixels exceeding the high threshold, and the *mask* as all pixels exceeding the low threshold. The markers will expand to fill the mask regions that contain them. But any mask regions that don't contain marker pixels are simply ignored.
de: Dies wird mithilfe der morphologischen Rekonstruktion erreicht, indem der *Marker* als alle Pixel definiert wird, die den hohen Schwellenwert überschreiten, und die *Maske* als alle Pixel, die den niedrigen Schwellenwert überschreiten. Die Markierungen werden erweitert, um die Maskenbereiche auszufüllen, in denen sie enthalten sind. Alle Maskenbereiche, die keine Markierungspixel enthalten, werden jedoch einfach ignoriert.

source: Applying a hysteresis threshold to an image. The size and area of the objects detected by this method are determined by the low threshold, but at least one of the pixel values within the object must exceed the high threshold. This slightly mitigates the problem of a single global threshold having [a huge impact on analysis results](chap_thresholding), by the same threshold simultaneously influencing both what is detected and its size.
de: Anwenden eines Hystereseschwellenwerts auf ein Bild. Die Größe und Fläche der mit dieser Methode erkannten Objekte wird durch den unteren Schwellenwert bestimmt, aber mindestens einer der Pixelwerte innerhalb des Objekts muss den hohen Schwellenwert überschreiten. Dadurch wird das Problem, dass ein einzelner globaler Schwellenwert [einen großen Einfluss auf die Analyseergebnisse hat] (chap_thresholding) hat, etwas gemildert, da derselbe Schwellenwert gleichzeitig sowohl das Erkannte als auch seine Größe beeinflusst.

source: H-Maxima & H-Minima
de: H-Maxima und H-Minima

source: We [saw previously](fig-morph_simple_maxima) that we could (kind of) identify local maxima in a very simple way using an image dilation, but the results are often too inaccurate to be useful.
de: Wir [haben zuvor gesehen](fig-morph_simple_maxima), dass wir mithilfe einer Bilddilatation (irgendwie) lokale Maxima auf sehr einfache Weise identifizieren können, aber die Ergebnisse sind oft zu ungenau, um nützlich zu sein.

source: **H-Maxima** and **H-Minima** can help us overcome this. These operations both require only one intuitive parameter: they enable us to identify maxima or minima using a local intensity threshold *H*.
de: **H-Maxima** und **H-Minima** können uns helfen, dieses Problem zu überwinden. Diese Operationen erfordern beide nur einen intuitiven Parameter: Sie ermöglichen es uns, Maxima oder Minima mithilfe eines lokalen Intensitätsschwellenwerts *H* zu identifizieren.

source: This is achieved using morphological reconstruction. For H-maxima, the process is:
de: Dies wird durch morphologische Rekonstruktion erreicht. Für H-Maxima ist der Prozess:

source: Set the original grayscale image as the *mask*
de: Legen Sie das ursprüngliche Graustufenbild als *Maske* fest.

source: Subtract *H* from the mask to create the *markers*
de: Subtrahieren Sie *H* von der Maske, um die *Markierungen* zu erstellen

source: Apply morphological reconstruction using the markers and mask
de: Wenden Sie mithilfe der Marker und der Maske eine morphologische Rekonstruktion an

source: Subtract the reconstruction result from the *mask*
de: Subtrahieren Sie das Rekonstruktionsergebnis von der *Maske*

source: Threshold the subtracted image with a global threshold of *H*
de: Schwellenwert für das subtrahierte Bild mit einem globalen Schwellenwert von *H*

source: The main steps are illustrated in {numref}`fig-morph_h_maxima`. We can apply the same process to an inverted image to find *H-minima*.
de: Die Hauptschritte werden in {numref}`fig-morph_h_maxima` veranschaulicht. Wir können den gleichen Prozess auf ein invertiertes Bild anwenden, um *H-Minima* zu finden.

source: Calculating H-maxima using morphological reconstruction. Here, *H* is set (arbitrarily) to be the image standard deviation.
de: Berechnung von H-Maxima mittels morphologischer Rekonstruktion. Hier wird *H* (willkürlich) als Bildstandardabweichung festgelegt.

source: Opening & closing by reconstruction
de: Eröffnung und Schließung durch Rekonstruktion

source: H-maxima and H-minima use morphological reconstruction to effectively generate a background image that can be subtracted from the original. We do this by subtracting a constant *H*, which acts as a local intensity threshold.
de: H-Maxima und H-Minima nutzen die morphologische Rekonstruktion, um effektiv ein Hintergrundbild zu erzeugen, das vom Original subtrahiert werden kann. Wir tun dies, indem wir eine Konstante *H* subtrahieren, die als lokaler Intensitätsschwellenwert fungiert.

source: We can also use morphological reconstruction to generate a background image based upon spatial information, rather than an intensity threshold *H*, by using **opening by reconstruction**. This effectively introduces a size component into our local threshold. **Closing by reconstruction** is an analogous operation that can be defined using morphological closing.
de: Wir können die morphologische Rekonstruktion auch verwenden, um ein Hintergrundbild basierend auf räumlichen Informationen anstelle eines Intensitätsschwellenwerts *H* zu generieren, indem wir **Öffnung durch Rekonstruktion** verwenden. Dies führt effektiv eine Größenkomponente in unseren lokalen Schwellenwert ein. **Schließen durch Rekonstruktion** ist eine analoge Operation, die durch morphologisches Schließen definiert werden kann.

source: The starting point for opening by reconstruction is a *morphological opening* [as defined above](sec_morph_opening_closing), i.e. an erosion followed by a dilation. This defines the marker image. The original image is used as the mask.
de: Ausgangspunkt für die Öffnung durch Rekonstruktion ist eine *morphologische Öffnung* [wie oben definiert](sec_morph_opening_closing), also eine Erosion gefolgt von einer Dilatation. Dies definiert das Markierungsbild. Als Maske wird das Originalbild verwendet.

source: Using opening by reconstruction to obtain a background estimate. The estimate can be subtracted from an image before applying a global threshold.
de: Verwendung von Öffnung durch Rekonstruktion, um eine Hintergrundschätzung zu erhalten. Die Schätzung kann von einem Bild subtrahiert werden, bevor ein globaler Schwellenwert angewendet wird.

source: As before, opening alone removes structures that are smaller than the structuring element, while slightly affecting the shapes of everything else. Opening by reconstruction essentially adds some further (constrained) dilations so that the structures that were *not* removed are more similar to how they were originally. This can make opening by reconstruction more attractive for generating background images that will be used for subtraction.
de: Wie zuvor werden durch das alleinige Öffnen Strukturen entfernt, die kleiner als das strukturierende Element sind, während die Formen aller anderen Elemente leicht beeinflusst werden. Beim Öffnen durch Rekonstruktion werden im Wesentlichen einige weitere (eingeschränkte) Erweiterungen hinzugefügt, so dass die Strukturen, die *nicht* entfernt wurden, ihrem ursprünglichen Zustand ähnlicher sind. Dies kann das Öffnen durch Rekonstruktion für die Generierung von Hintergrundbildern, die für die Subtraktion verwendet werden, attraktiver machen.

source: Opening by reconstruction can also be applied to binary images as an alternative to *opening* and *area opening*. Like area opening, opening by reconstruction is able to remove some objects while retaining the shapes of larger objects exactly.
de: Das Öffnen durch Rekonstruktion kann alternativ zum *Öffnen* und *Flächenöffnen* auch auf Binärbilder angewendet werden. Ähnlich wie beim Flächenöffnen können beim Öffnen durch Rekonstruktion einige Objekte entfernt werden, während die Formen größerer Objekte exakt beibehalten werden.

source: Using opening by reconstruction to remove small (and thin) objects from a binary image, while retaining the original shape of everything that remains.
de: Verwenden Sie das Öffnen durch Rekonstruktion, um kleine (und dünne) Objekte aus einem Binärbild zu entfernen und gleichzeitig die ursprüngliche Form aller verbleibenden Elemente beizubehalten.
