Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/4-colors/colors.po
Languages: de, es

source: Default Caption
de: Standard-Beschriftung
es: Leyenda por defecto

source: Channels & colors
de: Kanäle und Farben
es: Canales y colores

source: Chapter outline
de: Gliederung des Kapitels
es: Esquema del capítulo

source: Images with multiple **color channels** may display differently in different software
de: Bilder mit mehreren **Farbkanälen** können in verschiedenen Programmen unterschiedlich dargestellt werden.
es: Las imágenes con varios **canales de color** pueden mostrarse de forma diferente en distintos programas.

source: **RGB images** are a special case, and generally look consistent across different software
de: **RGB-Bilder** sind ein Sonderfall und sehen im Allgemeinen in verschiedenen Programmen gleich aus.
es: **Las imágenes RGB** son un caso especial y, por lo general, tienen el mismo aspecto en distintos programas.

source: In ImageJ, multichannel images that are not RGB may be referred to as **composite images**
de: In ImageJ können Mehrkanalbilder, die nicht RGB sind, als **Zusammengesetzte Bilder** bezeichnet werden.
es: En ImageJ, las imágenes multicanal que no son RGB pueden denominarse **imágenes compuestas**.

source: **Converting images to RGB often loses information!**
de: **Bei der Konvertierung von Bildern in RGB gehen oft Informationen verloren!
es: **La conversión de imágenes a RGB suele perder información.

source: Introduction
de: Einführung
es: Introducción

source: One way to introduce color into images is to use a suitable LUT, as described in {ref}`chap_pixels`. Then the fact that different colors could be involved in the display of such images was really only incidental: at each location in the image there was still only one channel, one pixel and one value.
de: Eine Möglichkeit, Farbe in Bilder einzubringen, ist die Verwendung einer geeigneten LUT, wie in {ref}`chap_pixels` beschrieben. Dann war die Tatsache, dass verschiedene Farben an der Darstellung solcher Bilder beteiligt sein konnten, wirklich nur nebensächlich: An jeder Stelle des Bildes gab es immer noch nur einen Kanal, ein Pixel und einen Wert.
es: Una forma de introducir color en las imágenes es utilizar una LUT adecuada, como se describe en {ref}`chap_pixels`. Entonces, el hecho de que en la visualización de tales imágenes pudieran intervenir diferentes colores era en realidad sólo incidental: en cada lugar de la imagen seguía habiendo un solo canal, un píxel y un valor.

source: There are images for which color plays a more important role. We will consider two types:
de: Es gibt Bilder, bei denen die Farbe eine wichtigere Rolle spielt. Wir werden zwei Typen betrachten:
es: Hay imágenes para las que el color desempeña un papel más importante. Consideraremos dos tipos:

source: **RGB images** -- which are widely used for display, but are *usually* not very good for quantitative analysis
de: **RGB-Bilder** - die häufig für die Anzeige verwendet werden, aber *normalerweise* nicht sehr gut für quantitative Analysen geeignet sind
es: **Imágenes RGB**: muy utilizadas para la visualización, pero *normalmente* poco adecuadas para el análisis cuantitativo.

source: **Multichannel / composite images** -- which are often better for analysis, but need to be converted to RGB for display
de: **Mehrkanal-/Kompositbilder** -- die oft besser für die Analyse geeignet sind, aber für die Anzeige in RGB umgewandelt werden müssen
es: **Imágenes multicanal / compuestas**: a menudo son mejores para el análisis, pero deben convertirse a RGB para su visualización.

source: Since they often *look* the same, but behave very differently, knowing which kind of color image you have is important for any scientific work.
de: Da sie oft gleich *aussehen*, sich aber sehr unterschiedlich verhalten, ist es für jede wissenschaftliche Arbeit wichtig zu wissen, welche Art von Farbbild man hat.
es: Dado que a menudo *parecen* iguales, pero se comportan de forma muy diferente, saber qué tipo de imagen en color se tiene es importante para cualquier trabajo científico.

source: Mixing red, green & blue
de: Mischen von Rot, Grün und Blau
es: Mezcla de rojo, verde y azul

source: We previously discussed how image LUTs provide a way to map pixel values to colors that can be displayed on screen. Now that we've looked at image types and bit-depths, we can expand a bit more on how that works in practice.
de: Wir haben bereits besprochen, wie Bild-LUTs eine Möglichkeit bieten, Pixelwerte auf Farben abzubilden, die auf dem Bildschirm angezeigt werden können. Nachdem wir uns nun mit Bildtypen und Bittiefen befasst haben, können wir etwas näher darauf eingehen, wie das in der Praxis funktioniert.
es: Ya hemos hablado de cómo las LUT de imagen proporcionan una forma de asignar valores de píxel a colores que se pueden mostrar en pantalla. Ahora que hemos visto los tipos de imagen y las profundidades de bits, podemos ampliar un poco más cómo funciona en la práctica.

source: In general, each color is represented using three 8-bit unsigned integers: one for **r**ed, one for **g**reen, one for **b**lue. Each integer value defines how much of each primary color should be mixed together to create the final color used to display the pixel.
de: Im Allgemeinen wird jede Farbe durch drei vorzeichenlose 8-Bit-Ganzzahlen dargestellt: eine für **r**ed, eine für **g**reen, eine für **b**lue. Jeder Integer-Wert legt fest, wie viel von jeder Primärfarbe zusammengemischt werden sollte, um die endgültige Farbe zu erzeugen, die zur Anzeige des Pixels verwendet wird.
es: En general, cada color se representa mediante tres enteros sin signo de 8 bits: uno para **r**ed, uno para **g**verde, uno para **b**azul. Cada valor entero define qué cantidad de cada color primario debe mezclarse para crear el color final utilizado para mostrar el píxel.

source: In the case of a grayscale LUT, the red, green and blue values are all the same:
de: Im Falle einer Graustufen-LUT sind die Rot-, Grün- und Blauwerte alle gleich:
es: En el caso de una LUT de escala de grises, los valores rojo, verde y azul son todos iguales:

source: Other LUTs may include only one color, with the others set to zero:
de: Andere LUTs können nur eine Farbe enthalten, während die anderen auf Null gesetzt werden:
es: Otras LUT pueden incluir sólo un color, con los demás a cero:

source: However for most LUTs the red, green and blue values differ:
de: Bei den meisten LUTs unterscheiden sich jedoch die Rot-, Grün- und Blauwerte:
es: Sin embargo, en la mayoría de las LUT, los valores de rojo, verde y azul difieren:

source: Because each of the red, green and blue values can be in the range 0-255, mixing them together can generate (theoretically at least) up to 256 x 256 x 256 = 16,777,216 different colors, i.e. a *lot*.
de: Da jeder der Rot-, Grün- und Blauwerte im Bereich von 0-255 liegen kann, können durch Mischen dieser Werte (zumindest theoretisch) bis zu 256 x 256 x 256 = 16.777.216 verschiedene Farben erzeugt werden, d. h. eine *große* Menge.
es: Como cada uno de los valores de rojo, verde y azul puede estar en el rango 0-255, mezclarlos puede generar (teóricamente al menos) hasta 256 x 256 x 256 = 16.777.216 colores diferentes, es decir, un *mucho*.

source: When it comes to display, this method of representing color using 8-bit RGB values should easily give us many more colors than we could ever hope to distinguish by eye. We don't need a higher bit-depth for display.
de: Was die Anzeige betrifft, so sollte diese Methode der Farbdarstellung mit 8-Bit-RGB-Werten problemlos viel mehr Farben liefern, als wir jemals mit dem Auge zu unterscheiden hoffen könnten. Wir brauchen keine höhere Bittiefe für die Anzeige.
es: En lo que respecta a la visualización, este método de representación del color mediante valores RGB de 8 bits debería proporcionarnos fácilmente muchos más colores de los que podríamos llegar a distinguir a simple vista. No necesitamos una mayor profundidad de bits para la visualización.

source: RGB images
de: RGB-Bilder
es: Imágenes RGB

source: Until now we have considered images where each pixel has a single value, and there is an LUT associated with the image to map these values to colors.
de: Bisher haben wir Bilder betrachtet, bei denen jedes Pixel einen einzigen Wert hat und eine LUT mit dem Bild verbunden ist, um diese Werte auf Farben abzubilden.
es: Hasta ahora hemos considerado imágenes en las que cada píxel tiene un único valor y existe una LUT asociada a la imagen para asignar estos valores a colores.

source: Now that we know how colors are represented, we can consider another option.
de: Da wir nun wissen, wie Farben dargestellt werden, können wir eine weitere Option in Betracht ziehen.
es: Ahora que sabemos cómo se representan los colores, podemos considerar otra opción.

source: Instead of storing a single value per pixel, we can store the RGB values that represent the color used to display the pixel instead. Each pixel then has three values (for red, green and blue), not just a single value.
de: Anstatt einen einzelnen Wert pro Pixel zu speichern, können wir stattdessen die RGB-Werte speichern, die die Farbe repräsentieren, die für die Anzeige des Pixels verwendet wird. Jedes Pixel hat dann drei Werte (für Rot, Grün und Blau) und nicht nur einen einzelnen Wert.
es: En lugar de almacenar un único valor por píxel, podemos almacenar los valores RGB que representan el color utilizado para mostrar el píxel. De este modo, cada píxel tiene tres valores (rojo, verde y azul) y no un único valor.

source: When an image is stored in this way it's called an **RGB image**.
de: Wenn ein Bild auf diese Weise gespeichert wird, nennt man es ein **RGB-Bild**.
es: Cuando una imagen se almacena de este modo, se denomina **imagen RGB**.

source: We can easily create an RGB image from any combination of image + LUT: just replace each pixel value in the original image with the associated RGB values that we find in the LUT. Now each pixel has three values instead of one, but the end result *looks* exactly the same.
de: Wir können ganz einfach ein RGB-Bild aus einer beliebigen Kombination von Bild und LUT erstellen: Ersetzen Sie einfach jeden Pixelwert im Originalbild durch die entsprechenden RGB-Werte, die wir in der LUT finden. Jetzt hat jedes Pixel drei Werte anstelle von einem, aber das Endergebnis *sieht* genau gleich aus.
es: Podemos crear fácilmente una imagen RGB a partir de cualquier combinación de imagen + LUT: basta con sustituir cada valor de píxel de la imagen original por los valores RGB asociados que encontremos en la LUT. Ahora cada píxel tiene tres valores en lugar de uno, pero el resultado final *tiene* exactamente el mismo aspecto.

source: The risk of RGB
de: Das Risiko von RGB
es: El riesgo del RGB

source: The problem with converting an image to RGB is that, in general, *we can't go back!* In fact, the unwitting *overuse* of RGB images is one of the most common sources of data-destroying errors in some branches of scientific imaging.
de: Das Problem bei der Konvertierung eines Bildes in RGB besteht darin, dass wir im Allgemeinen *nicht zurückgehen können*. Tatsächlich ist die unbewusste *Überbeanspruchung* von RGB-Bildern eine der häufigsten Ursachen für datenvernichtende Fehler in einigen Bereichen der wissenschaftlichen Bildgebung.
es: El problema de convertir una imagen a RGB es que, en general, *no podemos volver atrás*. De hecho, el *sobreuso* involuntario de imágenes RGB es una de las fuentes más comunes de errores que destruyen datos en algunas ramas de la imagen científica.

source: Beware converting to RGB!
de: Vorsicht bei der Konvertierung in RGB!
es: ¡Cuidado con la conversión a RGB!

source: Converting an image to RGB is another way lose our raw data.
de: Die Umwandlung eines Bildes in RGB ist eine weitere Möglichkeit, unsere Rohdaten zu verlieren.
es: Convertir una imagen a RGB es otra forma de perder nuestros datos en bruto.

source: {numref}`fig-colors_im_grays_rgb` shows this in action. In the 'least destructive' case, the image has a grayscale LUT. This means that the red, green and blue values are identical to one another -- but *not* necessarily identical to the pixel values of the original image. We have converted the data to 8-bit and used the LUT to determine how much to scale during the conversion.
de: {numref}`fig-colors_im_grays_rgb` zeigt dies in Aktion. Im "am wenigsten destruktiven" Fall hat das Bild eine Graustufen-LUT. Das bedeutet, dass die Rot-, Grün- und Blauwerte untereinander identisch sind - aber *nicht* unbedingt mit den Pixelwerten des Originalbildes. Wir haben die Daten in 8-Bit konvertiert und die LUT verwendet, um zu bestimmen, wie viel bei der Konvertierung skaliert werden soll.
es: {numref}Fig-colors_im_grays_rgb` muestra esto en acción. En el caso "menos destructivo", la imagen tiene una LUT en escala de grises. Esto significa que los valores de rojo, verde y azul son idénticos entre sí, pero *no* necesariamente idénticos a los valores de píxel de la imagen original. Hemos convertido los datos a 8 bits y utilizado la LUT para determinar cuánto escalar durante la conversión.

source: In general, it's not possible to recover the original pixel values from the RGB image: we probably don't know exactly what rescaling was applied, and we have lost information to clipping and rounding.
de: Im Allgemeinen ist es nicht möglich, die ursprünglichen Pixelwerte aus dem RGB-Bild wiederherzustellen: Wir wissen wahrscheinlich nicht genau, welche Skalierung vorgenommen wurde, und wir haben Informationen durch Beschneidung und Rundung verloren.
es: En general, no es posible recuperar los valores originales de los píxeles a partir de la imagen RGB: probablemente no sepamos exactamente qué reescalado se aplicó, y hemos perdido información por recorte y redondeo.

source: Converting a grayscale image to RGB can lose information. We can separate out the red, green and blue values from the RGB image and visualize each as separate images to explore the information they contain. Even though the RGB image looks unchanged from the original, and all three color channels have similar histograms to the original, the bit-depth has been reduced and image statistics modified. There is also a big histogram peak that indicates substantial clipping.
de: Bei der Umwandlung eines Graustufenbildes in RGB können Informationen verloren gehen. Wir können die Rot-, Grün- und Blauwerte aus dem RGB-Bild herauslösen und sie als separate Bilder darstellen, um die darin enthaltenen Informationen zu untersuchen. Obwohl das RGB-Bild gegenüber dem Original unverändert aussieht und alle drei Farbkanäle ähnliche Histogramme wie das Original aufweisen, wurde die Bittiefe verringert und die Bildstatistik verändert. Außerdem gibt es eine große Histogrammspitze, die auf eine erhebliche Beschneidung hinweist.
es: Convertir una imagen en escala de grises a RGB puede hacer que se pierda información. Podemos separar los valores rojo, verde y azul de la imagen RGB y visualizar cada uno de ellos como imágenes independientes para explorar la información que contienen. Aunque el aspecto de la imagen RGB no varía con respecto al original, y los tres canales de color tienen histogramas similares al original, se ha reducido la profundidad de bits y se han modificado las estadísticas de la imagen. También hay un gran pico en el histograma que indica un recorte sustancial.

source: The impact of converting an image with any other LUT to RGB is even more dramatic, as shown in {numref}`fig-colors_im_rgb`. Here, the red, green and blue values are different and the histograms for each color are very different. Again, it would not be possible to recover the original pixel values from the RGB image.
de: Die Auswirkungen der Konvertierung eines Bildes mit einer anderen LUT in RGB sind sogar noch dramatischer, wie in {numref}`fig-colors_im_rgb` gezeigt wird. Hier sind die Rot-, Grün- und Blauwerte unterschiedlich und die Histogramme für jede Farbe sind sehr unterschiedlich. Auch hier wäre es nicht möglich, die ursprünglichen Pixelwerte aus dem RGB-Bild wiederherzustellen.
es: El impacto de convertir una imagen con cualquier otra LUT a RGB es aún más dramático, como se muestra en {numref}`fig-colors_im_rgb`. Aquí, los valores de rojo, verde y azul son diferentes y los histogramas de cada color son muy distintos. De nuevo, no sería posible recuperar los valores originales de los píxeles a partir de la imagen RGB.

source: Converting an to RGB can lose information in a particularly dramatic way if the LUT is not grayscale. The histograms for each channel may now look completely different.
de: Bei der Konvertierung eines Bildes in RGB können Informationen auf besonders dramatische Weise verloren gehen, wenn die LUT nicht graustufig ist. Die Histogramme für jeden Kanal können nun völlig anders aussehen.
es: La conversión de un a RGB puede perder información de una manera particularmente dramática si la LUT no es en escala de grises. Los histogramas de cada canal pueden tener ahora un aspecto completamente distinto.

source: The role of RGB
de: Die Rolle von RGB
es: El papel del RGB

source: Using RGB images for display
de: RGB-Bilder für die Anzeige verwenden
es: Visualización de imágenes RGB

source: So what's the point of having RGB images, if they are so risky?
de: Welchen Sinn haben also RGB-Bilder, wenn sie so riskant sind?
es: Entonces, ¿qué sentido tiene tener imágenes RGB, si son tan arriesgadas?

source: One of the biggest reasons to use RGB images in science is for presentation. While specialist image analysis software applications, such as ImageJ, are typically designed to handle a range of exotic image types and bit-depths, the same is not true for non-scientific software.
de: Einer der wichtigsten Gründe für die Verwendung von RGB-Bildern in der Wissenschaft ist die Präsentation. Während spezialisierte Bildanalyseprogramme wie ImageJ in der Regel für die Verarbeitung einer Reihe exotischer Bildtypen und Bittiefen ausgelegt sind, gilt dies nicht für nicht-wissenschaftliche Software.
es: Una de las principales razones para utilizar imágenes RGB en la ciencia es la presentación. Aunque las aplicaciones de software especializadas en análisis de imágenes, como ImageJ, suelen estar diseñadas para manejar una serie de tipos de imágenes y profundidades de bits exóticos, no ocurre lo mismo con el software no científico.

source: If want want an image to dispay exactly the same in ImageJ as in a PowerPoint&reg; presentation or a figure in a publication, for example, we'll probably want to convert it to RGB. If we don't, the image might display very strangely on other software -- or even not open at all.
de: Wenn wir wollen, dass ein Bild in ImageJ genauso angezeigt wird wie in einer PowerPoint-Präsentation&reg; oder einer Abbildung in einer Publikation, müssen wir es wahrscheinlich in RGB konvertieren. Wenn wir das nicht tun, wird das Bild in anderen Programmen möglicherweise sehr seltsam angezeigt - oder lässt sich sogar überhaupt nicht öffnen.
es: Si queremos que una imagen se muestre exactamente igual en ImageJ que en una presentación de PowerPoint&reg; o en una figura de una publicación, por ejemplo, probablemente querremos convertirla a RGB. Si no lo hacemos, la imagen podría mostrarse de forma muy extraña en otro software, o incluso no abrirse en absoluto.

source: 'Why is my image just black?'
de: Warum ist mein Bild nur schwarz?
es: ¿Por qué mi imagen es sólo negra?

source: Over the years, I have encountered a remarkable number of cases where a researcher has saved their fluorescence microscopy images *only* in an RGB format.
de: Im Laufe der Jahre bin ich auf eine bemerkenswerte Anzahl von Fällen gestoßen, in denen ein Forscher seine Fluoreszenzmikroskopiebilder *nur* im RGB-Format gespeichert hat.
es: A lo largo de los años, me he encontrado con un número notable de casos en los que un investigador ha guardado sus imágenes de microscopía de fluorescencia *sólo* en formato RGB.

source: Their justification was that they tried saving the images in different way at the microscope, but *'it didn't work -- the images were all black'*.
de: Sie begründeten dies damit, dass sie versucht hatten, die Bilder auf verschiedene Weise am Mikroskop zu speichern, aber *es funktionierte nicht - die Bilder waren alle schwarz'*.
es: Su justificación fue que intentaron guardar las imágenes de forma diferente en el microscopio, pero *'no funcionó -- las imágenes eran todas negras'*.

source: The explanation is almost invariably that their images were really 16-bit or 32-bit, but they tried to open them in software that doesn't handle 16-bit images very well (e.g. they just double-clicked the file to open it in the default image viewer). All they saw as a black, seemingly-empty image.
de: Die Erklärung ist fast immer, dass ihre Bilder in Wirklichkeit 16- oder 32-Bit-Bilder waren, sie aber versucht haben, sie in einer Software zu öffnen, die 16-Bit-Bilder nicht gut verarbeiten kann (z. B. haben sie einfach auf die Datei doppelgeklickt, um sie im Standard-Bildbetrachter zu öffnen). Alles, was sie sahen, war ein schwarzes, scheinbar leeres Bild.
es: La explicación es casi siempre que sus imágenes eran realmente de 16 o 32 bits, pero intentaron abrirlas con un software que no maneja muy bien las imágenes de 16 bits (por ejemplo, hicieron doble clic en el archivo para abrirlo en el visor de imágenes predeterminado). Lo único que veían era una imagen negra, aparentemente vacía.

source: Whenever they tried exporting from the microscope's acquisition software in different ways, they found an option that gave a viewable image -- and stuck with that.
de: Wann immer sie versuchten, auf verschiedene Weise aus der Erfassungssoftware des Mikroskops zu exportieren, fanden sie eine Option, die ein anzeigbares Bild lieferte - und blieben bei dieser.
es: Cada vez que intentaban exportar desde el software de adquisición del microscopio de diferentes maneras, encontraban una opción que ofrecía una imagen visible, y se quedaban con ella.

source: The problem with this is that it usually meant that *they didn't save their raw data at all!* They *only* saved an RGB copy, with all the rescaling and LUT magic applied, which is wholly unsuitable for analysis.
de: Das Problem dabei ist, dass dies in der Regel bedeutete, dass *sie ihre Rohdaten überhaupt nicht gespeichert haben!* Sie haben *nur* eine RGB-Kopie gespeichert, auf die alle Skalierungs- und LUT-Magie angewendet wurde, die für die Analyse völlig ungeeignet ist.
es: El problema es que, en la mayoría de los casos, esto significa que *no guardaron los datos en bruto*, sino que *sólo* guardaron una copia RGB, con toda la magia del reescalado y las LUT aplicadas, que es totalmente inadecuada para el análisis.

source: The solution is to view images in ImageJ, or similar scientific software. This usually reveals that the image is not 'all black' after all. Rather, one only needs to adjust the brightness and contrast (using the LUT) to see the raw data in all its glory.
de: Die Lösung besteht darin, Bilder in ImageJ oder einer ähnlichen wissenschaftlichen Software zu betrachten. Dabei zeigt sich in der Regel, dass das Bild doch nicht "ganz schwarz" ist. Vielmehr muss man nur die Helligkeit und den Kontrast (mithilfe der LUT) anpassen, um die Rohdaten in ihrer ganzen Pracht zu sehen.
es: La solución es ver las imágenes en ImageJ o en un programa científico similar. Esto suele revelar que, después de todo, la imagen no es "totalmente negra". Basta con ajustar el brillo y el contraste (mediante la LUT) para ver los datos en bruto en todo su esplendor.

source: When RGB is all you've got
de: Wenn RGB alles ist, was Sie haben
es: Cuando RGB es todo lo que tienes
