Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/4-colors/colors.po
Languages: de, es

source: All the previous comments about *'don't convert to RGB before analysis'* as based on the assumption that your raw data isn't already RGB. This is usually the case with microscopy and medical imaging whenever accurate quantification is important.
de: Alle vorherigen Kommentare über *'nicht vor der Analyse in RGB konvertieren'* basieren auf der Annahme, dass Ihre Rohdaten nicht bereits RGB sind. Dies ist in der Regel bei Mikroskopie und medizinischer Bildgebung der Fall, wenn eine genaue Quantifizierung wichtig ist.
es: Todos los comentarios anteriores sobre *'no convertir a RGB antes del análisis'* se basan en la suposición de que los datos en bruto no son ya RGB. Este suele ser el caso de la microscopía y la imagen médica cuando es importante una cuantificación precisa.

source: Nevertheless, it's not *always* the case.
de: Dennoch ist das nicht *immer* der Fall.
es: Sin embargo, no *siempre* es así.

source: A common example is brightfield imaging for histology or pathology. Here, the camera is often RGB and an RGB image is really as close to the raw data as we are likely to get.
de: Ein gängiges Beispiel ist die Hellfeld-Bildgebung in der Histologie oder Pathologie. Hier ist die Kamera oft RGB, und ein RGB-Bild kommt den Rohdaten so nahe wie möglich.
es: Un ejemplo habitual son las imágenes de campo claro para histología o patología. En estos casos, la cámara suele ser RGB y una imagen RGB es lo más parecido a los datos en bruto que podemos obtener.

source: Example RGB histology image, from https://openslide.org
de: Beispiel für ein RGB-Histologiebild, von https://openslide.org
es: Ejemplo de imagen histológica RGB, de https://openslide.org

source: Crucially, the analysis of brightfield images in histology usually aims to replicate (and sometimes improve upon) the visual assessment that a pathologist might make looking down a microscope. It's often based on detecting, classifying and counting cells, measuring stained areas, or recognizing the presence of particular patterns -- but *not* accurately quantifying staining intensity.
de: Entscheidend ist, dass die Analyse von Hellfeldbildern in der Histologie in der Regel darauf abzielt, die visuelle Beurteilung zu wiederholen (und manchmal zu verbessern), die ein Pathologe beim Blick durch ein Mikroskop vornehmen könnte. Sie basiert häufig auf der Erkennung, Klassifizierung und Zählung von Zellen, der Messung gefärbter Bereiche oder der Erkennung bestimmter Muster - aber *nicht* auf der genauen Quantifizierung der Färbeintensität.
es: Fundamentalmente, el análisis de imágenes de campo claro en histología suele tener como objetivo replicar (y a veces mejorar) la evaluación visual que un patólogo podría hacer al microscopio. A menudo se basa en detectar, clasificar y contar células, medir áreas teñidas o reconocer la presencia de patrones particulares, pero no en cuantificar con precisión la intensidad de la tinción.

source: Multichannel images
de: Mehrkanalige Bilder
es: Imágenes multicanal

source: So far, we have focussed on 2D images with a **single channel** -- that is, a single value for every pixel at every *x,y* coordinate in the image.
de: Bisher haben wir uns auf 2D-Bilder mit einem **Einkanal** konzentriert, d. h. einem einzigen Wert für jedes Pixel an jeder *x,y*-Koordinate im Bild.
es: Hasta ahora, nos hemos centrado en imágenes 2D con un **canal único**, es decir, un valor único para cada píxel en cada coordenada *x,y* de la imagen.

source: Such images can be converted to 8-bit RGB using a LUT. If we do this, then we get an image with **three channels**, where each channel is displayed using red, green and blue LUTs -- with the colors blended together for display. But we shouldn't do that conversion prior to analysis in case we lose our raw data.
de: Solche Bilder können mit Hilfe einer LUT in 8-Bit-RGB umgewandelt werden. Wenn wir dies tun, erhalten wir ein Bild mit **drei Kanälen**, bei dem jeder Kanal mit Hilfe von roten, grünen und blauen LUTs dargestellt wird - wobei die Farben für die Anzeige zusammengemischt werden. Wir sollten diese Konvertierung jedoch nicht vor der Analyse durchführen, da wir sonst unsere Rohdaten verlieren.
es: Estas imágenes pueden convertirse a RGB de 8 bits mediante una LUT. Si hacemos esto, obtenemos una imagen con **tres canales**, donde cada canal se muestra usando LUTs rojo, verde y azul -- con los colores mezclados para su visualización. Pero no deberíamos hacer esa conversión antes del análisis por si perdemos nuestros datos en bruto.

source: Now, we turn to consider **multichannel images** that aren't RGB images. Rather, the raw data itself has multiple channels.
de: Wir betrachten nun **Mehrkanalbilder**, die keine RGB-Bilder sind. Vielmehr haben die Rohdaten selbst mehrere Kanäle.
es: Ahora pasamos a considerar las **imágenes multicanal** que no son imágenes RGB. Más bien, los propios datos en bruto tienen varios canales.

source: In fluorescence microscopy, it's common to acquire multichannel images in which pixel values for each channel are determined from light that has been filtered according to its wavelength. We *might* choose to visualize these channels as red, green and blue, but we don't have to.
de: In der Fluoreszenzmikroskopie werden in der Regel Mehrkanalbilder aufgenommen, bei denen die Pixelwerte für jeden Kanal aus dem nach seiner Wellenlänge gefilterten Licht bestimmt werden. Wir *können* uns dafür entscheiden, diese Kanäle als rot, grün und blau darzustellen, aber wir müssen es nicht.
es: En microscopía de fluorescencia, es habitual adquirir imágenes multicanal en las que los valores de los píxeles de cada canal se determinan a partir de luz filtrada según su longitud de onda. Podríamos elegir visualizar estos canales como rojo, verde y azul, pero no tenemos por qué hacerlo.

source: In principle, any LUT might be applied to each channel, but it makes sense to choose LUTs that somehow relate to the wavelength (i.e. color) of light detected for the corresponding channels. Channels can then be overlaid on top of one another, and their colors further merged for display (e.g. high values in both green and red channels are shown as yellow).
de: Im Prinzip kann jede LUT auf jeden Kanal angewendet werden, aber es ist sinnvoll, LUTs zu wählen, die in irgendeiner Weise mit der Wellenlänge (d. h. der Farbe) des für die entsprechenden Kanäle erfassten Lichts zusammenhängen. Die Kanäle können dann übereinander gelegt und ihre Farben für die Anzeige weiter zusammengeführt werden (z. B. werden hohe Werte im grünen und roten Kanal als gelb angezeigt).
es: En principio, se puede aplicar cualquier LUT a cada canal, pero tiene sentido elegir LUTs que se relacionen de algún modo con la longitud de onda (es decir, el color) de la luz detectada para los canales correspondientes. A continuación, los canales pueden superponerse y sus colores fusionarse para su visualización (por ejemplo, los valores altos de los canales verde y rojo se muestran en amarillo).

source: The important feature of these images is that the actual channel information is always retained, and so the original pixel values remain available. This means we can still extract channels or adjust their LUTs as needed.
de: Das wichtige Merkmal dieser Bilder ist, dass die eigentlichen Kanalinformationen immer erhalten bleiben und somit die ursprünglichen Pixelwerte verfügbar bleiben. Das bedeutet, dass wir weiterhin Kanäle extrahieren oder ihre LUTs nach Bedarf anpassen können.
es: La característica importante de estas imágenes es que siempre se conserva la información real del canal, por lo que los valores originales de los píxeles siguen estando disponibles. Esto significa que aún podemos extraer canales o ajustar sus LUT según sea necesario.

source: Multichannel image using red, green and blue LUTs. Although this looks a lot like an RGB image, each channel still contains the raw data (which might be 16-bit or 32-bit). The original pixel values can be extracted if needed, and different LUTs used.
de: Mehrkanalbild mit roten, grünen und blauen LUTs. Obwohl dies einem RGB-Bild sehr ähnlich sieht, enthält jeder Kanal immer noch die Rohdaten (die 16- oder 32-Bit sein können). Die ursprünglichen Pixelwerte können bei Bedarf extrahiert werden, und es können verschiedene LUTs verwendet werden.
es: Imagen multicanal que utiliza LUT de rojo, verde y azul. Aunque se parece mucho a una imagen RGB, cada canal sigue conteniendo los datos en bruto (que pueden ser de 16 o 32 bits). Si es necesario, se pueden extraer los valores originales de los píxeles y utilizar diferentes LUT.

source: Multichannel image from {numref}`fig-colors_composite_rgb` using different LUTs. Again, no information is lost: we can access the original pixel values, and update the LUTs if needed.
de: Mehrkanalbild aus {numref}`fig-colors_composite_rgb` unter Verwendung verschiedener LUTs. Auch hier gehen keine Informationen verloren: Wir können auf die ursprünglichen Pixelwerte zugreifen und die LUTs bei Bedarf aktualisieren.
es: Imagen multicanal de {numref}`fig-colors_composite_rgb` utilizando diferentes LUTs. De nuevo, no se pierde información: podemos acceder a los valores de píxel originales y actualizar las LUT si es necesario.

source: Just like with a single channel image, we can create an RGB image that allows us to visualize our multichannel image -- using the LUTs to figure out which RGB values are needed to represent the color of each pixel.
de: Genau wie bei einem einkanaligen Bild können wir ein RGB-Bild erstellen, das es uns ermöglicht, unser Mehrkanalbild zu visualisieren, indem wir die LUTs verwenden, um herauszufinden, welche RGB-Werte zur Darstellung der Farbe jedes Pixels erforderlich sind.
es: Al igual que con una imagen de un solo canal, podemos crear una imagen RGB que nos permita visualizar nuestra imagen multicanal -- utilizando las LUTs para averiguar qué valores RGB son necesarios para representar el color de cada píxel.

source: Then, again just like with the single channel image, this is problematic if we don't keep the raw data -- because we can never recover the original values from the RGB representation.
de: Wie beim Einkanalbild ist dies problematisch, wenn wir die Rohdaten nicht aufbewahren, denn wir können die ursprünglichen Werte nie aus der RGB-Darstellung wiederherstellen.
es: Entonces, de nuevo al igual que con la imagen de un solo canal, esto es problemático si no conservamos los datos en bruto - porque nunca podemos recuperar los valores originales de la representación RGB.

source: We can create an RGB image from {numref}`fig-colors_composite_non_rgb`, but then we have three channels locked to red, green and blue -- which have converted the original channels to 8-bit, and mixed up information due to the LUT colors used. We can no longer recover the original pixel values after converting to RGB.
de: Wir können ein RGB-Bild aus {numref}`fig-colors_composite_non_rgb` erstellen, aber dann haben wir drei Kanäle, die auf Rot, Grün und Blau fixiert sind - was die ursprünglichen Kanäle in 8-Bit konvertiert und die Informationen aufgrund der verwendeten LUT-Farben vermischt hat. Nach der Konvertierung in RGB können wir die ursprünglichen Pixelwerte nicht mehr wiederherstellen.
es: Podemos crear una imagen RGB a partir de {numref}`fig-colors_composite_non_rgb`, pero entonces tenemos tres canales bloqueados a rojo, verde y azul -- que han convertido los canales originales a 8 bits, y mezclado información debido a los colores LUT utilizados. Ya no podemos recuperar los valores originales de los píxeles después de convertirlos a RGB.

source: Summary of color images
de: Zusammenfassung der Farbbilder
es: Resumen de imágenes en color

source: The main message here can be distilled into two rules:
de: Die wichtigste Botschaft lässt sich in zwei Regeln zusammenfassen:
es: El mensaje principal puede resumirse en dos reglas:

source: **Always use the original image for analysis**
de: **Immer das Originalbild zur Analyse verwenden**
es: **Utilice siempre la imagen original para el análisis.

source: If the raw data isn't RGB, then don't convert it before analysis!
de: Wenn die Rohdaten nicht RGB sind, sollten Sie sie vor der Analyse nicht konvertieren!
es: Si los datos brutos no son RGB, ¡no los convierta antes de analizarlos!

source: **Create an RGB copy of your image for display**
de: **Erstellen Sie eine RGB-Kopie Ihres Bildes für die Anzeige**
es: **Crea una copia RGB de tu imagen para mostrarla.

source: Keep the RGB copy separate, so you always retain it *and* the raw image
de: Bewahren Sie die RGB-Kopie separat auf, damit Sie sie *und* das Rohbild immer behalten können.
es: Mantén la copia RGB separada, para conservarla siempre *y* la imagen sin procesar

source: RGB images aren't *bad* -- we almost always need them for display, and for *some* imaging applications (e.g. brightfield histology) they are the best raw data we can get. But we need to be cautious if our raw data isn't RGB, and avoid converting to RGB too early.
de: RGB-Bilder sind nicht *schlecht* - wir brauchen sie fast immer für die Anzeige, und für *bestimmte* Bildgebungsanwendungen (z. B. Hellfeld-Histologie) sind sie die besten Rohdaten, die wir bekommen können. Aber wir müssen vorsichtig sein, wenn unsere Rohdaten nicht RGB sind, und eine zu frühe Konvertierung in RGB vermeiden.
es: Las imágenes RGB no son *malas*: casi siempre las necesitamos para la visualización, y para *algunas* aplicaciones de imagen (por ejemplo, histología de campo claro) son los mejores datos brutos que podemos obtener. Pero debemos ser cautelosos si nuestros datos brutos no son RGB, y evitar convertirlos a RGB demasiado pronto.

source: In the end, it's normal to keep at least two versions of each dataset: one in the original (possibly multichannel) format, and one as RGB for display. This RGB image is normally created as the _final_ step, after applying any processing or LUT adjustments to the original data.
de: Letztendlich ist es normal, mindestens zwei Versionen eines jeden Datensatzes aufzubewahren: eine im ursprünglichen (möglicherweise mehrkanaligen) Format und eine als RGB-Bild für die Anzeige. Dieses RGB-Bild wird normalerweise als _letzter_ Schritt erstellt, nachdem alle Verarbeitungs- oder LUT-Anpassungen auf die Originaldaten angewendet wurden.
es: Al final, lo normal es conservar al menos dos versiones de cada conjunto de datos: una en el formato original (posiblemente multicanal) y otra en RGB para su visualización. Esta imagen RGB suele crearse como paso _final_, tras aplicar cualquier procesamiento o ajuste LUT a los datos originales.

source: Other color spaces
de: Andere Farbräume
es: Otros espacios de color

source: Color is a big topic, and there is a lot more that could be said about different color spaces and transformations. However, these are mostly relevant when working with data that is originally RGB.
de: Farbe ist ein großes Thema, und es gäbe noch viel mehr über die verschiedenen Farbräume und Transformationen zu sagen. Diese sind jedoch hauptsächlich für die Arbeit mit Daten relevant, die ursprünglich RGB sind.
es: El color es un gran tema, y se podría decir mucho más sobre los diferentes espacios de color y transformaciones. Sin embargo, estos son sobre todo relevantes cuando se trabaja con datos que son originalmente RGB.

source: For example, we could convert an RGB image to an *HSB* representation, where HSB stands for *Hue*, *Saturation* and *Brightness*. This is useful to separate hue from brightness, e.g. to help identify all red pixels regardless of whether they are bright or dark.
de: Wir können zum Beispiel ein RGB-Bild in eine *HSB*-Darstellung konvertieren, wobei HSB für *Farbton*, *Sättigung* und *Helligkeit* steht. Dies ist nützlich, um den Farbton von der Helligkeit zu trennen, z. B. um alle roten Pixel zu identifizieren, unabhängig davon, ob sie hell oder dunkel sind.
es: Por ejemplo, podemos convertir una imagen RGB en una representación *HSB*, donde HSB significa *Tono*, *Saturación* y *Brillo*. Esto es útil para separar el tono del brillo, por ejemplo, para ayudar a identificar todos los píxeles rojos independientemente de si son brillantes u oscuros.

source: Alternatively, we could convert an RGB image to *CMYK*, which stands for *Cyan*, *Magenta*, *Yellow* and *blacK* -- which may be a better fit for printers than monitors.
de: Alternativ können wir ein RGB-Bild in *CMYK* konvertieren, was für *Cyan*, *Magenta*, *Gelb* und *BlackK* steht - was für Drucker besser geeignet sein dürfte als für Monitore.
es: Otra posibilidad es convertir una imagen RGB a *CMYK*, que significa *Cyan*, *Magenta*, *Yellow* y *blacK*, lo que puede ser más adecuado para impresoras que para monitores.

source: But I personally haven't found such transforms very relevant to the areas of bioimage analysis in which I have worked. I have tried to focus here on the main need-to-know topics that impact analyzing scientific images. With this in mind, I think that understanding RGB (and its limitations) is crucial -- while other transforms can be picked up later if they are needed.
de: Ich persönlich habe jedoch festgestellt, dass solche Transformationen für die Bereiche der Bio-Bildanalyse, in denen ich gearbeitet habe, nicht sehr relevant sind. Ich habe versucht, mich hier auf die wichtigsten Themen zu konzentrieren, die für die Analyse wissenschaftlicher Bilder wichtig sind. In diesem Sinne denke ich, dass das Verständnis von RGB (und seiner Grenzen) von entscheidender Bedeutung ist - während andere Transformationen später nachgeholt werden können, wenn sie benötigt werden.
es: Pero, personalmente, no he encontrado esas transformaciones muy relevantes para las áreas de análisis de bioimágenes en las que he trabajado. He intentado centrarme aquí en los principales temas que es necesario conocer y que afectan al análisis de imágenes científicas. Con esto en mente, creo que la comprensión de RGB (y sus limitaciones) es crucial - mientras que otras transformaciones pueden ser recogidos más tarde si son necesarios.
