Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/4-colors/imagej.po
Languages: es, pt_br

source: {guilabel}`Composite Invert` -- Similar to {guilabel}`Composite`, except *subtract* the red, green and blue LUT values instead of adding them
es: {guilabel}`Composite Invert` -- Similar a {guilabel}`Composite`, excepto que *resta* los valores LUT rojo, verde y azul en lugar de sumarlos.
pt_br: {guilabel}`Composite Invert` -- Semelhante a {guilabel}`Composite`, exceto *subtrair* os valores LUT vermelho, verde e azul em vez de adicioná-los

source: Both {guilabel}`Composite Min` and {guilabel}`Composite Invert` are useful for LUTs with light backgrounds, therefore if you select one of these options ImageJ may flip a LUT to have a light background if needed.
es: Tanto {guilabel}`Composite Min` como {guilabel}`Composite Invert` son útiles para LUTs con fondos claros, por lo tanto si selecciona una de estas opciones ImageJ puede voltear una LUT para que tenga un fondo claro si es necesario.
pt_br: Tanto {guilabel}`Composite Min` quanto {guilabel}`Composite Invert` são úteis para LUTs com fundos claros, portanto, se você selecionar um dos essas opções ImageJ podem inverter uma LUT para ter um fundo claro, se necessário.

source: Visualizing the new composite modes.
es: Visualización de los nuevos modos compuestos.
pt_br: Visualizando os novos modos compostos.

source: Be careful with composites!
es: ¡Cuidado con los compuestos!
pt_br: Cuidado com os compósitos!

source: Any new visualization modes have the potential to cause confusion or to be abused. Although the new composite modes can be useful, I advise caution.
es: Cualquier nuevo modo de visualización puede causar confusión o dar lugar a abusos. Aunque los nuevos modos compuestos pueden ser útiles, aconsejo precaución.
pt_br: Quaisquer novos modos de visualização têm o potencial de causar confusão ou abuso. Embora os novos modos compostos possam ser úteis, aconselho cautela.

source: The original {guilabel}`Composite` mode is really well established, and is the default. If you use any of the 'new' composite modes in a figure for publication, you should clearly specify which.
es: El modo original {guilabel}`Composite` está realmente bien establecido, y es el predeterminado. Si utiliza alguno de los "nuevos" modos compuestos en una figura para su publicación, deberá especificar claramente cuál.
pt_br: O modo {guilabel}`Composite` original está realmente bem estabelecido e é o padrão. Se você usar qualquer um dos “novos” modos compostos em uma figura para publicação, deverá especificar claramente qual.

source: Choosing channel colors
es: Elegir los colores de los canales
pt_br: Escolhendo as cores do canal

source: By changing the LUTs, channels can be assigned any color you like. Although red/green images are widespread, especially for colocalization, they are particularly unhelpful for colorblindness. More accessible images can be created by switching the LUTs of at least one channel to something more suitable (e.g. Red &rarr; Magenta) – although displaying both channels separately is better still.
es: Cambiando las LUT, se puede asignar a los canales el color que se desee. Aunque las imágenes rojo/verde están muy extendidas, sobre todo para la colocalización, son especialmente poco útiles para el daltonismo. Se pueden crear imágenes más accesibles cambiando las LUTs de al menos un canal a algo más adecuado (por ejemplo, Rojo &rarr;<span class='transifex-protect'> </span> Magenta) - aunque mostrar ambos canales por separado es aún mejor.
pt_br: Ao alterar as LUTs, os canais podem receber qualquer cor que você desejar. Embora as imagens vermelhas/verdes sejam difundidas, especialmente para colocalização, elas são particularmente inúteis para daltonismo. Imagens mais acessíveis podem ser criadas alternando as LUTs de pelo menos um canal para algo mais adequado (por exemplo, vermelho &rarr; Magenta) – embora exibir os dois canais separadamente seja ainda melhor.

source: You can also test the effects of different colors using the Fiji command {menuselection}`Image --> Color --> Simulate Color Blindness` (note that this may require converting the image to RGB first).
es: También puede probar los efectos de diferentes colores utilizando el comando Fiji {menuselection}`Image --&gt; Color --&gt; Simulate Color Blindness` (tenga en cuenta que esto puede requerir convertir la imagen a RGB primero).
pt_br: Você também pode testar os efeitos de cores diferentes usando o comando Fiji {menuselection}`Imagem --> Cor --> Simular daltonismo` (observe que isso pode exigir a conversão da imagem para RGB primeiro).

source: More information about generating figures with suitable colors is available at <https://www.nature.com/articles/nmeth.1618>.
es: Encontrará más información sobre cómo generar figuras con los colores adecuados en <https://www.nature.com/articles/nmeth.1618>.
pt_br: Mais informações sobre como gerar figuras com cores adequadas estão disponíveis em <https://www.nature.com/articles/nmeth.1618>.

source: Converting to RGB
es: Conversión a RGB
pt_br: Convertendo para RGB

source: As described in {ref}`chap_colors`, one of the most important uses of RGB images is to create a compatible image for display in different software. We will see more about how to save such images in {ref}`chap_files`.
es: Como se describe en {ref}`chap_colors`, uno de los usos más importantes de las imágenes RGB es crear una imagen compatible para su visualización en diferentes programas. Veremos más sobre cómo guardar dichas imágenes en {ref}`chap_files`.
pt_br: Conforme descrito em {ref}`chap_colors`, um dos usos mais importantes das imagens RGB é criar uma imagem compatível para exibição em diferentes softwares. Veremos mais sobre como salvar essas imagens em {ref}`chap_files`.

source: It should be possible to convert any image to RGB using {menuselection}`Image --> Type --> RGB Color`. However, my preferred way to create an RGB image for display is usually {menuselection}`Image --> Overlay --> Flatten` {kbd}`Shift+F`. This not only converts the image, but also incorporates any ROIs or overlays into the RGB version. Flattening is similar to taking a screenshot of the image as it currently appears, except unaffected by the current zoom level or field of view.
es: Debería ser posible convertir cualquier imagen a RGB usando {menuselection}`Image --&gt; Type --&gt; RGB Color`. Sin embargo, mi forma preferida de crear una imagen RGB para su visualización suele ser {menuselection}`Image --&gt; Overlay --&gt; Flatten` {kbd}`Shift+F`. Esto no sólo convierte la imagen, sino que también incorpora cualquier ROI o superposición en la versión RGB. Aplanar es similar a tomar una captura de pantalla de la imagen tal y como aparece actualmente, excepto que no se ve afectado por el nivel de zoom actual o el campo de visión.
pt_br: Deveria ser possível converter qualquer imagem para RGB usando {menuselection}`Imagem --> Tipo --> Cor RGB`. No entanto, minha maneira preferida de criar uma imagem RGB para exibição geralmente é {menuselection}`Image --> Overlay --> Flatten` {kbd}`Shift+F`. Isso não apenas converte a imagem, mas também incorpora quaisquer ROIs ou sobreposições na versão RGB. Achatar é semelhante a tirar uma captura de tela da imagem como ela aparece atualmente, exceto que não é afetado pelo nível de zoom ou campo de visão atual.

source: Question
es: Pregunta
pt_br: Pergunta

source: ImageJ has two different copying commands, {menuselection}`Edit --> Copy` and {menuselection}`Edit --> Copy to System`. Why?
es: ImageJ tiene dos comandos de copia diferentes, {menuselection}`Edit --&gt; Copy` y {menuselection}`Edit --&gt; Copy to System`. ¿Por qué?
pt_br: ImageJ tem dois comandos de cópia diferentes, {menuselection}`Edit --> Copy` e {menuselection}`Edit --> Copy to System` . Por que?

source: **Note:** When investigating this, you should explore {menuselection}`Edit --> Paste`, alongside two commands in the {menuselection}`File --> New -->` submenu. Be on the lookout for any conversions.
es: **Nota:** Cuando investigue esto, debería explorar {menuselection}`Edición --&gt; Pegar`, junto con dos comandos en el submenú {menuselection}`Archivo --&gt; Nuevo --&gt;`. Esté atento a las conversiones.
pt_br: **Observação:** Ao investigar isso, você deve explorar {menuselection}`Editar --> Colar`, juntamente com dois comandos no {menuselection}`Arquivo --> Novo -->` submenu. Esteja atento a quaisquer conversões.

source: Answer
es: Respuesta
pt_br: Responder

source: {menuselection}`Edit --> Copy` allows you to copy part of an individual image slice (i.e. a 2D part of a particular color channel) and paste it into another image while exactly preserving the original image type and pixel values. You can also use {menuselection}`File --> New --> Internal Clipboard` to get the copied region (but {menuselection}`Image --> Duplicate...` is usually a better option). However, this image type might well not be compatible with other software, therefore images copied in this way cannot be accessed outside ImageJ.
es: {menuselection}Edición --&gt; Copiar` le permite copiar parte de una imagen individual (por ejemplo, una parte 2D de un canal de color particular) y pegarla en otra imagen preservando exactamente el tipo de imagen original y los valores de píxel. También puede utilizar {menuselection}`Archivo --&gt; Nuevo --&gt; Portapapeles interno` para obtener la región copiada (pero {menuselection}`Imagen --&gt; Duplicar...` suele ser una mejor opción). Sin embargo, este tipo de imagen podría no ser compatible con otro software, por lo que no se puede acceder a las imágenes copiadas de esta manera fuera de ImageJ.
pt_br: {menuselection}`Editar --> Copiar` permite copiar parte de uma fatia de imagem individual (ou seja, uma parte 2D de um canal de cor específico) e colá-la em outra imagem preservando exatamente o tipo de imagem original e os valores de pixel. Você também pode usar {menuselection}`Arquivo --> Novo --> Área de transferência interna` para obter a região copiada (mas {menuselection}` Imagem -> Duplicar...` geralmente é uma opção melhor). No entanto, este tipo de imagem pode não ser compatível com outro software, portanto, as imagens copiadas desta forma não podem ser acessadas fora do ImageJ.

source: {menuselection}`Edit --> Copy to System` is needed if you want to copy an image to the system clipboard so that it can be pasted into other software. However, be warned that this converts the image to RGB in the process. If therefore preserves the image appearance, but not necessarily the pixel values.
es: {menuselection}`Edición --&gt; Copiar al Sistema` es necesario si quiere copiar una imagen al portapapeles del sistema para poder pegarla en otro software. Sin embargo, tenga en cuenta que esto convierte la imagen a RGB en el proceso. Por lo tanto, conserva la apariencia de la imagen, pero no necesariamente los valores de los píxeles.
pt_br: {menuselection}`Editar --> Copiar para Sistema` é necessário se você deseja copiar uma imagem para a área de transferência do sistema para que ela possa ser colada em outro software. No entanto, esteja avisado que isso converte a imagem em RGB no processo. Portanto, preserva a aparência da imagem, mas não necessariamente os valores dos pixels.

source: You can test the compatibility of composite and RGB images by opening {menuselection}`File --> Open Samples --> HeLa Cells` image, and saving it using {menuselection}`File --> Save As --> Tiff...` both before and after running {menuselection}`Image --> Type --> RGB Color` to convert the original 16-bit composite data to RGB.
es: Puede probar la compatibilidad de las imágenes compuestas y RGB abriendo la imagen {menuselection}`File --&gt; Open Samples --&gt; HeLa Cells`, y guardándola usando {menuselection}`File --&gt; Save As --&gt; Tiff...` tanto antes como después de ejecutar {menuselection}`Image --&gt; Type --&gt; RGB Color` para convertir los datos compuestos originales de 16 bits a RGB.
pt_br: Você pode testar a compatibilidade de imagens compostas e RGB abrindo a imagem {menuselection}`File --> Open Samples --> HeLa Cells` e salvando-a usando {menuselection}`Arquivo --> Salvar como --> Tiff...` antes e depois de executar {menuselection}`Imagem --> Tipo --> RGB Color` para converter os dados compostos originais de 16 bits em RGB.

source: Try then opening both saved images in other software (e.g. Microsoft PowerPoint&reg;) and compare their appearance.
es: Intente entonces abrir ambas imágenes guardadas en otro software (por ejemplo, Microsoft PowerPoint&reg;) y compare su apariencia.
pt_br: Tente então abrir as duas imagens salvas em outro software (por exemplo, Microsoft PowerPoint&reg;) e compare sua aparência.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run= https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)

source: Think of at least 2 ways in which converting a composite image to RGB can lose information.
es: Piensa en al menos 2 formas en las que al convertir una imagen compuesta a RGB se puede perder información.
pt_br: Pense em pelo menos duas maneiras pelas quais a conversão de uma imagem composta em RGB pode causar perda de informações.

source: You can explore this by comparing the images *Neuron-composite.tif* and *Neuron-RGB.tif*. The {menuselection}`Image --> Color --> Split Channels` command should help.
es: Puede explorar esto comparando las imágenes *Neuron-composite.tif* y *Neuron-RGB.tif*. El comando {menuselection}`Image --&gt; Color --&gt; Split Channels` debería ayudar.
pt_br: Você pode explorar isso comparando as imagens *Neuron-composite.tif* e *Neuron-RGB.tif*. O comando {menuselection}`Image --> Color --> Split Channels` deve ajudar.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-composite.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-RGB.tif)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-composite.tif&amp;open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-RGB.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-composite.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-RGB. tif)

source: One way that converting an image to RGB can lose information is if the original data is 16-bit before conversion and 8-bit afterwards, causing rounding and/or clipping to occur (see {ref}`chap_bit_depths`).
es: Una forma en que la conversión de una imagen a RGB puede perder información es si los datos originales son de 16 bits antes de la conversión y de 8 bits después, lo que provoca el redondeo y/o el recorte (véase {ref}`chap_bit_depths`).
pt_br: Uma maneira pela qual a conversão de uma imagem para RGB pode perder informações é se os dados originais tiverem 16 bits antes da conversão e 8 bits depois, causando arredondamento e/ou recorte (consulte {ref}`chap_bit_profundidades`).

source: Another is that during conversion the channels have been forced to be purely red, green and blue. But perhaps they were not originally so, and separate channels have been merged into the same ones. If you had started with more than three channels, this will definitely have occurred, but even if you had fewer channels you can have problems (like in the *Neuron_composite.tif* and *Neuron_RGB.tif* examples).
es: Otra es que durante la conversión se haya forzado a que los canales sean puramente rojo, verde y azul. Pero quizás no lo eran originalmente, y se han fusionado canales separados en los mismos. Si había empezado con más de tres canales, esto habrá ocurrido sin duda, pero incluso si tenía menos canales puede tener problemas (como en los ejemplos *Neuron_composite.tif* y *Neuron_RGB.tif*).
pt_br: Outra é que durante a conversão os canais foram forçados a serem puramente vermelhos, verdes e azuis. Mas talvez não fossem originalmente assim, e canais separados foram fundidos nos mesmos. Se você começou com mais de três canais, isso definitivamente terá ocorrido, mas mesmo se você tivesse menos canais você pode ter problemas (como nos exemplos *Neuron_composite.tif* e *Neuron_RGB.tif*).

source: The trouble with _only_ having an RGB image is that it is no longer possible to know for sure what the original data looked like, to be able to figure out whether anything has been lost. For example, perhaps you have managed to generate a magnificent image consisting of turquoise, yellow and dazzling pink channels. Each pixel is displayed on screen as a combination of those colors. However, precisely the same color for any pixel can also be represented -- rather more simply -- as a mixture of red, green and blue. So no matter what channels and colors you began with, the final result after merging can be replicated using red, green and blue channels. But if you _only_ have the RGB version, you might never be able to extract the original 3 channels again. Their colors could be so mixed together that the original pixel values would be irretrievably lost.
es: El problema de disponer _sólo_ de una imagen RGB es que ya no es posible saber con certeza cómo eran los datos originales, para poder averiguar si se ha perdido algo. Por ejemplo, quizá hayas conseguido generar una magnífica imagen compuesta por canales turquesa, amarillo y rosa deslumbrante. Cada píxel se muestra en pantalla como una combinación de esos colores. Sin embargo, el mismo color exacto para cualquier píxel también puede representarse --de forma bastante más sencilla-- como una mezcla de rojo, verde y azul. Por lo tanto, no importa con qué canales y colores hayas empezado, el resultado final después de la fusión se puede replicar utilizando los canales rojo, verde y azul. Pero si _sólo_ tienes la versión RGB, es posible que nunca puedas volver a extraer los 3 canales originales. Sus colores podrían estar tan mezclados que los valores originales de los píxeles se perderían irremediablemente.
pt_br: O problema de _apenas_ ter uma imagem RGB é que não é mais possível saber com certeza como eram os dados originais, para poder descobrir se algo foi perdido. Por exemplo, talvez você tenha conseguido gerar uma imagem magnífica composta por canais turquesa, amarelo e rosa deslumbrante. Cada pixel é exibido na tela como uma combinação dessas cores. No entanto, precisamente a mesma cor para qualquer pixel também pode ser representada - de forma mais simples - como uma mistura de vermelho, verde e azul. Portanto, não importa com quais canais e cores você começou, o resultado final após a fusão pode ser replicado usando canais vermelhos, verdes e azuis. Mas se você _apenas_ tiver a versão RGB, talvez nunca mais consiga extrair os 3 canais originais. Suas cores poderiam ser tão misturadas que os valores originais dos pixels seriam irremediavelmente perdidos.

source: And so the good things about RGB images are that they look identical to the original image you had before conversion, and other software (e.g. webbrowsers or PowerPoint&reg;) can understand them effortlessly. But the _potentially very bad_ thing about RGB images is that creating them requires conversion, and after this it might very well be _impossible_ to regain the original pixel values.
es: Lo bueno de las imágenes RGB es que su aspecto es idéntico al de la imagen original antes de la conversión, y otros programas (por ejemplo, navegadores web o PowerPoint&reg;) pueden entenderlas sin esfuerzo. Pero lo _potencialmente muy malo_ de las imágenes RGB es que para crearlas hay que convertirlas, y después de esto puede ser _imposible_ recuperar los valores originales de los píxeles.
pt_br: E a vantagem das imagens RGB é que elas parecem idênticas à imagem original que você tinha antes da conversão, e outros softwares (por exemplo, navegadores da web ou PowerPoint&reg;) podem entendê-las sem esforço. Mas a coisa _potencialmente muito ruim_ sobre as imagens RGB é que criá-las requer conversão e, depois disso, pode muito bem ser _impossível_ recuperar os valores originais dos pixels.

source: How RGB images are converted / How I find out what I can't remember
es: Cómo se convierten las imágenes RGB / Cómo averiguo lo que no recuerdo
pt_br: Como as imagens RGB são convertidas / Como descubro o que não consigo lembrar

source: When describing how {menuselection}`Analyze --> Measure` handles RGB image, I said that it converts the image first.
es: Al describir cómo {menuselection}`Analyze --&gt; Measure` maneja la imagen RGB, dije que primero convierte la imagen.
pt_br: Ao descrever como {menuselection}`Analyze --> Measure` lida com imagens RGB, eu disse que ele converte a imagem primeiro.

source: 'Converts the image' is a fairly vague statement for a very good reason: I only have a vague awareness of how it works, because I've never needed to know it. RGB images aren't good for quantification anyway, so I don't often have any reason to measure pixel values within them.
es: Convierte la imagen" es una afirmación bastante vaga por una buena razón: sólo sé vagamente cómo funciona, porque nunca he necesitado saberlo. De todos modos, las imágenes RGB no son buenas para la cuantificación, así que no suelo tener motivos para medir los valores de los píxeles en ellas.
pt_br: 'Converte a imagem' é uma afirmação bastante vaga por uma boa razão: só tenho uma vaga noção de como funciona, porque nunca precisei saber disso. De qualquer forma, as imagens RGB não são boas para quantificação, então muitas vezes não tenho motivos para medir os valores de pixel dentro delas.

source: I admit this to give reassurance that there's a good chance you don't need to know it either. So if you find the rest of this box confusing, don't worry.
es: Lo admito para asegurarle que es muy probable que usted tampoco necesite saberlo. Así que si el resto de este recuadro te parece confuso, no te preocupes.
pt_br: Admito isso para garantir que há uma boa chance de você também não precisar saber disso. Portanto, se você achar o restante desta caixa confuso, não se preocupe.

source: **However,** it also gives an opportunity to make a bigger point: there are too many intricacies within ImageJ to remember all of them. And that's fine. I believe that a far more important skill is knowing how to investigate what is happening.
es: **Sin embargo, también nos da la oportunidad de hacer una observación más importante: hay demasiadas complejidades en ImageJ como para recordarlas todas. Y eso está bien. Creo que una habilidad mucho más importante es saber cómo investigar lo que está sucediendo.
pt_br: **No entanto,** também oferece a oportunidade de enfatizar um ponto mais importante: há muitas complexidades no ImageJ para lembrar de todas elas. E tudo bem. Acredito que uma habilidade muito mais importante é saber investigar o que está acontecendo.

source: And so here is how I set about understanding what 'converts the image' means.
es: Y así es como me puse a entender lo que significa "convierte la imagen".
pt_br: E foi assim que comecei a entender o que significa “converte a imagem”.
