Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/4-colors/imagej.po
Languages: es, pt_br

source: Firstly, I created an RGB image with 50x50 pixels known values for red (0), green (100) and blue (200).
es: En primer lugar, he creado una imagen RGB de 50x50 píxeles con valores conocidos para el rojo (0), el verde (100) y el azul (200).
pt_br: Primeiramente, criei uma imagem RGB com valores conhecidos de 50x50 pixels para vermelho (0), verde (100) e azul (200).

source: **If** the conversion is simply averaging the red, green and blue values then I would expect the result of running {menuselection}`Analyze --> Measure` to be 100 (since that is the mean of 0, 100 and 200). When I tested it, I found that was the case. I tried some other values, and they all behaved the same way: it appears that conversion is simply averaging the channels.
es: **Si** la conversión es simplemente promediar los valores rojo, verde y azul, entonces yo esperaría que el resultado de ejecutar {menuselection}`Analyze --&gt; Measure` sea 100 (ya que es la media de 0, 100 y 200). Cuando lo probé, descubrí que ese era el caso. Probé otros valores, y todos se comportaron de la misma manera: parece que la conversión está simplemente promediando los canales.
pt_br: **Se** a conversão for simplesmente calcular a média dos valores vermelho, verde e azul, então eu esperaria que o resultado da execução de {menuselection}`Analyze --> Measure` fosse 100 (já que essa é a média de 0, 100 e 200). Quando testei, descobri que era esse o caso. Tentei alguns outros valores e todos se comportaram da mesma maneira: parece que a conversão é simplesmente uma média dos canais.

source: I then hypothesised that I should get the same thing if I use {menuselection}`Image --> Type --> 8-bit`. So I tried that out, and again it matched expectations.
es: Entonces me planteé la hipótesis de que debería obtener lo mismo si utilizaba {menuselection}`Image --&gt; Type --&gt; 8-bit`. Así que lo probé, y de nuevo coincidió con las expectativas.
pt_br: Então levantei a hipótese de que deveria obter a mesma coisa se usasse {menuselection}`Image --> Type --> 8-bit`. Então tentei e, novamente, correspondeu às expectativas.

source: So I concluded that {menuselection}`Analyze --> Measure` was quietly calling {menuselection}`Image --> Type --> 8-bit` on a copy of the image, and then measuring *that*.
es: Así que concluí que {menuselection}`Analyze --&gt; Measure` estaba llamando silenciosamente a {menuselection}`Image --&gt; Type --&gt; 8-bit` en una copia de la imagen, y luego midiendo *eso*.
pt_br: Então concluí que {menuselection}`Analyze --> Measure` estava chamando silenciosamente {menuselection}`Image --> Type --> 8 -bit` em uma cópia da imagem e depois medindo *isso*.

source: Or maybe it's calling {menuselection}`Image --> Type --> 32-bit` instead?
es: ¿O tal vez está llamando a {menuselection}`Image --&gt; Type --&gt; 32-bit` en su lugar?
pt_br: Ou talvez esteja chamando {menuselection}`Image --> Type --> 32-bit`?

source: I needed a new image that would show the effects of rounding, so I added 1 to the blue channel, making its values 201.
es: Necesitaba una nueva imagen que mostrara los efectos del redondeo, así que añadí 1 al canal azul, haciendo que sus valores fueran 201.
pt_br: Eu precisava de uma nova imagem que mostrasse os efeitos do arredondamento, então adicionei 1 ao canal azul, totalizando 201.

source: I then tried {menuselection}`Image --> Type --> 32-bit`, which gave the expected average of 100.33. But {menuselection}`Image --> Type --> 8-bit` still gave 100 per pixel -- because it is limited to integers. And {menuselection}`Analyze --> Measure` also gave me 100 -- which suggest that it converts the RGB images to 8-bit, not floating point, when making its measurements.
es: Entonces probé {menuselection}`Image --&gt; Type --&gt; 32-bit`, que dio la media esperada de 100.33. Pero {menuselection}`Image --&gt; Type --&gt; 8-bit` sigue dando 100 por pixel -- porque está limitado a enteros. Y {menuselection}`Analyze --&gt; Measure` también me dio 100 -- lo que sugiere que convierte las imágenes RGB a 8-bit, no a coma flotante, cuando hace sus mediciones.
pt_br: Então tentei {menuselection}`Image --> Type --> 32-bit`, que deu a média esperada de 100,33. Mas {menuselection}`Image --> Type --> 8-bit` ainda deu 100 por pixel - porque é limitado a números inteiros. E {menuselection}`Analyze --> Measure` também me deu 100 - o que sugere que ele converte as imagens RGB em 8 bits, não em ponto flutuante, ao fazer suas medições.

source: Finally, I remembered that ImageJ sometimes sneaks in extra options. So I opened {menuselection}`Edit --> Options --> Conversions...` and found a checkbox for {menuselection}`Weighted RGB conversion`. If I selected it, and repeated the steps above I got quite different answers -- because it no longer converts using a straight 'average of the 3 channels'. Rather, each channel is weighted: 0.30 x Red + 0.59 x Green + 0.11 x Blue.
es: Finalmente, me acordé de que ImageJ a veces cuela opciones extra. Así que abrí {menuselection}`Edit --&gt; Options --&gt; Conversions...` y encontré una casilla para {menuselection}`Weighted RGB conversion`. Si la seleccionaba, y repetía los pasos anteriores obtenía respuestas muy diferentes -- porque ya no convierte usando una 'media de los 3 canales'. Más bien, cada canal es ponderado: 0,30 x Rojo + 0,59 x Verde + 0,11 x Azul.
pt_br: Finalmente, lembrei que o ImageJ às vezes traz opções extras. Então abri {menuselection}`Editar --> Opções --> Conversões...` e encontrei uma caixa de seleção para {menuselection}`Ponderada Conversão RGB`. Se eu o selecionasse e repetisse as etapas acima, obtive respostas bem diferentes - porque ele não converte mais usando uma 'média dos 3 canais' direta. Em vez disso, cada canal é ponderado: 0,30 x Vermelho + 0,59 x Verde + 0,11 x Azul.

source: Pondering the weights took me down a googling rabbit hole to see these are (somewhat) standard weight values for grayscale image conversion used across different software. But, more importantly, I saw that the {menuselection}`Weighted RGB conversion` option affected *both* measurement and conversion -- supporting my suspicion that they are connected.
es: Reflexionando sobre los pesos me llevó a un agujero de conejo de Google para ver que estos son (algo) los valores de peso estándar para la conversión de imágenes en escala de grises utilizados a través de diferentes software. Pero, lo que es más importante, vi que la opción `Conversión RGB ponderada` de {menuselection} afectaba *tanto* a la medición como a la conversión, lo que apoya mi sospecha de que están conectadas.
pt_br: Refletir sobre os pesos me levou a pesquisar no Google para ver que esses são valores de peso (de certa forma) padrão para conversão de imagens em escala de cinza usados em diferentes softwares. Mas, o mais importante, vi que a opção {menuselection}`Conversão RGB ponderada` afetou *tanto* a medição quanto a conversão - apoiando minha suspeita de que elas estão conectadas.

source: Confused? Me too.
es: ¿Confuso? Yo también.
pt_br: Confuso? Eu também.

source: **But** my main point is that mortals like me can't predict what software is going to do. Even if we think we know, there's a chance some sneaky option somewhere is changing the behavior.
es: **Pero** mi punto principal es que los mortales como yo no podemos predecir lo que el software va a hacer. Incluso si pensamos que sabemos, hay una posibilidad de que alguna opción furtiva en algún lugar está cambiando el comportamiento.
pt_br: **Mas** meu ponto principal é que mortais como eu não podem prever o que o software fará. Mesmo que pensemos que sabemos, há uma chance de que alguma opção sorrateira em algum lugar esteja mudando o comportamento.

source: What we *can* do is foster a critical mind. We can learn enough about the software to know how to test what it is doing.
es: Lo que *podemos* hacer es fomentar el espíritu crítico. Podemos aprender lo suficiente sobre el software para saber cómo probar lo que hace.
pt_br: O que *podemos* fazer é promover uma mente crítica. Podemos aprender o suficiente sobre o software para saber como testar o que ele está fazendo.

source: And that, at least, is how I learned to use ImageJ and came to write this book.
es: Y así, al menos, es como aprendí a usar ImageJ y llegué a escribir este libro.
pt_br: E foi assim, pelo menos, que aprendi a usar o ImageJ e escrevi este livro.
