Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/4-colors/imagej.po
Languages: es, pt_br

source: ImageJ: Channels & colors
es: ImageJ: Canales y colores
pt_br: ImageJ: Canais e cores

source: Introduction
es: Introducción
pt_br: Introdução

source: ImageJ has good support for both RGB and multichannel images, but the behavior is not always obvious. This section explains the ideas, including common areas of confusion.
es: ImageJ tiene un buen soporte tanto para imágenes RGB como multicanal, pero el comportamiento no siempre es obvio. Esta sección explica las ideas, incluyendo las áreas comunes de confusión.
pt_br: ImageJ tem bom suporte para imagens RGB e multicanal, mas o comportamento nem sempre é óbvio. Esta seção explica as ideias, incluindo áreas comuns de confusão.

source: RGB vs. Multichannel
es: RGB vs. Multicanal
pt_br: RGB vs. Multicanal

source: ImageJ treats RGB as a special image type, even though it is still [8-bit unsigned integer](chap_bit_depths_imagej). There are several ways to recognize that an image has the type 'RGB':
es: ImageJ trata RGB como un tipo de imagen especial, aunque sigue siendo [8-bit unsigned integer](chap_bit_depths_imagej). Hay varias maneras de reconocer que una imagen tiene el tipo 'RGB':
pt_br: ImageJ trata RGB como um tipo de imagem especial, embora ainda seja [inteiro não assinado de 8 bits] (chap_bit_profundidades_imagej). Existem várias maneiras de reconhecer que uma imagem tem o tipo ‘RGB’:

source: The text *RGB* appears at the top of the image window
es: El texto *RGB* aparece en la parte superior de la ventana de la imagen
pt_br: O texto *RGB* aparece na parte superior da janela da imagem

source: {menuselection}`Image --> Type --> RGB Color` is selected
es: {menuselection}Se selecciona `Imagen --&gt; Tipo --&gt; Color RGB
pt_br: {menuselection}`Imagem --> Tipo --> Cor RGB` está selecionado

source: When moving the cursor over the image, there are *three* values shown in the status bar (e.g. *value=127,127,127*) instead of one
es: Al mover el cursor sobre la imagen, se muestran *tres* valores en la barra de estado (por ejemplo, *valor=127,127,127*) en lugar de uno.
pt_br: Ao mover o cursor sobre a imagem, há *três* valores mostrados na barra de status (por exemplo, *valor=127.127.127*) em vez de um

source: Multichannel images that *aren't* RGB are recognizable because they have an extra slider at the bottom, with a small {guilabel}`C` label, which is used to switch the 'active' channel. The {menuselection}`Image --> Type --> ` will be {menuselection}`8-bit`, {menuselection}`16-bit` or {menuselection}`32-bit`.
es: Las imágenes multicanal que *no* son RGB se reconocen porque tienen un deslizador extra en la parte inferior, con una pequeña etiqueta {guilabel}`C`, que se utiliza para cambiar el canal "activo". El {menuselection}`Image --&gt; Type --&gt; ` será {menuselection}`8-bit`, {menuselection}`16-bit` o {menuselection}`32-bit`.
pt_br: Imagens multicanal que *não* são RGB são reconhecíveis porque possuem um controle deslizante extra na parte inferior, com um pequeno rótulo {guilabel}`C`, que é usado para alternar o 'ativo' 'canal. O {menuselection}`Imagem --> Tipo --> ` será {menuselection}`8 bits`, {menuselection}`16 bits` ou {menuselection}`32 bits`.

source: A multichannel image (left) and RGB image (right). The colors used to display the image are identical, but other aspects of the image window indicate that the images themselves are quite different.
es: Una imagen multicanal (izquierda) y una imagen RGB (derecha). Los colores utilizados para mostrar la imagen son idénticos, pero otros aspectos de la ventana de la imagen indican que las imágenes en sí son bastante diferentes.
pt_br: Uma imagem multicanal (esquerda) e uma imagem RGB (direita). As cores usadas para exibir a imagem são idênticas, mas outros aspectos da janela da imagem indicam que as próprias imagens são bastante diferentes.

source: The distinction is really important when it comes to measurements and histograms, because the behavior between RGB and multichannel images is subtly different:
es: La distinción es realmente importante cuando se trata de mediciones e histogramas, porque el comportamiento entre las imágenes RGB y multicanal es sutilmente diferente:
pt_br: A distinção é muito importante quando se trata de medições e histogramas, porque o comportamento entre imagens RGB e multicanal é sutilmente diferente:

source: **Multichannel images:**
es: **Imágenes multicanal:**
pt_br: **Imagens multicanal:**

source: {menuselection}`Analyze --> Measure` uses the active channel only, based on the {guilabel}`C` slider
es: {menuselection}`Analizar --&gt; Medir` utiliza sólo el canal activo, basándose en el deslizador `C` de {guilabel}
pt_br: {menuselection}`Analyze --> Measure` usa apenas o canal ativo, com base no controle deslizante {guilabel}`C`

source: {menuselection}`Analyze --> Histogram` uses either uses the active channel only or all channels, after prompting the user to choose
es: {menuselection}`Analizar --&gt; Histograma` utiliza sólo el canal activo o todos los canales, después de pedir al usuario que elija
pt_br: {menuselection}`Analyze --> Histogram` usa apenas o canal ativo ou todos os canais, após solicitar ao usuário que escolha

source: {menuselection}`Image --> Adjust --> Brightness/Contrast...` can be used to adjust the brightness & contrast for the active channel
es: {menuselection}`Imagen --&gt; Ajustar --&gt; Brillo/Contraste...` se puede utilizar para ajustar el brillo y el contraste del canal activo.
pt_br: {menuselection}`Imagem --> Ajustar --> Brilho/Contraste...` pode ser usado para ajustar o brilho e o contraste do canal ativo

source: It is possible to change LUTs independently for each channel
es: Es posible cambiar las LUT independientemente para cada canal
pt_br: É possível alterar LUTs de forma independente para cada canal

source: **RGB images:**
es: **Imágenes RGB
pt_br: **Imagens RGB:**

source: {menuselection}`Analyze --> Measure` converts the image to have a single 8-bit channel before making measurements
es: {menuselection}`Analyze --&gt; Measure` convierte la imagen para que tenga un único canal de 8 bits antes de realizar las mediciones.
pt_br: {menuselection}`Analyze --> Measure` converte a imagem para ter um único canal de 8 bits antes de fazer medições

source: {menuselection}`Analyze --> Histogram` creates a histogram after converting the image as above, but also provides an {guilabel}`RGB` button to also view separate histograms for the red, green and blue channels
es: {menuselection}`Analyze --&gt; Histogram` crea un histograma después de convertir la imagen como arriba, pero también proporciona un botón {guilabel}`RGB` para ver también histogramas separados para los canales rojo, verde y azul.
pt_br: {menuselection}`Analyze --> Histogram` cria um histograma após converter a imagem como acima, mas também fornece um {guilabel}`RGB` botão para visualizar também histogramas separados para os canais vermelho, verde e azul

source: {menuselection}`Image --> Adjust --> Brightness/Contrast...` can only be used to adjust the brightness & contrast for all channels simultaneously
es: {menuselection}`Imagen --&gt; Ajustar --&gt; Brillo/Contraste...` sólo se puede utilizar para ajustar el brillo y el contraste de todos los canales simultáneamente.
pt_br: {menuselection}`Imagem --> Ajustar --> Brilho/Contraste...` só pode ser usado para ajustar o brilho e o contraste de todos os canais simultaneamente

source: It is *not* possible to change LUTs per channel
es: No es posible cambiar las LUT por canal.
pt_br: *Não* é possível alterar LUTs por canal

source: When it comes to measuring an RGB image, the enigmatic statement above that ImageJ 'converts the image' is explained (in more detail than you might want) [at the end](sec_colors_converts).
es: Cuando se trata de medir una imagen RGB, la enigmática afirmación anterior de que ImageJ "convierte la imagen" se explica (con más detalle del que quizá desee) [al final](sec_colors_converts).
pt_br: Quando se trata de medir uma imagem RGB, a afirmação enigmática acima de que ImageJ 'converte a imagem' é explicada (com mais detalhes do que você gostaria) [no final](sec_colors_converts).

source: Practical
es: Práctico
pt_br: Prático

source: Explore several of the images under {menuselection}`File --> Open Samples -->` and identify which are treated by ImageJ as RGB, which as multichannel, and which have just a single channel. There is only one correct answer per image.
es: Explore varias de las imágenes en {menuselection}`Archivo --&gt; Abrir Muestras --&gt;` e identifique cuáles son tratadas por ImageJ como RGB, cuáles como multicanal y cuáles tienen un solo canal. Sólo hay una respuesta correcta por imagen.
pt_br: Explore diversas imagens em {menuselection}`File --> Open Samples -->` e identifique quais são tratadas pelo ImageJ como RGB, quais como multicanal e quais possuem apenas um único canal. Existe apenas uma resposta correta por imagem.

source: **Note 1:** Here, 'RGB' means that ImageJ treats the image has having the special 'RGB' image type. It's possible for a multichannel image to have three channels with red, green and blue LUTs, but Imagej doesn't consider it to be RGB. You should therefore use the rules given above to distinguish images RGB from multichannel.
es: **Nota 1:** Aquí, 'RGB' significa que ImageJ trata la imagen como si tuviera el tipo de imagen especial 'RGB'. Es posible que una imagen multicanal tenga tres canales con LUTs rojo, verde y azul, pero Imagej no la considera RGB. Por lo tanto, debe utilizar las reglas indicadas anteriormente para distinguir las imágenes RGB de las multicanal.
pt_br: **Nota 1:** Aqui, 'RGB' significa que ImageJ trata a imagem como tendo o tipo de imagem especial 'RGB'. É possível que uma imagem multicanal tenha três canais com LUTs vermelho, verde e azul, mas o Imagej não a considera RGB. Você deve, portanto, usar as regras fornecidas acima para distinguir imagens RGB de multicanal.

source: **Note 2:** At the time I write this, the sample images don't work for me properly in Fiji -- but they do work in ImageJ. Hopefully the Fiji bug will be fixed before you read this.
es: **Nota 2:** En el momento de escribir esto, las imágenes de ejemplo no me funcionan correctamente en Fiji -- pero sí en ImageJ. Esperemos que el error Fiji se fija antes de leer esto.
pt_br: **Nota 2:** No momento em que escrevo isto, as imagens de amostra não funcionam corretamente para mim em Fiji - mas funcionam no ImageJ. Esperamos que o bug de Fiji seja corrigido antes de você ler isto.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io)

source: launch ImageJ.JS
es: iniciar ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
es: Solución
pt_br: Solução

source: There are several awkward images:
es: Hay varias imágenes incómodas:
pt_br: Existem várias imagens estranhas:

source: {menuselection}`HeLa Cells (48-bit RGB)` is *not* treated as having the RGB type... and ImageJ doesn't have a '48-bit' type either! Here, 48-bit RGB means that we actually have three 16-bit channels with red, green and blue LUTs. For ImageJ, that's not really an RGB image, it's a multichannel image. Don't expect too much consistency in naming: always check the types!
es: {menuselection}HeLa Cells (48-bit RGB)` *no* se trata como si tuviera el tipo RGB... ¡y ImageJ tampoco tiene un tipo '48-bit'! Aquí, RGB de 48 bits significa que en realidad tenemos tres canales de 16 bits con LUTs rojo, verde y azul. Para ImageJ, eso no es realmente una imagen RGB, es una imagen multicanal. No esperes demasiada consistencia en la nomenclatura: ¡comprueba siempre los tipos!
pt_br: {menuselection}`HeLa Cells (48-bit RGB)` *não* é tratado como tendo o tipo RGB... e ImageJ também não tem um tipo '48-bit' ! Aqui, RGB de 48 bits significa que na verdade temos três canais de 16 bits com LUTs vermelho, verde e azul. Para ImageJ, isso não é realmente uma imagem RGB, é uma imagem multicanal. Não espere muita consistência na nomenclatura: verifique sempre os tipos!

source: {menuselection}`Fly Brain` has a slider, but it doesn't have a {guilabel}`C` label. This is because the slider isn't for channels, but rather for *z*-slices. We will meet *z*-slices in the [next chapter](chap_dimensions).
es: {menuselection}Fly Brain tiene un deslizador, pero no tiene una etiqueta {guilabel}`C`. Esto se debe a que el deslizador no es para canales, sino para *z*-cortes. Nos encontraremos con *z*-cortes en el [próximo capítulo](chap_dimensiones).
pt_br: {menuselection}`Fly Brain` tem um controle deslizante, mas não tem um rótulo {guilabel}`C`. Isso ocorre porque o controle deslizante não é para canais, mas sim para fatias *z*. Encontraremos *z*-slices no [próximo capítulo](chap_dimensions).

source: {menuselection}`Image with Overlay` looks colorful, but the colors all come from the [overlay](sec_imagej_overlay) -- not from the image being RGB. Admittedly, the name helps here.
es: {menuselection}Imagen con superposición" parece colorida, pero todos los colores provienen de la superposición (sec_imagej_overlay), no de la imagen RGB. Hay que admitir que el nombre ayuda en este caso.
pt_br: {menuselection}`Imagem com sobreposição` parece colorida, mas todas as cores vêm da [sobreposição](sec_imagej_overlay) - não da imagem ser RGB. É certo que o nome ajuda aqui.

source: Working with channels
es: Trabajar con canales
pt_br: Trabalhando com canais

source: There are several useful commands for working with color channels under {menuselection}`Image --> Color --> `. Some of these, such as {menuselection}`Image --> Color --> Split channels` and {menuselection}`Image --> Color --> Merge channels` are quite intuitive, and work for both RGB and multichannel images.
es: Hay varios comandos útiles para trabajar con canales de color en {menuselection}`Image --&gt; Color --&gt; `. Algunos de ellos, como {menuselection}`Image --&gt; Color --&gt; Split channels` y {menuselection}`Image --&gt; Color --&gt; Merge channels` son bastante intuitivos, y funcionan tanto para imágenes RGB como multicanal.
pt_br: Existem vários comandos úteis para trabalhar com canais de cores em {menuselection}`Image --> Color --> `. Alguns deles, como {menuselection}`Imagem --> Cor --> Dividir canais` e {menuselection}`Imagem --> Cor -> Mesclar canais são bastante intuitivos e funcionam tanto para imagens RGB quanto para imagens multicanal.

source: One of the most useful commands that requires some explanation is {menuselection}`Image --> Color --> Channels Tool...` {kbd}`Shift+Z`. If you run the {menuselection}`Channels Tool...` command for an RGB image and try to do anything, ImageJ will ask
es: Uno de los comandos más útiles que requiere alguna explicación es {menuselection}`Image --&gt; Color --&gt; Channels Tool...` {kbd}`Shift+Z`. Si ejecutas el comando {menuselection}`Channels Tool...` para una imagen RGB e intentas hacer algo, ImageJ te preguntará
pt_br: Um dos comandos mais úteis que requer alguma explicação é {menuselection}`Image --> Color --> Channels Tool...` {kbd}</ extensão>`Shift+Z`. Se você executar o comando <span class='notranslate'>{menuselection}`Ferramenta de canais...` para uma imagem RGB e tentar fazer qualquer coisa, o ImageJ perguntará

source: Agreeing to the prompt will convert the RGB image to a multichannel image.
es: Si acepta, la imagen RGB se convertirá en una imagen multicanal.
pt_br: Concordar com o prompt converterá a imagem RGB em uma imagem multicanal.

source: The question might be a little bit confusing because 'composite' and 'multichannel' do not quite mean the same thing, although they are sometimes used interchangeably with ImageJ. To be more precise, a 'composite image' in this context is a multichannel image that is displayed using a particular **display mode**.
es: La pregunta puede ser un poco confusa porque "compuesta" y "multicanal" no significan exactamente lo mismo, aunque a veces se utilicen indistintamente en ImageJ. Para ser más precisos, una "imagen compuesta" en este contexto es una imagen multicanal que se muestra utilizando un **modo de visualización** concreto.
pt_br: A questão pode ser um pouco confusa porque 'composto' e 'multicanal' não significam exatamente a mesma coisa, embora às vezes sejam usados de forma intercambiável com ImageJ. Para ser mais preciso, uma 'imagem composta' neste contexto é uma imagem multicanal que é exibida usando um **modo de exibição** específico.

source: ImageJ has three main modes for displaying multichannel images, accessible from the drop-down menu of the *Channels Tool* dialog:
es: ImageJ tiene tres modos principales para mostrar imágenes multicanal, accesibles desde el menú desplegable del diálogo *Herramienta Canales*:
pt_br: ImageJ tem três modos principais para exibir imagens multicanal, acessíveis no menu suspenso da caixa de diálogo *Ferramenta Canais*:

source: {guilabel}`Composite` -- Merge some or all the channels together for display. Currently, this works with up to 7 or 8 channels (depending on software version; an extra one was added recently). Individual channels can be turned on and off.
es: {guilabel}`Composite` -- Fusiona algunos o todos los canales para mostrarlos juntos. Actualmente, funciona con hasta 7 u 8 canales (dependiendo de la versión del software; recientemente se ha añadido uno más). Los canales individuales pueden activarse y desactivarse.
pt_br: {guilabel}`Composite` -- Mescla alguns ou todos os canais para exibição. Atualmente funciona com até 7 ou 8 canais (dependendo da versão do software; um extra foi adicionado recentemente). Canais individuais podem ser ativados e desativados.

source: {guilabel}`Color` -- View the 'active' channel only, using its original color LUT. You can switch the channel with the slider below the image.
es: {guilabel}`Color` -- Visualiza sólo el canal "activo", utilizando su LUT de color original. Puede cambiar de canal con el control deslizante situado debajo de la imagen.
pt_br: {guilabel}`Color` -- Visualiza apenas o canal 'ativo', usando sua LUT de cor original. Você pode mudar de canal com o controle deslizante abaixo da imagem.

source: {guilabel}`Grayscale` -- Similar to {guilabel}`Color`, except always using a grayscale LUT.
es: {guilabel}`Grayscale` -- Similar a {guilabel}`Color`, excepto que siempre utiliza una LUT de escala de grises.
pt_br: {guilabel}`Grayscale` -- Semelhante a {guilabel}`Color`, exceto sempre usando uma LUT em escala de cinza.

source: Whenever a channel is active, the LUT can be changed using options in the *Channels Tool* dialog -- or the {menuselection}`Image --> Lookup Tables --> ` submenu as usual. Similarly, {menuselection}`Image --> Adjust --> Brightness/Contrast...` works on the active channel to update the LUT.
es: Siempre que un canal esté activo, la LUT puede cambiarse usando las opciones del diálogo *Channels Tool* -- o el submenú {menuselection}`Image --&gt; Lookup Tables --&gt; ` como de costumbre. De forma similar, {menuselection}`Image --&gt; Adjust --&gt; Brightness/Contrast...` funciona en el canal activo para actualizar la LUT.
pt_br: Sempre que um canal está ativo, a LUT pode ser alterada usando opções na caixa de diálogo *Ferramenta de Canais* -- ou no {menuselection}`Image --> Lookup Tables --> ` submenu como habitual. Da mesma forma, {menuselection}`Image --> Adjust --> Brightness/Contrast...` funciona no canal ativo para atualizar o LUT.

source: ImageJ multichannel image sample *Fluorescent Cells*. Using the {menuselection}`Image --> Color --> Channels Tool...` and the slider at the bottom of the window, you can view the channels individually or simultaneously.
es: Muestra de imagen multicanal de ImageJ *Células fluorescentes*. Usando {menuselection}`Image --&gt; Color --&gt; Channels Tool...` y el deslizador en la parte inferior de la ventana, puede ver los canales individual o simultáneamente.
pt_br: Amostra de imagem multicanal ImageJ *Células Fluorescentes*. Usando a {menuselection}`Image --> Color --> Channels Tool...` e o controle deslizante na parte inferior da janela, você pode visualizar os canais individualmente ou simultaneamente.

source: The way in which {guilabel}`Composite` mode works is that an RGB image is effectively created for each channel based on its LUT, and the red, green and blue values are *added* together to get the final output color (clipping at 255 if needed).
es: El modo de funcionamiento de {guilabel}`Composite` consiste en crear una imagen RGB para cada canal basándose en su LUT, y *sumar* los valores de rojo, verde y azul para obtener el color de salida final (recortando a 255 si es necesario).
pt_br: A maneira como o modo {guilabel}`Composite` funciona é que uma imagem RGB é efetivamente criada para cada canal com base em sua LUT, e os valores de vermelho, verde e azul são *adicionados* juntos para obter a cor de saída final (recorte em 255, se necessário).

source: This isn't the only way to generate a composite image, and it doesn't work well for all LUTs -- particular LUTs that map low pixel values to bright colors or white.
es: Esta no es la única forma de generar una imagen compuesta, y no funciona bien con todas las LUTs -- en particular las LUTs que asignan valores bajos de píxeles a colores brillantes o blanco.
pt_br: Esta não é a única maneira de gerar uma imagem composta e não funciona bem para todos os LUTs - LUTs específicos que mapeiam valores baixos de pixel para cores brilhantes ou branco.

source: Therefore, since ImageJ 1.53o some additional composite modes were added to the {menuselection}`Channels Tool...`, and refined over the next few releases after a long (and occasionally testy) discussion on image.sc. At the time of writing, the available modes are:
es: Por lo tanto, desde ImageJ 1.53o se añadieron algunos modos de composición adicionales a {menuselection}`Channels Tool...`, y se perfeccionaron en las siguientes versiones después de una larga (y ocasionalmente irritable) discusión en image.sc. En el momento de escribir estas líneas, los modos disponibles son:
pt_br: Portanto, desde o ImageJ 1.53o, alguns modos de composição adicionais foram adicionados à {menuselection}`Ferramenta de Canais...`, e refinados nos próximos lançamentos após um longo (e ocasionalmente irritante) discussão em image.sc. No momento em que este artigo foi escrito, os modos disponíveis são:

source: {guilabel}`Composite Max` -- Similar to {guilabel}`Composite`, except use the *maximum* of the red, green and blue values across all channels (not the sum)
es: {guilabel}`Composite Max` -- Similar a {guilabel}`Composite`, excepto que utiliza el *máximo* de los valores rojo, verde y azul de todos los canales (no la suma).
pt_br: {guilabel}`Composite Max` -- Semelhante a {guilabel}`Composite`, exceto que use o *máximo* de vermelho, verde e valores azuis em todos os canais (não a soma)

source: {guilabel}`Composite Min` -- Similar to {guilabel}`Composite Max`, except use the *minimum* of the red, green and blue values across all channels (not the maximum)
es: {guilabel}`Composite Min` -- Similar a {guilabel}`Composite Max`, excepto que utiliza el *mínimo* de los valores rojo, verde y azul de todos los canales (no el máximo).
pt_br: {guilabel}`Composite Min` -- Semelhante a {guilabel}`Composite Max`, exceto que use o *mínimo* de vermelho, verde e valores azuis em todos os canais (não o máximo)
