Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/4-colors/python.po
Languages: de

source: Python: Channels & colors
de: Python: Kanäle und Farben

source: This section gives a brief overview of some color-related considerations when using Python.
de: Dieser Abschnitt gibt einen kurzen Überblick über einige farbbezogene Überlegungen bei der Verwendung von Python.

source: See the [scikit-image color module](https://scikit-image.org/docs/dev/api/skimage.color.html) for a lot more useful info.
de: Weitere nützliche Informationen finden Sie im [scikit-image-Farbmodul](https://scikit-image.org/docs/dev/api/skimage.color.html).

source: RGB images
de: RGB-Bilder

source: Let's begin by reading the RGB image used on the title page of this book.
de: Beginnen wir mit der Lektüre des RGB-Bildes, das auf der Titelseite dieses Buches verwendet wird.

source: If we check the shape of the image, we can see that the RGB information seems to be joined on at the end: the shape is in the form `[rows, columns, channels]`.
de: Wenn wir die Form des Bildes überprüfen, können wir sehen, dass die RGB-Informationen am Ende zusammengefügt zu sein scheinen: Die Form hat die Form „[Zeilen, Spalten, Kanäle]“.

source: RGB to single-channel
de: RGB zu Einkanal

source: We can convert an RGB image to a single-channel image in lots of ways.
de: Wir können ein RGB-Bild auf viele Arten in ein Einkanalbild konvertieren.

source: A single-channel image is often referred to as **grayscale** - although whether it is actually displayed using shades of gray or not depends upon the colormap.
de: Ein Einkanalbild wird oft als **Graustufen** bezeichnet – obwohl es von der Farbkarte abhängt, ob es tatsächlich in Graustufen angezeigt wird oder nicht.

source: Split channels
de: Geteilte Kanäle

source: One option is to split the RGB channels to give three separate single-channel images.
de: Eine Möglichkeit besteht darin, die RGB-Kanäle aufzuteilen, um drei separate Einkanalbilder zu erhalten.

source: Averaging channels
de: Mittelungskanäle

source: A second easy option is to simply calculate the average (mean) of the RGB values.
de: Eine zweite einfache Möglichkeit besteht darin, einfach den Durchschnitt (Mittelwert) der RGB-Werte zu berechnen.

source: However, it is common to calculate a *weighted* mean of the RGB values. Commonly the weights are
de: Es ist jedoch üblich, einen *gewichteten* Mittelwert der RGB-Werte zu berechnen. Im Allgemeinen sind es die Gewichte

source: This is what scikit-image's [`rgb2gray`](https://scikit-image.org/docs/stable/api/skimage.color.html#skimage.color.rgb2gray) does, as described [here](https://scikit-image.org/docs/stable/auto_examples/color_exposure/plot_rgb_to_gray.html).
de: Dies ist, was [`rgb2gray`](https://scikit-image.org/docs/stable/api/skimage.color.html#skimage.color.rgb2gray) von scikit-image tut, wie [hier](https: //scikit-image.org/docs/stable/auto_examples/color_exposure/plot_rgb_to_gray.html).

source: To be fair, the simple mean and the weighted mean images don't look very different to me.
de: Um fair zu sein, sehen die Bilder mit dem einfachen Mittelwert und dem gewichteten Mittelwert für mich nicht sehr unterschiedlich aus.

source: To check if they really *are* different, we can show one subtracted from the other.
de: Um zu überprüfen, ob sie wirklich unterschiedlich sind, können wir das eine vom anderen subtrahieren.

source: Hmmmmm, this looks very suspicious. The fact the *difference* image looks the same suggests to me that some rescaling might have happened.
de: Hmmmmm, das sieht sehr verdächtig aus. Die Tatsache, dass das *Unterschiedsbild* gleich aussieht, deutet für mich darauf hin, dass möglicherweise eine Neuskalierung stattgefunden hat.

source: So let's go back to checking the `dtype` comparing statistics.
de: Kehren wir also zur Überprüfung der „dtype“-Vergleichsstatistiken zurück.

source: Right, that seems to suggest that `rgb2gray` has also rescaled our image during conversion.
de: Richtig, das scheint darauf hinzudeuten, dass „rgb2gray“ unser Bild während der Konvertierung ebenfalls neu skaliert hat.

source: Indeed, it's reasonably common to work with 8-bit RGB images in Python (`uint8`) with values in the range 0-255, but it's perhaps even more common to work with floating point RGB images in the range 0-1 (either `float32` or `float64`). So we do need to be on the lookout for sneaky conversions.
de: Tatsächlich ist es einigermaßen üblich, in Python mit 8-Bit-RGB-Bildern (`uint8`) mit Werten im Bereich von 0-255 zu arbeiten, aber vielleicht ist es noch üblicher, mit Fließkomma-RGB-Bildern im Bereich von 0-1 (entweder) zu arbeiten „float32“ oder „float64“). Wir müssen also nach hinterlistigen Konvertierungen Ausschau halten.

source: With that in mind, we can make our images comparable my dividing our `im_mean` by 255.
de: Vor diesem Hintergrund können wir unsere Bilder vergleichbar machen, indem wir unseren „im_mean“ durch 255 teilen.

source: This demonstrates that the pixel values are at least a bit different when converted using the weighted mean.
de: Dies zeigt, dass sich die Pixelwerte bei der Umrechnung mit dem gewichteten Mittel zumindest geringfügig unterscheiden.

source: Multichannel images
de: Mehrkanalbilder

source: Working with multichannel (non-RGB) images in Python is extremely easy in some ways, and very awkward in others.
de: Die Arbeit mit Mehrkanalbildern (nicht RGB) in Python ist in mancher Hinsicht extrem einfach, in anderer Hinsicht sehr umständlich.

source: Although because most of the awkward stuff comes at the start, that will dominate the rest of this section.
de: Obwohl die meisten unangenehmen Dinge am Anfang stehen, werden sie den Rest dieses Abschnitts dominieren.

source: For example, even just opening the data properly can be a challenge.
de: Beispielsweise kann es schon eine Herausforderung sein, die Daten ordnungsgemäß zu öffnen.

source: Reading multichannel images
de: Lesen von Mehrkanalbildern

source: I like using [imageio](https://imageio.readthedocs.io/en/v2.9.0/userapi.html) to read images for its simplicity. However, if we rely upon `imageio.imread` for a multichannel tiff, we tend to just get the first channel.
de: Ich verwende [imageio](https://imageio.readthedocs.io/en/v2.9.0/userapi.html) wegen seiner Einfachheit gerne zum Lesen von Bildern. Wenn wir uns jedoch für ein Mehrkanal-TIFF auf „imageio.imread“ verlassen, erhalten wir in der Regel nur den ersten Kanal.

source: Later chapters will show other ways to open images.
de: In späteren Kapiteln werden andere Möglichkeiten zum Öffnen von Bildern gezeigt.

source: We can do better if we switch to `imageio.volread` to treat the image as a volume instead.
de: Wir können es besser machen, wenn wir zu „imageio.volread“ wechseln, um das Bild stattdessen als Volume zu behandeln.

source: The trouble now is that the channels appear at the *start* of our shape, whereas for the RGB image the channels were at the end.
de: Das Problem besteht nun darin, dass die Kanäle am *Anfang* unserer Form erscheinen, während sie sich beim RGB-Bild am Ende befanden.

source: That may or may not matter - *because Python doesn't have a completely fixed convention for where the channels should be*.
de: Das kann wichtig sein oder auch nicht – *weil Python keine völlig feste Konvention dafür hat, wo die Kanäle sein sollten*.

source: Some libraries assume 'channels-first', and some assume 'channels-last'.
de: Einige Bibliotheken gehen von „Kanäle zuerst“ und andere von „Kanäle zuletzt“ aus.

source: The good news is that, if you know what's required, you can easily move the channels to the right place.
de: Die gute Nachricht ist: Wenn Sie wissen, was erforderlich ist, können Sie die Kanäle problemlos an die richtige Stelle verschieben.

source: Displaying multichannel images
de: Mehrkanalbilder anzeigen

source: Unfortunately, you can't easily show any arbitrary multichannel image using either channels-first or channels-last.
de: Leider können Sie nicht einfach ein beliebiges Mehrkanalbild anzeigen, indem Sie „Kanäle zuerst“ oder „Kanäle zuletzt“ verwenden.

source: Let's focus on channels-last, since it's more similar to how the RGB images behaved.
de: Konzentrieren wir uns auf die letzten Kanäle, da sie dem Verhalten der RGB-Bilder ähnlicher sind.

source: We can show the channels one by one, as in the RGB case, or average the channels if we like - although the mean we get probably won't be a very meaningful mean.
de: Wir können die Kanäle einzeln anzeigen, wie im RGB-Fall, oder die Kanäle mitteln, wenn wir möchten – obwohl der Mittelwert, den wir erhalten, wahrscheinlich kein sehr aussagekräftiger Mittelwert sein wird.

source: Adding color
de: Farbe hinzufügen

source: Unfortunately, we don't currently have any of the color information that could be used to display each channel. We can just choose a colormap, like with any other single-channel image, but we can't easily visualize channels merged together (at least with matplotlib... as far as I know).
de: Leider liegen uns derzeit keine Farbinformationen vor, die zur Darstellung der einzelnen Kanäle verwendet werden könnten. Wir können einfach eine Farbkarte auswählen, wie bei jedem anderen Einzelkanalbild, aber wir können die zusammengeführten Kanäle nicht einfach visualisieren (zumindest mit Matplotlib ... soweit ich weiß).

source: But one this we *can* do is convert each of our channels to RGB, using a fixed color. Here is a helper function to do that.
de: Was wir jedoch tun können, ist, jeden unserer Kanäle mit einer festen Farbe in RGB umzuwandeln. Hier ist eine Hilfsfunktion, um das zu tun.

source: Creating composites
de: Verbundwerkstoffe erstellen

source: Having done that, we can simply add our RGB images together to create a composite image - remembering to clip the result, so that we keep inside the range 0-1.
de: Nachdem wir das getan haben, können wir einfach unsere RGB-Bilder zusammenfügen, um ein zusammengesetztes Bild zu erstellen – wobei wir daran denken, das Ergebnis zu beschneiden, damit wir innerhalb des Bereichs 0-1 bleiben.

source: **Important!** We've moved away from colormaps here to change pixel values when creating RGB images. This gives us more control, but we need to remember that none of these modified images are suitable for quantitative analysis.
de: **Wichtig!** Wir haben uns hier von Farbkarten entfernt, um Pixelwerte beim Erstellen von RGB-Bildern zu ändern. Dies gibt uns mehr Kontrolle, wir müssen jedoch bedenken, dass keines dieser modifizierten Bilder für eine quantitative Analyse geeignet ist.
