Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/bit_depths.po
Languages: es

source: Default Caption
es: Leyenda predeterminada

source: Types & bit-depths
es: Tipos y profundidad de bits

source: Chapter outline
es: Outline del capítulo

source: The **bit-depth** & **type** of an image determine what pixel values it can contain
es: La **profundidad de bits** y el **tipo** de una imagen determinan los valores de píxel que puede contener

source: An image with a **higher bit-depth** can (potentially) contain **more information**
es: Una imagen con **mayor profundidad de bits** puede contener (potencialmente) **más información**.

source: During acquisition, most images have the type **unsigned integer**
es: Durante la adquisición, la mayoría de las imágenes tienen el tipo **entero sin signo**.

source: During processing, it's often better to use **floating point** types
es: Durante el procesamiento, a menudo es mejor utilizar tipos de **punto flotante**.

source: Attempting to store values outside the range permitted by the type & bit-depth leads to **clipping** -- which is usually **very bad indeed**
es: Si se intenta almacenar valores fuera del rango permitido por el tipo y la profundidad de bits, se produce un **recorte**, que suele ser **muy malo**.

source: Introduction
es: Introducción

source: As described in {ref}`chap_pixels`, each pixel has a numerical value – but a pixel cannot typically have just *any* numerical value it likes. Instead, it works under the constraints of the image **type** and **bit-depth**.
es: Como se describe en {ref}`chap_pixels`, cada píxel tiene un valor numérico, pero un píxel no puede tener *cualquier* valor numérico. En su lugar, trabaja bajo las restricciones del **tipo** y **profundidad de bits** de la imagen.

source: Ultimately the pixels are stored in some binary format: a sequence of **bits** (**bi**nary digi**ts**), i.e. ones and zeros. The bit-depth determines how many of these ones and zeros are available to store each pixel. The type determines how these bits are interpreted.
es: En última instancia, los píxeles se almacenan en algún formato binario: una secuencia de **bits** (**bi**nary digi**ts**), es decir, unos y ceros. La profundidad de bits determina cuántos de estos unos y ceros están disponibles para almacenar cada píxel. El tipo determina cómo se interpretan estos bits.

source: Representing numbers with bits
es: Representar números con bits

source: Bob devising his code.
es: Bob ideando su código.

source: Suppose Bob is developing a secret code to store numbers, but in which he is only allowed to write ones and zeros. If he is only allowed a single one or zero (i.e. a single bit), he doesn't have many options.
es: Supongamos que Bob está desarrollando un código secreto para almacenar números, pero en el que sólo se le permite escribir unos y ceros. Si sólo se le permite escribir un único uno o cero (es decir, un único bit), no tiene muchas opciones.

source: Assuming he wants his encoded numbers to be consecutive integers starting from zero, this means he can only represent two different numbers: one and zero.
es: Suponiendo que quiere que sus números codificados sean enteros consecutivos empezando por cero, esto significa que sólo puede representar dos números diferentes: uno y cero.

source: If he is allowed an extra bit, suddenly he can represent 4 numbers by combining the ones and zeros differently.
es: Si se le permite un bit extra, de repente puede representar 4 números combinando los unos y los ceros de forma diferente.

source: Clearly, the more bits Bob is allowed, the more unique combinations he can have -- and therefore the more different numbers he can represent in his code.
es: Evidentemente, cuantos más bits se le permitan a Bob, más combinaciones únicas podrá tener y, por tanto, más números diferentes podrá representar en su código.

source: With 8 bits are his disposal, Bob can combine the bits in 256 different ways to represent 256 different numbers.
es: Con 8 bits a su disposición, Bob puede combinar los bits de 256 formas distintas para representar 256 números diferentes.

source: The pixel values in an image are stored using a code just like this. Each possible value is represented in binary as a unique combination of bits.
es: Los valores de los píxeles de una imagen se almacenan mediante un código como éste. Cada valor posible se representa en binario como una combinación única de bits.

source: Image bit-depth
es: Profundidad de bits de la imagen

source: The **bit-depth** of an image is the number of bits used to represent each pixel. A bit-depth of 8 would indicate that 8 bits are used to represent a single pixel value.
es: La **profundidad de bits** de una imagen es el número de bits utilizados para representar cada píxel. Una profundidad de bits de 8 indica que se utilizan 8 bits para representar el valor de un píxel.

source: The bit-depth imposes a limit upon the pixel values that are possible. A lower bit-depth implies that fewer different pixel values are available, which can result in an image that contains less information.
es: La profundidad de bits impone un límite a los valores de píxel posibles. Una menor profundidad de bits implica que hay menos valores de píxel disponibles, lo que puede dar como resultado una imagen que contenga menos información.

source: Representing an image using different bit-depths.
es: Representación de una imagen utilizando diferentes profundidades de bits.

source: As shown in {numref}`fig-bit_depths_demo`, a 1-bit image can contain only two values: here, shown as black or white pixels. Such **binary images** are extremely limited in the information that they can contain, although will turn out to be [very useful later](chap_thresholding) when processing images.
es: Como se muestra en {numref}`fig-bit_depths_demo`, una imagen de 1 bit sólo puede contener dos valores: aquí, mostrados como píxeles blancos o negros. Tales **imágenes binarias** son extremadamente limitadas en la información que pueden contener, aunque resultarán [muy útiles más adelante](chap_thresholding) al procesar imágenes.

source: A 2-bit image is not much better, containing at most only 4 different values. A 4-bit image can have 16 values. When visualized with a grayscale LUT, this is a substantial improvement. In fact, the eye is not particularly good at distinguishing different shades of gray -- making it difficult to see much difference between a 4-bit and 8-bit image. However, the histograms reveal that the 8-bit image contains more fine-grained information.
es: Una imagen de 2 bits no es mucho mejor, ya que sólo contiene, como máximo, 4 valores diferentes. Una imagen de 4 bits puede tener 16 valores. Cuando se visualiza con una LUT de escala de grises, es una mejora sustancial. De hecho, el ojo no es particularmente bueno distinguiendo diferentes tonos de gris, por lo que es difícil ver mucha diferencia entre una imagen de 4 bits y una de 8 bits. Sin embargo, los histogramas revelan que la imagen de 8 bits contiene información más detallada.

source: In practice, computers tend to work with groups of 8 bits, with each group of 8 bits known as a **byte**. Microscopes that acquire 8-bit images are still reasonably common, and these permit 2<sup>8</sup> = 256 different pixel values, which fall in the range 0–255. The next step up is a 16-bit image, which can contain 2<sup>16</sup> = 65536 values: a dramatic improvement (0–65535).
es: En la práctica, los ordenadores suelen trabajar con grupos de 8 bits, y cada grupo de 8 bits se conoce como **byte**. Los microscopios que adquieren imágenes de 8 bits siguen siendo razonablemente comunes, y éstos permiten 2<sup>8</sup> = 256 valores de píxel diferentes, que caen en el rango 0-255. El siguiente paso es una imagen de 16 bits, que puede contener 2<sup>16</sup> = 65536 valores: una mejora espectacular (0-65535).

source: Question
es: Pregunta

source: What impact would you expect bit-depth to have on the file size of a saved image?
es: ¿Qué impacto esperas que tenga la profundidad de bits en el tamaño del archivo de una imagen guardada?

source: For example, would you expect an 8-bit image to have a larger, smaller or (roughly) equivalent file size to a 16-bit image of the same scene? You can assume the two images have the same number of pixels.
es: Por ejemplo, ¿esperarías que una imagen de 8 bits tuviera un tamaño de archivo mayor, menor o (aproximadamente) equivalente al de una imagen de 16 bits de la misma escena? Puedes suponer que las dos imágenes tienen el mismo número de píxeles.

source: Answer
es: Respuesta

source: In general, the file size required to store an image is expected to be higher with a higher bit-depth.
es: En general, se espera que el tamaño del archivo necesario para almacenar una imagen sea mayor con una mayor profundidad de bits.

source: Assuming that the image isn't [compressed](sec_files_compression), a 16-bit image would require roughly twice as much storage space as a corresponding 8-bit image.
es: Suponiendo que la imagen no esté [comprimida](sec_files_compression), una imagen de 16 bits necesitaría aproximadamente el doble de espacio de almacenamiento que una imagen correspondiente de 8 bits.

source: If you have a 1024 x 1024 pixel image that is 8-bit, that should take roughly 1 MB to store. The corresponding 16-bit image would require approximately 2 MB.
es: Si tienes una imagen de 1024 x 1024 píxeles y 8 bits, necesitarás aproximadamente 1 MB para almacenarla. La imagen de 16 bits correspondiente necesitaría aproximadamente 2 MB.

source: Image type
es: Tipo de imagen

source: At this point, you might be wondering: what about fractions? Or negative numbers?
es: Llegados a este punto, puede que te preguntes: ¿y las fracciones? ¿O los números negativos?

source: In reality, the bit-depth is only part of the story. The **type** of the image is what determines how the bits are interpreted.
es: En realidad, la profundidad de bits es sólo una parte de la historia. El **tipo** de la imagen es lo que determina cómo se interpretan los bits.

source: Until now, we have assumed that 8 bits would be used to represent whole numbers in the range 0 -- 255, because we have 2<sup>8</sup> = 256 different combinations of 8 bits. This is an **unsigned integer** representation.
es: Hasta ahora, hemos supuesto que se utilizarían 8 bits para representar números enteros en el rango 0 -- 255, porque tenemos 2<sup>8</sup> = 256 combinaciones diferentes de 8 bits. Esta es una representación de **entero sin signo**.

source: But suppose we dedicate one of our bits to represent whether the number should be interpreted as positive or negative, with the remaining seven bits providing the magnitude of the number. An image using this approach has the type **signed integer**. Typically, an 8-bit signed integer can be in the range -128 -- 127. Including 0, that still leaves 256 distinct possibilities.
es: Pero supongamos que dedicamos uno de nuestros bits a representar si el número debe interpretarse como positivo o negativo, y que los siete bits restantes proporcionan la magnitud del número. Una imagen que utilice este enfoque tiene el tipo **entero con signo**. Típicamente, un entero con signo de 8 bits puede estar en el rango -128 -- 127. Incluyendo el 0, aún quedan 256 posibilidades distintas.

source: Although the images we acquire are normally composed of unsigned integers, we will later explore the immense benefits of processing operations such as averaging or subtracting pixel values, in which case the resulting pixels may be negative or contain fractional parts. **Floating point** type images make it possible to store these new, not-necessarily-integer values in an efficient way. That can be important, because we could lose a lot of information if we always had to round pixel values to integers.
es: Aunque las imágenes que adquirimos se componen normalmente de enteros sin signo, más adelante exploraremos las inmensas ventajas de procesar operaciones como promediar o restar valores de píxeles, en cuyo caso los píxeles resultantes pueden ser negativos o contener partes fraccionarias. Las imágenes de tipo **punto flotante** permiten almacenar estos nuevos valores, no necesariamente enteros, de forma eficiente. Eso puede ser importante, porque podríamos perder mucha información si tuviéramos que redondear siempre los valores de los píxeles a enteros.

source: Floating point images also allow us to store three special values: $+\infty$, $-\infty$ and `NaN`. The last of these stands for *Not a Number*, and can represent a missing or impossible value, e.g. the result of 0/0.
es: Las imágenes de punto flotante también nos permiten almacenar tres valores especiales: $+\infty$, $-\infty$ y `NaN`. El último de ellos significa *Not a Number*, y puede representar un valor omitido o imposible, por ejemplo, el resultado de 0/0.

source: Key message
es: Mensaje clave

source: The bit-depth and type of an image determine what pixel values are possible.
es: La profundidad de bits y el tipo de imagen determinan los valores de píxel posibles.

source: How & why points can float
es: Cómo y por qué pueden flotar los puntos

source: Floating point pixel values have variable precision depending upon whether they are representing very small or very large numbers.
es: Los valores de píxeles en punto flotante tienen una precisión variable en función de si representan números muy pequeños o muy grandes.

source: Representing a number in binary using floating point is analogous to writing it out in standard form, i.e. something like 3.14×10<sup>8</sup>, which may be written as 3.14e8. In this case, we have managed to represent 314000000 using only 4 digits: 314 and 8 (the 10 is already baked in to the representation).
es: Representar un número en binario utilizando punto flotante es análogo a escribirlo en forma estándar, es decir, algo así como 3,14×10<sup>8</sup>, que puede escribirse como 3,14e8. En este caso, hemos conseguido representar 314000000 utilizando sólo 4 dígitos: 314 y 8 (el 10 ya está incorporado en la representación).

source: In the binary case, the form is more properly something like ± 2<sup>**M**</sup>×N: we have one bit devoted to the sign, a fixed number of additional bits for the exponent *M*, and the rest to the main number *N* (called the fraction).
es: En el caso binario, la forma es más propiamente algo como ± 2<sup>**M**</sup>×N: tenemos un bit dedicado al signo, un número fijo de bits adicionales para el exponente *M*, y el resto al número principal *N* (llamado fracción).

source: A 32-bit floating point number typically uses 1 bit for the sign, 8 bits for the exponent and 23 bits for the fraction, allowing us to store a very wide range of positive and negative numbers. A 64-bit floating point number uses 1 bit for the sign, 11 bits for the exponent and 52 for the fraction, thereby allowing both an even wider range and greater precision. But again these require more storage space than 8- and 16-bit images.
es: Un número en punto flotante de 32 bits utiliza normalmente 1 bit para el signo, 8 bits para el exponente y 23 bits para la fracción, lo que nos permite almacenar una gama muy amplia de números positivos y negativos. Un número en punto flotante de 64 bits utiliza 1 bit para el signo, 11 bits para el exponente y 52 para la fracción, lo que permite un rango aún más amplio y una mayor precisión. Pero, de nuevo, éstos requieren más espacio de almacenamiento que los de 8 y 16 bits.

source: Common image types & bit-depths
es: Tipos de imagen y profundidad de bits más comunes

source: Lots of permutations of bit-depth and type are possible, but in practice three are most common for images:
es: Son posibles muchas permutaciones de profundidad de bits y tipo de bits, pero en la práctica las más habituales para las imágenes son tres:

source: 8-bit unsigned integer
es: Entero sin signo de 8 bits

source: 16-bit unsigned integer
es: Entero sin signo de 16 bits

source: 32-bit floating point
es: punto flotante de 32 bits

source: The representations above are sufficiently ubiquitous that the type is often assumed. Unless otherwise specified, any 8-bit or 16-bit image is most likely to use unsigned integers, while a 32-bit image is probably using floating point pixels.
es: Las representaciones anteriores son lo suficientemente ubicuas como para que a menudo se asuma el tipo. A menos que se especifique lo contrario, es más probable que cualquier imagen de 8 o 16 bits utilice números enteros sin signo, mientras que una imagen de 32 bits probablemente utilice píxeles de punto flotante.

source: Conceivably you *can* have a 32-bit signed/unsigned integer image, or even a 16-bit floating point image, but these are less common in the wild.
es: Es posible que *puedas* tener una imagen entera de 32 bits con/sin signo, o incluso una imagen de punto flotante de 16 bits, pero son menos comunes en la naturaleza.

source: The pixels shown on the right all belong to different images.
es: Los píxeles que se muestran a la derecha pertenecen todos a imágenes diferentes.

source: In each case, identify what *possible* type an image could have in order to represent the value of the pixel. There can be more than one possible type for each pixel.
es: En cada caso, identifica qué tipo *posible* podría tener una imagen para representar el valor del píxel. Puede haber más de un tipo posible para cada píxel.

source: Your type options are:
es: Sus opciones de tipo son:

source: Signed integer
es: Entero con signo

source: Unsigned integer
es: Entero sin signo

source: Floating point
es: Punto flotante

source: The possible image types, from left to right:
es: Los posibles tipos de imágenes, de izquierda a derecha:

source: Signed integer or floating point
es: Entero con signo o punto flotante

source: Unsigned integer, signed integer or floating point
es: Entero sin signo, entero con signo o punto flotante

source: Note that 'floating point' is an option in all cases: it's the most flexible representation.
es: Ten en cuenta que el 'punto flotante' es una opción en todos los casos: es la representación más flexible.

source: What is the maximum pixel value that can be stored in a *16-bit, unsigned integer* image?
es: ¿Cuál es el valor máximo de píxeles que se puede almacenar en una imagen de *16 bits, entero sin signo*?

source: The maximum value that can be stored in a 16-bit, unsigned integer image is 2<sup>16</sup>-1 = 65535.
es: El valor máximo que se puede almacenar en una imagen entera sin signo de 16 bits es 2<sup>16</sup>-1 = 65535.

source: What would be the maximum pixel value that can be stored in a *16-bit, signed integer* image?
es: ¿Cuál sería el valor máximo de píxeles que se puede almacenar en una imagen de *16 bits, entero con signo*?

source: The maximum value that can be stored in a 16-bit, signed integer image is 2<sup>15</sup>-1 = 32767 (since one of the bits is used for the sign, we have 15 remaining).
es: El valor máximo que se puede almacenar en una imagen entera con signo de 16 bits es 2<sup>15</sup>-1 = 32767 ( como uno de los bits se usa para el signo, nos quedan 15).

source: An image as a matrix of numbers, or just ones and zeros?
es: ¿Una imagen como matriz de números, o solo unos y ceros?

source: You may recall how {numref}`fig-image_array` showed an image as being a matrix of numbers. That is already a slightly high level abstraction of how the image is actually represented. It's more accurate to see the image (or, indeed, any digital data) as simply being a long stream of ones and zeros, such as
es: Quizás recuerdes cómo {numref}`fig-image_array` mostraba una imagen como una matriz de números. Esto ya es un nivel ligeramente alto de abstracción de cómo se representa realmente la imagen. Es más exacto ver la imagen (o, de hecho, cualquier dato digital) como si fuera simplemente un largo flujo de unos y ceros, como

source: More information is needed about how the pixel values of the image are encoded to interpret these ones and zeros. This includes how should the ones and zeros be split up to represent different values (e.g. in chunks of 8, 16, or some other number?).
es: Se necesita más información sobre cómo se codifican los valores de píxeles de la imagen para interpretar estos unos y ceros. Esto incluye cómo se deben dividir los unos y los ceros para representar diferentes valores (por ejemplo, en trozos de 8, 16 o algún otro número).

source: The bit-depth is what tells us how big the chunks are, and the type tells us how to convert each chunk into a decimal number.
es: La profundidad de bits es lo que nos dice qué tan grandes son los fragmentos y el tipo nos dice cómo convertir cada fragmento en un número decimal.

source: When bits go bad
es: Cuando las cosas van mal

source: We're now ready to discuss why you absolutely do need to know the basics of bit-depths and image types when working with scientific images.
es: Ahora estamos listos para discutir por qué es absolutamente necesario conocer los conceptos básicos de las profundidades de bits y los tipos de imágenes cuando se trabaja con imágenes científicas.

source: The main point of {ref}`chap_pixels` is that we need to keep control of our pixel values so that our final analysis is justifiable. There are two main bit-related things that can go wrong when trying to store a pixel value in an image:
es: El punto principal de {ref}`chap_pixels` es que debemos mantener el control de los valores de nuestros píxeles para que nuestro análisis final sea justificable. Hay dos cosas principales relacionadas con los bits que pueden salir mal al intentar almacenar un valor de píxel en una imagen:

source: **Clipping:** We try to store a number outside the range supported, so that the closest valid value is stored instead. For example, if we try to store -10 in an 8-bit unsigned integer image then the closest value we can actually store is 0. Similarly, if we try to store 500 then the closest valid value is 255.
es: **Recorte:** Intentamos almacenar un número fuera del rango admitido, de modo que se almacene el valor válido más cercano. Por ejemplo, si intentamos almacenar -10 en una imagen entera sin signo de 8 bits, entonces el valor más cercano que podemos almacenar es 0. De manera similar, si intentamos almacenar 500, entonces el valor válido más cercano es 255.

source: **Rounding:** We try to store a number that cannot be represented exactly, and so it must be rounded to the closest possible value. For example, if we want to store 6.4 in an 8-bit unsigned integer image then this is not possible; rather, we would need to store 6 instead.
es: **Redondeo:** Intentamos almacenar un número que no se puede representar exactamente, por lo que se debe redondear al valor más cercano posible. Por ejemplo, si queremos almacenar 6.4 en una imagen entera sin signo de 8 bits, esto no es posible; más bien, necesitaríamos almacenar 6.

source: Data clipping
es: Recorte de datos

source: Of the two problems, clipping is usually the more serious, as shown in {numref}`fig-bits_clipping`. A clipped image contains pixels with values equal to the maximum or minimum supported by that bit-depth, and it's no longer possible to tell what values those pixels *should* have. **The information is irretrievably lost.**
es: De los dos problemas, el recorte suele ser el más grave, como se muestra en {numref}`fig-bits_clipping`. Una imagen recortada contiene píxeles con valores iguales al máximo o mínimo admitido por esa profundidad de bits, y ya no es posible saber qué valores *deberían* tener esos píxeles. **La información se pierde irremediablemente.**
