Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/bit_depths.po
Languages: es

source: Clipping often occurs whenever an image is converted to have a lower bit-depth. During this conversion, not all the original pixel values may be preserved -- in which case they must be somehow transformed into the range permitted by the output bit-depth.
es: El recorte suele ocurrir cada vez que se convierte una imagen para que tenga una profundidad de bits más baja. Durante esta conversión, es posible que no se conserven todos los valores de píxeles originales, en cuyo caso deben transformarse de alguna manera al rango permitido por la profundidad de bits de salida.

source: This transformation could simply involve clipping the unsupported values (usually very bad), or it could involve rescaling the pixel values first (usually less bad).
es: Esta transformación podría implicar simplemente recortar los valores no admitidos (normalmente muy malos), o podría implicar reescalar primero los valores de píxeles (normalmente menos malos).

source: Storing an image using a lower bit-depth, either by clipping or by scaling the values. The top row shows all images with the same minimum and maximum values to determine the contrast, while the second row shows shows the same images with the maximum set to the highest pixel value actually present (the images are the same, only the LUTs are different). The bottom rows show both a plot of the pixel values through the center of each image and histograms of all the image pixel values. One may infer that information has been lost in both of the 8-bit images, but more much horrifically when clipping was applied. Scaling squeezes the data into a narrow range, which might result in some rounding errors -- but most of the information remains intact, with the shapes of the profile plot and histogram remaining similar.
es: Almacenar una imagen usando una profundidad de bits más baja, ya sea recortando o escalando los valores. La fila superior muestra todas las imágenes con los mismos valores mínimo y máximo para determinar el contraste, mientras que la segunda fila muestra las mismas imágenes con el máximo establecido en el valor de píxel más alto realmente presente (las imágenes son las mismas, solo los LUT son diferentes). Las filas inferiores muestran un gráfico de los valores de píxeles a través del centro de cada imagen e histogramas de todos los valores de píxeles de la imagen. Se puede inferir que la información se perdió en ambas imágenes de 8 bits, pero de manera mucho más terrible cuando se aplicó el recorte. El reajuste comprime los datos en un rango estrecho, lo que podría dar lugar a algunos errores de redondeo. Pero la mayor parte de la información permanece intacta, y las formas del gráfico del perfil y del histograma siguen siendo similares.

source: Clipping of high pixel values during acquisition is also called **saturation**.
es: El recorte de valores de píxeles altos durante la adquisición también se denomina **saturación**.

source: However, it's important to know that **clipping can already occur during image acquisition**. In fluorescence microscopy, this depends upon three main factors:
es: Sin embargo, es importante saber que **el recorte ya puede ocurrir durante la adquisición de la imagen**. En microscopía de fluorescencia, esto depende de tres factores principales:

source: **The amount of light being emitted.** Because pixel values depend upon how much light is detected, a sample emitting very little light is less likely to require the ability to store very large values. Although it still *might* because of...
es: **La cantidad de luz que se emite.** Debido a que los valores de los píxeles dependen de la cantidad de luz que se detecta, es menos probable que una muestra que emita muy poca luz requiera la capacidad de almacenar valores muy grandes. Aunque todavía *podría* debido a...

source: **The gain of the microscope.** Quantifying very tiny amounts of light accurately has practical difficulties. A microscope’s gain effectively amplifies the amount of detected light to help overcome this before turning it into a pixel value (see {ref}`chap_microscope_types`). However, if the gain is too high, even a small number of detected photons could end up being over-amplified until clipping occurs.
es: **La ganancia del microscopio.** Cuantificar con precisión cantidades muy pequeñas de luz tiene dificultades prácticas. La ganancia de un microscopio amplifica efectivamente la cantidad de luz detectada para ayudar a superar esto antes de convertirla en un valor de píxel (consulte {ref}`chap_microscope_types`). Sin embargo, si la ganancia es demasiado alta, incluso una pequeña cantidad de fotones detectados podrían terminar sobreamplificados hasta que se produzca el recorte.

source: **The offset of the microscope.** This effectively acts as a constant being added to every pixel. If this is too high, or even negative, it can also push the pixels outside the permissible range.
es: **El offset del microscopio.** Esto actúa efectivamente como una constante que se agrega a cada píxel. Si es demasiado alto, o incluso negativo, también puede empujar a los píxeles fuera del rango permitido.

source: Avoid clipping your data!
es: ¡Evita recortar tus datos!

source: If clipping occurs, we no longer know what is happening in the brightest or darkest parts of the image -- which can thwart any later analysis. Therefore **during image acquisition, any available controls should be adjusted to make sure clipping is avoided.**
es: Si se produce recorte, ya no sabemos qué está sucediendo en las partes más brillantes u oscuras de la imagen, lo que puede frustrar cualquier análisis posterior. Por lo tanto, **durante la adquisición de imágenes, se deben ajustar todos los controles disponibles para garantizar que se evite el recorte.**

source: When acquiring an 8-bit unsigned integer image, is it fair to say your data is fine so long as your minimum pixel value is 0 and your maximum value is 255?
es: Al adquirir una imagen entera sin signo de 8 bits, ¿es justo decir que sus datos están bien siempre que su valor mínimo de píxeles sea 0 y su valor máximo sea 255?

source: No! At least, not really.
es: ¡No! Al menos no realmente.

source: You *cannot* store pixels outside the range 0–255. If your image contains pixels with either of those extreme values, *you cannot be certain whether or not clipping has occurred*. Therefore, you should ensure images you acquire do not contain any pixels with the most extreme values permitted by the image bit-depth. To be confident your 8-bit data is not clipped, the maximum range would be 1–254.
es: *No puedes* almacenar píxeles fuera del rango 0–255. Si tu imagen contiene píxeles con cualquiera de esos valores extremos, *no puedes estar seguro de si se ha producido un recorte o no*. Por lo tanto, debes asegurarte de que las imágenes que adquieras no contengan píxeles con los valores más extremos permitidos por la profundidad de bits de la imagen. Para tener la certeza de que tus datos de 8 bits no se recortan, el rango máximo sería 1–254.

source: The bit-depth of an image is probably some multiple of 8, but the bit-depth that a [detector (e.g. CCD)](chap_microscope_types) can support might not be.
es: La profundidad de bits de una imagen probablemente sea un múltiplo de 8, pero la profundidad de bits que un [detector (por ejemplo, CCD)](chap_microscope_types) puede admitir podría no serlo.

source: For example, what is the maximum value in a 16-bit image that was acquired using a camera with a 12-bit output?
es: Por ejemplo, ¿cuál es el valor máximo en una imagen de 16 bits adquirida utilizando una cámara con output de 12 bits?

source: And what is the maximum value in a 8-bit image acquired using a camera with a 14-bit output?
es: ¿Y cuál es el valor máximo en una imagen de 8 bits adquirida con una cámara con output de 14 bits?

source: Assume unsigned integers are used in both cases.
es: Supongamos que en ambos casos se utilizan enteros sin signo.

source: The maximum value of a 16-bit image obtained using a 12-bit camera is 4095 (i.e. 2<sup>12</sup>-1).
es: El valor máximo de una imagen de 16 bits obtenida con una cámara de 12 bits es 4095 (es decir, 2<sup>12</sup>-1 ).

source: The maximum value of an 8-bit image obtained using a 14-bit camera is 255 – the extra bits of the camera do not change this. But if the image was saved in 16-bit instead, the maximum value would be 16383.
es: El valor máximo de una imagen de 8 bits obtenida con una cámara de 14 bits es 255; los bits adicionales de la cámara no cambian esto. Pero si la imagen se guardara en 16 bits, el valor máximo sería 16383.

source: So be aware that the actual range of possible values depends upon the acquisition equipment as well as the bit-depth of the image itself. The lower bit-depth will dominate.
es: Por lo tanto, ten en cuenta que el rango real de valores posibles depende del equipo de adquisición y de la profundidad de bits de la imagen misma. Dominará la profundidad de bits más baja.

source: Rounding errors
es: Errores de redondeo

source: Rounding is a more subtle problem than clipping. Again it is relevant as early as acquisition.
es: El redondeo es un problema más sutil que el recorte. Una vez más, es relevante desde la adquisición.

source: For example, suppose you are acquiring an image in which there really are 1000 distinct and quantifiable levels of light being emitted from different parts of a sample. These could not possibly be given different pixel values within an 8-bit image, but could normally be fit into a 16-bit or 32-bit image with lots of room to spare. If our image is 8-bit, and we want to avoid clipping, then we would need to scale the original photon counts down first – resulting in pixels with different photon counts being rounded to have the same values, and their original differences being lost.
es: Por ejemplo, supongamos que se adquiere una imagen en la que hay 1000 niveles distintos y cuantificables de luz emitida por diferentes partes de una muestra. En una imagen de 8 bits no es posible asignarles valores de píxel diferentes, pero en una imagen de 16 o 32 bits sí que cabrían. Si nuestra imagen es de 8 bits y queremos evitar el recorte, primero tendremos que reducir la escala de los recuentos de fotones originales, con lo que los píxeles con recuentos de fotones diferentes se redondearán para que tengan los mismos valores y se perderán sus diferencias originales.

source: Nevertheless, rounding errors during acquisition are usually small: it may not *really* matter if we can't tell the difference between detecting 1,000 photons and 1,003 photons.
es: No obstante, los errores de redondeo durante la adquisición suelen ser pequeños: puede que *realmente* no importe si no podemos diferenciar entre detectar 1.000 fotones y 1.003 fotones.

source: Rounding can be a bigger problem when it comes to processing operations like filtering, which often involve computing averages over many pixels (see {ref}`chap_filters`). The good news is that at this post-acquisition stage we can convert our data to floating point and then get fractions if we need them.
es: El redondeo puede ser un problema mayor cuando se trata de operaciones de procesado como el filtrado, que a menudo implican calcular promedios sobre muchos píxeles (véase {ref}`chap_filters`). La buena noticia es que en esta fase posterior a la adquisición podemos convertir nuestros datos a punto flotante y obtener fracciones si las necesitamos.

source: Floating point rounding errors
es: Errores de redondeo en punto flotante

source: As a full disclosure, I should admit that using floating point types is only a partial solution to rounding issues. Even a 64-bit floating point image cannot store all useful pixel values with perfect precision, and seemingly straightforward numbers like 0.1 are only imprecisely represented.
es: Como revelación completa, debo admitir que el uso de tipos de punto flotante es sólo una solución parcial a los problemas de redondeo. Incluso una imagen de 64 bits en punto flotante no puede almacenar todos los valores de píxel útiles con una precisión perfecta, y números aparentemente sencillos como 0.1 sólo se representan de forma imprecisa.

source: But this is not really unexpected: this binary limitation is similar to how we cannot write 1/3 in decimal exactly. We can write 0.3333333 but our level of precision will depend upon our willingness to continue adding 3’s after the decimal point.
es: Pero esto no es realmente inesperado: esta limitación binaria es similar a la forma en que no podemos escribir 1/3 en decimal con exactitud. Podemos escribir 0.3333333, pero nuestro nivel de precisión dependerá de nuestra voluntad de seguir sumando 3 después del punto decimal.

source: In any case, rounding 0.1 to 0.100000001490116119384765625 (a possible floating point representation) is not so bad as rounding it to 0 (an integer representation), and the imprecisions of floating point numbers in image analysis are *usually* small enough to be disregarded.
es: En cualquier caso, redondear 0.1 a 0.100000001490116119384765625 (una posible representación en punto flotante) no es tan malo como redondearlo a 0 (una representación entera), y las imprecisiones de los números en punto flotante en el análisis de imágenes son *normalmente* lo bastante pequeñas como para no tenerlas en cuenta.

source: See <https://xkcd.com/217/> for more information.
es: Para más información, consulte <https://xkcd.com/217/>.

source: More bits are better (usually)
es: Más bits es mejor (normalmente)

source: From considering both clipping and rounding, the simple rule of bit-depths emerges: if you want the maximum information and precision in your images, more bits are better. This is depicted in {numref}`fig-blocks_and_bits`.
es: Al considerar tanto el recorte como el redondeo, surge la sencilla regla de la profundidad de bits: si quieres la máxima información y precisión en tus imágenes, más bits es mejor. Esto se muestra en {numref}`fig-blocks_and_bits`.

source: When given the option of acquiring a 16-bit or 8-bit image, most of the time you should opt for the former.
es: Cuando se le da la opción de adquirir una imagen de 16 u 8 bits, la mayoría de las veces debe optar por la primera.

source: **Illustration of the comparative accuracy of *(left to right)* 8-bit, 16-bit and 32-bit images.** If an 8-bit image is like creating a sculpture out of large building blocks, a 16-bit image is more like using Lego and a 32-bit floating point image resembles using clay. Anything that can be created with the blocks can also be made from the Lego; anything made from the Lego can also be made from the clay. This does not work in reverse: some complex creations can only be represented properly by clay, and building blocks permit only a crude approximation at best. On the other hand, if you only need something blocky, it’s not really worth the extra effort of Lego or clay. And, from a very great distance, it might be hard to tell the difference.
es: **Ilustración de la precisión comparativa de *(de izquierda a derecha)* imágenes de 8 bits, 16 bits y 32 bits.** Si una imagen de 8 bits es como crear una escultura a partir de grandes bloques de construcción, una imagen de 16 bits es más parecida a utilizar Lego y una imagen de 32 bits en punto flotante se asemeja a utilizar arcilla. Cualquier cosa que se pueda crear con los bloques también se puede hacer con el Lego; cualquier cosa que se haga con el Lego también se puede hacer con la arcilla. Esto no funciona a la inversa: algunas creaciones complejas sólo pueden representarse correctamente con arcilla, y los bloques de construcción sólo permiten, como mucho, una burda aproximación. Por otra parte, si sólo necesitas algo en bloques, no merece la pena el esfuerzo extra de Lego o la arcilla. Y, desde una distancia muy grande, puede ser difícil notar la diferencia.

source: Although *more bits are better* is a simple rule of thumb we can share with those who do not know the subtleties of bit-depths, it should not be held completely rigorously.
es: Aunque *más bits es mejor* es una simple regla empírica que podemos compartir con quienes no conocen las sutilezas de la profundidad de bits, no debe sostenerse con total rigor.

source: Can you think of any circumstances when more bits might *not* be better?
es: ¿Se te ocurre alguna circunstancia en la que más bits *no* sean mejores?

source: Reasons why a lower bit depth is *sometimes* preferable to a higher one include:
es: A veces es preferible una profundidad de bits menor que una mayor:

source: A higher bit-depth leads to larger file sizes, and potentially slower processing. For very large datasets, this might be a bigger issue that any loss of precision found in using fewer bits.
es: Una mayor profundidad de bits conlleva archivos de mayor tamaño y un procesamiento potencialmente más lento. En el caso de conjuntos de datos muy grandes, esto puede suponer un problema mayor que cualquier pérdida de precisión derivada del uso de menos bits.

source: The amount of light detected per pixel might be so low that thousands of possible values are not required for its accurate storage, and 8-bits (or even fewer) would be enough. For the light-levels in biological fluorescence microscopy, going beyond 16-bits would seldom bring any benefit.
es: La cantidad de luz detectada por píxel puede ser tan baja que no se necesiten miles de valores posibles para almacenarla con precisión, y bastaría con 8 bits (o incluso menos). Para los niveles de luz en microscopía de fluorescencia biológica, ir más allá de los 16 bits rara vez aportaría algún beneficio.

source: But with smallish datasets for which processing and storage costs are not a problem, it is safest to err on the side of more bits than we strictly need.
es: Pero con conjuntos de datos pequeños para los que los costes de procesamiento y almacenamiento no son un problema, lo más seguro es errar por el lado de más bits de los que estrictamente necesitamos.
