Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/imagej.po
Languages: de, es, pt_br

source: We shouldn't be complacent about image conversions, even if we think they *should* be ok. It's so easy to measure images (press {kbd}`M`), we should always check before and after conversion to make sure the summary measurements are unchanged.
de: Wir sollten bei Bildkonvertierungen nicht selbstgefällig sein, auch wenn wir denken, dass sie in Ordnung *sollten*. Es ist so einfach, Bilder zu messen (drücken Sie {kbd}`M`), wir sollten immer vor und nach der Konvertierung überprüfen, um sicherzustellen, dass die Gesamtmessungen unverändert sind.
es: No debemos ser complacientes con las conversiones de imágenes, incluso si pensamos que *deberían* estar bien. Es muy fácil medir imágenes (presiona {kbd}`M`) que siempre debemos verificar antes y después de la conversión para asegurarnos de que las medidas resumidas no hayan cambiado.
pt_br: Não devemos ser complacentes com as conversões de imagens, mesmo que pensemos que elas *deveriam* estar bem. É tão fácil medir imagens (pressione {kbd}`M`), devemos sempre verificar antes e depois da conversão para ter certeza de que as medidas resumidas permanecem inalteradas.

source: Reducing the bit-depth
de: Reduzierung der Bittiefe
es: Reducir la profundidad de bits
pt_br: Reduzindo a profundidade de bits

source: Reducing the bit-depth is where the biggest dangers lurk. Then not all values from a higher bit-depth image fit into an image with a lower bit-depth.
de: In der Reduzierung der Bittiefe lauern die größten Gefahren. Dann passen nicht alle Werte aus einem Bild mit höherer Bittiefe in ein Bild mit geringerer Bittiefe.
es: Reducir la profundidad de bits es donde acechan los mayores peligros. Entonces no todos los valores de una imagen con una profundidad de bits más alta encajan en una imagen con una profundidad de bits más baja.
pt_br: Reduzir a profundidade de bits é onde se escondem os maiores perigos. Assim, nem todos os valores de uma imagem com profundidade de bits mais alta cabem em uma imagem com profundidade de bits mais baixa.

source: The process is the same: choose the type you want from the {menuselection}`Image --> Type -->` submenu.
de: Der Vorgang ist derselbe: Wählen Sie den gewünschten Typ aus dem Untermenü {menuselection}`Image --> Type -->` aus.
es: El proceso es el mismo: elige el tipo que desees en el submenú {menuselection}`Image --> Type -->`.
pt_br: O processo é o mesmo: escolha o tipo desejado no submenu {menuselection}`Imagem --> Tipo -->`.

source: But what happens next depends upon whether the option {guilabel}`Scale When Converting` under {menuselection}`Edit --> Options --> Conversions...` is checked or not.
de: Aber was als nächstes passiert, hängt davon ab, ob die Option {guilabel}„Skalierung beim Konvertieren“ unter {menuselection}„Bearbeiten --> Optionen -->“ aktiviert ist Konvertierungen...` wird überprüft oder nicht.
es: Pero lo que sucede a continuación depende de si la opción {guilabel}`Scale When Converting` en {menuselection}`Edit --> Options --> Conversions...` está marcado o no.
pt_br: Mas o que acontece a seguir depende se a opção {guilabel}`Escala ao converter` em {menuselection}`Editar --> Opções --> Conversions...` está marcado ou não.

source: {guilabel}`Scale When Converting` **is _not_ checked:** pixels are simply given the closest valid value within the new bit depth, i.e. there is clipping and rounding as needed.
de: {guilabel}„Skalierung beim Konvertieren“ **ist _nicht_ aktiviert:** Pixel erhalten einfach den nächstgelegenen gültigen Wert innerhalb der neuen Bittiefe, d. h. es wird nach Bedarf beschnitten und gerundet.
es: {guilabel}`Scale When Converting` **_no_ está marcada:** a los píxeles simplemente se les da el valor válido más cercano dentro de la nueva profundidad de bits, es decir, hay recorte y redondeo según sea necesario.
pt_br: {guilabel}`Escala ao converter` **_não_ está marcada:** os pixels recebem simplesmente o valor válido mais próximo dentro da nova profundidade de bits, ou seja, há recorte e arredondamento conforme necessário.

source: Example: If you convert an image to 8-bit, then no data will be lost *only* if every pixel value before conversion is an integer in the range 0--255. Every other value will be rounded or clipped.
de: Beispiel: Wenn Sie ein Bild in 8-Bit konvertieren, gehen *nur* dann keine Daten verloren, wenn jeder Pixelwert vor der Konvertierung eine Ganzzahl im Bereich von 0 bis 255 ist. Jeder andere Wert wird gerundet oder beschnitten.
es: Ejemplo: si convierte una imagen a 8 bits, no se perderán datos *solo* si cada valor de píxel antes de la conversión es un número entero en el rango de 0 a 255. Cualquier otro valor se redondeará o recortará.
pt_br: Exemplo: Se você converter uma imagem para 8 bits, nenhum dado será perdido *somente* se cada valor de pixel antes da conversão for um número inteiro no intervalo de 0 a 255. Todos os outros valores serão arredondados ou cortados.

source: {guilabel}`Scale When Converting`**_is_ checked:** a constant is added or subtracted, then pixels are further divided by another constant before being assigned to the nearest valid value within the new bit depth. Only *then* is clipping or rounding applied if it is still needed.
de: {guilabel}`Skalierung beim Konvertieren`**_is_ geprüft:** Eine Konstante wird addiert oder subtrahiert, dann werden die Pixel weiter durch eine andere Konstante dividiert, bevor sie dem nächsten gültigen Wert innerhalb zugewiesen werden neue Bittiefe. Nur *dann* wird eine Beschneidung oder Rundung angewendet, wenn sie noch benötigt wird.
es: {guilabel}`Scale When Converting`**_is_ checked:** se suma o resta una constante, luego los píxeles se dividen entre otra constante antes de asignarlos al valor válido más cercano dentro de la nueva profundidad de bits. Sólo *entonces* se aplica el recorte o el redondeo si aún es necesario.
pt_br: {guilabel}`Escala ao converter`**_está_ marcada:** uma constante é adicionada ou subtraída, então os pixels são divididos por outra constante antes de serem atribuídos ao valor válido mais próximo dentro do nova profundidade de bits. Somente *então* o recorte ou arredondamento é aplicado se ainda for necessário.

source: {guilabel}`Scale When Converting` is on by default and, as suggested by {numref}`fig-bits_clipping`, is usually the best option. The question then is where the constants come from to perform the rescaling.
de: {guilabel}`Scale When Converting` ist standardmäßig aktiviert und, wie von {numref}`fig-bits_clipping` vorgeschlagen, normalerweise die beste Lösung Möglichkeit. Die Frage ist dann, woher die Konstanten kommen, um die Neuskalierung durchzuführen.
es: {guilabel}`Scale When Converting` está activado de forma predeterminada y, como lo sugiere {numref}`fig-bits_clipping`, suele ser el mejor opción. La pregunta entonces es de dónde vienen las constantes para realizar el re-escalado.
pt_br: {guilabel}`Escala ao converter` está ativado por padrão e, como sugerido por {numref}`fig-bits_clipping`, geralmente é o melhor opção. A questão então é de onde vêm as constantes para realizar o reescalonamento.

source: Perhaps surprisingly, they are determined from the {guilabel}`Minimum` and {guilabel}`Maximum` in the current *Brightness/Contrast...* settings: the *Minimum* is subtracted, and the result is divided by *Maximum* - *Minimum*. Any pixel value that was lower than *Minimum* or higher than *Maximum* ends up being clipped. Consequently, **converting to a lower bit-depth with scaling can lead to different results depending upon what the brightness and contrast settings were**.
de: Es überrascht vielleicht, dass sie aus dem {guilabel}„Minimum“ und dem {guilabel}„Maximum“ in der aktuellen *Helligkeit/Kontrast ermittelt werden. .* Einstellungen: Das *Minimum* wird subtrahiert und das Ergebnis wird durch *Maximum* - *Minimum* dividiert. Jeder Pixelwert, der niedriger als *Minimum* oder höher als *Maximum* war, wird abgeschnitten. Folglich kann **die Konvertierung in eine niedrigere Bittiefe mit Skalierung je nach Helligkeits- und Kontrasteinstellungen zu unterschiedlichen Ergebnissen führen**.
es: Quizás sea sorprendente que se determinen a partir del {guilabel}`Mínimum` y {guilabel}`Maximum` en la configuración *Brillo/Contraste actual. .*: se resta el *Mínimo* y el resultado se divide entre *Máximo* - *Mínimo*. Cualquier valor de píxel que sea inferior al *Mínimo* o superior al *Máximo* acaba siendo recortado. En consecuencia, **convertir a una profundidad de bits más baja con escalado puede generar resultados diferentes dependiendo de cuáles fueron las configuraciones de brillo y contraste**.
pt_br: Talvez surpreendentemente, eles são determinados a partir do {guilabel}`Mínimo` e {guilabel}`Máximo` no *Brilho/Contraste atual. .* configurações: o *Mínimo* é subtraído e o resultado é dividido por *Máximo* - *Mínimo*. Qualquer valor de pixel inferior a *Mínimo* ou superior a *Máximo* acaba sendo cortado. Conseqüentemente, **converter para uma profundidade de bits mais baixa com escala pode levar a resultados diferentes dependendo das configurações de brilho e contraste**.

source: This means that, ideally, we would use a minimum value that is equal to the minimum pixel value in the image, and a maximum value equal to the maximum pixel value. Fortunately, there is an easy way to achieve this:
de: Das bedeutet, dass wir im Idealfall einen Minimalwert verwenden würden, der dem minimalen Pixelwert im Bild entspricht, und einen Maximalwert, der dem maximalen Pixelwert entspricht. Glücklicherweise gibt es einen einfachen Weg, dies zu erreichen:
es: Esto significa que, idealmente, usaríamos un valor mínimo que sea igual al valor mínimo de píxel en la imagen y un valor máximo igual al valor máximo de píxel. Afortunadamente, existe una manera sencilla de lograrlo:
pt_br: Isso significa que, idealmente, usaríamos um valor mínimo igual ao valor mínimo de pixel da imagem e um valor máximo igual ao valor máximo de pixel. Felizmente, existe uma maneira fácil de conseguir isso:

source: Reset the Brightness/Contrast range before reducing the bit-depth
de: Setzen Sie den Helligkeits-/Kontrastbereich zurück, bevor Sie die Bittiefe verringern
es: Restablece el rango de Brillo/Contraste antes de reducir la profundidad de bits
pt_br: Redefina a faixa de brilho/contraste antes de reduzir a profundidade de bits

source: If you **really** need to reduce the bit-depth of an image in ImageJ, you should usually open {menuselection}`Image --> Adjust --> Brightness/Contrast...` ({kbd}`Shift+C`) and press the {guilabel}`Reset` button first, to minimize the data lost to clipping or rounding.
de: Wenn Sie die Bittiefe eines Bildes in ImageJ **wirklich** reduzieren müssen, sollten Sie normalerweise {menuselection}`Image --> Adjust --> Brightness/Contrast öffnen. ..` ({kbd}`Umschalt+C`) und drücken Sie zuerst die {guilabel}Taste „Zurücksetzen“, um den Datenverlust zu minimieren zum Abschneiden oder Abrunden.
es: Si **realmente** necesitas reducir la profundidad de bits de una imagen en ImageJ, normalmente debes abrir {menuselection}`Image --> Adjust --> Brightness/Contrast. ..` ({kbd}`Shift+C`) y presiona el botón {guilabel}`Reset` primero, para minimizar la pérdida de datos al recorte o al redondeo.
pt_br: Se você **realmente** precisa reduzir a profundidade de bits de uma imagem no ImageJ, normalmente você deve abrir {menuselection}`Imagem --> Ajustar --> Brilho/Contraste. ..` ({kbd}`Shift+C`) e pressione o botão {guilabel}`Reset` primeiro, para minimizar a perda de dados para recorte ou arredondamento.

source: Why is scaling usually a good thing when reducing the bit-depth, and why is a constant usually subtracted before applying this scaling?
de: Warum ist die Skalierung normalerweise eine gute Sache, wenn die Bittiefe reduziert wird, und warum wird normalerweise eine Konstante subtrahiert, bevor diese Skalierung angewendet wird?
es: ¿Por qué el escalado suele ser bueno al reducir la profundidad de bits y por qué generalmente se resta una constante antes de aplicar este escalado?
pt_br: Por que o dimensionamento geralmente é uma coisa boa ao reduzir a profundidade de bits e por que uma constante geralmente é subtraída antes de aplicar esse dimensionamento?

source: **Hint:** As an example, consider how a 16-bit image containing values in the range 4000–5000 might be converted to 8-bit first without scaling, and then alternatively by scaling with or without the initial constant subtraction. What constants for subtraction and division would usually minimize the amount of information lost when converting to 8-bit image, limiting the errors to rounding only and not clipping?
de: **Hinweis:** Betrachten Sie als Beispiel, wie ein 16-Bit-Bild mit Werten im Bereich von 4000–5000 zunächst ohne Skalierung und dann alternativ durch Skalierung mit oder ohne die anfängliche konstante Subtraktion in ein 8-Bit-Bild konvertiert werden könnte. Welche Konstanten für Subtraktion und Division würden normalerweise den Informationsverlust bei der Konvertierung in ein 8-Bit-Bild minimieren und die Fehler nur auf das Runden und nicht auf das Abschneiden beschränken?
es: **Sugerencia:** Como ejemplo, considera cómo una imagen de 16 bits que contiene valores en el rango de 4000 a 5000 podría convertirse a 8 bits primero sin escalar y luego, alternativamente, escalar con o sin la resta constante inicial. ¿Qué constantes para la resta y la división normalmente minimizarían la cantidad de información perdida al convertir a una imagen de 8 bits, limitando los errores al redondeo únicamente y no al recorte?
pt_br: **Dica:** Como exemplo, considere como uma imagem de 16 bits contendo valores no intervalo de 4.000 a 5.000 pode ser convertida para 8 bits primeiro sem escala e, em seguida, alternativamente, escalando com ou sem a subtração constante inicial. Quais constantes para subtração e divisão normalmente minimizariam a quantidade de informações perdidas na conversão para uma imagem de 8 bits, limitando os erros apenas ao arredondamento e não ao recorte?

source: In the example given, converting to 8-bit without any scaling would result in all pixels simply becoming 255: all useful information in the image would be lost.
de: Im angegebenen Beispiel würde die Konvertierung in 8-Bit ohne Skalierung dazu führen, dass alle Pixel einfach 255 werden: Alle nützlichen Informationen im Bild würden verloren gehen.
es: En el ejemplo dado, la conversión a 8 bits sin ningún escalado daría como resultado que todos los píxeles simplemente pasaran a ser 255: se perdería toda la información útil de la imagen.
pt_br: No exemplo dado, a conversão para 8 bits sem qualquer escala resultaria em todos os pixels simplesmente se tornarem 255: todas as informações úteis na imagem seriam perdidas.

source: With scaling but without subtraction, it would make sense to divide all pixel values by the maximum in the image divided by the maximum in the new bit depth, i.e. by 5000/255. This would then lead to an image in which pixels fall into the range 204–255. Much information has clearly been lost: 1000 potentially different values have now been squeezed into 52.
de: Bei Skalierung, aber ohne Subtraktion wäre es sinnvoll, alle Pixelwerte durch das Maximum im Bild dividiert durch das Maximum in der neuen Bittiefe zu dividieren, also durch 5000/255. Dies würde dann zu einem Bild führen, dessen Pixel in den Bereich 204–255 fallen. Offensichtlich sind viele Informationen verloren gegangen: 1000 potenziell unterschiedliche Werte wurden jetzt auf 52 gequetscht.
es: Con escala pero sin resta, tendría sentido dividir todos los valores de píxeles por el máximo de la imagen dividido por el máximo de la nueva profundidad de bits, es decir, por 5000/255. Esto conduciría a una imagen en la que los píxeles se encuentran en el rango de 204 a 255. Claramente se ha perdido mucha información: 1000 valores potencialmente diferentes ahora se han comprimido en 52.
pt_br: Com dimensionamento, mas sem subtração, faria sentido dividir todos os valores de pixels pelo máximo na imagem dividido pelo máximo na nova profundidade de bits, ou seja, por 5000/255. Isso levaria então a uma imagem na qual os pixels estariam no intervalo 204–255. Muita informação foi claramente perdida: 1000 valores potencialmente diferentes foram agora espremidos em 52.

source: However, if we first subtract the smallest of our 16-bit values (i.e. 4000), our initial range becomes 0–1000. Divide then by 1000/255 and the new values become scaled across the full range of an 8-bit image, i.e. 0–255. We have still lost information – but considerably less than if we had not subtracted the constant first.
de: Wenn wir jedoch zuerst den kleinsten unserer 16-Bit-Werte (d. h. 4000) subtrahieren, beträgt unser anfänglicher Bereich 0–1000. Teilen Sie dann durch 1000/255 und die neuen Werte werden über den gesamten Bereich eines 8-Bit-Bildes, d. h. 0–255, skaliert. Wir haben immer noch Informationen verloren – aber deutlich weniger, als wenn wir die Konstante nicht vorher abgezogen hätten.
es: Sin embargo, si primero restamos el más pequeño de nuestros valores de 16 bits (es decir, 4000), nuestro rango inicial pasa a ser 0-1000. Luego divide por 1000/255 y los nuevos valores se escalarán en todo el rango de una imagen de 8 bits, es decir, 0–255. Todavía hemos perdido información, pero considerablemente menos que si no hubiéramos restado primero la constante.
pt_br: No entanto, se primeiro subtrairmos o menor dos nossos valores de 16 bits (ou seja, 4.000), nosso intervalo inicial se tornará 0–1.000. Divida então por 1000/255 e os novos valores serão dimensionados em toda a faixa de uma imagem de 8 bits, ou seja, 0–255. Ainda perdemos informação – mas consideravelmente menos do que se não tivéssemos subtraído a constante primeiro.

source: Practical
de: Praktisch
es: Práctico
pt_br: Prático

source: Make sure that the {guilabel}`Scale When Converting` option is turned on (it should be by default). Then using a suitable 8-bit sample image, e.g. {menuselection}`File --> Open Samples --> Boats`, explore the effects of brightness/contrast settings when increasing or decreasing bit-depths.
de: Stellen Sie sicher, dass die Option „Beim Konvertieren skalieren“ aktiviert ist (dies sollte standardmäßig der Fall sein). Verwenden Sie dann ein geeignetes 8-Bit-Beispielbild, z. {menuselection}`File --> Open Samples --> Boats`, erkunden Sie die Auswirkungen von Helligkeits-/Kontrasteinstellungen beim Erhöhen oder Verringern der Bittiefe.
es: Asegúrate de que la opción {guilabel}`Scale When Converting` esté activada (debería estar activada de forma predeterminada). Luego, utilizando una imagen de muestra de 8 bits adecuada, p. {menuselection}`File --> Open Samples --> Boats`, explora los efectos de las configuraciones de brillo/contraste al aumentar o disminuir la profundidad de bits.
pt_br: Certifique-se de que a opção {guilabel}`Escala ao converter` esteja ativada (deve estar por padrão). Em seguida, usando uma imagem de amostra adequada de 8 bits, por ex. {menuselection}`Arquivo --> Abrir amostras --> Barcos`, explore os efeitos das configurações de brilho/contraste ao aumentar ou diminuir a profundidade de bits.

source: Can you destroy the image by simply 1) increasing the bit-depth, and the then 2) decreasing the bit-depth to its original value?
de: Können Sie das Bild zerstören, indem Sie einfach 1) die Bittiefe erhöhen und dann 2) die Bittiefe auf den ursprünglichen Wert verringern?
es: ¿Puedes destruir la imagen simplemente 1) aumentando la profundidad de bits y luego 2) disminuyendo la profundidad de bits a su valor original?
pt_br: Você pode destruir a imagem simplesmente 1) aumentando a profundidade de bits e depois 2) diminuindo a profundidade de bits para seu valor original?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/6f9f451fdc0116197501ae504a57d5e7)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run= https://gist.github.com/petebankhead/6f9f451fdc0116197501ae504a57d5e7)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run= https://gist.github.com/petebankhead/6f9f451fdc0116197501ae504a57d5e7)

source: launch ImageJ.JS
de: Starten Sie ImageJ.JS
es: lanzar ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
de: Lösung
es: Solución
pt_br: Solução

source: It's generally a good idea to choose {guilabel}`Reset` in the {menuselection}`Brightness/Contrast...` window before reducing any bit-depths for 2D images (see {ref}`chap_multidimensional_processing` to read about special considerations related to *z*-stacks or time series).
de: Im Allgemeinen ist es eine gute Idee, im Fenster {menuselection}„Helligkeit/Kontrast...“ die Option „Zurücksetzen“ auszuwählen, bevor Sie etwas reduzieren Bittiefen für 2D-Bilder (siehe {ref}`chap_multidimensional_processing`, um mehr über besondere Überlegungen im Zusammenhang mit *z*-Stapeln oder Zeitreihen zu erfahren).
es: Generalmente es una buena idea elegir {guilabel}`Reset` en la ventana {menuselection}`Brightness/Contrast...` antes de reducir cualquier profundidades de bits para imágenes 2D (consulta {ref}`chap_multidimensional_processing` para leer sobre consideraciones especiales relacionadas con *z*-stacks o series de tiempo).
pt_br: Geralmente é uma boa ideia escolher {guilabel}`Reset` na janela {menuselection}`Brilho/Contraste...` antes de reduzir qualquer profundidades de bits para imagens 2D (consulte {ref}`chap_multidimensional_processing` para ler sobre considerações especiais relacionadas a pilhas *z* ou séries temporais).

source: You can destroy an image by increasing its bit-depth, adjusting the brightness/contrast and then decreasing the bit-depth to the original one again. This may seem weird, because clearly the final bit-depth is *capable* of storing all the original pixel values. But ImageJ does not know this and does not check, so it will simply do its normal bit-depth-reducing conversion based on contrast settings.
de: Sie können ein Bild zerstören, indem Sie seine Bittiefe erhöhen, Helligkeit/Kontrast anpassen und dann die Bittiefe wieder auf das Original verringern. Das mag seltsam erscheinen, da die endgültige Bittiefe offensichtlich in der Lage ist, alle ursprünglichen Pixelwerte zu speichern. Aber ImageJ weiß dies nicht und führt keine Prüfung durch, sodass es einfach seine normale Konvertierung zur Reduzierung der Bittiefe basierend auf den Kontrasteinstellungen durchführt.
es: Puedes destruir una imagen aumentando su profundidad de bits, ajustando el brillo/contraste y luego disminuyendo la profundidad de bits al original nuevamente. Esto puede parecer extraño, porque claramente la profundidad de bits final es *capaz* de almacenar todos los valores de píxeles originales. Pero ImageJ no lo sabe y no lo comprueba, por lo que simplemente realizará su conversión normal de reducción de profundidad de bits basándose en la configuración de contraste.
pt_br: Você pode destruir uma imagem aumentando sua profundidade de bits, ajustando o brilho/contraste e diminuindo a profundidade de bits para a original novamente. Isto pode parecer estranho, porque claramente a profundidade de bits final é *capaz* de armazenar todos os valores de pixel originais. Mas o ImageJ não sabe disso e não verifica, então ele simplesmente fará sua conversão normal de redução de profundidade de bits com base nas configurações de contraste.
