Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/3-bit_depths/imagej.po
Languages: de, es, pt_br

source: ImageJ: Types & bit-depths
de: ImageJ: Typen und Bittiefen
es: ImageJ: tipos y profundidades de bits
pt_br: ImageJ: Tipos e profundidade de bits

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: The bit-depth and type of an image is determined before it is opened in ImageJ. If the data is clipped, it's already wrong before we begin -- and no amount of ImageJ wizardry will get the information back.
de: Die Bittiefe und der Typ eines Bildes werden bestimmt, bevor es in ImageJ geöffnet wird. Wenn die Daten abgeschnitten sind, sind sie bereits falsch, bevor wir beginnen – und keine noch so große ImageJ-Zauberei wird die Informationen zurückbekommen.
es: La profundidad de bits y el tipo de una imagen se determinan antes de abrirla en ImageJ. Si los datos se recortan, ya son incorrectos antes de comenzar, y ninguna cantidad de magia de ImageJ recuperará la información.
pt_br: A profundidade de bits e o tipo de uma imagem são determinados antes de ela ser aberta no ImageJ. Se os dados forem cortados, eles já estarão errados antes de começarmos - e nenhuma magia do ImageJ recuperará as informações.

source: Here, we will explore how to:
de: Hier erfahren Sie, wie Sie:
es: Aquí exploraremos cómo:
pt_br: Aqui, exploraremos como:

source: Check the bit-depth and type
de: Überprüfen Sie die Bittiefe und den Typ
es: Verifique la profundidad de bits y el tipo
pt_br: Verifique a profundidade de bits e o tipo

source: Diagnose when clipping may have occurred
de: Diagnostizieren Sie, wann möglicherweise ein Clipping aufgetreten ist
es: Diagnostica cuándo puede haber ocurrido un recorte
pt_br: Diagnosticar quando o recorte pode ter ocorrido

source: Convert the bit-depth and height -- carefully -- if needed
de: Konvertieren Sie die Bittiefe und -höhe bei Bedarf sorgfältig
es: Convierte la profundidad y la altura de bits (con cuidado) si es necesario
pt_br: Converta a profundidade e a altura dos bits - com cuidado - se necessário

source: Checking the bit-depth & type
de: Überprüfen der Bittiefe und des Typs
es: Comprobación de la profundidad de bits y el tipo
pt_br: Verificando a profundidade e o tipo de bits

source: Bit-depth and type are related to one another: both are needed to convert binary data into pixel values. ImageJ does not always make a careful distinction between the two.
de: Bittiefe und Typ hängen miteinander zusammen: Beide werden benötigt, um Binärdaten in Pixelwerte umzuwandeln. ImageJ unterscheidet nicht immer sorgfältig zwischen beiden.
es: La profundidad de bits y el tipo están relacionados entre sí: ambos son necesarios para convertir datos binarios en valores de píxeles. ImageJ no siempre hace una distinción cuidadosa entre los dos.
pt_br: A profundidade de bits e o tipo estão relacionados entre si: ambos são necessários para converter dados binários em valores de pixel. ImageJ nem sempre faz uma distinção cuidadosa entre os dois.

source: The full list of image types supported by ImageJ is found in the {menuselection}`Image --> Type --> ` submenu. The top three entries are the most important; they are
de: Die vollständige Liste der von ImageJ unterstützten Bildtypen finden Sie im Untermenü {menuselection}`Image --> Type --> `. Die ersten drei Einträge sind die wichtigsten; sie sind
es: La lista completa de tipos de imágenes admitidos por ImageJ se encuentra en el submenú {menuselection}`Image --> Type --> `. Las tres primeras entradas son las más importantes; estas son
pt_br: A lista completa de tipos de imagens suportados pelo ImageJ é encontrada no submenu {menuselection}`Image --> Type --> `. As três primeiras entradas são as mais importantes; eles são

source: **8-bit** -- unsigned integer
de: **8-Bit** – Ganzzahl ohne Vorzeichen
es: **8 bits** -- entero sin signo
pt_br: **8 bits** – número inteiro sem sinal

source: **16-bit** -- unsigned integer
de: **16-Bit** – Ganzzahl ohne Vorzeichen
es: **16 bits**: entero sin signo
pt_br: **16 bits** – número inteiro sem sinal

source: **32-bit** -- floating point
de: **32-Bit** – Gleitkomma
es: **32 bits** -- punto flotante
pt_br: **32 bits** – ponto flutuante

source: Although these look like bit-depths, they are listed as 'types'. But since an 8-bit and 16-bit images in ImageJ are *always* unsigned integer, and 32-bit images are *always* floating point, there is no ambiguity.
de: Obwohl diese wie Bittiefen aussehen, werden sie als „Typen“ aufgeführt. Da aber 8-Bit- und 16-Bit-Bilder in ImageJ *immer* vorzeichenlose Ganzzahlen sind und 32-Bit-Bilder *immer* Gleitkommabilder sind, gibt es keine Mehrdeutigkeit.
es: Aunque parecen profundidades de bits, se enumeran como "tipos". Pero dado que las imágenes de 8 y 16 bits en ImageJ son *siempre* enteros sin signo, y las imágenes de 32 bits son *siempre* de punto flotante, no hay ambigüedad.
pt_br: Embora pareçam profundidades de bits, eles são listados como 'tipos'. Mas como as imagens de 8 e 16 bits no ImageJ são *sempre* inteiros sem sinal e as imagens de 32 bits são *sempre* ponto flutuante, não há ambigüidade.

source: You can see the type of the current image by checking which item under {menuselection}`Image --> Type` has a tick next to it. But you don't usually have to; you can also see the information at the top of the image window.
de: Sie können den Typ des aktuellen Bildes sehen, indem Sie prüfen, welches Element unter {menuselection}`Image --> Type` ein Häkchen hat. Aber das ist normalerweise nicht nötig; Sie können die Informationen auch oben im Bildfenster sehen.
es: Puedes ver el tipo de imagen actual comprobando qué elemento en {menuselection}`Image --> Type -->` tiene una marca de verificación al lado. Pero normalmente no es necesario; También puedes ver la información en la parte superior de la ventana de la imagen.
pt_br: Você pode ver o tipo da imagem atual verificando qual item em {menuselection}`Imagem --> Tipo` tem uma marca ao lado. Mas geralmente não é necessário; você também pode ver as informações na parte superior da janela da imagem.

source: The text at the top of each image window provides useful information. Here, the image on the left is 8-bit and the image on the right is 16-bit.
de: Der Text oben in jedem Bildfenster bietet nützliche Informationen. Hier ist das Bild links 8-Bit und das Bild rechts 16-Bit.
es: El texto en la parte superior de cada ventana de imagen proporciona información útil. Aquí, la imagen de la izquierda es de 8 bits y la imagen de la derecha es de 16 bits.
pt_br: O texto na parte superior de cada janela de imagem fornece informações úteis. Aqui, a imagem à esquerda é de 8 bits e a imagem à direita é de 16 bits.

source: There are various other types listed under {menuselection}`Image --> Type`, which all have an association with color. These are less different than they first appear: an RGB image is really an 8-bit image with three channels (corresponding to red, green and blue). We will explore this in {ref}`chap_colors`.
de: Unter {menuselection}`Image --> Type` sind verschiedene andere Typen aufgeführt, die alle eine Verbindung zur Farbe haben. Diese unterscheiden sich weniger, als sie zunächst erscheinen: Ein RGB-Bild ist in Wirklichkeit ein 8-Bit-Bild mit drei Kanälen (entsprechend Rot, Grün und Blau). Wir werden dies in {ref}`chap_colors` untersuchen.
es: Hay varios otros tipos enumerados en {menuselection}`Image --> Type -->`, todos los cuales tienen una asociación con el color. Son menos diferentes de lo que parecen a primera vista: una imagen RGB es en realidad una imagen de 8 bits con tres canales (correspondientes a rojo, verde y azul). Exploraremos esto en {ref}`chap_colors`.
pt_br: Existem vários outros tipos listados em {menuselection}`Imagem --> Tipo`, todos eles associados à cor. Eles são menos diferentes do que parecem à primeira vista: uma imagem RGB é na verdade uma imagem de 8 bits com três canais (correspondendo a vermelho, verde e azul). Exploraremos isso em {ref}`chap_colors`.

source: Diagnosing problems
de: Probleme diagnostizieren
es: Diagnóstico de problemas
pt_br: Diagnosticando problemas

source: The biggest problem associated with an image's bit-depth and type is clipping. {menuselection}`Analyze --> Histogram` is the essential command needed to diagnose if something is wrong -- just press {kbd}`H` to run it.
de: Das größte Problem im Zusammenhang mit der Bittiefe und dem Typ eines Bildes ist das Beschneiden. {menuselection}„Analysieren --> Histogramm“ ist der wesentliche Befehl, der benötigt wird, um zu diagnostizieren, ob etwas nicht stimmt – drücken Sie einfach {kbd}`H ` um es auszuführen.
es: El mayor problema asociado con la profundidad de bits y el tipo de una imagen es el recorte. {menuselection}`Analyze --> Histogram` es el comando esencial necesario para diagnosticar si algo anda mal; simplemente presiona {kbd}`H `para ejecutarlo.
pt_br: O maior problema associado à profundidade e ao tipo de bits de uma imagem é o recorte. {menuselection}`Analyze --> Histogram` é o comando essencial necessário para diagnosticar se algo está errado - basta pressionar {kbd}`H `para executá-lo.

source: Two similar-looking images and their histograms: one clipped, one not.
de: Zwei ähnlich aussehende Bilder und ihre Histogramme: eines beschnitten, eines nicht.
es: Dos imágenes de apariencia similar y sus histogramas: una recortada, la otra no.
pt_br: Duas imagens de aparência semelhante e seus histogramas: uma cortada e outra não.

source: The main sign that an image was clipped is a big peak at either end of the histogram. This can take some careful inspection to distinguish from the black border that surrounds the histogram in ImageJ.
de: Das Hauptzeichen dafür, dass ein Bild abgeschnitten wurde, sind große Spitzen an beiden Enden des Histogramms. Dies kann eine sorgfältige Prüfung erfordern, um es vom schwarzen Rand zu unterscheiden, der das Histogramm in ImageJ umgibt.
es: La señal principal de que una imagen fue recortada es un gran pico en cada extremo del histograma. Esto puede requerir una inspección cuidadosa para distinguirlo del borde negro que rodea el histograma en ImageJ.
pt_br: O principal sinal de que uma imagem foi cortada é um grande pico em cada extremidade do histograma. Pode ser necessária uma inspeção cuidadosa para distinguir da borda preta que circunda o histograma no ImageJ.

source: If you know the bit-depth and type of the image, you can figure out the range (e.g. 0-255 for an 8-bit unsigned integer image, 0-65,535 for 16-bit) and usually that gives a good indication to where the peaks would be -- but it isn't a perfect guide. Conceivably, we could have an image that was clipped at some other value because it has been rescaled *after* clipping.
de: Wenn Sie die Bittiefe und den Typ des Bildes kennen, können Sie den Bereich ermitteln (z. B. 0-255 für ein 8-Bit-Ganzzahlbild ohne Vorzeichen, 0-65.535 für 16-Bit) und normalerweise gibt das einen guten Hinweis darauf, wo die Gipfel wären es – aber es ist kein perfekter Leitfaden. Es könnte sein, dass wir ein Bild haben, das auf einen anderen Wert zugeschnitten wurde, weil es *nach* dem Zuschneiden neu skaliert wurde.
es: Si conoces la profundidad de bits y el tipo de imagen, puedes calcular el rango (por ejemplo, 0-255 para una imagen entera sin signo de 8 bits, 0-65,535 para 16 bits) y, por lo general, eso da una buena indicación de dónde los picos estarían, pero no es una guía perfecta. Posiblemente, podríamos tener una imagen recortada con algún otro valor porque se le ha re-escalado *después* del recorte.
pt_br: Se você conhece a profundidade de bits e o tipo da imagem, poderá descobrir o intervalo (por exemplo, 0-255 para uma imagem inteira sem sinal de 8 bits, 0-65.535 para 16 bits) e geralmente isso fornece uma boa indicação de onde os picos seriam - mas não é um guia perfeito. É concebível que poderíamos ter uma imagem que foi recortada com algum outro valor porque foi redimensionada *após* o recorte.

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: Does the image below show signs of having been clipped?
de: Zeigt das Bild unten Anzeichen dafür, dass es beschnitten wurde?
es: ¿La siguiente imagen muestra signos de haber sido recortada?
pt_br: A imagem abaixo mostra sinais de ter sido cortada?

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: Yes! There is a small peak at the high end of the histogram, corresponding to pixel values of 4095. This is itself a suspicious number because it would be the maximum possible value in a 12-bit unsigned integer image (i.e. 2<sup>12</sup> - 1) -- so my guess is that was the bit-depth of the acquisition device.
de: Ja! Am oberen Ende des Histogramms gibt es eine kleine Spitze, die Pixelwerten von 4095 entspricht. Dies ist an sich eine verdächtige Zahl, da es sich um den maximal möglichen Wert in einem 12-Bit-Ganzzahlbild ohne Vorzeichen handelt (d. h. 2<sup>12</sup> - 1) – ich vermute also, dass es an der Bittiefe des Erfassungsgeräts lag.
es: ¡Sí! Hay un pequeño pico en el extremo superior del histograma, correspondiente a valores de píxeles de 4095. Este es en sí mismo un número sospechoso porque sería el valor máximo posible en una imagen entera sin signo de 12 bits (es decir, 2<sup>12</sup> - 1) - así que supongo que esa fue la profundidad de bits del dispositivo de adquisición.
pt_br: Sim! Há um pequeno pico na extremidade superior do histograma, correspondendo a valores de pixel de 4095. Este é um número suspeito porque seria o valor máximo possível em uma imagem inteira sem sinal de 12 bits (ou seja, 2<sup>12</sup> - 1) - então meu palpite é que essa foi a profundidade de bits do dispositivo de aquisição.

source: Admittedly, the image is not *very badly* clipped. We could check the proportion of pixels with that value, and use this to estimate whether it is likely that the clipping will have a significant impact upon later analysis. But it's better to avoid clipping altogether when possible.
de: Zugegebenermaßen ist das Bild nicht *sehr schlecht* beschnitten. Wir könnten den Anteil der Pixel mit diesem Wert überprüfen und damit abschätzen, ob die Beschneidung wahrscheinlich erhebliche Auswirkungen auf die spätere Analyse haben wird. Es ist jedoch besser, das Abschneiden nach Möglichkeit ganz zu vermeiden.
es: Es cierto que la imagen no está *muy mal* recortada. Podríamos comprobar la proporción de píxeles con ese valor y utilizarlo para estimar si es probable que el recorte tenga un impacto significativo en un análisis posterior. Pero es mejor evitar el recorte por completo cuando sea posible.
pt_br: É certo que a imagem não está *muito mal* cortada. Poderíamos verificar a proporção de pixels com esse valor e usá-lo para estimar se é provável que o recorte tenha um impacto significativo em análises posteriores. Mas é melhor evitar o recorte quando possível.

source: Converting images
de: Bilder konvertieren
es: Convertir imágenes
pt_br: Convertendo imagens

source: There are three main scenarios when you might need to convert the type or bit-depth of an image:
de: Es gibt drei Hauptszenarien, in denen Sie möglicherweise den Typ oder die Bittiefe eines Bildes konvertieren müssen:
es: Hay tres escenarios principales en los que es posible que necesites convertir el tipo o la profundidad de bits de una imagen:
pt_br: Existem três cenários principais em que pode ser necessário converter o tipo ou a profundidade de bits de uma imagem:

source: **Reducing the file size**
de: **Reduzierung der Dateigröße**
es: **Reducir el tamaño del archivo**
pt_br: **Reduzindo o tamanho do arquivo**

source: **Converting to 8-bit to display the image in other software**
de: **Konvertierung in 8-Bit, um das Bild in anderer Software anzuzeigen**
es: **Conversión a 8 bits para mostrar la imagen en otro software**
pt_br: **Convertendo para 8 bits para exibir a imagem em outro software**

source: Because 8-bit images are more common outside of science
de: Weil 8-Bit-Bilder außerhalb der Wissenschaft häufiger anzutreffen sind
es: Porque las imágenes de 8 bits son más comunes fuera de la ciencia
pt_br: Porque imagens de 8 bits são mais comuns fora da ciência

source: **Converting to floating-point before doing image processing operations**
de: **Konvertierung in Gleitkomma vor der Durchführung von Bildverarbeitungsvorgängen**
es: **Conversión a punto flotante antes de realizar operaciones de procesamiento de imágenes**
pt_br: **Convertendo para ponto flutuante antes de realizar operações de processamento de imagem**

source: Because (as we will see later in the book) these often require fractions and negative numbers
de: Denn (wie wir später in diesem Buch sehen werden) erfordern diese oft Brüche und negative Zahlen
es: Porque (como veremos más adelante en el libro) estos a menudo requieren fracciones y números negativos.
pt_br: Porque (como veremos mais adiante neste livro) muitas vezes requerem frações e números negativos

source: Note that *reversing* the effects of clipping isn't in the list: if an image is clipped during acquisition, any later conversion won't help. The clipped data is gone for good.
de: Beachten Sie, dass das *Umkehren* der Auswirkungen des Beschneidens nicht in der Liste enthalten ist: Wenn ein Bild während der Aufnahme beschnitten wird, hilft eine spätere Konvertierung nicht. Die abgeschnittenen Daten sind endgültig verschwunden.
es: Ten en cuenta que *revertir* los efectos del recorte no está en la lista: si una imagen se recorta durante la adquisición, cualquier conversión posterior no ayudará. Los datos recortados desaparecieron para siempre.
pt_br: Observe que *reverter* os efeitos do recorte não está na lista: se uma imagem for cortada durante a aquisição, qualquer conversão posterior não ajudará. Os dados cortados desapareceram para sempre.

source: However, you can still introduce clipping after acquisition by making ill-advised conversions -- with all the unfortunate consequences of that. Therefore it's important to know how ImageJ's type conversion works.
de: Allerdings kann es nach der Aufnahme immer noch zu Clipping kommen, indem man unüberlegte Konvertierungen vornimmt – mit all den unglücklichen Konsequenzen, die das mit sich bringt. Daher ist es wichtig zu wissen, wie die Typkonvertierung von ImageJ funktioniert.
es: Sin embargo, aún se puede introducir recorte después de la adquisición al realizar conversiones desacertadas, con todas las desafortunadas consecuencias que esto conlleva. Por lo tanto, es importante saber cómo funciona la conversión de tipos de ImageJ.
pt_br: No entanto, você ainda pode introduzir recorte após aquisição fazendo conversões imprudentes - com todas as consequências infelizes disso. Portanto é importante saber como funciona a conversão de tipo do ImageJ.

source: Increasing the bit-depth
de: Erhöhen der Bittiefe
es: Aumentar la profundidad de bits
pt_br: Aumentando a profundidade de bits

source: Let's start with the easy case: *increasing* the bit-depth of an image.
de: Beginnen wir mit dem einfachen Fall: *Erhöhen* der Bittiefe eines Bildes.
es: Comencemos con el caso fácil: *aumentar* la profundidad de bits de una imagen.
pt_br: Vamos começar com o caso fácil: *aumentar* a profundidade de bits de uma imagem.

source: In principle, we can convert an image just by choosing the type we want from the {menuselection}`Image --> Type -->` submenu.
de: Im Prinzip können wir ein Bild konvertieren, indem wir einfach den gewünschten Typ aus dem Untermenü {menuselection}`Image --> Type -->` auswählen.
es: En principio, podemos convertir una imagen simplemente eligiendo el tipo que queremos en el submenú {menuselection}`Image --> Type -->`.
pt_br: Em princípio, podemos converter uma imagem apenas escolhendo o tipo que queremos no submenu {menuselection}`Image --> Type -->`.

source: In ImageJ, there are only really three bit-depths and associated types. This means that the only conversions that can increase the bit-depth are:
de: In ImageJ gibt es eigentlich nur drei Bittiefen und zugehörige Typen. Dies bedeutet, dass die einzigen Konvertierungen, die die Bittiefe erhöhen können, folgende sind:
es: En ImageJ, en realidad sólo hay tres profundidades de bits y tipos asociados. Esto significa que las únicas conversiones que pueden aumentar la profundidad de bits son:
pt_br: No ImageJ, existem apenas três profundidades de bits e tipos associados. Isso significa que as únicas conversões que podem aumentar a profundidade de bits são:

source: 8-bit (unsigned integer) &rarr; 16-bit (unsigned integer)
de: 8-Bit (Ganzzahl ohne Vorzeichen) &rarr; 16-Bit (Ganzzahl ohne Vorzeichen)
es: 8 bits (entero sin signo) &rarr; 16 bits (entero sin signo)
pt_br: 8 bits (número inteiro sem sinal) &rarr; 16 bits (número inteiro sem sinal)

source: 8-bit (unsigned integer) &rarr; 32-bit (floating point)
de: 8-Bit (Ganzzahl ohne Vorzeichen) &rarr; 32-Bit (Gleitkomma)
es: 8 bits (entero sin signo) &rarr; 32 bits (punto flotante)
pt_br: 8 bits (número inteiro sem sinal) &rarr; 32 bits (ponto flutuante)

source: 16-bit (unsigned integer) &rarr; 32-bit (floating point)
de: 16-Bit (Ganzzahl ohne Vorzeichen) &rarr; 32-Bit (Gleitkomma)
es: 16 bits (entero sin signo) &rarr; 32 bits (punto flotante)
pt_br: 16 bits (número inteiro sem sinal) &rarr; 32 bits (ponto flutuante)

source: Fortunately,
de: Glücklicherweise,
es: Afortunadamente,
pt_br: Felizmente,

source: any 8-bit unsigned integer value can be represented in a 16-bit unsigned integer image
de: Jeder 8-Bit-Ganzzahlwert ohne Vorzeichen kann in einem 16-Bit-Ganzzahlbild ohne Vorzeichen dargestellt werden
es: cualquier valor entero sin signo de 8 bits se puede representar en una imagen de entero sin signo de 16 bits
pt_br: qualquer valor inteiro sem sinal de 8 bits pode ser representado em uma imagem inteira sem sinal de 16 bits

source: any 16-bit unsigned integer value can be represented in a 32-bit unsigned floating point image
de: Jeder vorzeichenlose 16-Bit-Ganzzahlwert kann in einem vorzeichenlosen 32-Bit-Gleitkommabild dargestellt werden
es: cualquier valor entero sin signo de 16 bits se puede representar en una imagen de punto flotante sin signo de 32 bits
pt_br: qualquer valor inteiro não assinado de 16 bits pode ser representado em uma imagem de ponto flutuante não assinado de 32 bits

source: Consequently, increasing the bit-depth *should* always be safe. That being said...
de: Folglich *sollte* eine Erhöhung der Bittiefe immer sicher sein. Davon abgesehen...
es: En consecuencia, aumentar la profundidad de bits *debería* ser siempre seguro. Sin embargo...
pt_br: Conseqüentemente, aumentar a profundidade de bits *deve* ser sempre seguro. Dito isto...

source: Always prepare for software to surprise us!
de: Seien Sie immer darauf gefasst, dass Software uns überrascht!
es: ¡Prepárate siempre para que el software nos sorprenda!
pt_br: Prepare-se sempre para que o software nos surpreenda!
