Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/1-processing_and_analysis/processing_and_analysis.po
Languages: de, es

source: Image processing & analysis
de: Bildverarbeitung und -analyse
es: Tratamiento y análisis de imágenes

source: Chapter outline
de: Gliederung des Kapitels
es: Esquema del capítulo

source: **Image processing** involves changing images, usually in ways that will help interpretation later
de: Bei der **Bildverarbeitung** werden Bilder verändert, in der Regel so, dass sie später besser interpretiert werden können.
es: **El tratamiento de imágenes** consiste en modificarlas, normalmente para facilitar su posterior interpretación.

source: **Image analysis** involves converting images into measurements
de: Die **Bildanalyse** umfasst die Umwandlung von Bildern in Messungen
es: **El análisis de imágenes** consiste en convertir las imágenes en medidas.

source: When image analysis is our goal, we almost always need image processing to get there
de: Wenn Bildanalyse unser Ziel ist, brauchen wir fast immer Bildverarbeitung, um dorthin zu gelangen.
es: Cuando nuestro objetivo es el análisis de imágenes, casi siempre necesitamos el procesamiento de imágenes para conseguirlo

source: Introduction
de: Einführung
es: Introducción

source: Successfully extracting useful information from microscopy images usually requires triumphing in two main battles.
de: Die erfolgreiche Extraktion nützlicher Informationen aus Mikroskopie-Bildern erfordert in der Regel einen Sieg in zwei wichtigen Kämpfen.
es: Para extraer con éxito información útil de las imágenes de microscopía suele ser necesario triunfar en dos batallas principales.

source: The first is to overcome limitations in image quality and make the really interesting image content more clearly visible. This involves **image processing**, the output of which is another image. The second is to compute meaningful measurements, which could be presented in tables and summary plots. This is **image analysis**.
de: Die erste besteht darin, die Einschränkungen der Bildqualität zu überwinden und die wirklich interessanten Bildinhalte deutlicher sichtbar zu machen. Dies erfordert eine **Bildverarbeitung**, deren Ergebnis ein anderes Bild ist. Die zweite besteht darin, aussagekräftige Messwerte zu berechnen, die in Tabellen und zusammenfassenden Diagrammen dargestellt werden können. Dies ist die **Bildanalyse**.
es: La primera consiste en superar las limitaciones de calidad de la imagen y hacer que el contenido realmente interesante de la imagen sea más claramente visible. Se trata de **procesar la imagen**, cuyo resultado es otra imagen. La segunda consiste en calcular mediciones significativas que puedan presentarse en tablas y gráficos de resumen. Esto es el **análisis de imágenes**.

source: Our main goal here is analysis -- but processing is almost always indispensable to get us there.
de: Unser Hauptziel ist die Analyse - aber die Verarbeitung ist fast immer unerlässlich, um dieses Ziel zu erreichen.
es: Nuestro principal objetivo es el análisis, pero el procesamiento es casi siempre indispensable para conseguirlo.

source: An image analysis workflow
de: Ein Arbeitsablauf zur Bildanalyse
es: Un flujo de trabajo de análisis de imágenes

source: So how do we figure out how to analyze our images?
de: Wie können wir also herausfinden, wie wir unsere Bilder analysieren können?
es: ¿Cómo podemos analizar nuestras imágenes?

source: Ultimately, we need some kind of workflow comprising multiple steps that eventually take us from image to results. Each individual step might be small and straightforward, but the combination is powerful.
de: Letztlich brauchen wir eine Art Arbeitsablauf, der mehrere Schritte umfasst, die uns schließlich vom Bild zum Ergebnis führen. Jeder einzelne Schritt mag klein und überschaubar sein, aber die Kombination ist leistungsstark.
es: En última instancia, necesitamos algún tipo de flujo de trabajo que comprenda múltiples pasos que finalmente nos lleven de la imagen a los resultados. Cada paso individual puede ser pequeño y sencillo, pero la combinación es poderosa.

source: I tend to view the challenge of constructing any scientific image analysis workflow as akin to solving a puzzle. In the end, we hope to extract some kind of quantitative measurements that are justified by the nature of the experiment and the facts of image formation. One of the interesting features of the puzzle is that there is no single, fixed solution.
de: Ich neige dazu, die Herausforderung des Aufbaus eines wissenschaftlichen Bildanalyse-Workflows als die Lösung eines Puzzles zu betrachten. Am Ende hoffen wir, eine Art von quantitativen Messungen zu erhalten, die durch die Art des Experiments und die Fakten der Bildentstehung gerechtfertigt sind. Eine der interessanten Eigenschaften des Rätsels ist, dass es keine einzige, feste Lösung gibt.
es: Tiendo a considerar el reto de construir cualquier flujo de trabajo de análisis científico de imágenes como algo parecido a resolver un rompecabezas. Al final, esperamos extraer algún tipo de medida cuantitativa que esté justificada por la naturaleza del experimento y los hechos de la formación de imágenes. Una de las características interesantes del rompecabezas es que no existe una solución única y fija.

source: Although this might initially seem inconvenient, it can be liberating: it suggests there is room for lateral thinking and sparks of creativity. The same images could be analyzed in quite different ways. Sometimes giving quite different results, or answering quite different scientific questions.
de: Auch wenn dies zunächst unbequem erscheinen mag, kann es doch befreiend sein: Es zeigt, dass es Raum für Querdenken und einen Funken Kreativität gibt. Dieselben Bilder können auf ganz unterschiedliche Weise analysiert werden. Das führt manchmal zu ganz anderen Ergebnissen oder Antworten auf ganz andere wissenschaftliche Fragen.
es: Aunque en principio esto pueda parecer inconveniente, puede ser liberador: sugiere que hay espacio para el pensamiento lateral y los chispazos de creatividad. Las mismas imágenes pueden analizarse de formas muy distintas. A veces dando resultados muy distintos, o respondiendo a preguntas científicas muy diferentes.

source: Admittedly, if no solution comes to mind after pondering for a while then such an optimistic outlook quickly subsides, and the 'puzzle' may very well turn into an unbearably infuriating 'problem' -- but the point here is that _in principle_ image analysis _can_ be enjoyable. What it takes is:
de: Zugegeben, wenn einem nach einer Weile des Grübelns keine Lösung einfällt, dann lässt der Optimismus schnell nach, und aus dem "Rätsel" kann durchaus ein unerträglich ärgerliches "Problem" werden - aber es geht hier darum, dass Bildanalyse _im Prinzip_ Spaß machen kann. Was es braucht, ist:
es: Es cierto que si no se le ocurre ninguna solución después de reflexionar durante un rato, esa perspectiva optimista se desvanece rápidamente y el "rompecabezas" puede convertirse en un "problema" insoportablemente exasperante, pero la cuestión es que _en principio_ el análisis de imágenes _puede_ ser divertido. Lo que hace falta es

source: a modicum of enthusiasm (please bring your own)
de: ein gewisses Maß an Enthusiasmus (bitte bringen Sie Ihren eigenen mit)
es: un mínimo de entusiasmo (traiga el suyo)

source: properly-acquired data, including all the necessary metadata (the subject of Part I)
de: ordnungsgemäß beschaffte Daten, einschließlich aller erforderlichen Metadaten (Gegenstand von Teil I)
es: datos adquiridos correctamente, incluidos todos los metadatos necesarios (objeto de la Parte I)

source: actually *having the tools at your disposal* to solve the puzzle (the subject Part II)
de: tatsächlich *die Werkzeuge zur Verfügung zu haben*, um das Rätsel zu lösen (das Thema Teil II)
es: realmente *tener las herramientas a tu disposición* para resolver el rompecabezas (el tema Parte II)

source: If you're a reluctant puzzler then it also helps to have the good luck not to be working on something horrendously difficult, but that is difficult to control.
de: Wenn Sie nur ungern puzzeln, dann hilft es auch, wenn Sie das Glück haben, nicht an etwas schrecklich Schwierigem zu arbeiten, das aber schwer zu kontrollieren ist.
es: Si eres un rompecabezas reacio, también ayuda tener la suerte de no estar trabajando en algo horrorosamente difícil, pero que es difícil de controlar.

source: Combining processing tools
de: Kombinierte Verarbeitungswerkzeuge
es: Combinación de herramientas de tratamiento

source: Image processing provides a whole host of tools that can be applied to puzzle-solving. When piecing together processing steps to form a workflow, we usually have two main stages:
de: Die Bildverarbeitung bietet eine ganze Reihe von Werkzeugen, die zum Lösen von Rätseln eingesetzt werden können. Beim Zusammensetzen von Verarbeitungsschritten zu einem Arbeitsablauf gibt es normalerweise zwei Hauptstufen:
es: El procesamiento de imágenes ofrece toda una serie de herramientas que pueden aplicarse a la resolución de puzzles. Al unir los pasos de procesamiento para formar un flujo de trabajo, solemos tener dos etapas principales:

source: **Preprocessing**: the stuff you do to clean up the image, e.g. subtract the background, use a filter to reduce noise
de: **Vorverarbeitung**: die Dinge, die Sie tun, um das Bild zu bereinigen, z. B. den Hintergrund abziehen, einen Filter verwenden, um das Rauschen zu reduzieren
es: **Preprocesamiento**: lo que haces para limpiar la imagen, por ejemplo, restar el fondo, utilizar un filtro para reducir el ruido

source: **Segmentation** the stuff you do to identify the things in the image you care about, e.g. apply a threshold to locate interesting features
de: **Segmentierung** das, was Sie tun, um die Dinge im Bild zu identifizieren, die Sie interessieren, z. B. einen Schwellenwert anwenden, um interessante Merkmale zu finden
es: **Segmentación** lo que haces para identificar las cosas de la imagen que te interesan, por ejemplo, aplicar un umbral para localizar características interesantes.

source: Having successfully navigated these stages, there are usually some additional tasks remaining (e.g. making measurements of shape, intensity or dynamics). However, these depend upon the specifics of the application and are *usually* not the hard part. If you can identify what you want to quantify, you're a long way towards solving the puzzle.
de: Nach erfolgreicher Bewältigung dieser Phasen verbleiben in der Regel noch einige zusätzliche Aufgaben (z. B. Messungen von Form, Intensität oder Dynamik). Diese hängen jedoch von den Besonderheiten der Anwendung ab und sind *in der Regel* nicht der schwierige Teil. Wenn Sie wissen, was Sie quantifizieren wollen, sind Sie der Lösung des Rätsels schon ein gutes Stück näher gekommen.
es: Una vez superadas estas etapas, suelen quedar algunas tareas adicionales (por ejemplo, realizar mediciones de la forma, la intensidad o la dinámica). Sin embargo, éstas dependen de las características específicas de la aplicación y *normalmente* no son lo más difícil. Si eres capaz de identificar lo que quieres cuantificar, estarás muy cerca de resolver el rompecabezas.

source: {numref}`fig-workflow` shows an example of how these ideas can fit together.
de: {numref}Fig-Workflow" zeigt ein Beispiel dafür, wie diese Ideen zusammenpassen können.
es: {numref}`fig-workflow` muestra un ejemplo de cómo pueden encajar estas ideas.

source: A simple image analysis workflow for detecting and measuring spots in an image.
de: Ein einfacher Bildanalyse-Workflow zur Erkennung und Messung von Flecken in einem Bild.
es: Un sencillo flujo de trabajo de análisis de imágenes para detectar y medir manchas en una imagen.

source: It won't be possible to cover *all* image processing tools in a book like this. Rather, we will focus on the essential ones needed to get started: thresholds, filters, morphological operations and transforms.
de: Es wird nicht möglich sein, *alle* Bildverarbeitungswerkzeuge in einem Buch wie diesem zu behandeln. Vielmehr werden wir uns auf die wichtigsten konzentrieren, die man für den Einstieg braucht: Schwellenwerte, Filter, morphologische Operationen und Transformationen.
es: No será posible abarcar *todas* las herramientas de tratamiento de imágenes en un libro como éste. Más bien nos centraremos en las esenciales para empezar: umbrales, filtros, operaciones morfológicas y transformaciones.

source: These are already enough to solve many image analysis puzzles, and provide the framework to which more can be added later.
de: Diese reichen bereits aus, um viele Rätsel der Bildanalyse zu lösen, und bilden den Rahmen, zu dem später weitere hinzugefügt werden können.
es: Estos ya son suficientes para resolver muchos enigmas del análisis de imágenes, y proporcionan el marco al que se pueden añadir más posteriormente.
