Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/1-formation_overview/formation_overview.po
Languages: de, es, pt_br

source: From photons to pixels
de: Von Photonen zu Pixeln
es: De fotones a píxeles
pt_br: De fótons a pixels

source: Chapter outline
de: Gliederung des Kapitels
es: Bosquejo del capítulo
pt_br: Esboço do capítulo

source: The **pixel values** in a fluorescence image depend upon **numbers of detected photons**
de: Die **Pixelwerte** in einem Fluoreszenzbild hängen von der **Anzahl der erkannten Photonen** ab
es: Los **valores de píxeles** en una imagen de fluorescencia dependen del **número de fotones detectados**
pt_br: Os **valores de pixel** em uma imagem de fluorescência dependem do **número de fótons detectados**

source: Our images can't be perfect: **blur & noise** are inevitable
de: Unsere Bilder können nicht perfekt sein: **Unschärfe und Rauschen** sind unvermeidlich
es: Nuestras imágenes no pueden ser perfectas: el **desenfoque y el ruido** son inevitables
pt_br: Nossas imagens não podem ser perfeitas: **desfoque e ruído** são inevitáveis

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: One of the most common imaging modalities associated with bioimage analysis is fluorescence microscopy. Applying the analysis techniques described in this book meaningfully to fluorescence images involves understanding a bit about the imaging process.
de: Eine der häufigsten Bildgebungsmodalitäten im Zusammenhang mit der Bioimage-Analyse ist die Fluoreszenzmikroskopie. Um die in diesem Buch beschriebenen Analysetechniken sinnvoll auf Fluoreszenzbilder anwenden zu können, muss man ein wenig über den Bildgebungsprozess wissen.
es: Una de las modalidades más comunes de bioimagenología, asociadas con el análisis de imágenes es la microscopía de fluorescencia. Aplicar de manera significativa las técnicas de análisis descritas en este libro a imágenes de fluorescencia implica entender un poco acerca del proceso de obtención de imágenes.
pt_br: Uma das modalidades de imagem mais comuns associadas à análise de bioimagem é a microscopia de fluorescência. Aplicar as técnicas de análise descritas neste livro de forma significativa às imagens de fluorescência envolve compreender um pouco sobre o processo de imagem.

source: Part III aim to provide an introduction to the main ideas, along with some useful mental models to help relate analysis techniques to imaging realities. These ideas can help with figuring out how to acquire and analyze fluorescence microscopy data in scientifically justifiable ways.
de: Teil III soll eine Einführung in die wichtigsten Ideen bieten, zusammen mit einigen nützlichen mentalen Modellen, die helfen sollen, Analysetechniken mit der Realität der Bildgebung zu verbinden. Diese Ideen können dabei helfen, herauszufinden, wie man Fluoreszenzmikroskopiedaten auf wissenschaftlich vertretbare Weise erfasst und analysiert.
es: La Parte III tiene como objetivo proporcionar una introducción a las ideas principales, junto con algunos modelos mentales útiles para ayudar a relacionar las técnicas de análisis con las realidades de la microscopía. Estas ideas pueden ayudar a descubrir cómo adquirir y analizar datos de microscopía de fluorescencia de manera científicamente justificable.
pt_br: A Parte III visa fornecer uma introdução às ideias principais, juntamente com alguns modelos mentais úteis para ajudar a relacionar técnicas de análise com realidades de imagem. Essas ideias podem ajudar a descobrir como adquirir e analisar dados de microscopia de fluorescência de maneiras cientificamente justificáveis.

source: The big picture of fluorescence imaging
de: Das große Bild der Fluoreszenzbildgebung
es: El panorama general de las microscopía de fluorescencia
pt_br: O panorama geral da imagem por fluorescência

source: Images in fluorescence microscopy are formed by detecting light. The amounts of light involved are so small that they can be thought of in terms of individual photons.
de: Die Bilder in der Fluoreszenzmikroskopie entstehen durch die Detektion von Licht. Die beteiligten Lichtmengen sind so gering, dass man sie sich als einzelne Photonen vorstellen kann.
es: Las imágenes en microscopía de fluorescencia se forman detectando luz. Las cantidades de luz involucradas son tan pequeñas que pueden considerarse en términos de fotones individuales.
pt_br: Imagens em microscopia de fluorescência são formadas pela detecção de luz. As quantidades de luz envolvidas são tão pequenas que podem ser pensadas em termos de fótons individuais.

source: The photons are emitted from fluorescent molecules within the sample being imaged. Sometimes these photon-emitting molecules may be the very things we are interested in studying, but often they have only been introduced to the sample because they have the helpful property of fluorescing in the presence of the (otherwise non-fluorescent) molecules or structures we would _really_ like to see.
de: Die Photonen werden von fluoreszierenden Molekülen in der abzubildenden Probe emittiert. Manchmal sind diese Photonen emittierenden Moleküle genau die Dinge, die wir untersuchen wollen, aber oft wurden sie nur in die Probe eingebracht, weil sie die hilfreiche Eigenschaft haben, in Gegenwart der (ansonsten nicht fluoreszierenden) Moleküle oder Strukturen zu fluoreszieren, die wir _wirklich_ gerne sehen würden.
es: Los fotones son emitidos por moléculas fluorescentes dentro de la muestra de la que se están tomando imágenes. A veces, estas moléculas emisoras de fotones pueden ser precisamente las cosas que nos interesa estudiar, pero a menudo sólo se han introducido en la muestra porque tienen la útil propiedad de fluorescer en presencia de las moléculas o estructuras que realmente nos gustaría visualizar (que de otra forma no serían fluorescentes).
pt_br: Os fótons são emitidos por moléculas fluorescentes dentro da amostra que está sendo fotografada. Às vezes, essas moléculas emissoras de fótons podem ser exatamente aquilo que estamos interessados em estudar, mas muitas vezes elas só foram introduzidas na amostra porque têm a propriedade útil de fluorescência na presença de moléculas ou estruturas (de outra forma não fluorescentes) que nós _realmente_ gostaria de ver.

source: Either way, the most that the image can tell us is how much light was emitted from any particular point in the sample. From this information we make our interpretations, such as about the presence of absence of some feature, about the size and shape of a structure, or about the relative concentration of a molecule. But in no case are we *seeing* the feature, structure or molecule directly in the recorded images: we only have measurements of the numbers of photons we could detect, encoded in pixel values.
de: In jedem Fall kann uns das Bild höchstens sagen, wie viel Licht von einem bestimmten Punkt der Probe ausgestrahlt wurde. Aus dieser Information ziehen wir unsere Interpretationen, z. B. über das Vorhandensein oder Nichtvorhandensein eines Merkmals, über die Größe und Form einer Struktur oder über die relative Konzentration eines Moleküls. Aber in keinem Fall *sehen* wir das Merkmal, die Struktur oder das Molekül direkt in den aufgenommenen Bildern: wir haben nur Messungen der Anzahl der Photonen, die wir erkennen konnten, kodiert in Pixelwerten.
es: De cualquier manera, lo más que la imagen puede decirnos es cuánta luz se emitió desde un punto particular de la muestra. A partir de esta información hacemos nuestras interpretaciones, como por ejemplo sobre la presencia o ausencia de alguna característica, sobre el tamaño y la forma de una estructura, o sobre la concentración relativa de una molécula. Pero en ningún caso *vemos* la característica, estructura o molécula directamente en las imágenes grabadas: sólo tenemos medidas de la cantidad de fotones que pudimos detectar, codificadas en valores de píxeles.
pt_br: De qualquer forma, o máximo que a imagem pode nos dizer é quanta luz foi emitida por qualquer ponto específico da amostra. A partir dessas informações fazemos nossas interpretações, como sobre a presença ou ausência de alguma característica, sobre o tamanho e a forma de uma estrutura, ou sobre a concentração relativa de uma molécula. Mas em nenhum caso estamos *vendo* a característica, estrutura ou molécula diretamente nas imagens gravadas: apenas temos medições do número de fótons que conseguimos detectar, codificados em valores de pixel.

source: We won't give much attention here to what any particular number of photons emanating from a sample really indicates from a biological point of view -- this would depend too much upon the design and details of the experiment, i.e. on the cells, stains and other substances involved. We can, however, often make general assumptions. One such assumption is that if we were to see (on average) twice as many photons originating from one region as from another, the number of fluorescing molecules must be around twice as high in the first region [^fn_1]. But before we can worry about such things, we should consider how accurately we can even determine the number and origins of photons being emitted from the sample in the first place, given the limited quality of the images we can actually record.
de: Wir werden hier nicht näher darauf eingehen, was eine bestimmte Anzahl von Photonen, die von einer Probe ausgehen, aus biologischer Sicht wirklich bedeutet - dies würde zu sehr von der Gestaltung und den Details des Experiments abhängen, d. h. von den beteiligten Zellen, Färbemitteln und anderen Substanzen. Wir können jedoch oft allgemeine Annahmen treffen. Eine dieser Annahmen ist, dass, wenn wir (im Durchschnitt) doppelt so viele Photonen sehen, die aus einer Region stammen als aus einer anderen, die Anzahl der fluoreszierenden Moleküle in der ersten Region etwa doppelt so hoch sein muss [^fn_1]. Doch bevor wir uns über solche Dinge Gedanken machen, sollten wir uns überlegen, wie genau wir angesichts der begrenzten Qualität der Bilder, die wir tatsächlich aufnehmen können, überhaupt die Anzahl und den Ursprung der von der Probe emittierten Photonen bestimmen können.
es: No prestaremos mucha atención aquí a lo que realmente indica un número particular de fotones que emana de una muestra desde un punto de vista biológico - esto dependería demasiado del diseño y los detalles del experimento, es decir, de las células, las tinciones y otras sustancias involucradas. Sin embargo, a menudo podemos hacer suposiciones generales. Una de esas suposiciones es que si viéramos (en promedio) el doble de fotones provenientes de una región que de otra, la cantidad de moléculas fluorescentes debe ser aproximadamente el doble en la primera región [^fn_1]. Pero antes de que podamos preocuparnos por tales cosas, primero debemos considerar con qué precisión podemos siquiera determinar el número y los orígen de los fotones emitidos por la muestra, dada la calidad limitada de las imágenes que realmente podemos registrar.
pt_br: Não daremos muita atenção aqui ao que qualquer número específico de fótons emanados de uma amostra realmente indica do ponto de vista biológico - isso dependeria muito do projeto e dos detalhes do experimento, ou seja, das células, manchas e outras substâncias envolvidas. Podemos, no entanto, muitas vezes fazer suposições gerais. Uma dessas suposições é que se víssemos (em média) duas vezes mais fótons originados de uma região do que de outra, o número de moléculas fluorescentes deveria ser cerca de duas vezes maior na primeira região [^fn_1]. Mas antes de podermos nos preocupar com essas coisas, devemos considerar com que precisão podemos determinar o número e as origens dos fótons emitidos pela amostra, dada a qualidade limitada das imagens que podemos realmente registrar.

source: Recording images
de: Aufnahme von Bildern
es: Grabación de imágenes
pt_br: Gravando imagens

source: We already introduced a simple model of fluorescence image formation in {ref}`chap_pixels` with two animations. The first animation shows the overall process:
de: Wir haben bereits ein einfaches Modell der Fluoreszenzbildbildung in {ref}`chap_pixels` mit zwei Animationen vorgestellt. Die erste Animation zeigt den Gesamtprozess:
es: Ya presentamos un modelo simple de formación de imágenes de fluorescencia en {ref}`chap_pixels` con dos animaciones. La primera animación muestra el proceso general:
pt_br: Já introduzimos um modelo simples de formação de imagens de fluorescência em {ref}`chap_pixels` com duas animações. A primeira animação mostra o processo geral:

source: The second animation zooms in to give more detail on photon detection, and how this ultimately leads to pixel values being stored in a digital image:
de: Die zweite Animation zoomt heran, um die Erkennung von Photonen und die damit verbundene Speicherung von Pixelwerten in einem digitalen Bild näher zu erläutern:
es: La segunda animación se acerca para brindar más detalles sobre la detección de fotones y cómo esto finalmente conduce a que los valores de los píxeles se almacenen en una imagen digital:
pt_br: A segunda animação aumenta o zoom para fornecer mais detalhes sobre a detecção de fótons e como isso leva ao armazenamento de valores de pixel em uma imagem digital:

source: It will be helpful to keep this model in mind throughout the following sections.
de: Es wird hilfreich sein, sich dieses Modell in den folgenden Abschnitten vor Augen zu halten.
es: Será útil tener presente este modelo a lo largo de las siguientes secciones.
pt_br: Será útil manter esse modelo em mente nas seções seguintes.

source: Once a sample has been prepared and is waiting underneath the microscope, the basic process of recording a fluorescence image comprises four main steps:
de: Sobald eine Probe vorbereitet ist und unter dem Mikroskop wartet, umfasst der grundlegende Prozess der Aufnahme eines Fluoreszenzbildes vier Hauptschritte:
es: Una vez que se ha preparado una muestra y espera debajo del microscopio, el proceso básico de registrar una imagen de fluorescencia comprende cuatro pasos principales:
pt_br: Depois que uma amostra foi preparada e aguarda sob o microscópio, o processo básico de gravação de uma imagem de fluorescência compreende quatro etapas principais:

source: **Fluorophore excitation.** The fluorescent molecules (fluorophores) first need to be raised into an excited state. This happens upon the absorption of a photon, the energy (i.e. wavelength) of which should fall into a range specific to the fluorophore itself. This is carried out by illuminating the sample, e.g. with a lamp or laser.
de: **Fluorophoranregung.** Die fluoreszierenden Moleküle (Fluorophore) müssen zunächst in einen angeregten Zustand gebracht werden. Dies geschieht durch die Absorption eines Photons, dessen Energie (d. h. Wellenlänge) in einen für das Fluorophor selbst spezifischen Bereich fallen sollte. Dies geschieht durch Beleuchtung der Probe, z. B. mit einer Lampe oder einem Laser.
es: **Excitación de fluoróforos.** Las moléculas fluorescentes (fluoróforos) primero deben elevarse a un estado excitado. Esto sucede tras la absorción de un fotón, cuya energía (es decir, longitud de onda) debe caer en un rango específico del propio fluoróforo. Esto se lleva a cabo iluminando la muestra, por ejemplo, con una lámpara o un láser.
pt_br: **Excitação de fluoróforos.** As moléculas fluorescentes (fluoróforos) primeiro precisam ser elevadas a um estado excitado. Isto acontece após a absorção de um fóton, cuja energia (isto é, comprimento de onda) deve cair em uma faixa específica do próprio fluoróforo. Isto é realizado iluminando a amostra, por ex. com uma lâmpada ou laser.

source: **Photon emission.** When returning to its ground state, each fluorophore may emit a photon –- this time with a lower energy (i.e. longer wavelength) than the photon previously absorbed.
de: **Photonenemission.** Bei der Rückkehr in den Grundzustand kann jedes Fluorophor ein Photon emittieren - diesmal mit einer geringeren Energie (d. h. einer längeren Wellenlänge) als das zuvor absorbierte Photon.
es: **Emisión de fotones.** Al regresar a su estado fundamental, cada fluoróforo puede emitir un fotón, esta vez con una energía más baja (es decir, una longitud de onda más larga) que el fotón previamente absorbido.
pt_br: **Emissão de fótons.** Ao retornar ao seu estado fundamental, cada fluoróforo pode emitir um fóton – desta vez com uma energia mais baixa (ou seja, comprimento de onda mais longo) do que o fóton previamente absorvido.

source: **Photon detection.** Most emitted photons can be thought of, rather informally, as 'shooting off in the wrong direction', in which case we have no hope of detecting them. But a proportion of the light should enter the objective lens of the microscope and be focussed towards a detector. When a photon strikes the detector, it is registered as a 'hit' by the release of an electron (if we're lucky; detectors are imperfect so this might not occur, meaning the photon is effectively lost).
de: **Photonendetektion.** Die meisten emittierten Photonen kann man sich, eher informell, als "in die falsche Richtung schießend" vorstellen, in diesem Fall haben wir keine Hoffnung, sie zu entdecken. Ein Teil des Lichts sollte jedoch in die Objektivlinse des Mikroskops eintreten und auf einen Detektor fokussiert werden. Wenn ein Photon auf den Detektor trifft, wird es durch die Freisetzung eines Elektrons als "Treffer" registriert (wenn wir Glück haben; Detektoren sind unvollkommen, so dass dies möglicherweise nicht geschieht, was bedeutet, dass das Photon praktisch verloren ist).
es: **Detección de fotones.** Se puede considerar, de manera bastante informal, que la mayoría de los fotones emitidos "salen dirigidos en la dirección equivocada", en cuyo caso no tenemos ninguna esperanza de detectarlos. Pero una parte de la luz debe entrar en el objetivo del microscopio y enfocarse hacia un detector. Cuando un fotón golpea el detector, se registra como un "golpe" por la liberación de un electrón (si tenemos suerte; los detectores son imperfectos, por lo que esto podría no ocurrir, lo que significa que el fotón se pierde efectivamente).
pt_br: **Detecção de fótons.** A maioria dos fótons emitidos pode ser considerada, de maneira bastante informal, como “disparando na direção errada”, caso em que não temos esperança de detectá-los. Mas uma proporção da luz deve entrar na lente objetiva do microscópio e ser focada em um detector. Quando um fóton atinge o detector, ele é registrado como um “acerto” pela liberação de um elétron (se tivermos sorte; os detectores são imperfeitos, então isso pode não ocorrer, o que significa que o fóton é efetivamente perdido).

source: **Quantification & storage.** After fixed time intervals, the charges of the electrons produced by photons striking the detector are quantified, and from these quantifications pixel values are determined. A larger charge indicates more photons, which translates into a higher pixel value.
de: **Quantifizierung und Speicherung** Nach festgelegten Zeitintervallen werden die Ladungen der Elektronen, die durch die auf den Detektor auftreffenden Photonen erzeugt werden, quantifiziert, und aus diesen Quantifizierungen werden Pixelwerte bestimmt. Eine größere Ladung bedeutet mehr Photonen, was sich in einem höheren Pixelwert niederschlägt.
es: **Cuantificación y almacenamiento.** Después de intervalos de tiempo fijos, se cuantifican las cargas de los electrones producidos por los fotones que golpean el detector y, a partir de estas cuantificaciones, se determinan los valores de los píxeles. Una carga mayor indica más fotones, lo que se traduce en un valor de píxel más alto.
pt_br: **Quantificação e armazenamento.** Após intervalos de tempo fixos, as cargas dos elétrons produzidos pelos fótons que atingem o detector são quantificadas e, a partir dessas quantificações, são determinados os valores dos pixels. Uma carga maior indica mais fótons, o que se traduz em um valor de pixel mais alto.

source: Errors and imprecisions
de: Fehler und Ungenauigkeiten
es: Errores e imprecisiones
pt_br: Erros e imprecisões

source: From the above summary, it's clear that we are quite some distance away from knowing exactly how much light is emitted from the sample: most photons do not reach the detector, and many that do are still not registered. But since we can expect to always lose track of a similar proportion of emitted light -- perhaps as much as 90% -- this does not matter much: we can expect all parts of the image to be similarly affected, so relative differences in brightness would still be reflected in our pixel values.
de: Aus der obigen Zusammenfassung wird deutlich, dass wir weit davon entfernt sind, genau zu wissen, wie viel Licht von der Probe emittiert wird: Die meisten Photonen erreichen den Detektor nicht, und viele, die es tun, werden immer noch nicht registriert. Da wir aber davon ausgehen können, dass immer ein ähnlicher Anteil des emittierten Lichts - vielleicht sogar 90 % - verloren geht, spielt dies keine große Rolle: Wir können davon ausgehen, dass alle Teile des Bildes in ähnlicher Weise betroffen sind, so dass sich relative Helligkeitsunterschiede immer noch in unseren Pixelwerten widerspiegeln würden.
es: Del resumen anterior, queda claro que estamos bastante lejos de saber exactamente cuánta luz emite la muestra: la mayoría de los fotones no llegan al detector, y muchos de los que lo hacen aún no están registrados. Pero ya que es posible asumir que perdemos siempre una proporción similar de luz emitida (tal vez hasta el 90%), esto no importa mucho: podemos esperar que todas las partes de la imagen se vean afectadas de manera similar, por lo que las diferencias relativas en el brillo todavía se reflejarán en nuestros valores de píxeles.
pt_br: A partir do resumo acima, fica claro que ainda estamos bastante longe de saber exatamente quanta luz é emitida pela amostra: a maioria dos fótons não atinge o detector, e muitos que chegam ainda não são registrados. Mas como podemos esperar sempre perder de vista uma proporção semelhante de luz emitida - talvez até 90% - isto não importa muito: podemos esperar que todas as partes da imagem sejam afetadas de forma semelhante, portanto, diferenças relativas no brilho ainda seria refletido em nossos valores de pixel.

source: However, this isn't our only limit. There are two more critical ways in which the images we can record are worse than the images we would like:
de: Das ist jedoch nicht unsere einzige Grenze. Es gibt zwei weitere kritische Aspekte, bei denen die Bilder, die wir aufnehmen können, schlechter sind als die Bilder, die wir gerne hätten:
es: Sin embargo, este no es nuestro único límite. Hay dos formas más críticas en las que las imágenes que podemos grabar son peores que las imágenes que querríamos:
pt_br: No entanto, este não é o nosso único limite. Existem duas maneiras mais críticas pelas quais as imagens que podemos registrar são piores do que as imagens que gostaríamos:
