Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/1-formation_overview/formation_overview.po
Languages: de, es, pt_br

source: **Uncertainty in space.** Ideally, all light originating from a particular point in the sample would strike the detector in exactly the same place, and therefore contribute to exactly the same pixel. In practice, however, _the light originating from one point can't be focused back to a single point on the detector_. Consequently, it can end up being spread over several pixels. The end result is that the image is _blurred_.
de: **Ungenauigkeit im Raum.** Im Idealfall würde alles Licht, das von einem bestimmten Punkt in der Probe ausgeht, an genau derselben Stelle auf den Detektor treffen und daher zu genau demselben Pixel beitragen. In der Praxis kann jedoch _das von einem Punkt ausgehende Licht nicht auf einen einzigen Punkt auf dem Detektor fokussiert werden_. Daher kann es sich über mehrere Pixel verteilen. Das Endergebnis ist, dass das Bild _unscharf_ ist.
es: **Incertidumbre en el espacio.** Idealmente, toda la luz que se origina de un punto particular en la muestra incidiría en el detector exactamente en el mismo lugar y, por lo tanto, contribuiría a exactamente el mismo píxel. Sin embargo, en la práctica, la luz que se origina de un punto no se puede enfocar hacia un único punto del detector. En consecuencia, puede acabar repartido entre varios píxeles. El resultado final es que la imagen está _borrosa_.
pt_br: **Incerteza no espaço.** Idealmente, toda a luz originada de um determinado ponto da amostra atingiria o detector exatamente no mesmo lugar e, portanto, contribuiria exatamente para o mesmo pixel. Na prática, porém, _a luz originada de um ponto não pode ser focada de volta para um único ponto do detector_. Consequentemente, pode acabar espalhado por vários pixels. O resultado final é que a imagem fica _desfocada_.

source: **Uncertainty in brightness.** When an image is blurry we would also expect it to be smooth, but this is not usually what we get in fluorescence microscopy. Rather, there are seemingly random variations in brightness everywhere throughout the image: the _noise_. Some noise can come from imprecisions when determining the charge of small clouds of electrons quickly. But, more fundamentally, _the emission of the photons is itself random_. This means that even if we could detect every photon perfectly we would *still* get noisy images.
de: **Unschärfe in der Helligkeit.** Wenn ein Bild unscharf ist, würden wir auch erwarten, dass es glatt ist, aber das ist bei der Fluoreszenzmikroskopie normalerweise nicht der Fall. Vielmehr gibt es scheinbar zufällige Helligkeitsschwankungen überall im Bild: das _Rauschen_. Ein Teil des Rauschens kann durch Ungenauigkeiten bei der schnellen Bestimmung der Ladung von kleinen Elektronenwolken entstehen. Aber im Grunde genommen ist _die Emission der Photonen selbst zufällig_. Das heißt, selbst wenn wir jedes Photon perfekt erfassen könnten, würden wir *immer noch* verrauschte Bilder erhalten.
es: **Incertidumbre en el brillo.** Cuando una imagen está borrosa, también esperaríamos que fuera suave, pero esto no suele ser lo que obtenemos en la microscopía de fluorescencia. Más bien, hay variaciones aparentemente aleatorias de brillo en todas partes de la imagen: el _ruido_. Algo de ruido puede provenir de imprecisiones al determinar rápidamente la carga de pequeñas nubes de electrones. Pero, más fundamentalmente, la emisión de fotones es en sí misma aleatoria. Esto significa que incluso si pudiéramos detectar cada fotón perfectamente *aún así* obtendríamos imágenes ruidosas.
pt_br: **Incerteza no brilho.** Quando uma imagem está borrada, também esperaríamos que ela fosse suave, mas geralmente não é isso que obtemos na microscopia de fluorescência. Em vez disso, existem variações aparentemente aleatórias no brilho em toda a imagem: o _ruído_. Algum ruído pode vir de imprecisões ao determinar rapidamente a carga de pequenas nuvens de elétrons. Mas, mais fundamentalmente, _a emissão dos fótons é em si aleatória_. Isso significa que mesmo que pudéssemos detectar perfeitamente cada fóton, *ainda* obteríamos imagens com ruído.

source: These issues are depicted in {numref}`fig-colored_spots`.
de: Diese Probleme sind in {numref}`fig-colored_spots` abgebildet.
es: Estos problemas se describen en {numref}`fig-colored_spots`.
pt_br: Esses problemas são descritos em {numref}`fig-colored_spots`.

source: The difference between what we might wish to image, and what we actually can image. *(Top)* Ideally, the small colored spots in reality would directly map to colored spots of a related size and separation in the image. This would make measuring the structures relatively straightforward: whatever we measure in the image accurately corresponds to the reality. *(Bottom)* In practice, the light emitted from our real structures would actually end up producing larger, blurry objects in the image with noise added on top. The *Blurred + Noisy* image then represents what we can *actually* acquire with a light microscope. For analysis, we need to use this decidedly imperfect image to try to figure out what the measurements of the real structures should be.
de: Der Unterschied zwischen dem, was wir abbilden möchten, und dem, was wir tatsächlich abbilden können. *(Oben)* Idealerweise würden die kleinen farbigen Flecken in der Realität direkt auf farbige Flecken einer ähnlichen Größe und eines ähnlichen Abstands auf dem Bild abgebildet. Dies würde die Messung der Strukturen relativ einfach machen: Was wir auf dem Bild messen, entspricht genau der Realität. *(Unten)* In der Praxis würde das von unseren realen Strukturen abgestrahlte Licht größere, unscharfe Objekte im Bild erzeugen, zu denen noch Rauschen hinzukommt. Das *unscharfe + verrauschte* Bild entspricht dann dem, was wir mit einem Lichtmikroskop *wirklich* aufnehmen können. Für die Analyse müssen wir dieses ausgesprochen unvollkommene Bild verwenden, um herauszufinden, wie die Messungen der echten Strukturen aussehen sollten.
es: La diferencia entre lo que podríamos desear visualizar y lo que realmente podemos visualizar. *(Arriba)* Idealmente, los pequeños puntos de color en realided se asignarían directamente a puntos de color en la imagen, relacionados en términos de tamaño y separación. Esto haría que medir las estructuras fuera relativamente sencillo: lo que sea que midamos en la imagen corresponde exactamente a la realidad. *(Abajo)* En la práctica, la luz emitida desde nuestras estructuras reales terminaría produciendo objetos más grandes y borrosos en la imagen, además de ruido agregado. La imagen *borrosa + ruidosa* representa lo que *realmente* podemos adquirir con un microscopio óptico. Para el análisis, necesitamos utilizar esta imagen decididamente imperfecta para intentar determinar cuáles deberían ser las medidas de las estructuras reales.
pt_br: A diferença entre o que desejamos imaginar e o que realmente podemos imaginar. *(Topo)* Idealmente, os pequenos pontos coloridos na realidade seriam mapeados diretamente para pontos coloridos de tamanho e separação relacionados na imagem. Isto tornaria a medição das estruturas relativamente simples: tudo o que medimos na imagem corresponde com precisão à realidade. *(Inferior)* Na prática, a luz emitida pelas nossas estruturas reais acabaria por produzir objetos maiores e desfocados na imagem com ruído adicionado no topo. A imagem *Desfocada + Ruidosa* representa então o que podemos *realmente* adquirir com um microscópio óptico. Para análise, precisamos usar esta imagem decididamente imperfeita para tentar descobrir quais deveriam ser as medidas das estruturas reais.

source: The twin issues of blur and noise do not affect all images equally. For example, blur can cause us to misjudge the size of something by several hundred nanometers; if the thing we are measuring is much larger than this then the relative error may be trivial, but if it is smaller then the relative error may be huge. Similarly, if we are detecting many thousands of photons then the uncertainty due to noise may be extremely small relative to the numbers involved, but if we have few photons then noise could dominate our results.
de: Die beiden Probleme der Unschärfe und des Rauschens betreffen nicht alle Bilder gleichermaßen. Die Unschärfe kann beispielsweise dazu führen, dass wir die Größe eines Objekts um mehrere hundert Nanometer falsch einschätzen. Wenn das Objekt, das wir messen, viel größer ist als diese Größe, kann der relative Fehler trivial sein, wenn es aber kleiner ist, kann der relative Fehler enorm sein. Ähnlich verhält es sich, wenn wir viele Tausend Photonen erfassen. Dann kann die Unsicherheit aufgrund von Rauschen im Verhältnis zur Anzahl der beteiligten Photonen extrem gering sein, aber wenn wir nur wenige Photonen haben, könnte das Rauschen unsere Ergebnisse dominieren.
es: Los problemas gemelos de borrosidad (desenfoque) y ruido no afectan a todas las imágenes por igual. Por ejemplo, el desenfoque puede hacer que calculemos mal el tamaño de algo en varios cientos de nanómetros; si lo que estamos midiendo es mucho mayor que esto, entonces el error relativo puede ser trivial, pero si es más pequeño, entonces el error relativo puede ser enorme. De manera similar, si detectamos muchos miles de fotones, entonces la incertidumbre debida al ruido puede ser extremadamente pequeña en relación con los números involucrados, pero si tenemos pocos fotones, entonces el ruido podría dominar nuestros resultados.
pt_br: Os problemas gêmeos de desfoque e ruído não afetam todas as imagens igualmente. Por exemplo, o desfoque pode fazer com que julguemos mal o tamanho de algo em várias centenas de nanômetros; se o que estamos medindo for muito maior do que isso, o erro relativo pode ser trivial, mas se for menor, o erro relativo pode ser enorme. Da mesma forma, se detectarmos muitos milhares de fotões, então a incerteza devida ao ruído pode ser extremamente pequena em relação aos números envolvidos, mas se tivermos poucos fotões, então o ruído poderá dominar os nossos resultados.

source: The biggest challenges arise whenever we are interested in measuring tiny structures in images containing only tens of photons at their brightest points. This is inconventiently common. In such cases, the effects of blur and noise can't be ignored.
de: Die größten Herausforderungen ergeben sich immer dann, wenn es darum geht, winzige Strukturen in Bildern zu messen, die an ihren hellsten Stellen nur einige Dutzend Photonen enthalten. Dies ist leider häufig der Fall. In solchen Fällen können die Auswirkungen von Unschärfe und Rauschen nicht ignoriert werden.
es: Los mayores desafíos surgen cuando estamos interesados en medir estructuras diminutas en imágenes que contienen sólo decenas de fotones en sus puntos más brillantes. Esto es inconvenientemente común. En tales casos, no se pueden ignorar los efectos del desenfoque y el ruido.
pt_br: Os maiores desafios surgem sempre que estamos interessados em medir pequenas estruturas em imagens contendo apenas dezenas de fótons nos seus pontos mais brilhantes. Isso é inconvenientemente comum. Nesses casos, os efeitos do desfoque e do ruído não podem ser ignorados.

source: The good news is that image processing can help us. However, we need to understand the problem so that we can choose appropriate processing techniques to apply. For that reason, the next two chapters will describe blur and noise in more detail -- and point towards ways we can deal with them.
de: Die gute Nachricht ist, dass die Bildverarbeitung uns helfen kann. Allerdings müssen wir das Problem verstehen, damit wir geeignete Verarbeitungstechniken auswählen können. Aus diesem Grund werden in den nächsten beiden Kapiteln Unschärfe und Rauschen genauer beschrieben - und Möglichkeiten aufgezeigt, wie wir damit umgehen können.
es: La buena noticia es que el procesamiento de imágenes puede ayudarnos. Sin embargo, debemos comprender el problema para poder elegir las técnicas de procesamiento adecuadas. Por esa razón, los próximos dos capítulos describirán el desenfoque y el ruido con más detalle y señalarán formas en que podemos abordarlos.
pt_br: A boa notícia é que o processamento de imagens pode nos ajudar. No entanto, precisamos entender o problema para que possamos escolher as técnicas de processamento apropriadas a serem aplicadas. Por esse motivo, os próximos dois capítulos descreverão o desfoque e o ruído com mais detalhes – e apontarão maneiras de lidar com eles.

source: This assumes a linear relationship, which does not always hold (e.g. if there's dye saturation, or high laser powers are used for illumination).
de: Dabei wird von einer linearen Beziehung ausgegangen, die nicht immer gegeben ist (z. B. bei Farbstoffsättigung oder bei Verwendung hoher Laserleistungen zur Beleuchtung).
es: Esto supone una relación lineal, que no siempre se cumple (por ejemplo, si hay sobresaturación o si se utilizan altas potencias de láser para la iluminación).
pt_br: Isso pressupõe uma relação linear, que nem sempre é válida (por exemplo, se houver saturação de corante ou se forem usadas altas potências de laser para iluminação).
