Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/2-point_operations/imagej.po
Languages: de, pt_br

source: ImageJ: Point operations
de: ImageJ: Punktoperationen
pt_br: ImageJ: operações pontuais

source: Introduction
de: Einführung
pt_br: Introdução

source: This section introduces image processing with ImageJ. It shows where to find the main point operations, including some tips (and warnings) about their use, along with a few exercises to try them out.
de: In diesem Abschnitt wird die Bildverarbeitung mit ImageJ vorgestellt. Es zeigt, wo die wichtigsten Punktoperationen zu finden sind, einschließlich einiger Tipps (und Warnungen) zu ihrer Verwendung sowie einiger Übungen zum Ausprobieren.
pt_br: Esta seção apresenta o processamento de imagens com ImageJ. Mostra onde encontrar as principais operações, incluindo algumas dicas (e avisos) sobre seu uso, além de alguns exercícios para experimentá-las.

source: Before we begin
de: Bevor wir anfangen
pt_br: Antes de começarmos

source: Before we embark on processing pixels, there are a couple of things we need to know how to do in preparation.
de: Bevor wir mit der Verarbeitung von Pixeln beginnen, müssen wir einige Dinge zur Vorbereitung wissen.
pt_br: Antes de iniciarmos o processamento de pixels, há algumas coisas que precisamos saber como fazer na preparação.

source: Duplicating images
de: Bilder duplizieren
pt_br: Duplicando imagens

source: One of the most important ImageJ shortcuts to learn is {kbd}`Shift+D` to **duplicate the image**. This applies the command {menuselection}`Image --> Duplicate...`.
de: Eine der wichtigsten ImageJ-Tastenkombinationen, die Sie lernen sollten, ist {kbd}`Umschalt+D`, um **das Bild zu duplizieren**. Dies wendet den Befehl {menuselection}`Image --> Duplicate...` an.
pt_br: Um dos atalhos mais importantes do ImageJ para aprender é {kbd}`Shift+D` para **duplicar a imagem**. Isso aplica o comando {menuselection}`Imagem --> Duplicar...`.

source: Being able to quickly duplicate an image matters for two main reasons:
de: Die Möglichkeit, ein Bild schnell zu duplizieren, ist aus zwei Hauptgründen wichtig:
pt_br: Ser capaz de duplicar rapidamente uma imagem é importante por dois motivos principais:

source: We often want to process duplicates of an image in different ways, and then combine or compare the results.
de: Oft möchten wir Duplikate eines Bildes auf unterschiedliche Weise verarbeiten und die Ergebnisse dann kombinieren oder vergleichen.
pt_br: Freqüentemente, queremos processar duplicatas de uma imagem de maneiras diferentes e depois combinar ou comparar os resultados.

source: Mistakes happen, and {menuselection}`Edit --> Undo` is rather limited; it can undo *some* processing steps applied to a single image slice, but not always... and it can't undo operations applied to image stacks
de: Fehler passieren und {menuselection}„Bearbeiten --> Rückgängig“ ist eher begrenzt; Es kann *einige* Verarbeitungsschritte rückgängig machen, die auf ein einzelnes Bildsegment angewendet werden, aber nicht immer ... und es kann keine Vorgänge rückgängig machen, die auf Bildstapel angewendet werden
pt_br: Erros acontecem e {menuselection}`Editar --> Desfazer` é bastante limitado; ele pode desfazer *algumas* etapas de processamento aplicadas a uma única fatia de imagem, mas nem sempre... e não pode desfazer operações aplicadas a pilhas de imagens

source: When working with an image in ImageJ, I almost always have at least one duplicate lingering around for when when things inevitably go wrong.
de: Wenn ich in ImageJ mit einem Bild arbeite, bleibt fast immer mindestens ein Duplikat übrig, für den Fall, dass etwas unweigerlich schief geht.
pt_br: Ao trabalhar com uma imagem no ImageJ, quase sempre tenho pelo menos uma duplicata disponível para quando as coisas inevitavelmente dão errado.

source: But {menuselection}`Image --> Duplicate...` has an extra, hidden bonus: it's supports extracting just a part of the image. This is controlled both by any ROI and by selecting subsets of channels, z-slices or time points where relevant. I frequently use duplication as a way to extract the channel from an image, as a more convenient alternative to {menuselection}`Image --> Color --> Split Channels`.
de: Aber {menuselection}`Image --> Duplicate...` hat einen zusätzlichen, versteckten Bonus: Es unterstützt das Extrahieren nur eines Teils des Bildes. Dies wird sowohl durch einen beliebigen ROI als auch durch die Auswahl von Teilmengen von Kanälen, Z-Slices oder Zeitpunkten, sofern relevant, gesteuert. Ich verwende häufig die Duplizierung, um den Kanal aus einem Bild zu extrahieren, als bequemere Alternative zu {menuselection}`Image --> Color --> Split Channels`.
pt_br: Mas {menuselection}`Image --> Duplicate...` tem um bônus extra oculto: suporta a extração de apenas uma parte da imagem. Isso é controlado por qualquer ROI e pela seleção de subconjuntos de canais, fatias z ou pontos de tempo, quando relevante. Frequentemente uso a duplicação como forma de extrair o canal de uma imagem, como uma alternativa mais conveniente para {menuselection}`Imagem --> Cor --> Dividir canais`.

source: Why can't ImageJ's 'Undo' undo much?
de: Warum kann ImageJs „Rückgängig“ nicht viel rückgängig machen?
pt_br: Por que o 'Desfazer' do ImageJ não pode desfazer muita coisa?

source: Implementing 'undo' in software is quite tricky. Especially in flexible software that enables the user to do a lot of different things.
de: Die Implementierung von „Rückgängig“ in Software ist ziemlich schwierig. Vor allem bei flexibler Software, die es dem Benutzer ermöglicht, viele verschiedene Dinge zu tun.
pt_br: Implementar 'desfazer' em software é bastante complicado. Especialmente em software flexível que permite ao usuário fazer muitas coisas diferentes.

source: When it comes to image processing, undo effectively requires the software to quietly duplicate the pixel values of an image before any processing step, so that they can be recovered later if needed. For a small image, that can work fine. But for big images (say, 1 GB or more), duplicating that much data could *significantly* slow down the software and potentially result in lots of out-of-memory errors.
de: Wenn es um die Bildverarbeitung geht, erfordert das Rückgängigmachen praktisch, dass die Software die Pixelwerte eines Bildes vor jedem Verarbeitungsschritt stillschweigend dupliziert, damit sie später bei Bedarf wiederhergestellt werden können. Für ein kleines Bild kann das gut funktionieren. Aber bei großen Bildern (z. B. 1 GB oder mehr) könnte das Duplizieren so vieler Daten die Software *erheblich* verlangsamen und möglicherweise zu vielen Fehlern wegen unzureichendem Arbeitsspeicher führen.
pt_br: Quando se trata de processamento de imagem, desfazer exige efetivamente que o software duplique silenciosamente os valores de pixel de uma imagem antes de qualquer etapa de processamento, para que possam ser recuperados posteriormente, se necessário. Para uma imagem pequena, isso pode funcionar bem. Mas para imagens grandes (digamos, 1 GB ou mais), duplicar essa quantidade de dados pode tornar o software *significativamente* lento e potencialmente resultar em muitos erros de falta de memória.

source: ImageJ provides some very limited undo support for 2D slices, but it's best not to rely on it. In general, it's left up to the user to decide when duplicating is necessary. If you suspect you might regret a processing step, then it's best to always duplicate the image beforehand with {kbd}`Shift+D`.
de: ImageJ bietet eine sehr eingeschränkte Rückgängig-Unterstützung für 2D-Slices, aber es ist besser, sich nicht darauf zu verlassen. Im Allgemeinen bleibt es dem Benutzer überlassen, zu entscheiden, wann eine Vervielfältigung erforderlich ist. Wenn Sie den Verdacht haben, dass Sie einen Verarbeitungsschritt bereuen könnten, duplizieren Sie das Bild am besten immer vorher mit {kbd}`Shift+D`.
pt_br: ImageJ fornece suporte de desfazer muito limitado para fatias 2D, mas é melhor não confiar nele. Em geral, cabe ao usuário decidir quando a duplicação é necessária. Se você suspeita que pode se arrepender de uma etapa de processamento, é melhor sempre duplicar a imagem antecipadamente com {kbd}`Shift+D`.

source: Converting to 32-bit
de: Konvertierung in 32-Bit
pt_br: Convertendo para 32 bits

source: The second thing I often do when processing an image in ImageJ is to [convert it to 32-bit floating point](sec_bits_type), using {menuselection}`Image --> Type --> 32-bit`.
de: Das zweite, was ich oft mache, wenn ich ein Bild in ImageJ verarbeite, ist, es [in 32-Bit-Gleitkommazahl umzuwandeln](sec_bits_type), indem ich {menuselection}`Image --> Type -- verwende. > 32-Bit`.
pt_br: A segunda coisa que costumo fazer ao processar uma imagem no ImageJ é [convertê-la para ponto flutuante de 32 bits](sec_bits_type), usando {menuselection}`Image --> Type -- > 32 bits`.

source: This isn't *always* essential, but we will soon see examples where the type of the image makes a difference to the result. So you should always at least consider converting.
de: Dies ist nicht *immer* unbedingt erforderlich, aber wir werden bald Beispiele sehen, bei denen die Art des Bildes einen Einfluss auf das Ergebnis hat. Sie sollten also immer zumindest über eine Umstellung nachdenken.
pt_br: Isso nem sempre é essencial, mas em breve veremos exemplos onde o tipo da imagem faz diferença no resultado. Portanto, você deve sempre pelo menos considerar a conversão.

source: Point operations for single images
de: Punktoperationen für Einzelbilder
pt_br: Operações pontuais para imagens únicas

source: Many point operations for single images are found in the {menuselection}`Process --> Math -->` submenu. At the top of the list come the arithmetic operations: {menuselection}`Add...`, {menuselection}`Subtract...`, {menuselection}`Multiply...` and {menuselection}`Divide...`.
de: Viele Punktoperationen für einzelne Bilder finden Sie im Untermenü {menuselection}`Process --> Math -->`. Ganz oben auf der Liste stehen die arithmetischen Operationen: {menuselection}`Add...`, {menuselection}`Subtract...` , {menuselection}`Multiplizieren...` und {menuselection}`Dividieren...`.
pt_br: Muitas operações pontuais para imagens únicas são encontradas no submenu {menuselection}`Process --> Math -->`. No topo da lista estão as operações aritméticas: {menuselection}`Add...`, {menuselection}`Subtract...` , {menuselection}`Multiplicar...` e {menuselection}`Dividir...`.

source: Practical
de: Praktisch
pt_br: Prático

source: Open the image *Spooked_16-bit.tif*, and apply *only* the following steps:
de: Öffnen Sie das Bild *Spooked_16-bit.tif* und führen Sie *nur* die folgenden Schritte aus:
pt_br: Abra a imagem *Spooked_16-bit.tif* e aplique *apenas* os seguintes passos:

source: Measure the mean pixel value of the image
de: Messen Sie den mittleren Pixelwert des Bildes
pt_br: Meça o valor médio do pixel da imagem

source: Subtract 600 from all pixel values
de: Subtrahieren Sie 600 von allen Pixelwerten
pt_br: Subtraia 600 de todos os valores de pixel

source: Add 600 to all pixel values
de: Addiere 600 zu allen Pixelwerten
pt_br: Adicione 600 a todos os valores de pixel

source: *Mathematically*, you should get the same mean measurements. Can you explain the result?
de: *Mathematisch gesehen* sollten Sie die gleichen Durchschnittswerte erhalten. Können Sie das Ergebnis erklären?
pt_br: *Matematicamente*, você deve obter as mesmas medidas médias. Você pode explicar o resultado?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/Spooked_16-bit.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https:/ /github.com/bioimagebook/practical-data/blob/main/images/Spooked_16-bit.tif)
pt_br: [![lançar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https:/ /github.com/bioimagebook/practical-data/blob/main/images/Spooked_16-bit.tif)

source: launch ImageJ.JS
de: Starten Sie ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
de: Lösung
pt_br: Solução

source: Firstly, the commands you need to run are:
de: Zunächst müssen folgende Befehle ausgeführt werden:
pt_br: Em primeiro lugar, os comandos que você precisa executar são:

source: {menuselection}`Analyze --> Measure`, or press {kbd}`M`
de: {menuselection}`Analysieren --> Messen` oder drücken Sie {kbd}`M`
pt_br: {menuselection}`Analisar --> Medir` ou pressione {kbd}`M`

source: {menuselection}`Process --> Math --> Subtract...` with the value 600
de: {menuselection}`Process --> Math --> Subtract...` mit dem Wert 600
pt_br: {menuselection}`Processar --> Matemática --> Subtrair...` com o valor 600

source: {menuselection}`Process --> Math --> Add...` with the value 600
de: {menuselection}`Prozess --> Mathematik --> Hinzufügen...` mit dem Wert 600
pt_br: {menuselection}`Processo --> Matemática --> Adicionar...` com o valor 600

source: When I do this, I get the following results table:
de: Wenn ich das mache, erhalte ich die folgende Ergebnistabelle:
pt_br: Quando faço isso, obtenho a seguinte tabela de resultados:

source: The reason the mean values differ is because we have a 16-bit image. After subtraction, any values that were less than 600 become clipped to zero. All these become 600 after the addition, pushing up the overall mean.
de: Der Grund dafür, dass die Mittelwerte unterschiedlich sind, liegt darin, dass wir ein 16-Bit-Bild haben. Nach der Subtraktion werden alle Werte, die kleiner als 600 waren, auf Null gekürzt. Alle diese Werte werden nach der Addition zu 600, was den Gesamtmittelwert erhöht.
pt_br: A razão pela qual os valores médios diferem é porque temos uma imagem de 16 bits. Após a subtração, quaisquer valores inferiores a 600 serão reduzidos a zero. Todos estes tornam-se 600 após a adição, aumentando a média geral.

source: If you didn't see this effect, then I would guess you had the foresight to run {menuselection}`Image --> Type --> 32-bit`. If you do this, the mean values match after all.
de: Wenn Sie diesen Effekt nicht gesehen haben, dann vermute ich, dass Sie die Weitsicht hatten, {menuselection}`Image --> Type --> 32-bit` auszuführen. Wenn man das macht, stimmen die Mittelwerte doch überein.
pt_br: Se você não viu esse efeito, então eu acho que você teve a precaução de executar {menuselection}`Image --> Type --> 32-bit`. Se você fizer isso, os valores médios corresponderão, afinal.

source: The {menuselection}`Process --> Math --> Log...` and {menuselection}`Process --> Math --> Gamma...` commands implement the log and gamma transforms respectively. The gamma transform is more common, since it contains an adjustable gamma parameter that can be used to tune the effect.
de: Der {menuselection}`Prozess --> Mathematik --> Protokoll...` und der {menuselection}`Prozess --> Mathematik -- >Gamma...`-Befehle implementieren die Log- bzw. Gamma-Transformationen. Die Gammatransformation ist häufiger anzutreffen, da sie einen einstellbaren Gammaparameter enthält, mit dem der Effekt abgestimmt werden kann.
pt_br: O {menuselection}`Processo --> Matemática --> Log...` e {menuselection}`Processo --> Matemática -- > Os comandos Gamma...` implementam as transformações log e gama respectivamente. A transformação gama é mais comum, pois contém um parâmetro gama ajustável que pode ser usado para ajustar o efeito.

source: Beware of the bit-depth with nonlinear transforms!
de: Achten Sie bei nichtlinearen Transformationen auf die Bittiefe!
pt_br: Cuidado com a profundidade de bits nas transformações não lineares!

source: When applying gamma or log transforms to 8-bit or 16-bit images, ImageJ applies some additional (linear) rescaling to the result so that the output falls within the range supported by the image.
de: Beim Anwenden von Gamma- oder Log-Transformationen auf 8-Bit- oder 16-Bit-Bilder wendet ImageJ eine zusätzliche (lineare) Neuskalierung auf das Ergebnis an, sodass die Ausgabe in den vom Bild unterstützten Bereich fällt.
pt_br: Ao aplicar transformações gama ou log a imagens de 8 ou 16 bits, o ImageJ aplica algum redimensionamento (linear) adicional ao resultado para que a saída fique dentro do intervalo suportado pela imagem.

source: This rescaling isn't needed for 32-bit images. This means that if you apply either command to a 32-bit image then it can seem that the image disappears. You'll need to follow up by using {menuselection}`Image --> Adjust --> Brightness/Contrast...` to reset the LUT display range to see the output properly.
de: Diese Neuskalierung ist für 32-Bit-Bilder nicht erforderlich. Das heißt, wenn Sie einen der beiden Befehle auf ein 32-Bit-Bild anwenden, kann es so aussehen, als würde das Bild verschwinden. Anschließend müssen Sie {menuselection}`Image --> Adjust --> Brightness/Contrast...` verwenden, um den LUT-Anzeigebereich zurückzusetzen, damit die Ausgabe richtig angezeigt wird.
pt_br: Esse redimensionamento não é necessário para imagens de 32 bits. Isso significa que se você aplicar qualquer um dos comandos a uma imagem de 32 bits, pode parecer que a imagem desaparece. Você precisará fazer o acompanhamento usando {menuselection}`Image --> Adjust --> Brightness/Contrast...` para redefinir o intervalo de exibição LUT para ver a saída corretamente.

source: Explore the use of {menuselection}`Process --> Math --> Gamma...` for enhancing the contrast of *Spooked_16-bit.tif*.
de: Entdecken Sie die Verwendung von {menuselection}`Process --> Math --> Gamma...` zur Verbesserung des Kontrasts von *Spooked_16-bit.tif*.
pt_br: Explore o uso de {menuselection}`Process --> Math --> Gamma...` para melhorar o contraste de *Spooked_16-bit.tif*.

source: If you want to see both the human and the ghost, should the gamma value be less than 1, equal to 1, or greater than 1?
de: Wenn Sie sowohl den Menschen als auch den Geist sehen möchten, sollte der Gammawert kleiner als 1, gleich 1 oder größer als 1 sein?
pt_br: Se você quiser ver o humano e o fantasma, o valor gama deve ser menor que 1, igual a 1 ou maior que 1?

source: **Tip:** To get a feeling for how the values are changing, create a histogram of the image first and press the {guilabel}`Live` button on the histogram. Then run the gamma command, turn on the {guilabel}`Preview` option and adjust the slider. You should now see a live update of how changing the gamma affects the pixel values.
de: **Tipp:** Um ein Gefühl dafür zu bekommen, wie sich die Werte ändern, erstellen Sie zunächst ein Histogramm des Bildes und klicken Sie im Histogramm auf die Schaltfläche {guilabel}„Live“. Führen Sie dann den Befehl „gamma“ aus, aktivieren Sie die Option „Vorschau“ und passen Sie den Schieberegler an. Sie sollten nun ein Live-Update darüber sehen, wie sich eine Änderung des Gammas auf die Pixelwerte auswirkt.
pt_br: **Dica:** para ter uma ideia de como os valores estão mudando, primeiro crie um histograma da imagem e pressione o botão {guilabel}`Live` no histograma. Em seguida, execute o comando gama, ative a opção {guilabel}`Preview` e ajuste o controle deslizante. Agora você deve ver uma atualização ao vivo de como a alteração da gama afeta os valores dos pixels.

source: The gamma needs to be less than 1.
de: Der Gammawert muss kleiner als 1 sein.
pt_br: O gama precisa ser menor que 1.

source: When the gamma is equal to 1, it isn't doing anything at all. When it is greater than 1, it's applying a non-linear adjustment -- but not one that really helps in this case.
de: Wenn das Gamma gleich 1 ist, passiert überhaupt nichts. Wenn er größer als 1 ist, wird eine nichtlineare Anpassung angewendet – aber in diesem Fall keine, die wirklich hilft.
pt_br: Quando o gama é igual a 1, não está fazendo nada. Quando é maior que 1, está aplicando um ajuste não linear - mas não um que realmente ajude neste caso.

source: Image inversion
de: Bildinvertierung
pt_br: Inversão de imagem

source: The {menuselection}`Edit --> Invert` command implements image inversion.
de: Der Befehl {menuselection}`Edit --> Invert` implementiert die Bildinvertierung.
pt_br: O comando {menuselection}`Edit --> Invert` implementa a inversão de imagem.

source: Inverting images or inverting LUTs?
de: Bilder invertieren oder LUTs invertieren?
pt_br: Invertendo imagens ou invertendo LUTs?

source: {menuselection}`Edit --> Invert` should not be confused with the {menuselection}`Image --> Lookup Tables --> Invert LUT` command, which inverts the LUT but *does nothing to the pixel values!*
de: {menuselection}`Edit --> Invert` sollte nicht mit {menuselection}`Image --> Lookup Tables --> Invert verwechselt werden LUT`-Befehl, der die LUT invertiert, aber *nichts mit den Pixelwerten tut!*
pt_br: {menuselection}`Editar --> Inverter` não deve ser confundido com {menuselection}`Imagem --> Tabelas de pesquisa --> Inverter Comando LUT`, que inverte o LUT mas *não faz nada com os valores dos pixels!*

source: Moreover, whether the LUT is inverted can be saved inside the file -- and so you could potentially open an image and find its LUT was inverted before you even started to do anything, and thereby misjudge whether structures are really brighter or darker than everything else.
de: Darüber hinaus kann in der Datei gespeichert werden, ob die LUT invertiert ist – Sie könnten also möglicherweise ein Bild öffnen und feststellen, dass die LUT invertiert war, bevor Sie überhaupt etwas getan haben, und dadurch falsch einschätzen, ob Strukturen wirklich heller oder dunkler als alles andere sind .
pt_br: Além disso, se o LUT está invertido pode ser salvo dentro do arquivo - e assim você pode abrir uma imagem e descobrir que seu LUT foi invertido antes mesmo de você começar a fazer qualquer coisa e, assim, julgar mal se as estruturas são realmente mais claras ou mais escuras do que todo o resto .

source: {menuselection}`File --> Open samples --> Blobs` is an example of this. It took a long time before I realized that the pixel values inside the blobs are higher than the background, because of the sneaky inverted LUT. As is often the case, the signs of an inverted LUT are evident in the text at the top of an image window.
de: {menuselection}`Datei --> Beispiele öffnen --> Blobs' ist ein Beispiel hierfür. Es hat lange gedauert, bis mir klar wurde, dass die Pixelwerte innerhalb der Blobs aufgrund der raffinierten invertierten LUT höher sind als die des Hintergrunds. Wie so oft sind die Anzeichen einer invertierten LUT im Text oben im Bildfenster erkennbar.
pt_br: {menuselection}`Arquivo --> Abrir amostras --> Blobs` é um exemplo disso. Demorei muito até perceber que os valores dos pixels dentro dos blobs são mais altos do que o fundo, por causa da LUT invertida sorrateira. Como costuma acontecer, os sinais de uma LUT invertida são evidentes no texto na parte superior de uma janela de imagem.

source: {menuselection}`Edit --> Invert` works differently when applied to different image types. Like in the 8-bit case, pixel values are always subtracted from some 'maximum'.
de: {menuselection}„Bearbeiten --> Invertieren“ funktioniert unterschiedlich, wenn es auf verschiedene Bildtypen angewendet wird. Wie im 8-Bit-Fall werden Pixelwerte immer von einem „Maximum“ subtrahiert.
pt_br: {menuselection}`Editar --> Inverter` funciona de maneira diferente quando aplicado a diferentes tipos de imagem. Como no caso de 8 bits, os valores dos pixels são sempre subtraídos de algum 'máximo'.

source: How this maximum is determined for 16 and 32-bit images in ImageJ?
de: Wie wird dieses Maximum für 16- und 32-Bit-Bilder in ImageJ bestimmt?
pt_br: Como esse máximo é determinado para imagens de 16 e 32 bits no ImageJ?
