Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/2-point_operations/imagej.po
Languages: de, pt_br

source: **Note:** the methods used for 16 and 32-bit images are different from one another!
de: **Hinweis:** Die für 16- und 32-Bit-Bilder verwendeten Methoden unterscheiden sich voneinander!
pt_br: **Observação:** os métodos usados para imagens de 16 e 32 bits são diferentes um do outro!

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Spooked_16-bit.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Spooked_16-bit.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Spooked_16-bit.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)

source: When I first wrote this question, to invert a 16-bit image pixel were subtracted from *the maximum value within the original image*. This is also true for stacks: the maximum value in the entire stack is found.
de: Als ich diese Frage zum ersten Mal schrieb, wurden zum Invertieren eines 16-Bit-Bildes die Pixel vom *Maximalwert im Originalbild* abgezogen. Dies gilt auch für Stapel: Es wird der Maximalwert im gesamten Stapel gefunden.
pt_br: Quando escrevi esta pergunta pela primeira vez, para inverter uma imagem de 16 bits, os pixels foram subtraídos do *valor máximo da imagem original*. Isto também se aplica às pilhas: o valor máximo em toda a pilha é encontrado.

source: Since ImageJ v1.53k, the maximum value of 65535 is used... unless you happen to have a different {guilabel}`Unsigned 6-bit range` value specified via the {guilabel}`Set` button via the *Brightness & Contrast* dialog. I only know about this sneaky alternative option through the [ImageJ release notes](https://imagej.nih.gov/ij/notes.html).
de: Seit ImageJ v1.53k wird der Maximalwert von 65535 verwendet ... es sei denn, Sie haben zufällig einen anderen {guilabel}Wert für den vorzeichenlosen 6-Bit-Bereich, der über die <span-Klasse angegeben wurde ='notranslate'>{guilabel}</span>Schaltfläche „Einstellen“ über das Dialogfeld *Helligkeit und Kontrast*. Ich kenne diese raffinierte Alternativoption nur aus den [ImageJ-Versionshinweisen](https://imagej.nih.gov/ij/notes.html).
pt_br: Desde ImageJ v1.53k, o valor máximo de 65535 é usado... a menos que você tenha um valor {guilabel}`Unsigned 6-bit range` diferente especificado por meio da {guilabel}botão `Set` através da caixa de diálogo *Brilho e Contraste*. Eu só conheço essa opção alternativa sorrateira através das [notas de lançamento do ImageJ](https://imagej.nih.gov/ij/notes.html).

source: For 32-bit image inversion, the pixels are subtracted from the *display maximum*, i.e. whatever maximum is set in the {menuselection}`Image --> Adjust --> Brightness/Contrast...` dialog box. Consequently, *inverting a 32-bit image can give different results each time it is applied if the contrast settings are not kept the same!*
de: Für die 32-Bit-Bildinvertierung werden die Pixel vom *Anzeigemaximum* abgezogen, d. h. von dem Maximum, das in {menuselection}`Bild --> Anpassen --> Helligkeit/Kontrast eingestellt ist ...`-Dialogfeld. Folglich *kann die Umkehrung eines 32-Bit-Bildes bei jeder Anwendung zu unterschiedlichen Ergebnissen führen, wenn die Kontrasteinstellungen nicht gleich bleiben!*
pt_br: Para inversão de imagem de 32 bits, os pixels são subtraídos do *máximo de exibição*, ou seja, qualquer máximo definido em {menuselection}`Imagem --> Ajustar --> Brilho/Contraste ...` caixa de diálogo. Conseqüentemente, *inverter uma imagem de 32 bits pode fornecer resultados diferentes cada vez que for aplicada, se as configurações de contraste não forem mantidas as mesmas!*

source: I personally dislike this unpredictable weirdness. I would happily apply {menuselection}`Edit --> Invert` to an 8-bit image. For anything else, I'd generally rather convert to 32-bit and multiply by -1 -- so that I know the results should be repeatable, regardless of brightess & contrast settings.
de: Ich persönlich mag diese unvorhersehbare Verrücktheit nicht. Ich würde gerne {menuselection}`Edit --> Invert` auf ein 8-Bit-Bild anwenden. Für alles andere würde ich im Allgemeinen lieber in 32-Bit konvertieren und mit -1 multiplizieren, damit ich weiß, dass die Ergebnisse unabhängig von den Helligkeits- und Kontrasteinstellungen wiederholbar sein sollten.
pt_br: Pessoalmente, não gosto dessa estranheza imprevisível. Eu ficaria feliz em aplicar {menuselection}`Edit --> Invert` a uma imagem de 8 bits. Para qualquer outra coisa, geralmente prefiro converter para 32 bits e multiplicar por -1 - para saber que os resultados devem ser repetíveis, independentemente das configurações de brilho e contraste.

source: The Image Calculator
de: Der Bildrechner
pt_br: A calculadora de imagens

source: {menuselection}`Process --> Math --> Image Calculator...` is used to combine two images in various ways. It is one of ImageJ's most indispensable commands.
de: {menuselection}`Process --> Math --> Image Calculator...` wird verwendet, um zwei Bilder auf verschiedene Arten zu kombinieren. Es ist einer der unverzichtbarsten Befehle von ImageJ.
pt_br: {menuselection}`Process --> Math --> Image Calculator...` é usado para combinar duas imagens de várias maneiras. É um dos comandos mais indispensáveis do ImageJ.

source: The *Image Calculator...* dialog
de: Der Dialog *Bildrechner...*
pt_br: A caixa de diálogo *Calculadora de imagens...*

source: But beware of the bit-depth and type! If any of the original images are 8 or 16-bit, then the result might require clipping or rounding, in which case selecting the option to create a {guilabel}`32-bit (float) result` may be necessary to get the expected output.
de: Aber achten Sie auf die Bittiefe und den Typ! Wenn es sich bei den Originalbildern um 8- oder 16-Bit-Bilder handelt, muss das Ergebnis möglicherweise beschnitten oder gerundet werden. Wählen Sie in diesem Fall die Option zum Erstellen eines 32-Bit-Bildes (Float) aus ) result` kann erforderlich sein, um die erwartete Ausgabe zu erhalten.
pt_br: Mas cuidado com a profundidade e o tipo de bits! Se alguma das imagens originais tiver 8 ou 16 bits, o resultado poderá exigir recorte ou arredondamento; nesse caso, selecione a opção para criar um {guilabel}`32 bits (float ) result` pode ser necessário para obter a saída esperada.

source: {menuselection}`Process --> Math --> Image Calculator...` finally makes it possible for us to check whether the pixel values of two images are all identical -- without relying on summary measurements or histograms.
de: {menuselection}`Process --> Math --> Image Calculator...` macht es uns endlich möglich, zu überprüfen, ob die Pixelwerte zweier Bilder alle identisch sind – ohne uns darauf verlassen zu müssen auf Übersichtsmessungen oder Histogrammen.
pt_br: {menuselection}`Process --> Math --> Image Calculator...` finalmente nos permite verificar se os valores de pixel de duas imagens são todos idênticos - sem depender em medições resumidas ou histogramas.

source: Use it to determine which two of the images *Same_1.tif*, *Same_2.tif* and *Same_3.tif* are identical in terms of pixel values.
de: Bestimmen Sie damit, welche zwei der Bilder *Same_1.tif*, *Same_2.tif* und *Same_3.tif* hinsichtlich der Pixelwerte identisch sind.
pt_br: Use-o para determinar quais duas das imagens *Same_1.tif*, *Same_2.tif* e *Same_3.tif* são idênticas em termos de valores de pixel.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Same_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Same_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Same_3.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Same_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Same_2.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/Same_3.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Same_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Same_2.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/Same_3.tif)

source: Answer
de: Antwort
pt_br: Responder

source: My preferred way to check this is to subtract the images from one another, making sure that the result is 32-bit (in case there are negative values). Doing this should reveal something hidden in the image *Same_2.tif*. Note that the contrast settings differ between *Same_1.tif* and *Same_3.tif*, so they may _look_ different.
de: Meine bevorzugte Methode, dies zu überprüfen, besteht darin, die Bilder voneinander zu subtrahieren und sicherzustellen, dass das Ergebnis 32-Bit ist (falls es negative Werte gibt). Dadurch sollte etwas sichtbar werden, das im Bild *Same_2.tif* verborgen ist. Beachten Sie, dass sich die Kontrasteinstellungen zwischen *Same_1.tif* und *Same_3.tif* unterscheiden, sodass sie möglicherweise unterschiedlich _aussehen_.
pt_br: Minha forma preferida de verificar isso é subtrair as imagens umas das outras, certificando-se de que o resultado seja 32 bits (caso haja valores negativos). Isso deve revelar algo oculto na imagem *Same_2.tif*. Observe que as configurações de contraste diferem entre *Same_1.tif* e *Same_3.tif*, então elas podem _parecer_ diferentes.

source: (Note that the calculator's {guilabel}`Difference` or {guilabel}`Divide` commands could also be used. {guilabel}`XOR` would work as well, but its output is harder to interpret since it involves comparing individual bits used to store each pixel value and gives an output where all matching bits are 0 and all non-matching bits are 1. When converted back into actual decimal values and then to colors for us to look at, this can appear strange. But at least if the resulting image is not completely black then we know that the original input images were not identical.)
de: (Beachten Sie, dass auch die Befehle {guilabel}„Difference“ oder {guilabel}„Divide“ des Rechners verwendet werden können. {guilabel}`XOR` würde auch funktionieren, aber seine Ausgabe ist schwieriger zu interpretieren, da es den Vergleich einzelner Bits zum Speichern jedes Pixelwerts beinhaltet und eine Ausgabe ergibt, bei der alle übereinstimmenden Bits 0 und alle nicht übereinstimmenden Bits sind sind 1. Bei der Rückumrechnung in tatsächliche Dezimalwerte und dann in für uns sichtbare Farben kann dies seltsam erscheinen. Wenn das resultierende Bild jedoch nicht vollständig schwarz ist, wissen wir zumindest, dass die ursprünglichen Eingabebilder nicht identisch waren.)
pt_br: (Observe que os comandos {guilabel}`Difference` ou {guilabel}`Divide` da calculadora também podem ser usados. {guilabel}`XOR` também funcionaria, mas sua saída é mais difícil de interpretar, pois envolve a comparação de bits individuais usados para armazenar cada valor de pixel e fornece uma saída onde todos os bits correspondentes são 0 e todos os bits não correspondentes são 1. Quando convertido novamente em valores decimais reais e depois em cores para observarmos, isso pode parecer estranho. Mas pelo menos se a imagem resultante não for completamente preta, saberemos que as imagens de entrada originais não eram idênticas.)
