Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/2-point_operations/point_operations.po
Languages: pt_br

source: This is equivalent to adding a separate 'noise image' to the non-existent cleaner image that we would prefer to have recorded. If we knew the pixels in the noise image then we could simply subtract it to get the clean result -- but, in practice, their randomness means that we do not.
pt_br: Isto equivale a adicionar uma 'imagem de ruído' separada à imagem mais limpa inexistente que preferiríamos ter gravada. Se soubéssemos os pixels na imagem de ruído, poderíamos simplesmente subtraí-los para obter o resultado limpo - mas, na prática, a aleatoriedade deles significa que não o fazemos.

source: Simulating imperfect image acquisition by adding noise to an 'ideal' image.
pt_br: Simulação de aquisição de imagem imperfeita adicionando ruído a uma imagem 'ideal'.

source: Despite the fact that noise is undesirable, adding noise images can be extremely useful when developing and validating image analysis methods.
pt_br: Apesar do ruído ser indesejável, adicionar imagens com ruído pode ser extremamente útil no desenvolvimento e validação de métodos de análise de imagens.

source: We can use it to create simulations in which the noise behaves statistically just like real noise, and add it to clean images. Using these simulations we can figure out things like how processing steps or changes during acquisition will affect or reduce the noise, or how sensitive our measurement strategies are to changes in image quality (see {ref}`chap_filters`, {ref}`chap_formation_noise` and {ref}`chap_macro_simulating`).
pt_br: Podemos usá-lo para criar simulações nas quais o ruído se comporta estatisticamente como o ruído real e adicioná-lo a imagens limpas. Usando essas simulações, podemos descobrir coisas como como as etapas de processamento ou alterações durante a aquisição afetarão ou reduzirão o ruído, ou quão sensíveis são nossas estratégias de medição às mudanças na qualidade da imagem (consulte {ref} `chap_filters`, {ref}`chap_formation_noise` e {ref}`chap_macro_simulating`).
