Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/2-point_operations/point_operations.po
Languages: pt_br

source: Default Caption
pt_br: Legenda padrão

source: Point operations
pt_br: Operações pontuais

source: Chapter outline
pt_br: Esboço do capítulo

source: **Point operations** are mathematical operations applied to individual pixel values
pt_br: **Operações de ponto** são operações matemáticas aplicadas a valores de pixels individuais

source: Point operations can be performed using a **single image**, an **image and a constant**, or **two images of the same size**
pt_br: As operações de ponto podem ser realizadas usando uma **única imagem**, uma **imagem e uma constante** ou **duas imagens do mesmo tamanho**

source: Some **nonlinear** point operations change the relationships between pixels in a way that can be useful to enhance contrast -- but should be used with caution
pt_br: Algumas operações pontuais **não lineares** alteram as relações entre pixels de uma forma que pode ser útil para melhorar o contraste - mas devem ser usadas com cautela

source: Introduction
pt_br: Introdução

source: A step used to process an image in some way can be called an **operation**.
pt_br: Uma etapa usada para processar uma imagem de alguma forma pode ser chamada de **operação**.

source: The simplest operations are **point operations**, which act on individual pixels. Point operations change each pixel in a way that depends upon its own value, but not upon where it is in the image nor upon the values of other pixels. This is in contrast to **neighborhood operations**, which calculate new pixel values based upon the values of pixels nearby.
pt_br: As operações mais simples são **operações pontuais**, que atuam em pixels individuais. As operações pontuais alteram cada pixel de uma forma que depende de seu próprio valor, mas não de onde ele está na imagem nem dos valores de outros pixels. Isso contrasta com as **operações de vizinhança**, que calculam novos valores de pixel com base nos valores de pixels próximos.

source: While not immediately very glamorous, point operations often have indispensable roles in more interesting contexts -- and so it's essential to know how they are used, and what complications to look out for.
pt_br: Embora não sejam imediatamente muito glamorosas, as operações pontuais muitas vezes têm papéis indispensáveis em contextos mais interessantes – e por isso é essencial saber como são usadas e quais complicações procurar.

source: Isn't modifying pixels bad?
pt_br: Modificar pixels não é ruim?

source: Part I stressed repeatedly that modifying pixels is a bad thing. Since image processing is all about changing pixel values, it's time to add a bit more nuance:
pt_br: A Parte I enfatizou repetidamente que modificar pixels é uma coisa ruim. Como o processamento de imagens envolve alterar os valores dos pixels, é hora de adicionar um pouco mais de nuances:

source: **Modifying pixel values is bad -- unless you have a good reason**.
pt_br: **Modificar valores de pixel é ruim – a menos que você tenha um bom motivo**.

source: A 'good reason' is something you can justify based upon the image data. Something you could confidently include in a journal article describing how you analyzed your image, and convince a reviewer was sensible.
pt_br: Uma 'boa razão' é algo que você pode justificar com base nos dados da imagem. Algo que você poderia incluir com segurança em um artigo de jornal descrevendo como você analisou sua imagem e convencer um revisor de que foi sensato.

source: You should also make sure to apply the processing to a **duplicate** of the image, and keep the original file. That way you can always return to the original data if you need to.
pt_br: Você também deve aplicar o processamento a uma **duplicação** da imagem e manter o arquivo original. Dessa forma, você sempre poderá retornar aos dados originais, se necessário.

source: Point operations for single images
pt_br: Operações pontuais para imagens únicas

source: Arithmetic
pt_br: Aritmética

source: Pixel values are just numbers. When we have numbers, we can do arithmetic.
pt_br: Os valores de pixel são apenas números. Quando temos números, podemos fazer aritmética.

source: It should therefore come as no surprise that we can take our pixel values and change them by adding, subtracting, multiplying or dividing by some other value. These are the simplest point operations.
pt_br: Portanto, não deve ser surpresa que possamos pegar nos nossos valores de pixel e alterá-los adicionando, subtraindo, multiplicando ou dividindo por algum outro valor. Estas são as operações pontuais mais simples.

source: We encountered this idea earlier when we saw that multiplying our pixel values could [increase the brightness](sec_images_luts). I argued that this was a *very bad thing* because it changes our data. Our better alternative was to change the LUT instead.
pt_br: Encontramos essa ideia anteriormente quando vimos que multiplicar nossos valores de pixel poderia [aumentar o brilho](sec_images_luts). Argumentei que isso era uma *coisa muito ruim* porque altera nossos dados. Nossa melhor alternativa era alterar o LUT.

source: Nevertheless, there are sometimes 'good reasons' to apply arithmetic to pixel values -- better than simply brightening the appearance. Examples include:
pt_br: No entanto, às vezes existem “boas razões” para aplicar aritmética aos valores dos pixels – melhor do que simplesmente iluminar a aparência. Exemplos incluem:

source: Subtracting a constant offset added by a microscope before quantifying intensities
pt_br: Subtraindo um deslocamento constante adicionado por um microscópio antes de quantificar as intensidades

source: See {ref}`chap_macro_simulating`
pt_br: Consulte {ref}`chap_macro_simulating`

source: Dividing by a constant so that you can convert bit-depth without clipping
pt_br: Dividindo por uma constante para que você possa converter a profundidade de bits sem recorte

source: See {ref}`chap_bit_depths`
pt_br: Consulte {ref}`chap_bit_profundidades`

source: **However**, we need to keep in mind that we're not dealing with abtract maths but rather bits and bytes. Which makes the next question particularly important.
pt_br: **No entanto**, precisamos ter em mente que não estamos lidando com matemática abstrata, mas sim com bits e bytes. O que torna a próxima questão particularmente importante.

source: Question
pt_br: Pergunta

source: Suppose you add a constant to every pixel in the image. Why might subtracting the same constant from the result not give you back the image you started with?
pt_br: Suponha que você adicione uma constante a cada pixel da imagem. Por que subtrair a mesma constante do resultado não devolveria a imagem com a qual você começou?

source: Answer
pt_br: Responder

source: If you add a constant that pushes pixel values outside the range supported by the bit-depth (e.g. 0–255 for 8-bit), then the result cannot fit in the image. It's likely to be clipped to the closest possible value instead. Subtracting the constant again does not restore the original value.
pt_br: Se você adicionar uma constante que empurre os valores de pixel para fora do intervalo suportado pela profundidade de bits (por exemplo, 0–255 para 8 bits), o resultado não poderá caber na imagem. É provável que seja reduzido ao valor mais próximo possível. Subtrair a constante novamente não restaura o valor original.

source: For example: 200 *(original value)* + 100 *(constant)* &rarr; 255 *(closest valid value)*. <br/> But then 255 - 100 &rarr; 155.
pt_br: Por exemplo: 200 *(valor original)* + 100 *(constante)* &rarr; 255 *(valor válido mais próximo)*. <br/> Mas então 255 - 100 &rarr; 155.

source: Based upon this, an important tip for image processing is:
pt_br: Com base nisso, uma dica importante para processamento de imagens é:

source: Convert integer images to floating point before manipulating pixels
pt_br: Converta imagens inteiras em ponto flutuante antes de manipular pixels

source: A 32-bit (or even 64-bit) floating point image is much less likely to suffer errors due to clipping and rounding. Therefore the first step of any image processing is often to convert the image to a floating point format.
pt_br: Uma imagem de ponto flutuante de 32 bits (ou mesmo 64 bits) tem muito menos probabilidade de sofrer erros devido a recorte e arredondamento. Portanto, o primeiro passo de qualquer processamento de imagem é muitas vezes converter a imagem para um formato de ponto flutuante.

source: See {ref}`chap_bit_depths` for details.
pt_br: Consulte {ref}`chap_bit_profundidades` para obter detalhes.

source: Image inversion
pt_br: Inversão de imagem

source: Inverting an image effectively involves 'flipping' the intensities: making the higher values lower, and the lower values higher.
pt_br: Inverter uma imagem envolve efetivamente 'inverter' as intensidades: diminuir os valores mais altos e aumentar os valores mais baixos.

source: In the case of 8-bit images, inverted pixel values can be easily computed simply by subtracting the original values from the maximum possible -- i.e. from 255.
pt_br: No caso de imagens de 8 bits, os valores de pixels invertidos podem ser facilmente calculados simplesmente subtraindo os valores originais do máximo possível - ou seja, de 255.

source: Why is inversion useful?
pt_br: Por que a inversão é útil?

source: Suppose you have a good strategy designed to detect bright structures, but it doesn't work for you because your images contain dark structures. If you invert your images first, then the structures become bright -- and your detection strategy might now succeed.
pt_br: Suponha que você tenha uma boa estratégia projetada para detectar estruturas brilhantes, mas ela não funciona porque suas imagens contêm estruturas escuras. Se você inverter suas imagens primeiro, as estruturas ficarão brilhantes – e sua estratégia de detecção poderá agora ter sucesso.

source: The effect of image and LUT inversion. Note that each histogram appears to be a mirror image of the other. Also, the image is clipped (sorry).
pt_br: O efeito da imagem e inversão LUT. Observe que cada histograma parece ser uma imagem espelhada do outro. Além disso, a imagem está cortada (desculpe).

source: Defining the 'maximum' when inverting an image
pt_br: Definindo o 'máximo' ao inverter uma imagem

source: Inverting an 8-bit (unsigned integer) image generally means subtracting all pixel values from 255, because 255 is the maximum supported by the image type and bit-depth.
pt_br: Inverter uma imagem de 8 bits (número inteiro sem sinal) geralmente significa subtrair todos os valores de pixels de 255, porque 255 é o máximo suportado pelo tipo de imagem e pela profundidade de bits.

source: The 'maximum' is not always defined in this way. For a 32-bit or 64-bit image (either integer or floating point), the maximum possible value is *huge*, and using that would result in exceedingly large pixel values. Therefore the 'maximum' is usually defined in some other way rather than based on the image type, such as by taking the maximum pixel value found within the image.
pt_br: O 'máximo' nem sempre é definido desta forma. Para uma imagem de 32 ou 64 bits (inteiro ou ponto flutuante), o valor máximo possível é *enorme*, e usá-lo resultaria em valores de pixel excessivamente grandes. Portanto, o 'máximo' é geralmente definido de alguma outra forma, em vez de com base no tipo de imagem, como, por exemplo, tomando o valor máximo de pixel encontrado na imagem.

source: Because I don't like letting the software decide what maximum to use, I often cheat: I multiply the pixels by -1 (ensuring the image is floating point). This retains the key properties of image inversion: it flips the high and low values, while retaining all the relative diffences between values.
pt_br: Como não gosto de deixar o software decidir qual máximo usar, costumo trapacear: multiplico os pixels por -1 (garantindo que a imagem seja de ponto flutuante). Isto mantém as principais propriedades da inversão de imagem: inverte os valores altos e baixos, mantendo todas as diferenças relativas entre os valores.

source: Nonlinear contrast enhancement
pt_br: Aprimoramento de contraste não linear

source: With arithmetic operations we change the pixel values, usefully or otherwise, but (assuming we have not clipped our image in the process) we have done so in a **linear** way. At most it would take another multiplication and/or addition to get us back to where we were. Because a similar relationship between pixel values exists, we could also adjust the brightness and contrast LUT so that it does not *look* like we have done anything at all.
pt_br: Com operações aritméticas, alteramos os valores dos pixels, de forma útil ou não, mas (assumindo que não cortamos nossa imagem no processo) fizemos isso de forma **linear**. No máximo, seria necessária outra multiplicação e/ou adição para voltarmos ao ponto onde estávamos. Como existe uma relação semelhante entre os valores dos pixels, também poderíamos ajustar o brilho e o contraste da LUT para que não pareça que fizemos alguma coisa.

source: **Nonlinear** point operations differ in that they affect relative values differently depending upon what they were in the first place. These are particularly useful for contrast enhancement.
pt_br: As operações pontuais **não lineares** diferem porque afetam os valores relativos de maneira diferente, dependendo de como eram em primeiro lugar. Estes são particularmente úteis para melhorar o contraste.

source: When we changed the brightness and contrast in {ref}`sec_images_luts`, we were making linear adjustments. For a grayscale LUT, this meant we chose the pixel value to display as black and the pixel value to display as white, with each value in between mapped to a shade of gray along a straight line ({numref}`fig-nonlinear_contrast`A).
pt_br: Quando alteramos o brilho e o contraste em {ref}`sec_images_luts`, estávamos fazendo ajustes lineares. Para uma LUT em escala de cinza, isso significa que escolhemos o valor do pixel para exibir como preto e o valor do pixel para exibir como branco, com cada valor intermediário mapeado para um tom de cinza ao longo de uma linha reta ({numref} `fig-nonlinear_contrast`A).

source: We could optionally use a nonlinear mapping values between values and shades of gray, but most software doesn't make it straightforward to change LUTs in sufficiently complicated ways. An easier approach is to duplicate the image and apply any non-linear adjustments to the pixel values themselves, and then map them to shades of gray in the usual (linear) way.
pt_br: Opcionalmente, poderíamos usar valores de mapeamento não linear entre valores e tons de cinza, mas a maioria dos softwares não facilita a alteração de LUTs de maneiras suficientemente complicadas. Uma abordagem mais fácil é duplicar a imagem e aplicar quaisquer ajustes não lineares aos próprios valores dos pixels e, em seguida, mapeá-los para tons de cinza da maneira usual (linear).

source: Common nonlinear transforms are to take the logarithm of the pixel value ({numref}`fig-nonlinear_contrast`B), or replace each value $p$ with $p^\gamma$ where $\gamma$ is the *gamma* parameter that can be adjusted depending upon the desired outcome ({numref}`fig-nonlinear_contrast`B-D).
pt_br: As transformações não lineares comuns são pegar o logaritmo do valor do pixel ({numref}`fig-nonlinear_contrast`B) ou substituir cada valor $p$ por $p^\gamma$ onde $ \gamma$ é o parâmetro *gamma* que pode ser ajustado dependendo do resultado desejado ({numref}`fig-nonlinear_contrast`B-D).

source: Nonlinear transforms applied to a simple 'ramp' image, consisting of linearly increasing pixel values. Replacing each pixel with its log or gamma-adjusted value has the effect of compressing either the lower or higher intensities closer together to free up more gray levels for the others. Note that, here we assume an 8-bit input image and have incorporated some necessary rescaling for an 8-bit output (based on the approach used by ImageJ).
pt_br: Transformadas não lineares aplicadas a uma imagem simples em 'rampa', consistindo em valores de pixels crescentes linearmente. Substituir cada pixel por seu valor ajustado por log ou gama tem o efeito de comprimir as intensidades mais baixas ou mais altas para liberar mais níveis de cinza para os outros. Observe que aqui assumimos uma imagem de entrada de 8 bits e incorporamos alguns redimensionamentos necessários para uma saída de 8 bits (com base na abordagem usada pelo ImageJ).

source: If all this sounds a dubious and awkward, be assured that it is: nonlinear transforms are best avoided whenever possible.
pt_br: Se tudo isso parece duvidoso e estranho, tenha certeza de que é: é melhor evitar transformações não lineares sempre que possível.

source: However, there is once scenario when they can really help: displaying an image with a **high dynamic range**, i.e. a big difference between the largest and smallest pixel values.
pt_br: No entanto, há um cenário em que eles podem realmente ajudar: exibir uma imagem com uma **alta faixa dinâmica**, ou seja, uma grande diferença entre o maior e o menor valor de pixel.

source: {numref}`fig-point_gamma_spooked` shows this in action. Here, the pixel values associated with the main character are all quite high. However, the values associated with the ghostly figure are all very low. There are no linear contrast settings with a standard grayscale LUT that make it possible to see both figures with any detail simultaneously. However, log or gamma transforms make this possible.
pt_br: {numref}`fig-point_gamma_spooked` mostra isso em ação. Aqui, os valores de pixel associados ao personagem principal são bastante altos. No entanto, os valores associados à figura fantasmagórica são todos muito baixos. Não há configurações de contraste linear com uma LUT em escala de cinza padrão que possibilite ver ambas as figuras com qualquer detalhe simultaneamente. No entanto, as transformações log ou gama tornam isso possível.

source: The application of nonlinear contrast enhancement to an image with a wide range of values. *(Top row)* In the original image, it's not possible to see details in both the foreground and background simultaneously. *(Bottom row)* Two examples of nonlinear techniques that make details visible throughout the image.
pt_br: A aplicação de aprimoramento de contraste não linear a uma imagem com uma ampla faixa de valores. *(Linha superior)* Na imagem original, não é possível ver detalhes no primeiro plano e no fundo simultaneamente. *(Linha inferior)* Dois exemplos de técnicas não lineares que tornam os detalhes visíveis em toda a imagem.

source: Avoid image manipulation!
pt_br: Evite a manipulação de imagens!

source: When creating figures for publication, changing the contrast in some linear manner is normally considered fine (assuming that it has not been done mischievously to make some inconvenient, research-undermining details impossible to discern).
pt_br: Ao criar figuras para publicação, alterar o contraste de alguma maneira linear é normalmente considerado aceitável (assumindo que isso não foi feito de maneira maliciosa para tornar impossíveis de discernir alguns detalhes inconvenientes e que prejudicam a pesquisa).

source: **But if any nonlinear operations are used, these should always be noted in the figure legend!**
pt_br: **Mas se forem utilizadas quaisquer operações não lineares, estas devem ser sempre anotadas na legenda da figura!**

source: This is because, although nonlinear operations can be very helpful when used with care, they can also easily mislead -- exaggerating or underplaying differences in brightness.
pt_br: Isso ocorre porque, embora as operações não lineares possam ser muito úteis quando usadas com cuidado, elas também podem facilmente enganar – exagerando ou subestimando as diferenças de brilho.

source: Point operations & multiple images
pt_br: Operações pontuais e múltiplas imagens

source: Instead of applying arithmetic using an image and a constant, we could also use two images of the same size. These can readily be added, subtracted, multiplied or divided by applying the operations to the corresponding pixels.
pt_br: Em vez de aplicar aritmética usando uma imagem e uma constante, também poderíamos usar duas imagens do mesmo tamanho. Estes podem ser facilmente adicionados, subtraídos, multiplicados ou divididos aplicando as operações aos pixels correspondentes.

source: This is a technique that is used *all the time* in image processing. Applications include:
pt_br: Esta é uma técnica usada *o tempo todo* no processamento de imagens. As aplicações incluem:

source: subtracting varying backgrounds
pt_br: subtraindo origens variadas

source: computing intensity ratios
pt_br: taxas de intensidade de computação

source: masking out regions
pt_br: mascarando regiões

source: **and much more...**
pt_br: **e muito mais...**

source: We will combine images in this way throughout the rest of the handbook.
pt_br: Combinaremos imagens desta forma ao longo do restante do manual.

source: In the two 32-bit images shown here, white pixels have values of one and black pixels have values of zero (gray pixels have values somewhere in between).
pt_br: Nas duas imagens de 32 bits mostradas aqui, os pixels brancos têm valores de um e os pixels pretos têm valores de zero (os pixels cinza têm valores intermediários).

source: What would be the result of multiplying the images together? And what would be the result of dividing the left image by the right image?
pt_br: Qual seria o resultado da multiplicação das imagens? E qual seria o resultado da divisão da imagem da esquerda pela imagem da direita?

source: Multiplying the images effectively results in everything outside the white region in the right image being removed from the left image (i.e. set to zero).
pt_br: Multiplicar as imagens resulta efetivamente em tudo fora da região branca na imagem direita sendo removido da imagem esquerda (ou seja, definido como zero).

source: Dividing has a similar effect, except that instead of becoming zero the masked-out pixels will take one of three results, depending upon the original pixel's value in the left image:
pt_br: A divisão tem um efeito semelhante, exceto que, em vez de se tornarem zero, os pixels mascarados terão um dos três resultados, dependendo do valor do pixel original na imagem à esquerda:

source: if it was _positive_, the result is $+\infty$ (shown here as yellow)
pt_br: se for _positivo_, o resultado será $+\infty$ (mostrado aqui em amarelo)

source: if it was _negative_, the result is $-\infty$
pt_br: se for _negativo_, o resultado é $-\infty$

source: if it was zero, the result is `NaN` ('not a number' -– indicating 0/0 is undefined; shown here as red)
pt_br: se for zero, o resultado é `NaN` ('não é um número' - indicando que 0/0 é indefinido; mostrado aqui em vermelho)

source: These are special values that can be contained in floating point images, but not images with integer types.
pt_br: Esses são valores especiais que podem estar contidos em imagens de ponto flutuante, mas não em imagens com tipos inteiros.

source: Adding noise
pt_br: Adicionando ruído

source: Fluorescence images are invariably noisy. The noise appears as a graininess throughout the image, which can be seen as arising from a random noise value (positive or negative) being added to every pixel.
pt_br: As imagens de fluorescência são invariavelmente ruidosas. O ruído aparece como granulação em toda a imagem, que pode ser visto como resultante de um valor de ruído aleatório (positivo ou negativo) adicionado a cada pixel.
