Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/4-colors/colors.po
Languages: es, pt_br

source: All the previous comments about *'don't convert to RGB before analysis'* as based on the assumption that your raw data isn't already RGB. This is usually the case with microscopy and medical imaging whenever accurate quantification is important.
es: Todos los comentarios anteriores sobre *'no convertir a RGB antes del análisis'* se basan en el supuesto de que sus datos sin procesar aún no son RGB. Este suele ser el caso de la microscopía y las imágenes médicas siempre que es importante una cuantificación precisa.
pt_br: Todos os comentários anteriores sobre *'não converter para RGB antes da análise'* baseiam-se na suposição de que seus dados brutos ainda não são RGB. Este é geralmente o caso da microscopia e das imagens médicas sempre que a quantificação precisa é importante.

source: Nevertheless, it's not *always* the case.
es: Sin embargo, no siempre es así.
pt_br: No entanto, nem sempre é esse o caso.

source: A common example is brightfield imaging for histology or pathology. Here, the camera is often RGB and an RGB image is really as close to the raw data as we are likely to get.
es: Un ejemplo común son las imágenes de campo claro para histología o patología. Aquí, la cámara suele ser RGB y una imagen RGB es realmente lo más cercana a los datos sin procesar que es probable que obtengamos.
pt_br: Um exemplo comum é a imagem de campo claro para histologia ou patologia. Aqui, a câmera geralmente é RGB e uma imagem RGB é realmente o mais próximo possível dos dados brutos.

source: Example RGB histology image, from https://openslide.org
es: Ejemplo de imagen de histología RGB, de https://openslide.org
pt_br: Exemplo de imagem de histologia RGB, de https://openslide.org

source: Crucially, the analysis of brightfield images in histology usually aims to replicate (and sometimes improve upon) the visual assessment that a pathologist might make looking down a microscope. It's often based on detecting, classifying and counting cells, measuring stained areas, or recognizing the presence of particular patterns -- but *not* accurately quantifying staining intensity.
es: Fundamentalmente, el análisis de imágenes de campo claro en histología generalmente tiene como objetivo replicar (y a veces mejorar) la evaluación visual que un patólogo podría hacer mirando por un microscopio. A menudo se basa en detectar, clasificar y contar células, medir áreas teñidas o reconocer la presencia de patrones particulares, pero *no* cuantificar con precisión la intensidad de la tinción.
pt_br: Crucialmente, a análise de imagens de campo claro em histologia geralmente visa replicar (e às vezes melhorar) a avaliação visual que um patologista pode fazer olhando ao microscópio. Freqüentemente, baseia-se na detecção, classificação e contagem de células, na medição de áreas manchadas ou no reconhecimento da presença de padrões específicos - mas *não* na quantificação precisa da intensidade da coloração.

source: Multichannel images
es: Imágenes multicanal
pt_br: Imagens multicanal

source: So far, we have focussed on 2D images with a **single channel** -- that is, a single value for every pixel at every *x,y* coordinate in the image.
es: Hasta ahora, nos hemos centrado en imágenes 2D con un **canal único**, es decir, un valor único para cada píxel en cada coordenada *x,y* de la imagen.
pt_br: Até agora, nos concentramos em imagens 2D com um **único canal** - ou seja, um único valor para cada pixel em cada coordenada *x,y* na imagem.

source: Such images can be converted to 8-bit RGB using a LUT. If we do this, then we get an image with **three channels**, where each channel is displayed using red, green and blue LUTs -- with the colors blended together for display. But we shouldn't do that conversion prior to analysis in case we lose our raw data.
es: Estas imágenes se pueden convertir a RGB de 8 bits mediante una LUT. Si hacemos esto, obtenemos una imagen con **tres canales**, donde cada canal se muestra usando LUT rojo, verde y azul, con los colores combinados para su visualización. Pero no deberíamos hacer esa conversión antes del análisis en caso de que perdamos nuestros datos sin procesar.
pt_br: Essas imagens podem ser convertidas para RGB de 8 bits usando uma LUT. Se fizermos isso, obteremos uma imagem com **três canais**, onde cada canal é exibido usando LUTs vermelho, verde e azul - com as cores mescladas para exibição. Mas não devemos fazer essa conversão antes da análise, caso percamos nossos dados brutos.

source: Now, we turn to consider **multichannel images** that aren't RGB images. Rather, the raw data itself has multiple channels.
es: Ahora, pasemos a considerar **imágenes multicanal** que no son imágenes RGB. Más bien, los datos sin procesar tienen múltiples canales.
pt_br: Agora, consideraremos **imagens multicanal** que não são imagens RGB. Em vez disso, os próprios dados brutos possuem vários canais.

source: In fluorescence microscopy, it's common to acquire multichannel images in which pixel values for each channel are determined from light that has been filtered according to its wavelength. We *might* choose to visualize these channels as red, green and blue, but we don't have to.
es: En microscopía de fluorescencia, es común adquirir imágenes multicanal en las que los valores de píxeles de cada canal se determinan a partir de luz filtrada según su longitud de onda. *Podríamos* optar por visualizar estos canales como rojo, verde y azul, pero no es necesario.
pt_br: Na microscopia de fluorescência, é comum adquirir imagens multicanais nas quais os valores dos pixels de cada canal são determinados a partir da luz que foi filtrada de acordo com seu comprimento de onda. *Poderíamos* optar por visualizar esses canais como vermelho, verde e azul, mas não precisamos fazê-lo.

source: In principle, any LUT might be applied to each channel, but it makes sense to choose LUTs that somehow relate to the wavelength (i.e. color) of light detected for the corresponding channels. Channels can then be overlaid on top of one another, and their colors further merged for display (e.g. high values in both green and red channels are shown as yellow).
es: En principio, se podría aplicar cualquier LUT a cada canal, pero tiene sentido elegir LUTs que de alguna manera se relacionen con la longitud de onda (es decir, el color) de la luz detectada para los canales correspondientes. Luego, los canales se pueden superponer uno encima del otro y sus colores se pueden fusionar para su visualización (por ejemplo, los valores altos en los canales verde y rojo se muestran en amarillo).
pt_br: Em princípio, qualquer LUT pode ser aplicada a cada canal, mas faz sentido escolher LUTs que de alguma forma se relacionem com o comprimento de onda (ou seja, cor) da luz detectada nos canais correspondentes. Os canais podem então ser sobrepostos uns sobre os outros e suas cores posteriormente mescladas para exibição (por exemplo, valores altos nos canais verde e vermelho são mostrados em amarelo).

source: The important feature of these images is that the actual channel information is always retained, and so the original pixel values remain available. This means we can still extract channels or adjust their LUTs as needed.
es: La característica importante de estas imágenes es que siempre se conserva la información real del canal y, por tanto, los valores de píxeles originales permanecen disponibles. Esto significa que aún podemos extraer canales o ajustar sus LUT según sea necesario.
pt_br: A característica importante destas imagens é que a informação real do canal é sempre retida e, assim, os valores originais dos pixels permanecem disponíveis. Isso significa que ainda podemos extrair canais ou ajustar seus LUTs conforme necessário.

source: Multichannel image using red, green and blue LUTs. Although this looks a lot like an RGB image, each channel still contains the raw data (which might be 16-bit or 32-bit). The original pixel values can be extracted if needed, and different LUTs used.
es: Imagen multicanal utilizando LUTs rojos, verdes y azules. Aunque se parece mucho a una imagen RGB, cada canal todavía contiene los datos sin procesar (que pueden ser de 16 o 32 bits). Los valores de píxeles originales se pueden extraer si es necesario y se pueden utilizar diferentes LUT.
pt_br: Imagem multicanal usando LUTs vermelho, verde e azul. Embora se pareça muito com uma imagem RGB, cada canal ainda contém os dados brutos (que podem ser de 16 ou 32 bits). Os valores de pixel originais podem ser extraídos, se necessário, e diferentes LUTs usados.

source: Multichannel image from {numref}`fig-colors_composite_rgb` using different LUTs. Again, no information is lost: we can access the original pixel values, and update the LUTs if needed.
es: Imagen multicanal de {numref}`fig-colors_composite_rgb` usando diferentes LUTs. Nuevamente, no se pierde información: podemos acceder a los valores de píxeles originales y actualizar las LUT si es necesario.
pt_br: Imagem multicanal de {numref}`fig-colors_composite_rgb` usando LUTs diferentes. Novamente, nenhuma informação é perdida: podemos acessar os valores originais dos pixels e atualizar os LUTs, se necessário.

source: Just like with a single channel image, we can create an RGB image that allows us to visualize our multichannel image -- using the LUTs to figure out which RGB values are needed to represent the color of each pixel.
es: Al igual que con una imagen de un solo canal, podemos crear una imagen RGB que nos permita visualizar nuestra imagen multicanal, usando los LUTs para determinar qué valores RGB son necesarios para representar el color de cada píxel.
pt_br: Assim como com uma imagem de canal único, podemos criar uma imagem RGB que nos permite visualizar nossa imagem multicanal – usando as LUTs para descobrir quais valores RGB são necessários para representar a cor de cada pixel.

source: Then, again just like with the single channel image, this is problematic if we don't keep the raw data -- because we can never recover the original values from the RGB representation.
es: Luego, al igual que con la imagen de un solo canal, esto es problemático si no conservamos los datos sin procesar, porque nunca podremos recuperar los valores originales de la representación RGB.
pt_br: Então, novamente, assim como acontece com a imagem de canal único, isso será problemático se não mantivermos os dados brutos - porque nunca poderemos recuperar os valores originais da representação RGB.

source: We can create an RGB image from {numref}`fig-colors_composite_non_rgb`, but then we have three channels locked to red, green and blue -- which have converted the original channels to 8-bit, and mixed up information due to the LUT colors used. We can no longer recover the original pixel values after converting to RGB.
es: Podemos crear una imagen RGB desde {numref}`fig-colors_composite_non_rgb`, pero luego tenemos tres canales bloqueados en rojo, verde y azul, que han convertido los canales originales a 8- bit, y han mezclado la información debido a los colores de LUTs utilizados. Ya no podemos recuperar los valores de píxeles originales después de convertir a RGB.
pt_br: Podemos criar uma imagem RGB a partir de {numref}`fig-colors_composite_non_rgb`, mas então temos três canais bloqueados para vermelho, verde e azul - que converteram os canais originais para 8- bit e informações confusas devido às cores LUT usadas. Não podemos mais recuperar os valores originais dos pixels após a conversão para RGB.

source: Summary of color images
es: Resumen de imágenes en color.
pt_br: Resumo das imagens coloridas

source: The main message here can be distilled into two rules:
es: El mensaje principal aquí se puede resumir en dos reglas:
pt_br: A mensagem principal aqui pode ser resumida em duas regras:

source: **Always use the original image for analysis**
es: **Utiliza siempre la imagen original para el análisis**
pt_br: **Sempre use a imagem original para análise**

source: If the raw data isn't RGB, then don't convert it before analysis!
es: Si los datos sin procesar no son RGB, ¡no los conviertas antes del análisis!
pt_br: Se os dados brutos não forem RGB, não os converta antes da análise!

source: **Create an RGB copy of your image for display**
es: **Crea una copia RGB de tu imagen para mostrarla**
pt_br: **Crie uma cópia RGB da sua imagem para exibição**

source: Keep the RGB copy separate, so you always retain it *and* the raw image
es: Manten la copia RGB separada, para conservarla siempre *y* la imagen sin procesar
pt_br: Mantenha a cópia RGB separada, para que você sempre a retenha *e* a imagem bruta

source: RGB images aren't *bad* -- we almost always need them for display, and for *some* imaging applications (e.g. brightfield histology) they are the best raw data we can get. But we need to be cautious if our raw data isn't RGB, and avoid converting to RGB too early.
es: Las imágenes RGB no son *malas*: casi siempre las necesitamos para mostrarlas, y para *algunas* aplicaciones de imágenes (por ejemplo, histología de campo claro) son los mejores datos sin procesar que podemos obtener. Pero debemos tener cuidado si nuestros datos sin procesar no son RGB y evitar convertirlos a RGB demasiado pronto.
pt_br: Imagens RGB não são *ruins* - quase sempre precisamos delas para exibição e, para *algumas* aplicações de imagem (por exemplo, histologia de campo claro), elas são os melhores dados brutos que podemos obter. Mas precisamos ser cautelosos se nossos dados brutos não forem RGB e evitar a conversão para RGB muito cedo.

source: In the end, it's normal to keep at least two versions of each dataset: one in the original (possibly multichannel) format, and one as RGB for display. This RGB image is normally created as the _final_ step, after applying any processing or LUT adjustments to the original data.
es: Al final, es normal conservar al menos dos versiones de cada conjunto de datos: una en el formato original (posiblemente multicanal) y otra como RGB para visualización. Esta imagen RGB normalmente se crea como el paso _final_, después de aplicar cualquier procesamiento o ajuste LUT a los datos originales.
pt_br: No final, é normal manter pelo menos duas versões de cada conjunto de dados: uma no formato original (possivelmente multicanal) e outra como RGB para exibição. Esta imagem RGB é normalmente criada como etapa _final_, após aplicar qualquer processamento ou ajustes de LUT aos dados originais.

source: Other color spaces
es: Otros espacios de color
pt_br: Outros espaços de cores

source: Color is a big topic, and there is a lot more that could be said about different color spaces and transformations. However, these are mostly relevant when working with data that is originally RGB.
es: El color es un gran tema y hay mucho más que podría decirse sobre los diferentes espacios de color y transformaciones. Sin embargo, estos son más relevantes cuando se trabaja con datos que originalmente son RGB.
pt_br: A cor é um grande tópico e há muito mais que poderia ser dito sobre os diferentes espaços e transformações de cores. No entanto, eles são mais relevantes ao trabalhar com dados originalmente RGB.

source: For example, we could convert an RGB image to an *HSB* representation, where HSB stands for *Hue*, *Saturation* and *Brightness*. This is useful to separate hue from brightness, e.g. to help identify all red pixels regardless of whether they are bright or dark.
es: Por ejemplo, podríamos convertir una imagen RGB a una representación *HSB*, donde HSB significa *Tono* (Hue), *Saturación* (Saturation) y *Brillo* (Brightness). Esto es útil para separar el tono del brillo, p.ej. para ayudar a identificar todos los píxeles rojos independientemente de si son brillantes u oscuros.
pt_br: Por exemplo, poderíamos converter uma imagem RGB em uma representação *HSB*, onde HSB significa *Matiz*, *Saturação* e *Brilho*. Isto é útil para separar o matiz do brilho, por ex. para ajudar a identificar todos os pixels vermelhos, independentemente de serem claros ou escuros.

source: Alternatively, we could convert an RGB image to *CMYK*, which stands for *Cyan*, *Magenta*, *Yellow* and *blacK* -- which may be a better fit for printers than monitors.
es: Alternativamente, podríamos convertir una imagen RGB a *CMYK*, que significa *cian* (Cyan), *magenta* (Magenta), *amarillo* (Yellow) y *negro* (blacK), lo que puede ser más adecuado para impresoras que para monitores.
pt_br: Alternativamente, poderíamos converter uma imagem RGB para *CMYK*, que significa *Ciano*, *Magenta*, *Amarelo* e *preto* – o que pode ser mais adequado para impressoras do que para monitores.

source: But I personally haven't found such transforms very relevant to the areas of bioimage analysis in which I have worked. I have tried to focus here on the main need-to-know topics that impact analyzing scientific images. With this in mind, I think that understanding RGB (and its limitations) is crucial -- while other transforms can be picked up later if they are needed.
es: Pero personalmente no me parece que tales transformaciones sean muy relevantes para las áreas del análisis de bioimágenes en las que he trabajado. He tratado de centrarme aquí en los principales temas que se necesitan conocer, que impactan el análisis de imágenes científicas. Con esto en mente, creo que comprender RGB (y sus limitaciones) es crucial, mientras que otras transformaciones se pueden retomar más adelante si son necesarias.
pt_br: Mas pessoalmente não achei tais transformações muito relevantes para as áreas de análise de bioimagem em que trabalhei. Tentei focar aqui nos principais tópicos necessários que impactam a análise de imagens científicas. Com isso em mente, acho que compreender o RGB (e suas limitações) é crucial - enquanto outras transformações podem ser realizadas posteriormente, se forem necessárias.
