Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/4-colors/colors.po
Languages: es, pt_br

source: Default Caption
es: Leyenda predeterminada
pt_br: Legenda padrão

source: Channels & colors
es: Canales y colores
pt_br: Canais e cores

source: Chapter outline
es: Outline del capítulo
pt_br: Esboço do capítulo

source: Images with multiple **color channels** may display differently in different software
es: Las imágenes con múltiples **canales de color** pueden mostrarse de manera diferente en diferentes tipos de software
pt_br: Imagens com vários **canais de cores** podem ser exibidas de forma diferente em softwares diferentes

source: **RGB images** are a special case, and generally look consistent across different software
es: **Las imágenes RGB** son un caso especial y, por lo general, se ven similares en distintos programas.
pt_br: **Imagens RGB** são um caso especial e geralmente parecem consistentes em diferentes softwares

source: In ImageJ, multichannel images that are not RGB may be referred to as **composite images**
es: En ImageJ, las imágenes multicanal que no son RGB pueden denominarse **imágenes compuestas**
pt_br: No ImageJ, imagens multicanal que não são RGB podem ser chamadas de **imagens compostas**

source: **Converting images to RGB often loses information!**
es: **¡Al convertir imágenes a RGB a menudo se pierde información!**
pt_br: **Converter imagens para RGB muitas vezes perde informações!**

source: Introduction
es: Introducción
pt_br: Introdução

source: One way to introduce color into images is to use a suitable LUT, as described in {ref}`chap_pixels`. Then the fact that different colors could be involved in the display of such images was really only incidental: at each location in the image there was still only one channel, one pixel and one value.
es: Una forma de introducir color en las imágenes es utilizar una LUT adecuada, como se describe en {ref}`chap_pixels`. Entonces, el hecho de que en la visualización de tales imágenes pudieran intervenir diferentes colores era en realidad sólo incidental: en cada lugar de la imagen todavía había sólo un canal, un píxel y un valor.
pt_br: Uma maneira de introduzir cores nas imagens é usar uma LUT adequada, conforme descrito em {ref}`chap_pixels`. Então, o fato de cores diferentes poderem estar envolvidas na exibição de tais imagens foi apenas incidental: em cada local da imagem ainda havia apenas um canal, um pixel e um valor.

source: There are images for which color plays a more important role. We will consider two types:
es: Hay imágenes en las que el color juega un papel más importante. Consideraremos dos tipos:
pt_br: Existem imagens para as quais a cor desempenha um papel mais importante. Consideraremos dois tipos:

source: **RGB images** -- which are widely used for display, but are *usually* not very good for quantitative analysis
es: **Imágenes RGB**: que se utilizan ampliamente para visualización, pero *normalmente* no son muy buenas para el análisis cuantitativo.
pt_br: **Imagens RGB** – que são amplamente utilizadas para exibição, mas *normalmente* não são muito boas para análise quantitativa

source: **Multichannel / composite images** -- which are often better for analysis, but need to be converted to RGB for display
es: **Imágenes multicanal/compuestas**: a menudo son mejores para el análisis, pero deben convertirse a RGB para su visualización.
pt_br: **Imagens multicanal/compostas** – que geralmente são melhores para análise, mas precisam ser convertidas para RGB para exibição

source: Since they often *look* the same, but behave very differently, knowing which kind of color image you have is important for any scientific work.
es: Dado que a menudo *lucen* iguales, pero se comportan de manera muy diferente, saber qué tipo de imagen a color tienes es importante para cualquier trabajo científico.
pt_br: Como muitas vezes *parecem* iguais, mas se comportam de maneira muito diferente, saber que tipo de imagem colorida você tem é importante para qualquer trabalho científico.

source: Mixing red, green & blue
es: Mezclando rojo, verde y azul
pt_br: Misturando vermelho, verde e azul

source: We previously discussed how image LUTs provide a way to map pixel values to colors that can be displayed on screen. Now that we've looked at image types and bit-depths, we can expand a bit more on how that works in practice.
es: Anteriormente analizamos cómo las LUTs de imágenes proporcionan una forma de asignar valores de píxeles a colores que se pueden mostrar en la pantalla. Ahora que hemos analizado los tipos de imágenes y las profundidades de bits, podemos ampliar un poco más cómo funciona en la práctica.
pt_br: Discutimos anteriormente como as LUTs de imagem fornecem uma maneira de mapear valores de pixel para cores que podem ser exibidas na tela. Agora que vimos os tipos de imagens e profundidades de bits, podemos expandir um pouco mais sobre como isso funciona na prática.

source: In general, each color is represented using three 8-bit unsigned integers: one for **r**ed, one for **g**reen, one for **b**lue. Each integer value defines how much of each primary color should be mixed together to create the final color used to display the pixel.
es: En general, cada color se representa mediante tres enteros sin signo de 8 bits: uno para **r**ed (rojo), uno para **g**reen (verde) y uno para **b**lue (azul). Cada valor entero define qué cantidad de cada color primario se debe mezclar para crear el color final utilizado para mostrar el píxel.
pt_br: Em geral, cada cor é representada usando três inteiros sem sinal de 8 bits: um para **r**ed, um para **g**reen, um para **b**lue. Cada valor inteiro define quanto de cada cor primária deve ser misturada para criar a cor final usada para exibir o pixel.

source: In the case of a grayscale LUT, the red, green and blue values are all the same:
es: En el caso de una LUT en escala de grises, los valores de rojo, verde y azul son todos iguales:
pt_br: No caso de uma LUT em tons de cinza, os valores de vermelho, verde e azul são todos iguais:

source: Other LUTs may include only one color, with the others set to zero:
es: Otros LUTs pueden incluir solo un color, y los demás se establecen en cero:
pt_br: Outras LUTs podem incluir apenas uma cor, com as demais definidas como zero:

source: However for most LUTs the red, green and blue values differ:
es: Sin embargo, para la mayoría de los LUTs los valores de rojo, verde y azul difieren:
pt_br: No entanto, para a maioria das LUTs, os valores de vermelho, verde e azul são diferentes:

source: Because each of the red, green and blue values can be in the range 0-255, mixing them together can generate (theoretically at least) up to 256 x 256 x 256 = 16,777,216 different colors, i.e. a *lot*.
es: Debido a que cada uno de los valores de rojo, verde y azul puede estar en el rango de 0 a 255, mezclarlos puede generar (al menos en teoría) hasta 256 x 256 x 256 = 16,777,216 colores diferentes, es decir, un *lote*.
pt_br: Como cada um dos valores de vermelho, verde e azul pode estar no intervalo de 0 a 255, misturá-los pode gerar (pelo menos teoricamente) até 256 x 256 x 256 = 16.777.216 cores diferentes, ou seja, um *lote*.

source: When it comes to display, this method of representing color using 8-bit RGB values should easily give us many more colors than we could ever hope to distinguish by eye. We don't need a higher bit-depth for display.
es: Cuando se trata de visualización, este método de representar el color utilizando valores RGB de 8 bits debería darnos fácilmente muchos más colores de los que podríamos esperar distinguir a simple vista. No necesitamos una mayor profundidad de bits para la visualización.
pt_br: Quando se trata de exibição, esse método de representação de cores usando valores RGB de 8 bits deve facilmente nos fornecer muito mais cores do que poderíamos esperar distinguir a olho nu. Não precisamos de uma profundidade de bits maior para exibição.

source: RGB images
es: Imágenes RGB
pt_br: Imagens RGB

source: Until now we have considered images where each pixel has a single value, and there is an LUT associated with the image to map these values to colors.
es: Hasta ahora hemos considerado imágenes donde cada píxel tiene un valor único y hay una LUT asociada con la imagen para asignar estos valores a colores.
pt_br: Até agora consideramos imagens onde cada pixel possui um único valor, e existe uma LUT associada à imagem para mapear esses valores em cores.

source: Now that we know how colors are represented, we can consider another option.
es: Ahora que sabemos cómo se representan los colores, podemos considerar otra opción.
pt_br: Agora que sabemos como as cores são representadas, podemos considerar outra opção.

source: Instead of storing a single value per pixel, we can store the RGB values that represent the color used to display the pixel instead. Each pixel then has three values (for red, green and blue), not just a single value.
es: En lugar de almacenar un único valor por píxel, podemos almacenar los valores RGB que representan el color utilizado para mostrar el píxel. Cada píxel tiene entonces tres valores (para rojo, verde y azul), no solo un valor único.
pt_br: Em vez de armazenar um único valor por pixel, podemos armazenar os valores RGB que representam a cor usada para exibir o pixel. Cada pixel possui então três valores (para vermelho, verde e azul), e não apenas um único valor.

source: When an image is stored in this way it's called an **RGB image**.
es: Cuando una imagen se almacena de esta manera, se denomina **imagen RGB**.
pt_br: Quando uma imagem é armazenada dessa forma, ela é chamada de **imagem RGB**.

source: We can easily create an RGB image from any combination of image + LUT: just replace each pixel value in the original image with the associated RGB values that we find in the LUT. Now each pixel has three values instead of one, but the end result *looks* exactly the same.
es: Podemos crear fácilmente una imagen RGB a partir de cualquier combinación de imagen + LUT: basta con sustituir cada valor de píxel de la imagen original por los valores RGB asociados que encontremos en la LUT. Ahora cada píxel tiene tres valores en lugar de uno, pero el resultado final *parece* exactamente igual.
pt_br: Podemos facilmente criar uma imagem RGB a partir de qualquer combinação de imagem + LUT: basta substituir cada valor de pixel na imagem original pelos valores RGB associados que encontramos na LUT. Agora cada pixel tem três valores em vez de um, mas o resultado final *parece* exatamente o mesmo.

source: The risk of RGB
es: El riesgo de RGB
pt_br: O risco do RGB

source: The problem with converting an image to RGB is that, in general, *we can't go back!* In fact, the unwitting *overuse* of RGB images is one of the most common sources of data-destroying errors in some branches of scientific imaging.
es: El problema con la conversión de una imagen a RGB es que, en general, *¡no podemos volver atrás!* De hecho, el *uso excesivo* involuntario de imágenes RGB es una de las fuentes más comunes de errores de destrucción de datos en algunas ramas de imagenologia científica.
pt_br: O problema com a conversão de uma imagem para RGB é que, em geral, *não podemos voltar atrás!* Na verdade, o *uso excessivo* involuntário de imagens RGB é uma das fontes mais comuns de erros que destroem dados em alguns ramos do imagem científica.

source: Beware converting to RGB!
es: ¡Cuidado con la conversión a RGB!
pt_br: Cuidado ao converter para RGB!

source: Converting an image to RGB is another way lose our raw data.
es: Convertir una imagen a RGB es otra forma de perder nuestros datos sin procesar.
pt_br: Converter uma imagem para RGB é outra maneira de perder nossos dados brutos.

source: {numref}`fig-colors_im_grays_rgb` shows this in action. In the 'least destructive' case, the image has a grayscale LUT. This means that the red, green and blue values are identical to one another -- but *not* necessarily identical to the pixel values of the original image. We have converted the data to 8-bit and used the LUT to determine how much to scale during the conversion.
es: {numref}`fig-colors_im_grays_rgb` muestra esto en acción. En el caso "menos destructivo", la imagen tiene una LUT en escala de grises. Esto significa que los valores de rojo, verde y azul son idénticos entre sí, pero *no* necesariamente idénticos a los valores de píxeles de la imagen original. Convertimos los datos a 8 bits y utilizamos la LUT para determinar cuánto escalar durante la conversión.
pt_br: {numref}`fig-colors_im_grays_rgb` mostra isso em ação. No caso 'menos destrutivo', a imagem possui uma LUT em tons de cinza. Isso significa que os valores de vermelho, verde e azul são idênticos entre si - mas *não* necessariamente idênticos aos valores de pixel da imagem original. Convertemos os dados para 8 bits e usamos o LUT para determinar quanto escalar durante a conversão.

source: In general, it's not possible to recover the original pixel values from the RGB image: we probably don't know exactly what rescaling was applied, and we have lost information to clipping and rounding.
es: En general, no es posible recuperar los valores de píxeles originales de la imagen RGB: probablemente no sepamos exactamente qué cambio de escala se aplicó y hemos perdido información al recortar y redondear.
pt_br: Em geral, não é possível recuperar os valores originais dos pixels da imagem RGB: provavelmente não sabemos exatamente qual redimensionamento foi aplicado e perdemos informações devido ao corte e ao arredondamento.

source: Converting a grayscale image to RGB can lose information. We can separate out the red, green and blue values from the RGB image and visualize each as separate images to explore the information they contain. Even though the RGB image looks unchanged from the original, and all three color channels have similar histograms to the original, the bit-depth has been reduced and image statistics modified. There is also a big histogram peak that indicates substantial clipping.
es: Al convertir una imagen en escala de grises a RGB se puede perder información. Podemos separar los valores rojo, verde y azul de la imagen RGB y visualizar cada uno como imágenes separadas para explorar la información que contienen. Aunque la imagen RGB parece no haber cambiado con respecto a la original y los tres canales de color tienen histogramas similares a los originales, la profundidad de bits se ha reducido y las estadísticas de la imagen se han modificado. También hay un gran pico en el histograma que indica un recorte sustancial.
pt_br: A conversão de uma imagem em tons de cinza para RGB pode causar perda de informações. Podemos separar os valores de vermelho, verde e azul da imagem RGB e visualizar cada um como imagens separadas para explorar as informações que contêm. Embora a imagem RGB pareça inalterada em relação ao original e todos os três canais de cores tenham histogramas semelhantes aos do original, a profundidade de bits foi reduzida e as estatísticas da imagem modificadas. Há também um grande pico no histograma que indica um recorte substancial.

source: The impact of converting an image with any other LUT to RGB is even more dramatic, as shown in {numref}`fig-colors_im_rgb`. Here, the red, green and blue values are different and the histograms for each color are very different. Again, it would not be possible to recover the original pixel values from the RGB image.
es: El impacto de convertir una imagen con cualquier otra LUT a RGB es aún más dramático, como se muestra en {numref}`fig-colors_im_rgb`. Aquí, los valores de rojo, verde y azul son diferentes y los histogramas de cada color son muy diferentes. Nuevamente, no sería posible recuperar los valores de píxeles originales de la imagen RGB.
pt_br: O impacto da conversão de uma imagem com qualquer outro LUT para RGB é ainda mais dramático, como mostrado em {numref}`fig-colors_im_rgb`. Aqui, os valores de vermelho, verde e azul são diferentes e os histogramas de cada cor são muito diferentes. Novamente, não seria possível recuperar os valores originais dos pixels da imagem RGB.

source: Converting an to RGB can lose information in a particularly dramatic way if the LUT is not grayscale. The histograms for each channel may now look completely different.
es: La conversión a RGB puede perder información de una manera particularmente dramática si la LUT no está en escala de grises. Los histogramas de cada canal ahora pueden verse completamente diferentes.
pt_br: A conversão de um para RGB pode perder informações de maneira particularmente dramática se a LUT não estiver em escala de cinza. Os histogramas de cada canal agora podem parecer completamente diferentes.

source: The role of RGB
es: El papel del RGB
pt_br: O papel do RGB

source: Using RGB images for display
es: Uso de imágenes RGB para visualización
pt_br: Usando imagens RGB para exibição

source: So what's the point of having RGB images, if they are so risky?
es: Entonces, ¿qué sentido tiene tener imágenes RGB, si son tan riesgosas?
pt_br: Então, de que adianta ter imagens RGB, se elas são tão arriscadas?

source: One of the biggest reasons to use RGB images in science is for presentation. While specialist image analysis software applications, such as ImageJ, are typically designed to handle a range of exotic image types and bit-depths, the same is not true for non-scientific software.
es: Una de las principales razones para utilizar imágenes RGB en ciencia es la presentación. Si bien las aplicaciones de software de análisis de imágenes especializadas, como ImageJ, generalmente están diseñadas para manejar una variedad de tipos de imágenes y profundidades de bits exóticos, no ocurre lo mismo con el software no científico.
pt_br: Um dos maiores motivos para usar imagens RGB na ciência é para apresentação. Embora os aplicativos de software especializados de análise de imagens, como o ImageJ, sejam normalmente projetados para lidar com uma variedade de tipos de imagens exóticas e profundidades de bits, o mesmo não acontece com softwares não científicos.

source: If want want an image to dispay exactly the same in ImageJ as in a PowerPoint&reg; presentation or a figure in a publication, for example, we'll probably want to convert it to RGB. If we don't, the image might display very strangely on other software -- or even not open at all.
es: Si queremos que una imagen se muestre exactamente igual en ImageJ que en una presentación de PowerPoint&reg; o una figura en una publicación, por ejemplo, probablemente querremos convertirla a RGB. Si no lo hacemos, la imagen podría verse de manera muy extraña en otro software, o incluso no abrirse en absoluto.
pt_br: Se quisermos que uma imagem seja exibida no ImageJ exatamente da mesma forma que em uma apresentação do PowerPoint&reg; ou uma figura em uma publicação, por exemplo, provavelmente desejaremos convertê-la para RGB . Caso contrário, a imagem poderá ser exibida de forma muito estranha em outro software - ou até mesmo não abrir.

source: 'Why is my image just black?'
es: '¿Por qué mi imagen es simplemente negra?'
pt_br: 'Por que minha imagem é apenas preta?'

source: Over the years, I have encountered a remarkable number of cases where a researcher has saved their fluorescence microscopy images *only* in an RGB format.
es: A lo largo de los años, me he encontrado con un número notable de casos en los que un investigador guardó sus imágenes de microscopía de fluorescencia *sólo* en formato RGB.
pt_br: Ao longo dos anos, encontrei um número notável de casos em que um pesquisador salvou suas imagens de microscopia de fluorescência *apenas* em formato RGB.

source: Their justification was that they tried saving the images in different way at the microscope, but *'it didn't work -- the images were all black'*.
es: Su justificación fue que intentaron guardar las imágenes de otra manera en el microscopio, pero "no funcionó: todas las imágenes eran negras".
pt_br: A justificativa deles foi que tentaram salvar as imagens de maneira diferente no microscópio, mas *'não funcionou - as imagens estavam todas pretas'*.

source: The explanation is almost invariably that their images were really 16-bit or 32-bit, but they tried to open them in software that doesn't handle 16-bit images very well (e.g. they just double-clicked the file to open it in the default image viewer). All they saw as a black, seemingly-empty image.
es: La explicación es casi invariablemente que sus imágenes eran en realidad de 16 o 32 bits, pero intentaron abrirlas en un software que no maneja muy bien imágenes de 16 bits (por ejemplo, simplemente hicieron doble clic en el archivo para abrirlo en el visor de imágenes predeterminado). Todo lo que vieron fue una imagen negra y aparentemente vacía.
pt_br: A explicação é quase invariavelmente que suas imagens eram na verdade de 16 ou 32 bits, mas eles tentaram abri-las em um software que não lida muito bem com imagens de 16 bits (por exemplo, eles apenas clicaram duas vezes no arquivo para abri-lo em o visualizador de imagens padrão). Tudo o que eles viram foi uma imagem preta e aparentemente vazia.

source: Whenever they tried exporting from the microscope's acquisition software in different ways, they found an option that gave a viewable image -- and stuck with that.
es: Cada vez que intentaron exportar desde el software de adquisición del microscopio de diferentes maneras, encontraron una opción que ofrecía una imagen visible, y se quedaron con ella.
pt_br: Sempre que tentavam exportar do software de aquisição do microscópio de diferentes maneiras, encontravam uma opção que fornecia uma imagem visível – e continuavam com ela.

source: The problem with this is that it usually meant that *they didn't save their raw data at all!* They *only* saved an RGB copy, with all the rescaling and LUT magic applied, which is wholly unsuitable for analysis.
es: El problema con esto es que generalmente significa que *¡no guardaron sus datos originales, sin procesar, en absoluto!* *Solo* guardaron una copia RGB, con todo el cambio de escala y la magia LUT aplicada, lo cual es totalmente inadecuado para el análisis.
pt_br: O problema com isso é que geralmente significava que *eles não salvaram seus dados brutos!* Eles *apenas* salvaram uma cópia RGB, com todo o redimensionamento e magia LUT aplicados, o que é totalmente inadequado para análise.

source: The solution is to view images in ImageJ, or similar scientific software. This usually reveals that the image is not 'all black' after all. Rather, one only needs to adjust the brightness and contrast (using the LUT) to see the raw data in all its glory.
es: La solución es ver imágenes en ImageJ o software científico similar. Esto normalmente revela que la imagen no es "completamente negra" después de todo. Más bien, sólo es necesario ajustar el brillo y el contraste (usando el LUT) para ver los datos sin procesar en todo su esplendor.
pt_br: A solução é visualizar imagens em ImageJ ou software científico semelhante. Isso geralmente revela que a imagem não é “toda preta”, afinal. Em vez disso, basta ajustar o brilho e o contraste (usando a LUT) para ver os dados brutos em toda a sua glória.

source: When RGB is all you've got
es: Cuando RGB es todo lo que tienes
pt_br: Quando RGB é tudo que você tem
