Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/4-colors/imagej.po
Languages: de

source: ImageJ: Channels & colors
de: ImageJ: Kanäle und Farben

source: Introduction
de: Einführung

source: ImageJ has good support for both RGB and multichannel images, but the behavior is not always obvious. This section explains the ideas, including common areas of confusion.
de: ImageJ bietet gute Unterstützung sowohl für RGB- als auch für Mehrkanalbilder, aber das Verhalten ist nicht immer offensichtlich. In diesem Abschnitt werden die Ideen erklärt, einschließlich der häufigsten Verwirrungen.

source: RGB vs. Multichannel
de: RGB vs. Mehrkanal

source: ImageJ treats RGB as a special image type, even though it is still [8-bit unsigned integer](chap_bit_depths_imagej). There are several ways to recognize that an image has the type 'RGB':
de: ImageJ behandelt RGB als einen speziellen Bildtyp, auch wenn es sich immer noch um [8-bit unsigned integer](chap_bit_depths_imagej) handelt. Es gibt mehrere Möglichkeiten zu erkennen, dass ein Bild den Typ "RGB" hat:

source: The text *RGB* appears at the top of the image window
de: Der Text *RGB* erscheint am oberen Rand des Bildfensters

source: {menuselection}`Image --> Type --> RGB Color` is selected
de: {menuselection}Bild --&gt; Typ --&gt; RGB-Farbe" ist ausgewählt

source: When moving the cursor over the image, there are *three* values shown in the status bar (e.g. *value=127,127,127*) instead of one
de: Wenn Sie den Cursor über das Bild bewegen, werden in der Statusleiste *drei* Werte angezeigt (z. B. *Wert=127,127,127*) statt einem

source: Multichannel images that *aren't* RGB are recognizable because they have an extra slider at the bottom, with a small {guilabel}`C` label, which is used to switch the 'active' channel. The {menuselection}`Image --> Type --> ` will be {menuselection}`8-bit`, {menuselection}`16-bit` or {menuselection}`32-bit`.
de: Mehrkanalbilder, die *nicht* RGB sind, erkennt man daran, dass sie unten einen zusätzlichen Schieberegler mit einem kleinen {guilabel}"C" haben, mit dem man den "aktiven" Kanal umschalten kann. Unter {menuselection}`Bild --&gt; Typ --&gt;` steht {menuselection}`8-bit`, {menuselection}`16-bit` oder {menuselection}`32-bit`.

source: A multichannel image (left) and RGB image (right). The colors used to display the image are identical, but other aspects of the image window indicate that the images themselves are quite different.
de: Ein Mehrkanalbild (links) und ein RGB-Bild (rechts). Die Farben, die zur Darstellung des Bildes verwendet werden, sind identisch, aber andere Aspekte des Bildfensters weisen darauf hin, dass die Bilder selbst recht unterschiedlich sind.

source: The distinction is really important when it comes to measurements and histograms, because the behavior between RGB and multichannel images is subtly different:
de: Die Unterscheidung ist besonders wichtig, wenn es um Messungen und Histogramme geht, denn das Verhalten von RGB- und Mehrkanalbildern ist sehr unterschiedlich:

source: **Multichannel images:**
de: **Mehrkanalbilder:**

source: {menuselection}`Analyze --> Measure` uses the active channel only, based on the {guilabel}`C` slider
de: {menuselection}Analysieren --&gt; Messen" verwendet nur den aktiven Kanal, basierend auf dem {guilabel} Schieberegler "C".

source: {menuselection}`Analyze --> Histogram` uses either uses the active channel only or all channels, after prompting the user to choose
de: {menuselection}Analysieren --&gt; Histogramm" verwendet entweder nur den aktiven Kanal oder alle Kanäle, nachdem der Benutzer zur Auswahl aufgefordert wurde

source: {menuselection}`Image --> Adjust --> Brightness/Contrast...` can be used to adjust the brightness & contrast for the active channel
de: {menuselection}Mit "Bild --&gt; Anpassen --&gt; Helligkeit/Kontrast..." können Sie die Helligkeit und den Kontrast für den aktiven Kanal einstellen.

source: It is possible to change LUTs independently for each channel
de: Es ist möglich, die LUTs unabhängig für jeden Kanal zu ändern

source: **RGB images:**
de: **RGB-Bilder:**

source: {menuselection}`Analyze --> Measure` converts the image to have a single 8-bit channel before making measurements
de: {menuselection}Analysieren --&gt; Messen" wandelt das Bild in einen einzelnen 8-Bit-Kanal um, bevor es gemessen wird.

source: {menuselection}`Analyze --> Histogram` creates a histogram after converting the image as above, but also provides an {guilabel}`RGB` button to also view separate histograms for the red, green and blue channels
de: {menuselection}Analysieren --&gt; Histogramm" erstellt ein Histogramm nach der Konvertierung des Bildes wie oben, bietet aber auch eine {guilabel}"RGB"-Schaltfläche, um separate Histogramme für den roten, grünen und blauen Kanal anzuzeigen.

source: {menuselection}`Image --> Adjust --> Brightness/Contrast...` can only be used to adjust the brightness & contrast for all channels simultaneously
de: {menuselection}Bild --&gt; Anpassen --&gt; Helligkeit/Kontrast..." kann nur verwendet werden, um die Helligkeit und den Kontrast für alle Kanäle gleichzeitig einzustellen.

source: It is *not* possible to change LUTs per channel
de: Es ist *nicht* möglich, LUTs pro Kanal zu ändern

source: When it comes to measuring an RGB image, the enigmatic statement above that ImageJ 'converts the image' is explained (in more detail than you might want) [at the end](sec_colors_converts).
de: Wenn es um die Messung eines RGB-Bildes geht, wird die rätselhafte Aussage oben, dass ImageJ "das Bild umwandelt", (ausführlicher als Sie vielleicht wollen) [am Ende](sec_colors_converts) erklärt.

source: Practical
de: Praktisch

source: Explore several of the images under {menuselection}`File --> Open Samples -->` and identify which are treated by ImageJ as RGB, which as multichannel, and which have just a single channel. There is only one correct answer per image.
de: Untersuchen Sie mehrere der Bilder unter {menuselection}`Datei --&gt; Beispiele öffnen --&gt;` und identifizieren Sie, welche von ImageJ als RGB behandelt werden, welche als Mehrkanal und welche nur einen einzigen Kanal haben. Es gibt nur eine richtige Antwort pro Bild.

source: **Note 1:** Here, 'RGB' means that ImageJ treats the image has having the special 'RGB' image type. It's possible for a multichannel image to have three channels with red, green and blue LUTs, but Imagej doesn't consider it to be RGB. You should therefore use the rules given above to distinguish images RGB from multichannel.
de: **Anmerkung 1:** Hier bedeutet "RGB", dass ImageJ das Bild mit dem speziellen Bildtyp "RGB" behandelt. Es ist möglich, dass ein Mehrkanalbild drei Kanäle mit roten, grünen und blauen LUTs hat, aber Imagej betrachtet es nicht als RGB. Sie sollten daher die oben genannten Regeln anwenden, um RGB-Bilder von Mehrkanalbildern zu unterscheiden.

source: **Note 2:** At the time I write this, the sample images don't work for me properly in Fiji -- but they do work in ImageJ. Hopefully the Fiji bug will be fixed before you read this.
de: **Anmerkung 2:** Zu dem Zeitpunkt, an dem ich dies schreibe, funktionieren die Beispielbilder bei mir nicht richtig in Fiji - aber sie funktionieren in ImageJ. Hoffentlich ist der Fehler in Fiji behoben, bevor Sie dies lesen.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io)

source: launch ImageJ.JS
de: ImageJ.JS starten

source: Solution
de: Lösung

source: There are several awkward images:
de: Es gibt mehrere unangenehme Bilder:

source: {menuselection}`HeLa Cells (48-bit RGB)` is *not* treated as having the RGB type... and ImageJ doesn't have a '48-bit' type either! Here, 48-bit RGB means that we actually have three 16-bit channels with red, green and blue LUTs. For ImageJ, that's not really an RGB image, it's a multichannel image. Don't expect too much consistency in naming: always check the types!
de: {menuselection}HeLa Cells (48-bit RGB)" wird *nicht* als RGB-Typ behandelt... und ImageJ hat auch keinen "48-bit"-Typ! 48-bit RGB bedeutet hier, dass wir drei 16-bit Kanäle mit roten, grünen und blauen LUTs haben. Für ImageJ ist das nicht wirklich ein RGB-Bild, sondern ein Mehrkanalbild. Erwarten Sie nicht zu viel Konsistenz bei der Benennung: Überprüfen Sie immer die Typen!

source: {menuselection}`Fly Brain` has a slider, but it doesn't have a {guilabel}`C` label. This is because the slider isn't for channels, but rather for *z*-slices. We will meet *z*-slices in the [next chapter](chap_dimensions).
de: {menuselection}Fly Brain" hat einen Schieberegler, aber kein {guilabel}"C" Label. Das liegt daran, dass der Schieberegler nicht für Kanäle, sondern für *z*-Scheiben gedacht ist. Wir werden *z*-Scheiben im [nächsten Kapitel](chap_dimensions) kennenlernen.

source: {menuselection}`Image with Overlay` looks colorful, but the colors all come from the [overlay](sec_imagej_overlay) -- not from the image being RGB. Admittedly, the name helps here.
de: {menuselection}Bild mit Überlagerung" sieht farbenfroh aus, aber die Farben kommen alle von der [Überlagerung](sec_imagej_overlay) -- nicht von dem Bild, das RGB ist. Zugegeben, der Name hilft hier.

source: Working with channels
de: Arbeiten mit Kanälen

source: There are several useful commands for working with color channels under {menuselection}`Image --> Color --> `. Some of these, such as {menuselection}`Image --> Color --> Split channels` and {menuselection}`Image --> Color --> Merge channels` are quite intuitive, and work for both RGB and multichannel images.
de: Es gibt mehrere nützliche Befehle für die Arbeit mit Farbkanälen unter {menuselection}`Bild --&gt; Farbe --&gt; `. Einige davon, wie {menuselection}`Bild --&gt; Farbe --&gt; Kanäle teilen` und {menuselection}`Bild --&gt; Farbe --&gt; Kanäle zusammenführen` sind recht intuitiv und funktionieren sowohl für RGB- als auch für Mehrkanalbilder.

source: One of the most useful commands that requires some explanation is {menuselection}`Image --> Color --> Channels Tool...` {kbd}`Shift+Z`. If you run the {menuselection}`Channels Tool...` command for an RGB image and try to do anything, ImageJ will ask
de: Einer der nützlichsten Befehle, der einer Erklärung bedarf, ist {menuselection}`Bild --&gt; Farbe --&gt; Kanalwerkzeug...` {kbd}`Umschalt+Z`. Wenn Sie den Befehl {menuselection}`Channels Tool...` für ein RGB-Bild ausführen und versuchen, etwas zu tun, wird ImageJ fragen

source: Agreeing to the prompt will convert the RGB image to a multichannel image.
de: Wenn Sie der Aufforderung zustimmen, wird das RGB-Bild in ein Mehrkanalbild umgewandelt.

source: The question might be a little bit confusing because 'composite' and 'multichannel' do not quite mean the same thing, although they are sometimes used interchangeably with ImageJ. To be more precise, a 'composite image' in this context is a multichannel image that is displayed using a particular **display mode**.
de: Die Frage ist vielleicht etwas verwirrend, weil "Composite" und "Multichannel" nicht ganz dasselbe bedeuten, obwohl sie in ImageJ manchmal austauschbar verwendet werden. Um genauer zu sein, ist ein "zusammengesetztes Bild" in diesem Zusammenhang ein Mehrkanalbild, das in einem bestimmten **Anzeigemodus** angezeigt wird.

source: ImageJ has three main modes for displaying multichannel images, accessible from the drop-down menu of the *Channels Tool* dialog:
de: ImageJ verfügt über drei Hauptmodi für die Anzeige von Mehrkanalbildern, die über das Dropdown-Menü des Dialogfelds *Kanalwerkzeug* zugänglich sind:

source: {guilabel}`Composite` -- Merge some or all the channels together for display. Currently, this works with up to 7 or 8 channels (depending on software version; an extra one was added recently). Individual channels can be turned on and off.
de: {guilabel}Composite" - Einige oder alle Kanäle für die Anzeige zusammenführen. Derzeit funktioniert dies mit bis zu 7 oder 8 Kanälen (je nach Softwareversion; ein zusätzlicher wurde kürzlich hinzugefügt). Einzelne Kanäle können ein- und ausgeschaltet werden.

source: {guilabel}`Color` -- View the 'active' channel only, using its original color LUT. You can switch the channel with the slider below the image.
de: {guilabel}Farbe" - Zeigt nur den "aktiven" Kanal an, der seine ursprüngliche Farb-LUT verwendet. Sie können den Kanal mit dem Schieberegler unterhalb des Bildes umschalten.

source: {guilabel}`Grayscale` -- Similar to {guilabel}`Color`, except always using a grayscale LUT.
de: {guilabel}Graustufen" - Ähnlich wie {guilabel}"Farbe", aber immer mit einer Graustufen-LUT.

source: Whenever a channel is active, the LUT can be changed using options in the *Channels Tool* dialog -- or the {menuselection}`Image --> Lookup Tables --> ` submenu as usual. Similarly, {menuselection}`Image --> Adjust --> Brightness/Contrast...` works on the active channel to update the LUT.
de: Immer wenn ein Kanal aktiv ist, kann die LUT mit Hilfe der Optionen im Dialog *Kanal-Werkzeug* - oder dem Untermenü {menuselection}`Bild --&gt; Lookup-Tabellen --&gt; ` wie gewohnt geändert werden. Ähnlich funktioniert {menuselection}`Bild --&gt; Anpassen --&gt; Helligkeit/Kontrast...` mit dem aktiven Kanal, um die LUT zu aktualisieren.

source: ImageJ multichannel image sample *Fluorescent Cells*. Using the {menuselection}`Image --> Color --> Channels Tool...` and the slider at the bottom of the window, you can view the channels individually or simultaneously.
de: ImageJ-Mehrkanalbildbeispiel *Fluoreszenzzellen*. Mit dem {menuselection}"Image --&gt; Color --&gt; Channels Tool..." und dem Schieberegler am unteren Rand des Fensters können Sie die Kanäle einzeln oder gleichzeitig anzeigen.

source: The way in which {guilabel}`Composite` mode works is that an RGB image is effectively created for each channel based on its LUT, and the red, green and blue values are *added* together to get the final output color (clipping at 255 if needed).
de: Im Modus "Composite" von {guilabel} wird für jeden Kanal auf der Grundlage der zugehörigen LUT ein RGB-Bild erstellt, und die Rot-, Grün- und Blauwerte werden *addiert*, um die endgültige Ausgabefarbe zu erhalten (ggf. mit Begrenzung auf 255).

source: This isn't the only way to generate a composite image, and it doesn't work well for all LUTs -- particular LUTs that map low pixel values to bright colors or white.
de: Dies ist nicht die einzige Möglichkeit, ein zusammengesetztes Bild zu erzeugen, und sie funktioniert nicht bei allen LUTs - insbesondere bei LUTs, die niedrige Pixelwerte auf helle Farben oder Weiß abbilden.

source: Therefore, since ImageJ 1.53o some additional composite modes were added to the {menuselection}`Channels Tool...`, and refined over the next few releases after a long (and occasionally testy) discussion on image.sc. At the time of writing, the available modes are:
de: Daher wurden seit ImageJ 1.53o einige zusätzliche Composite-Modi zum {menuselection}`Channels Tool...` hinzugefügt und in den nächsten Versionen nach einer langen (und gelegentlich gereizten) Diskussion auf image.sc verfeinert. Zum Zeitpunkt der Erstellung dieses Artikels sind die folgenden Modi verfügbar:

source: {guilabel}`Composite Max` -- Similar to {guilabel}`Composite`, except use the *maximum* of the red, green and blue values across all channels (not the sum)
de: {guilabel}Composite Max" - Ähnlich wie {guilabel}"Composite", nur dass das *Maximum* der Rot-, Grün- und Blauwerte über alle Kanäle verwendet wird (nicht die Summe)

source: {guilabel}`Composite Min` -- Similar to {guilabel}`Composite Max`, except use the *minimum* of the red, green and blue values across all channels (not the maximum)
de: {guilabel}Composite Min" - Ähnlich wie "Composite Max" ( {guilabel}), aber mit dem Unterschied, dass das *Minimum* der Rot-, Grün- und Blauwerte über alle Kanäle hinweg verwendet wird (nicht das Maximum).

source: {guilabel}`Composite Invert` -- Similar to {guilabel}`Composite`, except *subtract* the red, green and blue LUT values instead of adding them
de: {guilabel}Composite Invert" - Ähnlich wie {guilabel}"Composite", außer dass die roten, grünen und blauen LUT-Werte *subtrahiert* werden, anstatt sie zu addieren.

source: Both {guilabel}`Composite Min` and {guilabel}`Composite Invert` are useful for LUTs with light backgrounds, therefore if you select one of these options ImageJ may flip a LUT to have a light background if needed.
de: Sowohl {guilabel}`Composite Min` als auch {guilabel}`Composite Invert` sind nützlich für LUTs mit hellem Hintergrund. Wenn Sie eine dieser Optionen wählen, kann ImageJ eine LUT umdrehen, so dass sie einen hellen Hintergrund hat, wenn nötig.

source: Visualizing the new composite modes.
de: Visualisierung der neuen zusammengesetzten Modi.

source: Be careful with composites!
de: Seien Sie vorsichtig mit Verbundwerkstoffen!

source: Any new visualization modes have the potential to cause confusion or to be abused. Although the new composite modes can be useful, I advise caution.
de: Alle neuen Visualisierungsmodi haben das Potenzial, Verwirrung zu stiften oder missbraucht zu werden. Obwohl die neuen zusammengesetzten Modi nützlich sein können, rate ich zur Vorsicht.

source: The original {guilabel}`Composite` mode is really well established, and is the default. If you use any of the 'new' composite modes in a figure for publication, you should clearly specify which.
de: Der ursprüngliche {guilabel}"Composite"-Modus hat sich sehr gut bewährt und ist die Standardeinstellung. Wenn Sie einen der "neuen" Composite-Modi in einer zu veröffentlichenden Abbildung verwenden, sollten Sie klar angeben, welchen.

source: Choosing channel colors
de: Auswahl der Kanalfarben

source: By changing the LUTs, channels can be assigned any color you like. Although red/green images are widespread, especially for colocalization, they are particularly unhelpful for colorblindness. More accessible images can be created by switching the LUTs of at least one channel to something more suitable (e.g. Red &rarr; Magenta) – although displaying both channels separately is better still.
de: Durch Ändern der LUTs kann den Kanälen jede beliebige Farbe zugewiesen werden. Obwohl Rot/Grün-Bilder weit verbreitet sind, insbesondere für die Kolokalisierung, sind sie bei Farbenblindheit besonders wenig hilfreich. Besser zugängliche Bilder lassen sich erstellen, indem man die LUTs mindestens eines Kanals auf etwas Geeigneteres umstellt (z. B. Rot &rarr;<span class='transifex-protect'> </span> Magenta) - noch besser ist es allerdings, beide Kanäle getrennt darzustellen.

source: You can also test the effects of different colors using the Fiji command {menuselection}`Image --> Color --> Simulate Color Blindness` (note that this may require converting the image to RGB first).
de: Sie können die Auswirkungen verschiedener Farben auch mit dem Fiji-Befehl {menuselection}`Bild --&gt; Farbe --&gt; Farbenblindheit simulieren` testen (beachten Sie, dass Sie das Bild dazu möglicherweise zuerst in RGB konvertieren müssen).

source: More information about generating figures with suitable colors is available at <https://www.nature.com/articles/nmeth.1618>.
de: Weitere Informationen zur Erstellung von Figuren mit geeigneten Farben finden Sie unter <https://www.nature.com/articles/nmeth.1618>.

source: Converting to RGB
de: Konvertierung in RGB

source: As described in {ref}`chap_colors`, one of the most important uses of RGB images is to create a compatible image for display in different software. We will see more about how to save such images in {ref}`chap_files`.
de: Wie in {ref}`chap_colors` beschrieben, besteht eine der wichtigsten Verwendungen von RGB-Bildern darin, ein kompatibles Bild für die Anzeige in verschiedenen Programmen zu erstellen. Wir werden mehr darüber erfahren, wie man solche Bilder in {ref}`chap_files` speichert.

source: It should be possible to convert any image to RGB using {menuselection}`Image --> Type --> RGB Color`. However, my preferred way to create an RGB image for display is usually {menuselection}`Image --> Overlay --> Flatten` {kbd}`Shift+F`. This not only converts the image, but also incorporates any ROIs or overlays into the RGB version. Flattening is similar to taking a screenshot of the image as it currently appears, except unaffected by the current zoom level or field of view.
de: Es sollte möglich sein, jedes Bild mit {menuselection}`Bild --&gt; Typ --&gt; RGB-Farbe` in RGB zu konvertieren. Meine bevorzugte Methode zur Erstellung eines RGB-Bildes für die Anzeige ist jedoch {menuselection}`Bild --&gt; Überlagerung --&gt; Verflachen` {kbd}`Umschalt+F`. Dabei wird nicht nur das Bild konvertiert, sondern auch alle ROIs oder Überlagerungen in die RGB-Version integriert. Das Verkleinern ist vergleichbar mit einem Screenshot des Bildes, wie es gerade angezeigt wird, nur dass es nicht von der aktuellen Zoomstufe oder dem Sichtfeld beeinflusst wird.

source: Question
de: Frage

source: ImageJ has two different copying commands, {menuselection}`Edit --> Copy` and {menuselection}`Edit --> Copy to System`. Why?
de: ImageJ hat zwei verschiedene Kopierbefehle, {menuselection}`Bearbeiten --&gt; Kopieren` und {menuselection}`Bearbeiten --&gt; In System kopieren`. Warum?

source: **Note:** When investigating this, you should explore {menuselection}`Edit --> Paste`, alongside two commands in the {menuselection}`File --> New -->` submenu. Be on the lookout for any conversions.
de: **Hinweis:** Wenn Sie dies untersuchen, sollten Sie {menuselection}`Bearbeiten --&gt; Einfügen` sowie zwei Befehle im Untermenü {menuselection}`Datei --&gt; Neu --&gt;` untersuchen. Halten Sie Ausschau nach Konvertierungen.

source: Answer
de: Antwort

source: {menuselection}`Edit --> Copy` allows you to copy part of an individual image slice (i.e. a 2D part of a particular color channel) and paste it into another image while exactly preserving the original image type and pixel values. You can also use {menuselection}`File --> New --> Internal Clipboard` to get the copied region (but {menuselection}`Image --> Duplicate...` is usually a better option). However, this image type might well not be compatible with other software, therefore images copied in this way cannot be accessed outside ImageJ.
de: {menuselection}Mit `Bearbeiten --&gt; Kopieren` können Sie einen Teil eines einzelnen Bildausschnitts (z.B. einen 2D-Teil eines bestimmten Farbkanals) kopieren und in ein anderes Bild einfügen, wobei der ursprüngliche Bildtyp und die Pixelwerte genau erhalten bleiben. Sie können auch {menuselection}`Datei --&gt; Neu --&gt; Interne Zwischenablage` verwenden, um den kopierten Bereich zu erhalten (aber {menuselection}`Bild --&gt; Duplizieren...` ist normalerweise eine bessere Option). Allerdings ist dieser Bildtyp möglicherweise nicht mit anderer Software kompatibel, so dass auf Bilder, die auf diese Weise kopiert wurden, außerhalb von ImageJ nicht zugegriffen werden kann.

source: {menuselection}`Edit --> Copy to System` is needed if you want to copy an image to the system clipboard so that it can be pasted into other software. However, be warned that this converts the image to RGB in the process. If therefore preserves the image appearance, but not necessarily the pixel values.
de: {menuselection}Bearbeiten --&gt; Ins System kopieren" wird benötigt, wenn Sie ein Bild in die Zwischenablage des Systems kopieren wollen, damit es in andere Software eingefügt werden kann. Beachten Sie jedoch, dass dabei das Bild in RGB umgewandelt wird. Dadurch bleibt zwar das Aussehen des Bildes erhalten, aber nicht unbedingt die Pixelwerte.
