Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/4-colors/imagej.po
Languages: de

source: You can test the compatibility of composite and RGB images by opening {menuselection}`File --> Open Samples --> HeLa Cells` image, and saving it using {menuselection}`File --> Save As --> Tiff...` both before and after running {menuselection}`Image --> Type --> RGB Color` to convert the original 16-bit composite data to RGB.
de: Sie können die Kompatibilität von Composite- und RGB-Bildern testen, indem Sie das Bild {menuselection}`Datei --&gt; Proben öffnen --&gt; HeLa-Zellen` öffnen und es mit {menuselection}`Datei --&gt; Speichern unter --&gt; Tiff...` sowohl vor als auch nach der Ausführung von {menuselection}`Bild --&gt; Typ --&gt; RGB-Farbe` speichern, um die ursprünglichen 16-Bit-Composite-Daten in RGB zu konvertieren.

source: Try then opening both saved images in other software (e.g. Microsoft PowerPoint&reg;) and compare their appearance.
de: Versuchen Sie dann, beide gespeicherten Bilder in einer anderen Software (z. B. Microsoft PowerPoint&reg;) zu öffnen und vergleichen Sie ihr Aussehen.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)

source: Think of at least 2 ways in which converting a composite image to RGB can lose information.
de: Überlegen Sie sich mindestens 2 Möglichkeiten, wie bei der Umwandlung eines Composite-Bildes in RGB Informationen verloren gehen können.

source: You can explore this by comparing the images *Neuron-composite.tif* and *Neuron-RGB.tif*. The {menuselection}`Image --> Color --> Split Channels` command should help.
de: Sie können dies untersuchen, indem Sie die Bilder *Neuron-composite.tif* und *Neuron-RGB.tif* vergleichen. Der Befehl {menuselection}"Bild --&gt; Farbe --&gt; Kanäle teilen" sollte dabei helfen.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-composite.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-RGB.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-composite.tif&amp;open=https://github.com/bioimagebook/practical-data/blob/main/images/Neuron-RGB.tif)

source: One way that converting an image to RGB can lose information is if the original data is 16-bit before conversion and 8-bit afterwards, causing rounding and/or clipping to occur (see {ref}`chap_bit_depths`).
de: Bei der Konvertierung eines Bildes in RGB können Informationen verloren gehen, wenn die Originaldaten vor der Konvertierung 16-Bit und danach 8-Bit sind, was zu Rundungen und/oder Beschneidungen führt (siehe {ref}`chap_bit_depths`).

source: Another is that during conversion the channels have been forced to be purely red, green and blue. But perhaps they were not originally so, and separate channels have been merged into the same ones. If you had started with more than three channels, this will definitely have occurred, but even if you had fewer channels you can have problems (like in the *Neuron_composite.tif* and *Neuron_RGB.tif* examples).
de: Eine andere Möglichkeit ist, dass die Kanäle bei der Konvertierung in reine Rot-, Grün- und Blaukanäle umgewandelt wurden. Aber vielleicht waren sie ursprünglich nicht so, und getrennte Kanäle wurden zu denselben zusammengeführt. Wenn Sie mit mehr als drei Kanälen begonnen haben, wird dies mit Sicherheit der Fall gewesen sein, aber auch bei weniger Kanälen können Probleme auftreten (wie in den Beispielen *Neuron_composite.tif* und *Neuron_RGB.tif*).

source: The trouble with _only_ having an RGB image is that it is no longer possible to know for sure what the original data looked like, to be able to figure out whether anything has been lost. For example, perhaps you have managed to generate a magnificent image consisting of turquoise, yellow and dazzling pink channels. Each pixel is displayed on screen as a combination of those colors. However, precisely the same color for any pixel can also be represented -- rather more simply -- as a mixture of red, green and blue. So no matter what channels and colors you began with, the final result after merging can be replicated using red, green and blue channels. But if you _only_ have the RGB version, you might never be able to extract the original 3 channels again. Their colors could be so mixed together that the original pixel values would be irretrievably lost.
de: Das Problem, wenn man _nur_ ein RGB-Bild hat, besteht darin, dass man nicht mehr mit Sicherheit weiß, wie die ursprünglichen Daten aussahen, um herauszufinden, ob etwas verloren gegangen ist. Vielleicht ist es Ihnen gelungen, ein wunderschönes Bild zu erzeugen, das aus türkisfarbenen, gelben und pinkfarbenen Kanälen besteht. Jedes Pixel wird auf dem Bildschirm als eine Kombination dieser Farben angezeigt. Genau dieselbe Farbe für jedes Pixel kann aber auch - etwas einfacher - als eine Mischung aus Rot, Grün und Blau dargestellt werden. Unabhängig davon, mit welchen Kanälen und Farben Sie begonnen haben, kann das Endergebnis nach der Zusammenführung mit roten, grünen und blauen Kanälen wiedergegeben werden. Wenn Sie aber _nur_ die RGB-Version haben, können Sie die ursprünglichen 3 Kanäle möglicherweise nie wieder extrahieren. Ihre Farben könnten so vermischt sein, dass die ursprünglichen Pixelwerte unwiederbringlich verloren gehen.

source: And so the good things about RGB images are that they look identical to the original image you had before conversion, and other software (e.g. webbrowsers or PowerPoint&reg;) can understand them effortlessly. But the _potentially very bad_ thing about RGB images is that creating them requires conversion, and after this it might very well be _impossible_ to regain the original pixel values.
de: Das Gute an RGB-Bildern ist also, dass sie genauso aussehen wie das Originalbild vor der Konvertierung und dass andere Software (z. B. Webbrowser oder PowerPoint&reg;) sie mühelos verstehen kann. Das _potenziell sehr Schlechte_ an RGB-Bildern ist jedoch, dass ihre Erstellung eine Konvertierung erfordert, und dass es danach _unmöglich_ sein kann, die ursprünglichen Pixelwerte wiederherzustellen.

source: How RGB images are converted / How I find out what I can't remember
de: Wie RGB-Bilder umgewandelt werden / Wie ich herausfinde, was ich mir nicht merken kann

source: When describing how {menuselection}`Analyze --> Measure` handles RGB image, I said that it converts the image first.
de: Bei der Beschreibung, wie {menuselection}`Analysieren --&gt; Messen` mit RGB-Bildern umgeht, habe ich gesagt, dass das Bild zuerst umgewandelt wird.

source: 'Converts the image' is a fairly vague statement for a very good reason: I only have a vague awareness of how it works, because I've never needed to know it. RGB images aren't good for quantification anyway, so I don't often have any reason to measure pixel values within them.
de: Konvertiert das Bild" ist eine ziemlich vage Aussage, und das aus einem guten Grund: Ich habe nur eine vage Vorstellung davon, wie das funktioniert, weil ich es nie wissen musste. RGB-Bilder eignen sich ohnehin nicht zur Quantifizierung, so dass ich nicht oft einen Grund habe, Pixelwerte in ihnen zu messen.

source: I admit this to give reassurance that there's a good chance you don't need to know it either. So if you find the rest of this box confusing, don't worry.
de: Ich gebe dies zu, um Ihnen zu versichern, dass Sie es wahrscheinlich auch nicht wissen müssen. Wenn Sie also den Rest dieser Box verwirrend finden, machen Sie sich keine Sorgen.

source: **However,** it also gives an opportunity to make a bigger point: there are too many intricacies within ImageJ to remember all of them. And that's fine. I believe that a far more important skill is knowing how to investigate what is happening.
de: **Es bietet jedoch auch die Gelegenheit, einen größeren Punkt zu machen: Es gibt zu viele Feinheiten in ImageJ, um sich alle zu merken. Und das ist auch gut so. Ich glaube, dass eine viel wichtigere Fähigkeit darin besteht, zu wissen, wie man untersucht, was passiert.

source: And so here is how I set about understanding what 'converts the image' means.
de: Und so habe ich mich daran gemacht zu verstehen, was "das Bild umwandeln" bedeutet.

source: Firstly, I created an RGB image with 50x50 pixels known values for red (0), green (100) and blue (200).
de: Zunächst habe ich ein RGB-Bild mit 50x50 Pixeln erstellt, dessen Werte für Rot (0), Grün (100) und Blau (200) bekannt sind.

source: **If** the conversion is simply averaging the red, green and blue values then I would expect the result of running {menuselection}`Analyze --> Measure` to be 100 (since that is the mean of 0, 100 and 200). When I tested it, I found that was the case. I tried some other values, and they all behaved the same way: it appears that conversion is simply averaging the channels.
de: **Wenn** die Konvertierung einfach eine Mittelwertbildung der roten, grünen und blauen Werte ist, dann würde ich erwarten, dass das Ergebnis von {menuselection}"Analysieren --&gt; Messen" 100 ist (da dies der Mittelwert von 0, 100 und 200 ist). Bei meinen Tests stellte ich fest, dass dies der Fall war. Ich habe einige andere Werte ausprobiert, und sie verhielten sich alle gleich: Es scheint, dass die Konvertierung einfach den Mittelwert der Kanäle bildet.

source: I then hypothesised that I should get the same thing if I use {menuselection}`Image --> Type --> 8-bit`. So I tried that out, and again it matched expectations.
de: Ich stellte dann die Hypothese auf, dass ich dasselbe erhalten sollte, wenn ich {menuselection}`Bild --&gt; Typ --&gt; 8-Bit` verwende. Also habe ich das ausprobiert, und wieder entsprach es den Erwartungen.

source: So I concluded that {menuselection}`Analyze --> Measure` was quietly calling {menuselection}`Image --> Type --> 8-bit` on a copy of the image, and then measuring *that*.
de: Daraus schloss ich, dass {menuselection}"Analysieren --&gt; Messen" im Stillen {menuselection}"Bild --&gt; Typ --&gt; 8-Bit" auf einer Kopie des Bildes aufrief und dann *diese* Messung vornahm.

source: Or maybe it's calling {menuselection}`Image --> Type --> 32-bit` instead?
de: Oder vielleicht ruft es stattdessen {menuselection}`Bild --&gt; Typ --&gt; 32-bit` auf?

source: I needed a new image that would show the effects of rounding, so I added 1 to the blue channel, making its values 201.
de: Ich brauchte ein neues Bild, das die Auswirkungen der Rundung zeigt, also fügte ich dem blauen Kanal 1 hinzu und machte seine Werte zu 201.

source: I then tried {menuselection}`Image --> Type --> 32-bit`, which gave the expected average of 100.33. But {menuselection}`Image --> Type --> 8-bit` still gave 100 per pixel -- because it is limited to integers. And {menuselection}`Analyze --> Measure` also gave me 100 -- which suggest that it converts the RGB images to 8-bit, not floating point, when making its measurements.
de: Dann habe ich {menuselection}`Bild --&gt; Typ --&gt; 32-Bit` ausprobiert, was den erwarteten Durchschnitt von 100,33 ergab. Aber {menuselection}`Image --&gt; Type --&gt; 8-bit` ergab immer noch 100 pro Pixel -- weil es auf Ganzzahlen beschränkt ist. Und {menuselection}`Analyze --&gt; Measure` ergab ebenfalls 100 -- was darauf hindeutet, dass es die RGB-Bilder in 8-Bit und nicht in Fließkomma umwandelt, wenn es seine Messungen durchführt.

source: Finally, I remembered that ImageJ sometimes sneaks in extra options. So I opened {menuselection}`Edit --> Options --> Conversions...` and found a checkbox for {menuselection}`Weighted RGB conversion`. If I selected it, and repeated the steps above I got quite different answers -- because it no longer converts using a straight 'average of the 3 channels'. Rather, each channel is weighted: 0.30 x Red + 0.59 x Green + 0.11 x Blue.
de: Schließlich erinnerte ich mich daran, dass ImageJ manchmal zusätzliche Optionen einbaut. Also öffnete ich {menuselection}`Bearbeiten --&gt; Optionen --&gt; Konvertierungen...` und fand eine Checkbox für {menuselection}`Gewichtete RGB-Konvertierung`. Wenn ich es auswählte und die obigen Schritte wiederholte, erhielt ich ganz andere Antworten - weil die Konvertierung nicht mehr mit einem einfachen "Durchschnitt der 3 Kanäle" erfolgt. Stattdessen wird jeder Kanal gewichtet: 0,30 x Rot + 0,59 x Grün + 0,11 x Blau.

source: Pondering the weights took me down a googling rabbit hole to see these are (somewhat) standard weight values for grayscale image conversion used across different software. But, more importantly, I saw that the {menuselection}`Weighted RGB conversion` option affected *both* measurement and conversion -- supporting my suspicion that they are connected.
de: Das Grübeln über die Gewichte brachte mich dazu, zu googeln und herauszufinden, dass es sich dabei um (einigermaßen) standardmäßige Gewichtungswerte für die Umwandlung von Graustufenbildern handelt, die in verschiedenen Programmen verwendet werden. Aber was noch wichtiger ist, ich habe gesehen, dass die Option {menuselection}"Gewichtete RGB-Konvertierung" *beide* Messungen und Konvertierungen beeinflusst - was meinen Verdacht bestätigt, dass sie miteinander verbunden sind.

source: Confused? Me too.
de: Verwirrt? Ich auch.

source: **But** my main point is that mortals like me can't predict what software is going to do. Even if we think we know, there's a chance some sneaky option somewhere is changing the behavior.
de: **Aber** mein Hauptpunkt ist, dass Sterbliche wie ich nicht vorhersagen können, was Software tun wird. Selbst wenn wir glauben, es zu wissen, besteht die Möglichkeit, dass eine heimtückische Option irgendwo das Verhalten ändert.

source: What we *can* do is foster a critical mind. We can learn enough about the software to know how to test what it is doing.
de: Was wir tun *können*, ist, einen kritischen Geist zu fördern. Wir können genug über die Software lernen, um zu wissen, wie wir ihre Funktionsweise testen können.

source: And that, at least, is how I learned to use ImageJ and came to write this book.
de: Auf diese Weise habe ich gelernt, ImageJ zu benutzen, und bin dazu gekommen, dieses Buch zu schreiben.
