Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/4-colors/python.po
Languages: es, pt_br

source: Python: Channels & colors
es: Python: canales y colores
pt_br: Python: canais e cores

source: This section gives a brief overview of some color-related considerations when using Python.
es: Esta sección ofrece una breve descripción general de algunas consideraciones relacionadas con el color al utilizar Python.
pt_br: Esta seção fornece uma breve visão geral de algumas considerações relacionadas a cores ao usar Python.

source: See the [scikit-image color module](https://scikit-image.org/docs/dev/api/skimage.color.html) for a lot more useful info.
es: Consulta el [scikit-image color module](https://scikit-image.org/docs/dev/api/skimage.color.html) para obtener mucha más información útil.
pt_br: Consulte o [módulo de cores scikit-image](https://scikit-image.org/docs/dev/api/skimage.color.html) para obter muito mais informações úteis.

source: RGB images
es: Imágenes RGB
pt_br: Imagens RGB

source: Let's begin by reading the RGB image used on the title page of this book.
es: Comencemos leyendo la imagen RGB utilizada en la portada de este libro.
pt_br: Vamos começar lendo a imagem RGB usada na página de título deste livro.

source: If we check the shape of the image, we can see that the RGB information seems to be joined on at the end: the shape is in the form `[rows, columns, channels]`.
es: Si comprobamos la forma de la imagen, podemos ver que la información RGB parece estar unida al final: la forma tiene el formato `[filas, columnas, canales]`.
pt_br: Se verificarmos o formato da imagem, podemos ver que as informações RGB parecem estar unidas no final: o formato está na forma `[linhas, colunas, canais]`.

source: RGB to single-channel
es: RGB a monocanal
pt_br: RGB para canal único

source: We can convert an RGB image to a single-channel image in lots of ways.
es: Podemos convertir una imagen RGB en una imagen de un solo canal de muchas maneras.
pt_br: Podemos converter uma imagem RGB em uma imagem de canal único de várias maneiras.

source: A single-channel image is often referred to as **grayscale** - although whether it is actually displayed using shades of gray or not depends upon the colormap.
es: Una imagen de un solo canal a menudo se denomina **escala de grises**, aunque si realmente se muestra usando tonos de gris o no depende del mapa de colores.
pt_br: Uma imagem de canal único é frequentemente chamada de **tons de cinza** - embora a possibilidade de ela ser realmente exibida usando tons de cinza ou não dependa do mapa de cores.

source: Split channels
es: Canales divididos
pt_br: Canais divididos

source: One option is to split the RGB channels to give three separate single-channel images.
es: Una opción es dividir los canales RGB para obtener tres imágenes separadas de un solo canal.
pt_br: Uma opção é dividir os canais RGB para fornecer três imagens separadas de canal único.

source: Averaging channels
es: Canales promediados
pt_br: Média de canais

source: A second easy option is to simply calculate the average (mean) of the RGB values.
es: Una segunda opción sencilla es simplemente calcular el promedio (media) de los valores RGB.
pt_br: Uma segunda opção fácil é simplesmente calcular a média (média) dos valores RGB.

source: However, it is common to calculate a *weighted* mean of the RGB values. Commonly the weights are
es: Sin embargo, es común calcular una media *ponderada* de los valores RGB. Comúnmente los pesos son
pt_br: No entanto, é comum calcular uma média *ponderada* dos valores RGB. Geralmente os pesos são

source: This is what scikit-image's [`rgb2gray`](https://scikit-image.org/docs/stable/api/skimage.color.html#skimage.color.rgb2gray) does, as described [here](https://scikit-image.org/docs/stable/auto_examples/color_exposure/plot_rgb_to_gray.html).
es: Esto es lo que hace [`rgb2gray`](https://scikit-image.org/docs/stable/api/skimage.color.html#skimage.color.rgb2gray) de scikit-image, como se describe [aquí](https://scikit-image.org/docs/stable/auto_examples/color_exposure/plot_rgb_to_gray.html).
pt_br: Isso é o que o [`rgb2gray`](https://scikit-image.org/docs/stable/api/skimage.color.html#skimage.color.rgb2gray) do scikit-image faz, conforme descrito [aqui](https: //scikit-image.org/docs/stable/auto_examples/color_exposure/plot_rgb_to_gray.html).

source: To be fair, the simple mean and the weighted mean images don't look very different to me.
es: Para ser justos, las imágenes de media simple y media ponderada no me parecen muy diferentes.
pt_br: Para ser justo, as imagens da média simples e da média ponderada não parecem muito diferentes para mim.

source: To check if they really *are* different, we can show one subtracted from the other.
es: Para comprobar si realmente *son* diferentes, podemos mostrar uno restado del otro.
pt_br: Para verificar se eles realmente *são* diferentes, podemos mostrar um subtraído do outro.

source: Hmmmmm, this looks very suspicious. The fact the *difference* image looks the same suggests to me that some rescaling might have happened.
es: Hmmmmmm, esto parece muy sospechoso. El hecho de que la imagen de *diferencia* luzca igual me sugiere que podría haber ocurrido algún cambio de escala.
pt_br: Hmmmmm, isso parece muito suspeito. O fato de a imagem *diferença* parecer a mesma me sugere que algum redimensionamento pode ter acontecido.

source: So let's go back to checking the `dtype` comparing statistics.
es: Entonces, volvamos a verificar las estadísticas de comparación de `dtype`.
pt_br: Então, vamos voltar a verificar as estatísticas de comparação do `dtype`.

source: Right, that seems to suggest that `rgb2gray` has also rescaled our image during conversion.
es: Bien, eso parece sugerir que `rgb2gray` también cambió la escala de nuestra imagen durante la conversión.
pt_br: Certo, isso parece sugerir que `rgb2gray` também redimensionou nossa imagem durante a conversão.

source: Indeed, it's reasonably common to work with 8-bit RGB images in Python (`uint8`) with values in the range 0-255, but it's perhaps even more common to work with floating point RGB images in the range 0-1 (either `float32` or `float64`). So we do need to be on the lookout for sneaky conversions.
es: De hecho, es razonablemente común trabajar con imágenes RGB de 8 bits en Python (`uint8`) con valores en el rango 0-255, pero quizás sea aún más común trabajar con imágenes RGB de punto flotante en el rango 0-1 (ya sea `float32` o `float64`). Por lo tanto, debemos estar atentos a las conversiones furtivas.
pt_br: Na verdade, é razoavelmente comum trabalhar com imagens RGB de 8 bits em Python (`uint8`) com valores no intervalo de 0 a 255, mas talvez seja ainda mais comum trabalhar com imagens RGB de ponto flutuante no intervalo de 0 a 1 (ou `float32` ou `float64`). Portanto, precisamos estar atentos a conversões sorrateiras.

source: With that in mind, we can make our images comparable my dividing our `im_mean` by 255.
es: Con eso en mente, podemos hacer que nuestras imágenes sean comparables dividiendo nuestro `im_mean` por 255.
pt_br: Com isso em mente, podemos tornar nossas imagens comparáveis dividindo nosso `im_mean` por 255.

source: This demonstrates that the pixel values are at least a bit different when converted using the weighted mean.
es: Esto demuestra que los valores de píxeles son al menos un poco diferentes cuando se convierten utilizando la media ponderada.
pt_br: Isso demonstra que os valores dos pixels são pelo menos um pouco diferentes quando convertidos usando a média ponderada.

source: Multichannel images
es: Imágenes multicanal
pt_br: Imagens multicanal

source: Working with multichannel (non-RGB) images in Python is extremely easy in some ways, and very awkward in others.
es: Trabajar con imágenes multicanal (no RGB) en Python es extremadamente fácil en algunos aspectos y muy incómodo en otros.
pt_br: Trabalhar com imagens multicanal (não RGB) em Python é extremamente fácil em alguns aspectos e muito complicado em outros.

source: Although because most of the awkward stuff comes at the start, that will dominate the rest of this section.
es: Aunque debido a que la mayoría de las cosas raras ocurren al principio, dominarán el resto de esta sección.
pt_br: Embora a maior parte das coisas estranhas venham no início, isso dominará o resto desta seção.

source: For example, even just opening the data properly can be a challenge.
es: Por ejemplo, incluso el simple hecho de abrir los datos correctamente puede ser un desafío.
pt_br: Por exemplo, apenas abrir os dados corretamente pode ser um desafio.

source: Reading multichannel images
es: Lectura de imágenes multicanal
pt_br: Lendo imagens multicanal

source: I like using [imageio](https://imageio.readthedocs.io/en/v2.9.0/userapi.html) to read images for its simplicity. However, if we rely upon `imageio.imread` for a multichannel tiff, we tend to just get the first channel.
es: Me gusta usar [imageio](https://imageio.readthedocs.io/en/v2.9.0/userapi.html) para leer imágenes por su simplicidad. Sin embargo, si confiamos en `imageio.imread` para un tiff multicanal, tendemos a obtener solo el primer canal.
pt_br: Gosto de usar [imageio](https://imageio.readthedocs.io/en/v2.9.0/userapi.html) para ler imagens por sua simplicidade. No entanto, se confiarmos em `imageio.imread` para um tiff multicanal, tendemos a obter apenas o primeiro canal.

source: Later chapters will show other ways to open images.
es: Los capítulos posteriores mostrarán otras formas de abrir imágenes.
pt_br: Os capítulos posteriores mostrarão outras maneiras de abrir imagens.

source: We can do better if we switch to `imageio.volread` to treat the image as a volume instead.
es: Podemos hacerlo mejor si cambiamos a `imageio.volread` para tratar la imagen como un volumen.
pt_br: Podemos fazer melhor se mudarmos para `imageio.volread` para tratar a imagem como um volume.

source: The trouble now is that the channels appear at the *start* of our shape, whereas for the RGB image the channels were at the end.
es: El problema ahora es que los canales aparecen al *inicio* de nuestra forma, mientras que para la imagen RGB los canales estaban al final.
pt_br: O problema agora é que os canais aparecem no *início* da nossa forma, enquanto na imagem RGB os canais estavam no final.

source: That may or may not matter - *because Python doesn't have a completely fixed convention for where the channels should be*.
es: Eso puede importar o no, *porque Python no tiene una convención completamente fija sobre dónde deberían estar los canales*.
pt_br: Isso pode ou não importar - *porque o Python não tem uma convenção completamente fixa sobre onde os canais deveriam estar*.

source: Some libraries assume 'channels-first', and some assume 'channels-last'.
es: Algunas bibliotecas asumen 'canales al principio' y otras asumen 'canales al final'.
pt_br: Algumas bibliotecas assumem 'canais primeiro' e outras assumem 'canais por último'.

source: The good news is that, if you know what's required, you can easily move the channels to the right place.
es: La buena noticia es que, si sabes lo que se necesita, puedes mover fácilmente los canales al lugar correcto.
pt_br: A boa notícia é que, se você souber o que é necessário, poderá facilmente mover os canais para o lugar certo.

source: Displaying multichannel images
es: Visualización de imágenes multicanal
pt_br: Exibindo imagens multicanal

source: Unfortunately, you can't easily show any arbitrary multichannel image using either channels-first or channels-last.
es: Desafortunadamente, no se puede mostrar fácilmente ninguna imagen multicanal arbitraria utilizando canales al principio o canales al final.
pt_br: Infelizmente, você não pode mostrar facilmente qualquer imagem multicanal arbitrária usando o primeiro canal ou o último canal.

source: Let's focus on channels-last, since it's more similar to how the RGB images behaved.
es: Centrémonos en los canales al final, ya que es más similar a cómo se comportan las imágenes RGB.
pt_br: Vamos nos concentrar nos canais por último, já que é mais parecido com o comportamento das imagens RGB.

source: We can show the channels one by one, as in the RGB case, or average the channels if we like - although the mean we get probably won't be a very meaningful mean.
es: Podemos mostrar los canales uno por uno, como en el caso RGB, o promediar los canales si queremos, aunque la media que obtengamos probablemente no sea muy significativa.
pt_br: Podemos mostrar os canais um por um, como no caso RGB, ou calcular a média dos canais, se quisermos - embora a média obtida provavelmente não seja uma média muito significativa.

source: Adding color
es: Añadiendo color
pt_br: Adicionando cor

source: Unfortunately, we don't currently have any of the color information that could be used to display each channel. We can just choose a colormap, like with any other single-channel image, but we can't easily visualize channels merged together (at least with matplotlib... as far as I know).
es: Lamentablemente, actualmente no contamos con la información de color que podría usarse para mostrar cada canal. Simplemente podemos elegir un mapa de colores, como con cualquier otra imagen de un solo canal, pero no podemos visualizar fácilmente los canales fusionados (al menos con matplotlib... hasta donde yo sé).
pt_br: Infelizmente, atualmente não temos nenhuma informação de cores que possa ser usada para exibir cada canal. Podemos apenas escolher um mapa de cores, como qualquer outra imagem de canal único, mas não podemos visualizar facilmente canais mesclados (pelo menos com matplotlib... até onde eu sei).

source: But one this we *can* do is convert each of our channels to RGB, using a fixed color. Here is a helper function to do that.
es: Pero una cosa que *podemos* hacer es convertir cada uno de nuestros canales a RGB, usando un color fijo. Aquí hay una función auxiliar para hacer eso.
pt_br: Mas uma coisa que *podemos* fazer é converter cada um dos nossos canais para RGB, usando uma cor fixa. Aqui está uma função auxiliar para fazer isso.

source: Creating composites
es: Creando compuestos
pt_br: Criando composições

source: Having done that, we can simply add our RGB images together to create a composite image - remembering to clip the result, so that we keep inside the range 0-1.
es: Una vez hecho esto, podemos simplemente agregar nuestras imágenes RGB para crear una imagen compuesta, recordando recortar el resultado, de modo que nos mantengamos dentro del rango 0-1.
pt_br: Feito isso, podemos simplesmente adicionar nossas imagens RGB para criar uma imagem composta - lembrando de recortar o resultado, para que fiquemos dentro do intervalo 0-1.

source: **Important!** We've moved away from colormaps here to change pixel values when creating RGB images. This gives us more control, but we need to remember that none of these modified images are suitable for quantitative analysis.
es: **¡Importante!** Nos hemos alejado de los mapas de colores aquí para cambiar los valores de los píxeles al crear imágenes RGB. Esto nos da más control, pero debemos recordar que ninguna de estas imágenes modificadas es adecuada para el análisis cuantitativo.
pt_br: **Importante!** Afastamo-nos dos mapas de cores aqui para alterar os valores dos pixels ao criar imagens RGB. Isto nos dá mais controle, mas precisamos lembrar que nenhuma dessas imagens modificadas é adequada para análise quantitativa.
