Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/2-formation_spatial/formation_spatial.po
Languages: es

source: Blur & the PSF
es: Desenfoque y Función de dispersión de punto (Point Spread Function o PSF por sus siglas en inglés)

source: Chapter outline
es: Bosquejo del capítulo

source: Measurements in fluorescence microscopy are affected by **blur**
es: Las mediciones en microscopía de fluorescencia se ven afectadas por el **desenfoque**.

source: Blur acts as a convolution with the microscope's **Point Spread Function (PSF)**
es: El desenfoque actúa como una convolución con la **Función de dispersión de punto (PSF)** del microscopio.

source: The size of the PSF depends on the **microscope type**, **light wavelength** & **objective lens Numerical Aperture (NA)**, and is on the order of hundreds of nm
es: El tamaño de la PSF depende del **tipo de microscopio**, de la **longitud de onda de la luz** y de la **apertura numérica (NA)** del objetivo, y es del orden de cientos de nm.

source: In the focal plane, the PSF is an **Airy pattern**
es: En el plano focal, la PSF es un **patrón de aire**.

source: **Spatial resolution** is a measure of how close structures can be distinguished. It's better in _xy_ than along the _z_ dimension.
es: **La resolución espacial** es una medida de lo cerca que pueden distinguirse las estructuras. Es mejor en _xy_ que a lo largo de la dimensión _z_.

source: Introduction
es: Introducción

source: Microscopy images normally look blurry because light originating from one point in the sample is not all detected at a single pixel: usually it is detected over several pixels and _z_-slices. This is _not_ simply because we cannot use perfect lenses; rather, it's caused by a fundamental limit imposed by the nature of light. The end result is as if the light that we detect is redistributed slightly throughout our data ({numref}`fig-castles`).
es: Las imágenes de microscopía suelen verse borrosas porque la luz que se origina en un punto de la muestra no se detecta toda en un único píxel: normalmente se detecta en varios píxeles y cortes _z_. Esto no se debe simplemente a que no podamos utilizar lentes perfectas, sino a un límite fundamental impuesto por la naturaleza de la luz. El resultado final es como si la luz que detectamos se redistribuyera ligeramente a través de nuestros datos ({numref}`fig-castles`).

source: Schematic diagram showing the effects of blur. Think of the sand as photons, and the [height of the sandcastle as the intensity values of pixels](fig-transform_surface) (a greater height indicates more photons, and thus a brighter pixel). The ideal data would be sharp and could contain fine details (A), but after blurring it's not only harder to discriminate details, but intensities in the brighter regions have been reduced and sizes increased (B). If we then wish to determine the size or height of one of the sandcastle's towers, for example, we need to remember that any results we get by measuring (B) will differ from those we would have got if we could have measured (A) itself. Note, however, that approximately the same _amount_ of signal (sand or photons) is present in both cases –- only the arrangement has been changed.
es: Diagrama esquemático que muestra los efectos del desenfoque. Piense en la arena como fotones, y en la [altura del castillo de arena como los valores de intensidad de los píxeles](fig-transform_surface) (una mayor altura indica más fotones y, por tanto, un píxel más brillante). Los datos ideales serían nítidos y podrían contener detalles finos (A), pero tras el desenfoque no sólo es más difícil discriminar los detalles, sino que las intensidades en las regiones más brillantes se han reducido y los tamaños han aumentado (B). Si luego queremos determinar el tamaño o la altura de una de las torres del castillo de arena, por ejemplo, debemos recordar que los resultados que obtengamos midiendo (B) diferirán de los que habríamos obtenido si hubiéramos podido medir la propia (A). Sin embargo, hay que tener en cuenta que en ambos casos hay aproximadamente la misma _cantidad_ de señal (arena o fotones), sólo ha cambiado la distribución.

source: This is important for three reasons:
es: Esto es importante por tres razones:

source: Blur affects the apparent **size** of structures
es: El desenfoque afecta al **tamaño** aparente de las estructuras

source: Blur affects the apparent **intensity** (i.e. brightnesses) of structures
es: El desenfoque afecta a la **intensidad** aparente (es decir, al brillo) de las estructuras

source: Blur (sometimes) affects the apparent **number** of structures
es: El desenfoque (a veces) afecta al **número** aparente de estructuras

source: Therefore, _almost every measurement_ we might want to make can be affected by blurring to some degree.
es: Por lo tanto, _casi todas las mediciones_ que queramos hacer pueden verse afectadas por el desenfoque hasta cierto punto.

source: That's the bad news about blur. The good news is that it's rather well understood, and we can take some comfort that it is not random. In fact, the main ideas have already been described in {ref}`chap_filters`, because blurring in fluorescence microscopy is mathematically described by a **convolution** involving the microscope's **Point Spread Function (PSF)**. In other words, the PSF acts like a linear filter applied to the perfect, sharp data we would like but can never directly acquire.
es: Ésa es la mala noticia sobre el desenfoque. La buena noticia es que se entiende bastante bien, y podemos tranquilizarnos sabiendo que no es aleatorio. De hecho, las ideas principales ya se han descrito en {ref}`chap_filters`, porque el desenfoque en microscopía de fluorescencia se describe matemáticamente mediante una **convolución** en la que interviene la **Función de dispersión puntual (PSF)** del microscopio. En otras palabras, la PSF actúa como un filtro lineal aplicado a los datos perfectos y nítidos que desearíamos, pero que nunca podemos adquirir directamente.

source: Previously, we saw how smoothing (e.g. mean or Gaussian) filters could helpfully reduce noise, but as the filter size increased we would [lose more and more detail](chap_filters_gaussian_size). At that time, we could choose the size and shapes of filters ourselves, changing them arbitrarily by modifying coefficients to get the noise-reduction vs. lost-detail balance we liked best. But the microscope's blurring differs in at least two important ways. Firstly, it's effectively applied to our data _before_ noise gets involved, so offers no noise-reduction benefits. Secondly, because it occurs before we ever set our eyes on our images, the size and shape of the filter used (i.e. the PSF) are only indirectly (and in a very limited way) under our control. It would therefore be much nicer just to dispense with the blurring completely since it offers no real help, but unfortunately light conspires to make this not an option: we just need to cope with it.
es: Anteriormente, vimos cómo los filtros de suavizado (por ejemplo, medio o gaussiano) podían ayudar a reducir el ruido, pero a medida que aumentaba el tamaño del filtro [perdíamos cada vez más detalle](chap_filters_gaussian_size). En ese punto, podíamos elegir nosotros mismos el tamaño y la forma de los filtros, cambiándolos arbitrariamente al modificar los coeficientes para conseguir el equilibrio entre reducción de ruido y pérdida de detalle que más nos gustara. Pero el desenfoque del microscopio difiere en al menos dos aspectos importantes. En primer lugar, se aplica a nuestros datos _antes_ de que intervenga el ruido, por lo que no ofrece ventajas en cuanto a la reducción del ruido. En segundo lugar, como se produce antes de que pongamos los ojos en nuestras imágenes, el tamaño y la forma del filtro utilizado (es decir, la PSF) sólo están indirectamente (y de forma muy limitada) bajo nuestro control. Por lo tanto, sería mucho mejor prescindir por completo del desenfoque, ya que no ofrece ninguna ayuda real, pero por desgracia la luz conspira para que esto no sea una opción: simplemente tenemos que lidiar con ello.

source: The purpose of this chapter is to offer a practical introduction to why the blurring occurs, what a widefield microscope's PSF looks like, and why all this matters. Detailed optics and threatening integrals are not included, although several equations make appearances. Fortunately for the mathematically unenthusiastic, these are both short and useful.
es: El propósito de este capítulo es ofrecer una introducción práctica a por qué se produce el desenfoque, qué aspecto tiene la PSF de un microscopio de campo amplio y por qué todo esto es importante. No se incluyen ópticas detalladas ni integrales amenazadoras, aunque aparecen varias ecuaciones. Afortunadamente para los poco entusiastas de las matemáticas, éstas son breves y útiles.

source: Blur & convolution
es: Desenfoque y convolución

source: As stated above, the fundamental cause of blur is that light originating from an infinitesimally small point cannot then be detected at a similar point, no matter how great our lenses or detectors might be. Rather, it ends up being focused to some larger volume known as the PSF, which has a minimum size dependent upon both the light's wavelength and the lens being used.
es: Como ya se ha dicho, la causa fundamental del desenfoque es que la luz que se origina desde un punto infinitesimalmente pequeño no puede detectarse en un punto similar, por muy grandes que sean nuestras lentes o detectores. En lugar de ello, acaba siendo enfocada hacia un volumen mayor, conocido como PSF, que tiene un tamaño mínimo que depende tanto de la longitud de onda de la luz como de la lente utilizada.

source: Although it might not be obvious at low magnification (A), an image can be viewed as composed of small points (B). This gives us a useful way to understand what has happened in a blurred image: each point has simply been replaced by a more diffuse blob, the PSF. Images appear more or less blurred depending upon how large the blobby PSFs are \(C) and (D). This is equivalent to applying the PSF to an image as a linear filter.
es: Aunque no resulte obvio a bajo aumento (A), una imagen puede verse como compuesta de pequeños puntos (B). Esto nos proporciona una forma útil de entender lo que ha sucedido en una imagen borrosa: cada punto ha sido simplemente sustituido por una mancha más difusa, la PSF. Las imágenes aparecen más o menos borrosas en función del tamaño de las manchas PSF (C) y (D). Esto equivale a aplicar la PSF a una imagen como un filtro lineal.

source: This becomes more practically relevant if we consider that _any_ fluorescing sample can be viewed as composed of many similar, exceedingly small light-emitting points -- you may think of each point being a fluorophore. Our image would ideally then include individual points too, digitized into pixels with values proportional to the emitted light. But what we get instead is an image in which every point has been replaced by its PSF, scaled according to the point's brightness. Where these PSFs overlap, the detected light intensities are simply added together. Exactly how blurry this causes the image to be depends upon the size of the PSF ({numref}`fig-psf_sizes`).
es: Esto adquiere mayor relevancia práctica si tenemos en cuenta que _cualquier_ muestra fluorescente puede verse como compuesta de muchos puntos emisores de luz similares y extremadamente pequeños (se puede pensar que cada punto es un fluoróforo). Lo ideal sería que nuestra imagen incluyera también puntos individuales, digitalizados en píxeles con valores proporcionales a la luz emitida. Pero lo que obtenemos en su lugar es una imagen en la que cada punto ha sido sustituido por su PSF, escalada según el brillo del punto. Cuando estas PSF se superponen, las intensidades de luz detectadas simplemente se suman. La borrosidad de la imagen depende del tamaño de la PSF ({numref}`fig-psf_sizes`).

source: This blurring process is equivalent to **convolving** the (impossible) ideal point image with the PSF: i.e. applying a linear filter, as described in {ref}`chap_filters`. Because every point is blurred in the same way (at least in the ideal case; extra aberrations can cause some variations), this means that if we know the PSF then we can characterize the blur throughout the entire image -- and thereby make inferences about the extent to which blurring will impact upon anything we measure.
es: Este proceso de desenfoque es equivalente a **convolucionar** la (imposible) imagen ideal de puntos, con la PSF: es decir, aplicar un filtro lineal, como se describe en {ref}`chap_filters`. Dado que todos los puntos se desenfocan de la misma manera (al menos en el caso ideal; las aberraciones adicionales pueden causar algunas variaciones), esto significa que si conocemos la PSF podemos caracterizar el desenfoque en toda la imagen y, por tanto, hacer inferencias sobre el grado en que el desenfoque afectará cualquier cosa que midamos.

source: The shape of the PSF
es: La forma de la PSF

source: We can gain an initial impression of a microscope's PSF by recording a *z*-stack of a small, fluorescent bead, which represents an ideal light-emitting point. {numref}`fig-psf_bead` shows that, for a widefield microscope, the bead appears like a bright blob when it is in focus. More curiously, when viewed from the side (__xz__ or __yz__), it has a somewhat hourglass-like appearance -- albeit with some extra patterns. This exact shape is well enough understood that PSFs can also be generated theoretically based upon the type of microscope and objective lenses used (C).
es: Podemos obtener una primera impresión de la PSF de un microscopio registrando una serie de planos *z* (z-stack) de una pequeña perla fluorescente, que representa un punto ideal de emisión de luz. {numref}`fig-psf_bead` muestra que, para un microscopio de campo amplio, la perla aparece como una mancha brillante cuando está enfocada. Y lo que es más curioso, cuando se mira desde un lado (__xz__ o __yz__), tiene un aspecto similar al de un reloj de arena, aunque con algunos patrones adicionales. Esta forma exacta se conoce lo suficientemente bien como para que las PSF también puedan generarse teóricamente basándose en el tipo de microscopio y lentes objetivo utilizados (C).

source: PSFs for a widefield microscope. (A) and (B) are from z-stacks acquired of a small fluorescent bead, displayed using linear contrast and after applying a gamma transform to make fainter details easier to discern (see {ref}`chap_point_operations` for more information). \(C) shows a theoretical PSF for a similar microscope. It differs in appearance partly because the bead is not really an infinitesimally small point, and partly because the real microscope's objective lens is less than perfect. Nevertheless, the overall shapes are similar.
es: La PSF de un microscopio de campo amplio. (A) y (B) son series de plano z (z-stacks) adquiridas de una pequeña perla fluorescente, mostradas usando contraste lineal y tras aplicar una transformación gamma para hacer que los detalles más débiles sean más fáciles de discernir (ver {ref}`chap_point_operations` para más información). \(C) muestra una PSF teórica para un microscopio similar. Su aspecto difiere en parte porque la perla no es realmente un punto infinitamente pequeño, y en parte porque la lente objetivo del microscopio real no es perfecta. No obstante, las formas generales son similares.

source: Generating PSFs
es: Generación de PSF

source: ImageJ plugins to create theoretical PSFs are available from
es: Los plugins de ImageJ para crear PSF teóricas están disponibles en

source: In & out of focus
es: Enfoque y desenfoque

source: {numref}`fig-psf_planes` attempts to show that the hourglass aspect of the PSF is really perfectly intuitive. When recording a *z*-stack of a light-emitting point, we would _prefer_ that the light ended up at a single pixel in a single slice. But the light itself is oblivious to our wishes, and will cheerfully be detected if it happens to strike a detector, no matter where that is. Therefore we should expect the light to be detected across a small region only if the image is in-focus; otherwise it will be spread out to an extent that depends upon how far from the focal point it is detected. From the side (__xz__ or __yz__), this leads to an hourglass shape.
es: {numref}`fig-psf_planes` intenta mostrar que el aspecto de reloj de arena de la PSF es en realidad perfectamente intuitivo. Al grabar una serie de plano *z* (z-stacks) de un punto emisor de luz, _preferiríamos_ que la luz acabara en un único píxel de un único corte. Pero la propia luz es ajena a nuestros deseos, y fácilmente se detectará si golpea un detector, sin importar dónde se encuentre. Por lo tanto, lo que debemos esperar es que la luz se detectará en una pequeña región sólo si la imagen está enfocada; de lo contrario, se dispersará en una medida que dependerá de la distancia a la que se detecte del punto focal. Desde el lado (__xz__ o __yz__), esto da lugar a una forma de reloj de arena.

source: Simplified diagram to help visualize how a light-emitting point would be imaged using a widefield microscope. Some of the light originating from the point is captured by a lens. If you imagine the light then being directed towards a focal point, this leads to an hourglass shape. If a detector is placed close to the focal point, the spot-like image formed by the light striking the detector would be small and bright. However, if the detector were positioned above or below this focal plane, the intensity of the spot would decrease and its size would increase.
es: Diagrama simplificado para ayudar a visualizar cómo se obtendría una imagen de un punto emisor de luz utilizando un microscopio de campo amplio. Parte de la luz procedente del punto es captada por una lente. Si se imagina que la luz se dirige hacia un punto focal, se obtiene la forma de un reloj de arena. Si se coloca un detector cerca del punto focal, la imagen en forma de punto formada por la luz que incide en el detector sería pequeña y brillante. Sin embargo, si el detector se situara por encima o por debajo de este plano focal, la intensidad del punto disminuiría y su tamaño aumentaría.

source: Question
es: Pregunta

source: In focus, a light-emitting point looks like a small, bright blob. Out of focus, it's much less bright and extends over a wider area.
es: Enfocado, un punto emisor de luz parece una pequeña mancha brillante. Desenfocado, es mucho menos brillante y se extiende por una zona más amplia.

source: However, how would you expect the _total amount_ of light to differ in a widefield image depending upon whether a plane is in-focus or not? In other words, would you expect more or less light in the focal plane than in other planes above or below it?
es: Sin embargo, ¿cómo esperaría que la _cantidad total_ de luz difiriera en una imagen de campo amplio dependiendo de si un plano está enfocado o no? En otras palabras, ¿esperaría más o menos luz en el plano focal que en otros planos situados por encima o por debajo de él?

source: Answer
es: Respuesta

source: In a widefield image, every plane we can record contains in-focus light along with _all_ the detectable light from _all_ other planes added together. Therefore we should expect approximately _the same total amount of light_ within each plane of a *z*-stack – just differently distributed. That's potentially a lot of light in the 'wrong' place, especially if looking at a thick sample.
es: En una imagen de campo amplio, cada plano que podemos registrar contiene luz enfocada junto con _toda_ la luz detectable de _todos_ los demás planos sumados. Por tanto, deberíamos esperar aproximadamente _la misma cantidad total de luz_ dentro de cada plano de una serie de plano *z* (z-stack), sólo que distribuida de forma diferente. Eso potencialmente es mucha luz en el lugar "equivocado", especialmente si se observa una muestra gruesa.

source: At least, this would be so for an infinitely-large detector, or a small, centered sample. In practice, if the light originates from a location so out-of-focus that its light spills over the side of the detector then this plane would contain less light.
es: Al menos, esto sería así para un detector infinitamente grande, o una muestra pequeña y centrada. En la práctica, si la luz se origina en un lugar tan desenfocado que su luz se derrama por el lado del detector, entonces este plano contendría menos luz.

source: The appearance of interference
es: La aparición de interferencias

source: {numref}`fig-psf_planes` is quite limited in what it shows: it doesn't begin to explain the extra patterns of the PSF, which appear on each 2D plane as concentric rings (see {numref}`fig-bead_slices`) nor why the PSF doesn't shrink to a single point in the focal plane. These factors relate to the interference of light waves. While it's important to know that the rings occur -- if only to avoid ever misinterpreting them as extra ring-like structures being really present in a sample -- they have limited influence upon any analysis because the central region of the PSF is overwhelmingly brighter. Therefore for our purposes they can mostly be disregarded.
es: {numref}`fig-psf_planes` es bastante limitado en lo que muestra: no empieza a explicar los patrones adicionales de la PSF, que aparecen en cada plano 2D como anillos concéntricos (véase {numref}`fig-bead_slices`) ni por qué la PSF no se reduce a un único punto en el plano focal. Estos factores están relacionados con la interferencia de las ondas luminosas. Aunque es importante saber que existen anillos, aunque sólo sea para evitar malinterpretarlos como estructuras anulares adicionales realmente presentes en una muestra, su influencia en cualquier análisis es limitada, ya que la región central de la PSF es abrumadoramente más brillante. Por lo tanto, para nuestros propósitos, pueden ignorarse en su mayor parte.

source: Ten slices from a z-stack acquired of a fluorescent bead, starting from above and moving down to the focal plane. The same linear contrast settings have been applied to each slice for easy comparison, although this causes the in-focus bead to appear saturated since otherwise the rings would not be visible at all. Because the image is (approximately) symmetrical along the z-axis, additional slices moving below the focal plane would appear similar.
es: Diez cortes de una serie de plano z (z-stack) adquirida de una perla fluorescente, empezando desde arriba y bajando hasta el plano focal. Se han aplicado los mismos ajustes de contraste lineal a cada corte para facilitar la comparación, aunque esto hace que la perla enfocada aparezca saturada, ya que de lo contrario los anillos no serían visibles en absoluto. Dado que la imagen es (aproximadamente) simétrica a lo largo del eje z, los cortes adicionales que se desplacen por debajo del plano focal tendrían un aspecto similar.

source: The Airy disk
es: El disco Airy
