Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/2-formation_spatial/formation_spatial.po
Languages: es

source: Finally for this section, the PSF in the focal plane is important enough to deserve some attention, since we tend to want to measure things where they are most in-focus. This entire *xy* plane, including its interfering ripples, is called an **Airy pattern**, while the bright central part alone is the **Airy disk** ({numref}`fig-airy`). In the best possible case, when all the light in a 2D image comes from in-focus structures, what we can image would already have been blurred by a filter that looks like this.
es: Por último, para esta sección, la PSF en el plano focal es lo suficientemente importante como para merecer algo de atención, ya que tendemos a querer medir las cosas donde están más enfocadas. Todo este plano *xy*, incluidas sus ondulaciones interferentes, se denomina **patrón de Airy**, mientras que la parte central brillante por sí sola es el **disco de Airy** ({numref}`fig-airy`). En el mejor de los casos, cuando toda la luz de una imagen 2D procede de estructuras enfocadas, lo que podemos ver ya se habría hecho borroso por un filtro con este aspecto.

source: George Biddell Airy and the Airy pattern. (A) During his schooldays, Airy had been renowned for being skilled _'in the construction of peashooters and other such devices'_ (see <https://mathshistory.st-andrews.ac.uk/Biographies/Airy/>). The rings surrounding the Airy disk have been likened to the ripples on a pond. Although the rings phenomenon was already known, Airy wrote the first theoretical treatment of it in 1835 (<https://en.wikipedia.org/wiki/Airy_disk>). (B) An Airy pattern looks much like a 2D Gaussian function, although when the contrast is enhanced (C) small outer rings can be seen surrounding the Airy disk.
es: George Biddell Airy y el patrón de Airy. (A) En sus tiempos de estudiante, Airy era conocido por su destreza _"en la construcción de tiradores de guisantes y otros artefactos similares"_ (véase <https://mathshistory.st-andrews.ac.uk/Biographies/Airy/>). Los anillos que rodean el disco de Airy se han comparado con las ondas de un estanque. Aunque el fenómeno de los anillos ya era conocido, Airy escribió el primer tratamiento teórico del mismo en 1835 (<https://en.wikipedia.org/wiki/Airy_disk>). (B) Un patrón de Airy se parece mucho a una función gaussiana 2D, aunque cuando se aumenta el contraste (C) pueden verse pequeños anillos exteriores rodeando el disco de Airy.

source: The Airy disk should look familiar. If we ignore the little interfering ripples around its edges, it can be very well approximated by a Gaussian function ({numref}`fig-psf_surface`). Therefore _the blur of a microscope in 2D is similar to applying a Gaussian filter_, at least in the focal plane.
es: El disco de Airy debería resultarnos familiar. Si ignoramos las pequeñas ondulaciones que interfieren en sus bordes, nos podemos aproximar muy bien mediante una función gaussiana ({numref}`fig-psf_surface`). Por tanto, _el desenfoque de un microscopio en 2D es similar a aplicar un filtro gaussiano_, al menos en el plano focal.

source: Comparison of an Airy disk and a Gaussian of a similar size, using two wireframe plots and a correspnding 1D cross-section. The Gaussian is a *very* close match to the Airy disk, apart from the faint ripples at the sides, so we can often approximate the blur of a PSF using a Gaussian filter.
es: Comparación de un disco de Airy y una gaussiana de tamaño similar, utilizando dos gráficos de alambre y la sección transversal 1D correspondiente. La gaussiana es *muy* parecida al disco de Airy, aparte de las débiles ondulaciones laterales, por lo que a menudo podemos aproximar el desenfoque de una PSF utilizando un filtro gaussiano.

source: The size of the PSF
es: El tamaño de la PSF

source: So much for appearances. To judge how the blurring will affect what we can see and measure, we need to know the _size_ of the PSF. Because we don't tend to want our images to be blurry, smaller would be preferable.
es: Menos mal que las apariencias no nos engañan. Para juzgar cómo afectará el desenfoque a lo que podemos ver y medir, necesitamos saber el _tamaño_ de la PSF. Como usualmente no queremos que nuestras imágenes salgan borrosas, es preferible que sean más pequeñas.

source: The size requires some defining: the PSF actually continues indefinitely, but has extremely low intensity values when far from its center. One approach for characterizing the Airy disk size is to consider its radius $r_{airy}$ as the distance from the center to the first _minimum_: the lowest point before the first of the outer ripples begins. This is is given by:
es: El tamaño requiere cierta definición: en realidad, la PSF continúa indefinidamente, pero tiene valores de intensidad extremadamente bajos cuando se aleja de su centro. Un método para caracterizar el tamaño del disco de Airy es considerar su radio $r_{airy}$ como la distancia desde el centro hasta el primer _mínimo_: el punto más bajo antes de que comience la primera de las ondulaciones exteriores. Esto viene dado por:

source: where $\lambda$ is the light wavelength and NA is the numerical aperture of the objective lens [^fn_1].
es: donde $\lambda$ es la longitud de onda de la luz y NA es la apertura numérica de la lente objetivo [^fn_1].

source: A comparable measurement to $r_{airy}$ between the center and first minimum along the *z* axis is:
es: Una medida comparable a $r_{airy}$ entre el centro y el primer mínimo a lo largo del eje *z* es:

source: where $\eta$ is the refractive index of the objective lens immersion medium (which is a value related to the speed of light through that medium).
es: donde $\eta$ es el índice de refracción del medio de inmersión de la lente objetivo (que es un valor relacionado con la velocidad de la luz a través de ese medio).

source: The practical importance of these equations is that they reveal the key factors that influence how blurry an image will be. This hints at some ways we might be able to reduce blurring at the acquisition stage.
es: La importancia práctica de estas ecuaciones es que revelan los factores clave que influyen en el grado de desenfoque de una imagen. De este modo, es posible reducir el desenfoque durante la etapa de adquisición de imagen.

source: According to Equation {eq}`eqn-res_lateral`, the equation for the Airy disk size, what are the two variables we _may_ be able to control that influence the amount of blur in our images? And how must they be changed (increased or decreased) for the images to have less blur?
es: Según la ecuación {eq}`eqn-res_lateral`, la ecuación para el tamaño del disco de Airy, ¿cuáles son las dos variables que _podríamos_ controlar y que influyen en la cantidad de desenfoque de nuestras imágenes? ¿Y cómo hay que cambiarlas (aumentarlas o disminuirlas) para que las imágenes tengan menos desenfoque?

source: If the wavelength $\lambda$ is _lower_ or the objective NA is _higher_, $r_{airy}$ decreases and we have less blur.
es: Si la longitud de onda $\lambda$ es _más baja_ o el objetivo NA es _más alto_, $r_{airy}$ disminuye y tenemos menos desenfoque.

source: Does the NA have more influence on blur in the *xy* plane, or along the *z* axis?
es: ¿Influye más la NA en el desenfoque en el plano *xy*, o a lo largo del eje *z*?

source: Because of the squaring, the NA has a much greater influence on blur along the *z* axis than in *xy*. This can be seen clearly in {numref}`fig-psf_na`.
es: Debido a la elevación al cuadrado, la NA tiene una influencia mucho mayor en el desenfoque a lo largo del eje *z* que en *xy*. Esto puede verse claramente en {numref}`fig-psf_na`.

source: Examples of theoretical PSFs generated with different Numerical Apertures.
es: Ejemplos de PSF teóricas generadas con diferentes aperturas numéricas.

source: Numerical Aperture
es: Apertura numérica (NA por sus siglas en inglés)

source: The equations for the PSF size show that if you can use an objective lens with a higher NA, you can potentially reduce blur in an image -- especially along the *z* axis ({numref}`fig-psf_na`). Unfortunately, one soon reaches another limit in terms of what increasing the NA can achieve. This can be seen from the equation used to define it:
es: Las ecuaciones para el tamaño del PSF muestran que si se puede utilizar una lente objetivo con una NA más alta, se puede reducir potencialmente el desenfoque en una imagen -- especialmente a lo largo del eje *z* ({numref}`fig-psf_na`). Por desgracia, pronto se llega a otro límite en cuanto a lo que se puede conseguir aumentando la NA. Esto se puede ver en la ecuación utilizada para definirlo:

source: where $\eta$ is again the refractive index of the immersion medium and $\theta$ is the half-angle of the cone of light accepted by the objective. Because $\sin{\theta}$ can never exceed 1, the NA can never exceed $\eta$, which itself has fixed values (e.g. around 1.0 for air, 1.34 for water, or 1.5 for oil). High NA lenses can therefore reduce blur only to a limited degree.
es: donde $\eta$ es de nuevo el índice de refracción del medio de inmersión y $\theta$ es el semiángulo del cono de luz aceptado por el objetivo. Dado que $\sin{\theta}$ nunca puede superar 1, el NA nunca puede superar $\eta$, que a su vez tiene valores fijos (por ejemplo, alrededor de 1,0 para el aire, 1,34 para el agua o 1,5 para el aceite). Por lo tanto, los objetivos con una NA elevada sólo pueden reducir el desenfoque de forma limitada.

source: An important additional consideration is that the highest NAs are possible when the immersion refractive index is high, but if this does not match the refractive index of the medium surrounding the sample we get **spherical aberration**. This is a phenomenon whereby the PSF becomes asymmetrical at increasing depth and the blur becomes weirder. Therefore, matching the refractive indices of the immersion and embedding media is often _strongly_ preferable to using the highest NA objective available: it's usually better to have a larger PSF than a highly irregular one.
es: Una consideración adicional importante es que las mayores NA son posibles cuando el índice de refracción de la inmersión es alto, pero si éste no coincide con el índice de refracción del medio que rodea la muestra, obtenemos una **aberración esférica**. Esto se trata de un fenómeno por el cual la PSF se vuelve asimétrica conforme aumenta la profundidad y el desenfoque se vuelve más extraño. Por lo tanto, a menudo es preferible que los índices de refracción de los medios de inmersión e incrustación coincidan, a que se utilice el objetivo de mayor NA disponible: normalmente es mejor tener una PSF más grande que una muy irregular.

source: For an interactive tutorial on the effect of using different NAs, see <https://www.microscopyu.com/tutorials/imageformation-airyna>.
es: Para ver un tutorial interactivo sobre el efecto del uso de diferentes NA, consulte <https://www.microscopyu.com/tutorials/imageformation-airyna>.

source: Convince yourself that $z_{min}$ will be considerably higher than $r_{airy}$ using one of the following methods:
es: Convénzase por si mismo de que $z_{min}$ será considerablemente mayor que $r_{airy}$ utilizando uno de los siguientes métodos:

source: Put an example refractive index (e.g. $\eta = 1.34$ for water), and some reasonable values of $\lambda$ and the NA into the equations for the lateral {eq}`eqn-res_lateral` and axial {eq}`eqn-res_axial` resolution, and compare the results
es: Ponga un índice de refracción de ejemplo (por ejemplo, $\eta = 1,34$ para el agua), y algunos valores razonables de $\lambda$ y la NA en las ecuaciones para la resolución lateral {eq}`eqn-res_lateral` y axial {eq}`eqn-res_axial`, y compare los resultados

source: Calculate the ratio $z_{min} / r_{airy}$ and substitute in the equation for the NA. This should reveal that the ratio is bigger than 1, i.e. that $z_{min}$ is larger.
es: Calcule la relación $z_{min} / r_{airy}$ y sustitúyala en la ecuación de la NA. Esto debería revelar que la relación es mayor que 1, es decir, que $z_{min}$ es mayor.

source: What is the main implication of this observation, in terms of how separated structures need to be along different dimensions for them still to be distinguishable?
es: ¿Cuál es la principal implicación de esta observación, en términos de cuán separadas deben estar las estructuras a lo largo de diferentes dimensiones para que sigan siendo distinguibles?

source: The ratio is
es: La relación es

source: Therefore, even as $\sin\theta$ becomes close to 1 (i.e. a very high NA objective is used), the value of $z_{min}$ remains over 3 times larger than $r_{airy}$ -- the *z* resolution is much worse. When the NA is lower, the difference is even more.
es: Por lo tanto, incluso cuando $\sin\theta$ se acerca a 1 (es decir, se utiliza un objetivo de NA muy alto), el valor de $z_{min}$ sigue siendo más de 3 veces mayor que $r_{airy}$ -- la resolución *z* es mucho peor. Cuando la NA es menor, la diferencia es aún mayor.

source: The main practical implication is that it's more likely that you will be able to distinguish structures that are separated from one another by a short distance in *xy* than similarly separated in *z*. If you really need information along the *z*-dimension more than anywhere else, maybe rotating your sample could help?
es: La principal implicación práctica es que es más probable que pueda distinguir estructuras separadas entre sí por una corta distancia en *xy* que separadas de forma similar en *z*. Si realmente necesita información en la dimensión *z* más que en cualquier otra parte, ¿quizá la rotación de la muestra pueda ayudarle?

source: Spatial resolution
es: Resolución espacial

source: **Spatial resolution** is concerned with how close two structures can be while they are still distinguishable. This is a somewhat subjective and fuzzy idea, but one way to define it is by the **Rayleigh Criterion**, according to which two equally bright spots are said to be resolved (i.e. distinguishable) if they are separated by the distances calculated in the lateral {eq}`eqn-res_lateral` and axial {eq}`eqn-res_axial` equations above. If the spots are closer than this, they are likely to be seen as one. In the in-focus plane, this is illustrated in {numref}`fig-rayleigh`.
es: La **resolución espacial** se refiere a la distancia que puede haber entre dos estructuras sin que dejen de distinguirse. Se trata de una idea un tanto subjetiva y difusa, pero una forma de definirla es mediante el **Criterio Rayleigh**, según el cual se dice que dos manchas igualmente brillantes están resueltas (es decir, son distinguibles) si están separadas por las distancias calculadas en las ecuaciones anteriores {eq}`eqn-res_lateral` y {eq}`eqn-res_axial`. Si las manchas están más cerca, es probable que se vean como una sola. En el plano de enfoque, esto se ilustra en {numref}`fig-rayleigh`.

source: Airy patterns separated by different distances, defined in terms of Airy disk radii. The top row contains the patterns themselves, while the bottom row shows intensity profiles computed across the centers of the patterns. Two distinct spots are clearly visible whenever separated by at least one disk radius, and there is a dip apparent in the profile. However, if the separation is less than one radius, the contrast rapidly decreases until only one structure is apparent. By a separation of 0.5 radii, the two structures appear indistinguishable as a single, brighter structure.
es: Patrones de Airy separados por diferentes distancias, definidas en términos de radios de disco de Airy. La fila superior contiene los patrones mismos, mientras que la fila inferior muestra los perfiles de intensidad calculados a través de los centros de los patrones. Se aprecian claramente dos manchas que son claramente visibles siempre que estén separadas por al menos un radio de disco, y que el perfil muestre una caída. Sin embargo, si la separación es inferior a un radio, el contraste rápidamente disminuye hasta que sólo se aprecia una sola estructura. Con una separación de 0,5 radios, las dos estructuras parecen indistinguibles como una única estructura más brillante.

source: It should be kept in mind that the use of $r_{airy}$ and $z_{min}$ in the Rayleigh criterion is somewhat arbitrary -- and the effects of brightness differences, finite pixel sizes and noise further complicate the situation, so that in practice a greater distance may well be required for us to confidently distinguish structures. Nevertheless, the Rayleigh criterion is helpful to give some idea of the scale of distances involved, i.e. hundreds of nanometers when using visible light.
es: Hay que tener en cuenta que el uso de $r_{airy}$ y $z_{min}$ en el criterio de Rayleigh es un tanto arbitrario, y los efectos de las diferencias de brillo, el tamaño finito de los píxeles y el ruido complican aún más la situación, de modo que en la práctica puede ser necesaria una distancia mayor para que podamos distinguir con seguridad las estructuras. No obstante, el criterio de Rayleigh es útil para dar una idea de la escala de las distancias implicadas, por ejemplo cientos de nanómetros cuando se utiliza luz visible.

source: Suppose the diameter of the Airy disk is around 500 nm, and you are looking at an image containing separate, well-spaced structures that are 2 nm, 20 nm and 200 nm in size. Assuming that you have imaged all of these exactly in focus (after all, you are a brilliant microscopist), how will these structures appear in the image?
es: Supongamos que el diámetro del disco de Airy es alrededor de 500 nm y que usted está observando una imagen que contiene estructuras separadas y bien espaciadas de 2 nm, 20 nm y 200 nm de tamaño. Suponiendo que las haya enfocado todas exactamente (después de todo, usted es un microscopista brillante), ¿cómo aparecerán estas estructuras en la imagen?

source: _Note:_ This is a particularly important question! Think of both the size and brightness.
es: Nota:_ ¡Ésta es una pregunta especialmente importante! Piense tanto en el tamaño como en la luminosidad.

source: Because even an infinitesimally small point cannot appear smaller than the Airy disk in the recorded image, _potentially all 3 of these structures look the same!_ There may be _some_ increase in size visible with the 200 nm structure (because it is larger than a single point, this makes it like many different, slightly-shifted-but-mostly-overlapping Airy disks added together), but it will certainly not appear 10 or 100 times larger than the others.
es: Dado que ni siquiera un punto infinitesimal puede parecer más pequeño que el disco de Airy en la imagen grabada, es posible que las tres estructuras tengan el mismo aspecto. Puede que se aprecie un cierto aumento de tamaño en la estructura de 200 nm (dado que es mayor que un único punto, se asemeja a la suma de varios discos de Airy en su mayoría superpuestos pero con un ligero desplazamiento), pero desde luego no parecerá 10 o 100 veces mayor que las otras estructuras.

source: _However_, because smaller objects typically emit fewer photons, the smaller structures may well appear less bright -- if they are bright enough to be visible at all. Therefore, at this scale accurate measurements of size are impossible from (conventional, non-super-resolution) fluorescence microscopy images, but the actual size may have some relationship with brightness.
es: Sin embargo, como los objetos más pequeños suelen emitir menos fotones, las estructuras más pequeñas pueden parecer menos brillantes, si es que lo suficientemente brillantes como para ser visibles. Por lo tanto, a esta escala es imposible realizar mediciones precisas del tamaño a partir de imágenes de microscopía de fluorescencia convencional (sin super-resolución). Sin embargo, el tamaño real puede guardar cierta relación con el brillo.

source: Measuring PSFs & small structures
es: Medición de PSF y estructuras pequeñas

source: Knowing that the Airy disk resembles a Gaussian function is extremely useful, because any time we see an Airy disk we can fit a 2D Gaussian to it. The parameters of the function will then tell us the Gaussian's center exactly, which corresponds to where the fluorescing structure really is -- admittedly not with complete accuracy, but potentially still beyond the accuracy of even the pixel size (noise is the real limitation). This idea is fundamental to single-molecule localization techniques, including those in super-resolution microscopes like STORM and PALM, but requires that PSFs are sufficiently well-spaced that they do not interfere with one another and thereby ruin the fitting.
es: Saber que el disco de Airy se parece a una función gaussiana es extremadamente útil, porque cada vez que vemos un disco de Airy podemos ajustarle una gaussiana 2D. Los parámetros de la función nos dirán con exactitud el centro de la gaussiana, que corresponde al lugar donde se encuentra realmente la estructura fluorescente, aunque no con total precisión, pero potencialmente más allá de la precisión incluso del tamaño del píxel (el ruido es la verdadera limitación). Esta idea es fundamental para las técnicas de localización de moléculas individuales, incluidas las de los microscopios de super-resolución como STORM y PALM, pero requiere que las PSF estén lo suficientemente espaciadas como para que no interfieran entre sí y arruinen el ajuste.

source: In ImageJ, we can somewhat approximate this localization by drawing a line profile across the peak of a PSF and then running {menuselection}`Analyze --> Tools --> Curve Fitting...`. There we can fit a 1D Gaussian function, for which the equation used is
es: En ImageJ, podemos aproximarnos mas o menos a esta localización dibujando un perfil de línea a través del pico de una PSF y luego ejecutando {menuselection}`Analyze --&gt; Tools --&gt; Curve Fitting...`. Allí podemos ajustar una función gaussiana 1D, para la cual la ecuación utilizada es

source: $a$ is simply a background constant, $b$ tells you the peak amplitude (i.e. the maximum value of the Gaussian with the background subtracted), and $c$ gives the location of the peak along the profile line. But potentially the most useful parameter here is $d$, which corresponds to the $\sigma$ value of a Gaussian filter. So if you know this value for a PSF, you can approximate the same amount of blurring with a Gaussian filter. This may come in useful in {ref}`chap_macro_simulating`.
es: $a$ es simplemente una constante de fondo, $b$ indica la amplitud del pico (es decir, el valor máximo de la gaussiana con el fondo restado), y $c$ da la ubicación del pico a lo largo de la línea del perfil. Pero tal vez el parámetro más útil aquí es $d$, que corresponde al valor $\sigma$ de un filtro gaussiano. Así que si conoces este valor para una PSF, puedes aproximar la misma cantidad de desenfoque con un filtro Gaussiano. Esto puede ser útil en {ref}`chap_macro_simulating`.

source: Note that this is the _limit_ of the Airy disk size, and assumes that the system is free of any aberrations. In other words, this is the best that we can hope for: the Airy disk cannot be made smaller simply by better focusing, although it could easily be made worse by a less-than-perfect objective lens
es: Observe que éste es el _límite_ del tamaño del disco de Airy, y supone que el sistema está libre de aberraciones. En otras palabras, esto es lo mejor que podemos esperar: el disco de Airy no puede hacerse más pequeño simplemente enfocando mejor, aunque podría empeorar fácilmente con una lente objetiva sub-óptima.
