Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/2-measurements/imagej.po
Languages: es, pt_br

source: One such command is {menuselection}`Edit --> Selection --> Create Mask`. This creates a new [binary](chap_binary) (black and white) image that differentiates between the pixels that are inside and outside the ROI.
es: Uno de esos comandos es {menuselection}`Editar --> Selección --> Crear máscara`. Esto crea una nueva imagen [binaria](chap_binary) (blanco y negro) que diferencia entre los píxeles que están dentro y fuera del ROI.
pt_br: Um desses comandos é {menuselection}`Editar --> Seleção --> Criar Máscara`. Isso cria uma nova imagem [binária](chap_binary) (preto e branco) que diferencia os pixels que estão dentro e fora da ROI.

source: A ROI representing an area is usually depicted using yellow lines drawn on an image, but sometimes it isn't clear which pixels are inside or outside the ROI. {menuselection}`Edit --> Selection --> Create Mask` can help clarify this.
es: Una ROI que representa un área generalmente se representa mediante líneas amarillas dibujadas en una imagen, pero a veces no está claro qué píxeles están dentro o fuera de la ROI. {menuselection}`Editar --> Selección --> Crear máscara` puede ayudar a aclarar esto.
pt_br: Uma ROI que representa uma área geralmente é representada usando linhas amarelas desenhadas em uma imagem, mas às vezes não fica claro quais pixels estão dentro ou fora da ROI. {menuselection}`Editar --> Seleção --> Criar Máscara` pode ajudar a esclarecer isso.

source: {menuselection}`Process --> Binary --> Options...`
es: {menuselection}`Proceso --> Binario --> Opciones...`
pt_br: {menuselection}`Processo --> Binário --> Opções...`

source: Interpreting 'Create Mask'
es: Interpretación de 'Crear máscara'
pt_br: Interpretando 'Criar Máscara'

source: Unfortunately, when using {menuselection}`Edit --> Selection --> Create Mask` it is not *entirely certain* whether black means 'inside' or 'outside'. This depends upon whether {guilabel}`Black background` is selected within {menuselection}`Process --> Binary --> Options...`.
es: Desafortunadamente, cuando se usa {menuselection}`Editar --> Selección --> Crear Máscara` no es *completamente seguro* si negro significa "adentro" o "afuera". Esto depende de si {guilabel}`Fondo negro` está seleccionado dentro de {menuselection}`Proceso --> Binario --> Opciones... `.
pt_br: Infelizmente, ao usar {menuselection}`Editar --> Seleção --> Criar Máscara` não é *totalmente certo* se preto significa 'dentro' ou 'fora'. Isso depende se {guilabel}`Fundo preto` está selecionado em {menuselection}`Processo --> Binário --> Opções... `.

source: This doesn't usually matter in practice, because it tends to be clear from the context; ROIs usually cover a small region of the image, so the background color is the one seen in the majority of pixels.
es: Esto normalmente no importa en la práctica, porque tiende a quedar claro a partir del contexto; Las ROI suelen cubrir una pequeña región de la imagen, por lo que el color de fondo es el que se ve en la mayoría de los píxeles.
pt_br: Isso geralmente não importa na prática, porque tende a ficar claro no contexto; As ROIs geralmente cobrem uma pequena região da imagem, portanto a cor de fundo é aquela vista na maioria dos pixels.

source: An exception to this is if {menuselection}`Edit --> Selection --> Make Inverse` has been used to flip a ROI to represent all the background pixels of the original, with the foreground removed.
es: Una excepción a esto es si se ha utilizado {menuselection}`Editar --> Selección --> Hacer Inverso` para invertir un ROI para representar todos los píxeles de fondo del original, con el primer plano eliminado.
pt_br: Uma exceção a isso é se {menuselection}`Editar --> Seleção --> Fazer Inverso` tiver sido usado para inverter uma ROI para representar todos os pixels de fundo do original, com o primeiro plano removido.

source: Don't overestimate the accuracy of measurements
es: No sobreestimes la precisión de las mediciones.
pt_br: Não superestime a precisão das medições

source: Although ImageJ can measure very exactly whatever regions it is told to measure _within an image_, keep in mind that in light microscopy images any size measurements will not exactly correspond to sizes of structures _in real life_. This is especially true at very small scales (hundreds of nanometers or smaller), for resolution-related reasons that will be described in {ref}`chap_formation_spatial`.
es: Aunque ImageJ puede medir con mucha exactitud cualquier región que se le indique medir _dentro de una imagen_, tenga en cuenta que en imágenes de microscopía óptica, cualquier medida de tamaño no corresponderá exactamente a los tamaños de estructuras _en la vida real_. Esto es especialmente cierto en escalas muy pequeñas (cientos de nanómetros o menos), por razones relacionadas con la resolución que se describirán en {ref}`chap_formation_spatial`.
pt_br: Embora o ImageJ possa medir com muita exatidão quaisquer regiões que seja instruído a medir _dentro de uma imagem_, tenha em mente que em imagens de microscopia óptica quaisquer medidas de tamanho não corresponderão exatamente aos tamanhos das estruturas _na vida real_. Isto é especialmente verdadeiro em escalas muito pequenas (centenas de nanômetros ou menores), por razões relacionadas à resolução que serão descritas em {ref}`chap_formation_spatial`.

source: Working with multiple ROIs
es: Trabajar con múltiples ROI
pt_br: Trabalhando com vários ROIs

source: Normally, only a single ROI can be 'active' in ImageJ (i.e. affecting measurements) at any one time. If you need control over multiple ROIs, there are two places in which you can store them. These differ according to purpose:
es: Normalmente, solo una ROI puede estar "activa" en ImageJ (es decir, afectar las mediciones) a la vez. Si necesita controlar múltiples ROI, hay dos lugares donde puede almacenarlos. Estos se diferencian según su finalidad:
pt_br: Normalmente, apenas um único ROI pode estar 'ativo' no ImageJ (ou seja, afetando as medições) a qualquer momento. Se você precisar de controle sobre vários ROIs, há dois locais onde você pode armazená-los. Eles diferem de acordo com a finalidade:

source: **The ROI Manager:** for most ROIs that you want to be able to edit and use for measurements
es: **El Administrador de ROI:** para la mayoría de los ROI que desea poder editar y usar para mediciones
pt_br: **O Gerenciador de ROI:** para a maioria dos ROIs que você deseja editar e usar para medições

source: **The image overlay:** for ROIs that you only want to display
es: **La superposición de imágenes:** para las regiones de interés que solo deseas mostrar
pt_br: **A sobreposição de imagem:** para ROIs que você deseja exibir apenas

source: The ROI Manager
es: El administrador de retorno de la inversión
pt_br: O gerente de ROI

source: {kbd}`T` for _**T**roy manager_: shortcut to add ROI to the ROI Manager
es: {kbd}`T` para _**T**roy manager_: acceso directo para agregar ROI al Administrador de ROI
pt_br: {kbd}`T` para _**T**roy manager_: atalho para adicionar ROI ao ROI Manager

source: ImageJ's *ROI Manager* provides a convenient way to store multiple ROIs in a list, allowing you to easily access, edit and measure them.
es: *ROI Manager* de ImageJ proporciona una manera conveniente de almacenar múltiples ROI en una lista, lo que le permite acceder a ellos, editarlos y medirlos fácilmente.
pt_br: O *ROI Manager* do ImageJ fornece uma maneira conveniente de armazenar vários ROIs em uma lista, permitindo que você os acesse, edite e meça facilmente.

source: The slow way to open the ROI Manager is to choose {menuselection}`Analyze --> Tools --> ROI Manager...`. The fast way is just to draw a ROI and press {kbd}`T`.
es: La forma lenta de abrir el Administrador de ROI es elegir {menuselection}`Analizar --> Herramientas --> Administrador de ROI...`. La forma rápida es simplemente dibujar un ROI y presionar {kbd}`T`.
pt_br: A maneira mais lenta de abrir o ROI Manager é escolher {menuselection}`Analyze --> Tools --> ROI Manager...`. A maneira mais rápida é desenhar um ROI e pressionar {kbd}`T`.

source: The additional {guilabel}`Measure` command within the manager is then like applying {menuselection}`Analyze --> Measure` to each ROI in turn. If you happen to want to show all the ROIs simultaneously, you can select the {guilabel}`Show All` option [^fn_1].
es: El comando adicional {guilabel}`Medir` dentro del administrador es como aplicar {menuselection}`Analizar --> Medir` a cada ROI en doblar. Si desea mostrar todas las ROI simultáneamente, puede seleccionar la opción {guilabel}`Mostrar todo` [^fn_1].
pt_br: O comando adicional {guilabel}`Measure` dentro do gerenciador é como aplicar {menuselection}`Analyze --> Measure` a cada ROI em vez. Se quiser mostrar todos os ROIs simultaneamente, você pode selecionar a opção {guilabel}`Mostrar tudo` [^fn_1].

source: Because ROIs in the ROI Manager are represented independently of the image on which they were defined, you can create a ROI on one image, add it to the ROI manager, select a different image and then click on the ROI in the ROI Manager to place it on the second image. This provides one way to transfer a ROI from one image to another.
es: Debido a que las ROI en el Administrador de ROI se representan independientemente de la imagen en la que se definieron, puede crear una ROI en una imagen, agregarla al administrador de ROI, seleccionar una imagen diferente y luego hacer clic en la ROI en el Administrador de ROI para colocarla. en la segunda imagen. Esto proporciona una forma de transferir un ROI de una imagen a otra.
pt_br: Como os ROIs no ROI Manager são representados independentemente da imagem na qual foram definidos, você pode criar um ROI em uma imagem, adicioná-lo ao ROI Manager, selecionar uma imagem diferente e clicar no ROI no ROI Manager para colocar na segunda imagem. Isso fornece uma maneira de transferir um ROI de uma imagem para outra.

source: Measurements made from the ROI Manager always use the most recently-selected image, so be careful if you have several images open at the same time. This is another reason why choosing {guilabel}`Display label` under {menuselection}`Analyze --> Set Measurements...` is so important.
es: Las mediciones realizadas desde ROI Manager siempre utilizan la imagen seleccionada más recientemente, así que tenga cuidado si tiene varias imágenes abiertas al mismo tiempo. Esta es otra razón por la que elegir {guilabel}`Mostrar etiqueta` en {menuselection}`Analizar --> Establecer medidas...` es tan importante.
pt_br: As medições feitas no ROI Manager sempre usam a imagem selecionada mais recentemente, portanto, tome cuidado se você tiver várias imagens abertas ao mesmo tempo. Esta é outra razão pela qual escolher {guilabel}`Display label` em {menuselection}`Analyze --> Set Measurements...` é tão importante.

source: Transferring individual ROIs
es: Transferir ROI individuales
pt_br: Transferindo ROIs individuais

source: A faster way to transfer a single ROI between images without using the ROI Manager is to click on the second image and press {kbd}`Shift+E` (the shortcut for {menuselection}`Edit --> Selection --> Restore Selection`)
es: Una forma más rápida de transferir un único ROI entre imágenes sin usar el Administrador de ROI es hacer clic en la segunda imagen y presionar {kbd}`Shift+E` (el atajo para {menuselection}`Editar --> Selección --> Restaurar selección`)
pt_br: Uma maneira mais rápida de transferir um único ROI entre imagens sem usar o ROI Manager é clicar na segunda imagem e pressionar {kbd}`Shift+E` (o atalho para {menuselection}`Editar --> Seleção --> Restaurar Seleção`)

source: Expert ROI manipulation with the ROI Manager
es: Manipulación experta del ROI con el ROI Manager
pt_br: Manipulação especializada de ROI com o ROI Manager

source: Using the ROI Manager, you can craft your ROIs into more complex shapes: adding or removing other ROIs.
es: Con el Administrador de ROI, puede crear sus ROI en formas más complejas: agregando o eliminando otros ROI.
pt_br: Usando o ROI Manager, você pode criar seus ROIs em formas mais complexas: adicionando ou removendo outros ROIs.

source: To do this, first add the main ROIs you want to work with to the manager. Then select them, and choose from among the options:
es: Para hacer esto, primero agregue al administrador las principales ROI con las que desea trabajar. Luego selecciónalas y elige entre las opciones:
pt_br: Para fazer isso, primeiro adicione ao gerenciador os principais ROIs com os quais deseja trabalhar. Em seguida, selecione-os e escolha entre as opções:

source: {guilabel}`AND` – create a ROI containing only the regions where the selected ROIs overlap
es: {guilabel}`AND`: cree un ROI que contenga solo las regiones donde los ROI seleccionados se superponen
pt_br: {guilabel}`AND` – crie um ROI contendo apenas as regiões onde os ROIs selecionados se sobrepõem

source: {guilabel}`OR` – create a single ROI composed by combining all the selected ROIs
es: {guilabel}`O`: crea un único ROI compuesto combinando todos los ROI seleccionados
pt_br: {guilabel}`OR` – crie um único ROI composto pela combinação de todos os ROIs selecionados

source: {guilabel}`XOR` – create a single ROI containing all the selected ROIs, _except_ the places where they overlap ('eXclusive OR')
es: {guilabel}`XOR`: cree un único ROI que contenga todos los ROI seleccionados, _excepto_ los lugares donde se superponen ("OR exclusivo")
pt_br: {guilabel}`XOR` – crie um único ROI contendo todos os ROIs selecionados, _exceto_ os locais onde eles se sobrepõem ('eXclusive OR')

source: The *ROI Manager* with two ROIs
es: El *ROI Manager* con dos ROI
pt_br: O *Gerenciador de ROI* com dois ROIs

source: For {numref}`fig-rois_mask`, I used the ROI Manager to create a ROI with a hole in it.
es: Para {numref}`fig-rois_mask`, utilicé el Administrador de ROI para crear un ROI con un agujero.
pt_br: Para {numref}`fig-rois_mask`, usei o ROI Manager para criar um ROI com uma lacuna.

source: To do this in *happy_cell.tif*, you can
es: Para hacer esto en *happy_cell.tif*, puedes
pt_br: Para fazer isso em *happy_cell.tif*, você pode

source: Draw one ROI around the full cell, and add it to the ROI Manager
es: Dibuje un ROI alrededor de la celda completa y agréguelo al Administrador de ROI
pt_br: Desenhe um ROI em torno de toda a célula e adicione-o ao ROI Manager

source: Draw a second ROI around the nucleus, and add it to the ROI Manager
es: Dibuje un segundo ROI alrededor del núcleo y agréguelo al Administrador de ROI
pt_br: Desenhe um segundo ROI ao redor do núcleo e adicione-o ao ROI Manager

source: Then you can select both ROIs and use *one* of the combine operations -- {guilabel}`AND`, {guilabel}`OR`, {guilabel}`XOR` -- to subtract the nucleus ROI from the cell ROI. The end result is a ROI representing the cytoplasm, with the nucleus removed.
es: Luego puede seleccionar ambas ROI y usar *una* de las operaciones combinadas: {guilabel}`AND`, {guilabel}`OR` , {guilabel}`XOR` -- para restar el ROI del núcleo del ROI de la célula. El resultado final es una ROI que representa el citoplasma, sin el núcleo.
pt_br: Em seguida, você pode selecionar ambos os ROIs e usar *uma* das operações de combinação - {guilabel}`AND`, {guilabel}`OR` , {guilabel}`XOR` - para subtrair o ROI do núcleo do ROI da célula. O resultado final é uma ROI representando o citoplasma, com o núcleo removido.

source: Which combine operation do you need to achieve this?
es: ¿Qué operación de cosechadora necesita para lograr esto?
pt_br: Qual operação combinada você precisa para conseguir isso?

source: **Tip:** Remember {menuselection}`Edit --> Selection --> Create Mask` will let you see which pixels are inside and which pixels are outside the ROI.
es: **Consejo:** Recuerde que {menuselection}`Editar --> Selección --> Crear máscara` le permitirá ver qué píxeles están dentro y qué píxeles están fuera del ROI.
pt_br: **Dica:** Lembre-se de que {menuselection}`Editar --> Seleção --> Criar Máscara` permitirá que você veja quais pixels estão dentro e quais pixels estão fora da ROI.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)
es: [![lanzamiento ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https: //github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)

source: {guilabel}`XOR` ('exclusive OR') provides a ROI that contains pixels that are inside the cell OR inside the nucleus, but NOT both.
es: {guilabel}`XOR` ('OR exclusivo') proporciona un ROI que contiene píxeles que están dentro de la célula O dentro del núcleo, pero NO ambos.
pt_br: {guilabel}`XOR` ('OR exclusivo') fornece um ROI que contém pixels que estão dentro da célula OU dentro do núcleo, mas NÃO ambos.

source: Overlays
es: Superposiciones
pt_br: Sobreposições

source: {kbd}`B` for _**B**overlay_: shortcut to add a ROI to an overlay
es: {kbd}`B` para _**B**overlay_: acceso directo para agregar un ROI a una superposición
pt_br: {kbd}`B` para _**B**overlay_: atalho para adicionar um ROI a uma sobreposição

source: Overlays also contain a list of ROIs that are shown simultaneously on the image. However, unlike with the ROI Manager, ROIs stored on an overlay do _not_ usually affect the {guilabel}`Measure` command.
es: Las superposiciones también contienen una lista de ROI que se muestran simultáneamente en la imagen. Sin embargo, a diferencia del Administrador de ROI, los ROI almacenados en una superposición generalmente no afectan el comando {guilabel}`Medir`.
pt_br: As sobreposições também contêm uma lista de ROIs mostradas simultaneamente na imagem. No entanto, diferentemente do ROI Manager, os ROIs armazenados em uma sobreposição _não_ geralmente afetam o comando {guilabel}`Measure`.

source: Overlays are therefore suitable for storing annotations for visualization purposes. You can think of them as existing on their own separate layer, so that adding and removing the overlay does not mess up the underlying pixel values ({numref}`fig-rois`).
es: Por lo tanto, las superposiciones son adecuadas para almacenar anotaciones con fines de visualización. Puede pensar que existen en su propia capa separada, de modo que agregar y eliminar la superposición no estropee los valores de píxeles subyacentes ({numref}`fig-rois`).
pt_br: As sobreposições são, portanto, adequadas para armazenar anotações para fins de visualização. Você pode pensar neles como existindo em sua própria camada separada, de modo que adicionar e remover a sobreposição não atrapalhe os valores de pixel subjacentes ({numref}`fig-rois`).

source: The main commands for working with overlays are found in the {menuselection}`Image --> Overlay -->` submenu, where you can get started by drawing a ROI and choosing {guilabel}`Add Selection` (or simply press {kbd}`B`). The same submenu also provides commands to transfer ROIs between the overlay and the ROI Manager.
es: Los comandos principales para trabajar con superposiciones se encuentran en el submenú {menuselection}`Imagen --> Superposición -->`, donde puede comenzar dibujando un ROI y eligiendo {guilabel}`Agregar selección` (o simplemente presione {kbd}`B`). El mismo submenú también proporciona comandos para transferir ROI entre la superposición y el Administrador de ROI.
pt_br: Os principais comandos para trabalhar com sobreposições são encontrados no submenu {menuselection}`Image --> Overlay -->`, onde você pode começar desenhando um ROI e escolhendo {guilabel}`Adicionar seleção` (ou simplesmente pressione {kbd}`B`). O mesmo submenu também fornece comandos para transferir ROIs entre a sobreposição e o ROI Manager.

source: You can 'reactivate' a ROI on an overlay by clicking it with the {kbd}`Alt` key pressed (provided a suitable ROI tool is selected), and then edit or reposition it.
es: Puede 'reactivar' un ROI en una superposición haciendo clic en él con la tecla {kbd}`Alt` presionada (siempre que se seleccione una herramienta de ROI adecuada) y luego editarlo o reubicarlo.
pt_br: Você pode 'reativar' um ROI em uma sobreposição clicando nele com a tecla {kbd}`Alt` pressionada (desde que uma ferramenta de ROI adequada esteja selecionada) e, em seguida, edite ou reposicione-o.

source: Note that if a ROI on an overlay has been 'reactivated' in this way, then it *does* influence measurements.
es: Tenga en cuenta que si un ROI en una superposición se ha "reactivado" de esta manera, entonces *influye* en las mediciones.
pt_br: Observe que se um ROI em uma sobreposição tiver sido “reativado” dessa forma, então ele *influencia* as medições.

source: Saving ROIs
es: Guardar ROI
pt_br: Salvando ROIs

source: Individual ROIs, currently active on an image, can be saved simply by choosing {menuselection}`File --> Save As --> Selection...`
es: Las ROI individuales, actualmente activas en una imagen, se pueden guardar simplemente eligiendo {menuselection}`Archivo --> Guardar como --> Selección...`
pt_br: ROIs individuais, atualmente ativos em uma imagem, podem ser salvos simplesmente escolhendo {menuselection}`Arquivo --> Salvar como --> Seleção...`

source: The ROI Manager also has a {guilabel}`Save...` command (under {guilabel}`More`), which will save whichever ROIs are currently selected in the manager (or, if none are selected, all of them).
es: El Administrador de ROI también tiene un comando {guilabel}`Guardar...` (bajo {guilabel}`Más`), que guardará lo que Las ROI están actualmente seleccionadas en el administrador (o, si no se selecciona ninguna, todas).
pt_br: O ROI Manager também possui um comando {guilabel}`Salvar...` (em {guilabel}`More`), que salvará o que for Os ROIs estão atualmente selecionados no gerenciador (ou, se nenhum estiver selecionado, todos eles).

source: Overlays are fixed to specific images and do not have their own special save command, but will nonetheless be included if you save the image as a TIFF file (ImageJ's default format). Any currently-active ROI will also be saved in a TIFF.
es: Las superposiciones se fijan para imágenes específicas y no tienen su propio comando especial para guardar, pero de todos modos se incluirán si guarda la imagen como un archivo TIFF (el formato predeterminado de ImageJ). Cualquier ROI actualmente activo también se guardará en un TIFF.
pt_br: As sobreposições são fixadas em imagens específicas e não possuem seu próprio comando especial para salvar, mas serão incluídas se você salvar a imagem como um arquivo TIFF (formato padrão do ImageJ). Qualquer ROI atualmente ativo também será salvo em um TIFF.

source: This is all fine if you work only in ImageJ or Fiji, but unfortunately if you try to view your ROIs in other software it is highly unlikely to work properly. The ROI format is specific to ImageJ.
es: Todo esto está bien si trabaja sólo en ImageJ o Fiji, pero desafortunadamente, si intenta ver sus ROI en otro software, es muy poco probable que funcione correctamente. El formato ROI es específico de ImageJ.
pt_br: Tudo bem se você trabalhar apenas no ImageJ ou Fiji, mas infelizmente se você tentar visualizar seus ROIs em outro software, é altamente improvável que funcione corretamente. O formato ROI é específico do ImageJ.
