Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/2-measurements/imagej.po
Languages: es, pt_br

source: ImageJ: Measurements & histograms
es: ImageJ: Medidas e histogramas
pt_br: ImageJ: Medições e histogramas

source: Introduction
es: Introducción
pt_br: Introdução

source: ImageJ makes generating basic measurements and histograms *extremely* easy:
es: ImageJ hace que generar histogramas y medidas básicas sea *extremadamente* fácil:
pt_br: ImageJ torna a geração de medições básicas e histogramas *extremamente* fácil:

source: Press {kbd}`M` to make **M**easurements
es: Presione {kbd}`M` para realizar **M**mediciones
pt_br: Pressione {kbd}`M` para fazer medições **M**

source: This is the shortcut to run {menuselection}`Analyze --> Measure`.
es: Este es el atajo para ejecutar {menuselection}`Analizar --> Medir`.
pt_br: Este é o atalho para executar {menuselection}`Analyze --> Measure`.

source: Press {kbd}`H` to create a **H**istogram
es: Presione {kbd}`H` para crear un **H**istograma
pt_br: Pressione {kbd}`H` para criar um istograma **H**

source: This is the shortcut to run {menuselection}`Analyze --> Histogram`.
es: Este es el atajo para ejecutar {menuselection}`Analizar --> Histograma`.
pt_br: Este é o atalho para executar {menuselection}`Analyze --> Histogram`.

source: Assuming your image is 2D and there is no ROI active (we will explore [dimensions](chap_dimensions) and [ROIs](sec_imagej_rois) later), both of these commands will use all the pixels in the image.
es: Suponiendo que su imagen es 2D y no hay un ROI activo (exploraremos [dimensiones](chap_dimensions) y [ROIs](sec_imagej_rois) más adelante), ambos comandos usarán todos los píxeles de la imagen.
pt_br: Supondo que sua imagem seja 2D e não haja ROI ativo (exploraremos [dimensions](chap_dimensions) e [ROIs](sec_imagej_rois) posteriormente), ambos os comandos usarão todos os pixels da imagem.

source: We'll explore how to customize the regions being measured and exactly what measurements are made later in this section, but already it should be possible to answer the following questions.
es: Exploraremos cómo personalizar las regiones que se miden y exactamente qué mediciones se realizan más adelante en esta sección, pero ya debería ser posible responder las siguientes preguntas.
pt_br: Exploraremos como personalizar as regiões que estão sendo medidas e exatamente quais medições são feitas posteriormente nesta seção, mas já deve ser possível responder às seguintes perguntas.

source: Practical
es: Práctico
pt_br: Prático

source: *similar_1.tif*, *similar_2.tif*, *similar_3.tif* and *similar_4.tif* are all, well, similar. However only two contain *identical* pixel values.
es: *similar_1.tif*, *similar_2.tif*, *similar_3.tif* y *similar_4.tif* son todos, bueno, similares. Sin embargo, sólo dos contienen valores de píxeles *idénticos*.
pt_br: *similar_1.tif*, *similar_2.tif*, *similar_3.tif* e *similar_4.tif* são todos, bem, semelhantes. No entanto, apenas dois contêm valores de pixel *idênticos*.

source: Which two images contain the same values?
es: ¿Qué dos imágenes contienen los mismos valores?
pt_br: Quais são as duas imagens que contêm os mesmos valores?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_3.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_4.tif)
es: [![lanzamiento ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/similar_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_2.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/similar_3.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_4.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/similar_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_2.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/similar_3.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/similar_4.tif)

source: launch ImageJ.JS
es: lanzar ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
es: Solución
pt_br: Solução

source: Only *similar_1.tif* and *similar_3.tif* can contain the same values. An easy way to determine this is to compute the mean (average) of all pixels in each of the images. Only those two images share the same mean value.
es: Sólo *similar_1.tif* y *similar_3.tif* pueden contener los mismos valores. Una forma sencilla de determinar esto es calcular la media (promedio) de todos los píxeles en cada una de las imágenes. Sólo esas dos imágenes comparten el mismo valor medio.
pt_br: Apenas *similar_1.tif* e *similar_3.tif* podem conter os mesmos valores. Uma maneira fácil de determinar isso é calcular a média (média) de todos os pixels em cada uma das imagens. Apenas essas duas imagens compartilham o mesmo valor médio.

source: *disguise_matching.tif* has lost its match.
es: *disguise_matching.tif* ha perdido su partido.
pt_br: *disguise_matching.tif* perdeu a partida.

source: Which of the following three images have the same pixel values as *disguise_matching.tif*?
es: ¿Cuál de las siguientes tres imágenes tiene los mismos valores de píxeles que *disguise_matching.tif*?
pt_br: Qual das três imagens a seguir tem os mesmos valores de pixel que *disguise_matching.tif*?

source: *disguised_1.tif*
es: *disfrazado_1.tif*
pt_br: *disfarçado_1.tif*

source: *disguised_2.tif*
es: *disfrazado_2.tif*
pt_br: *disfarçado_2.tif*

source: *disguised_3.tif*
es: *disfrazado_3.tif*
pt_br: *disfarçado_3.tif*

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/disguise_matching.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_3.tif)
es: [![lanzamiento ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/disguise_matching.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_1.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/disguised_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_3.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/disguise_matching.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_1.tif&open=https: //github.com/bioimagebook/practical-data/blob/main/images/disguised_2.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/disguised_3.tif)

source: *disguised_3.tif* is the matching image.
es: *disguised_3.tif* es la imagen correspondiente.
pt_br: *disguised_3.tif* é a imagem correspondente.

source: Measuring images
es: Imágenes de medición
pt_br: Medindo imagens

source: When using {menuselection}`Analyze --> Measure`, the measurements are added to a *Results table*.
es: Cuando se utiliza {menuselection}`Analizar --> Medir`, las mediciones se agregan a una *tabla de resultados*.
pt_br: Ao usar {menuselection}`Analyze --> Measure`, as medidas são adicionadas a uma *Tabela de resultados*.

source: By default, the mean, minimum and maximum pixel values are provided, along with the area of the image... and that's all. It's not a lot.
es: Por defecto se proporcionan los valores de píxeles medio, mínimo y máximo, junto con el área de la imagen... y eso es todo. No es mucho.
pt_br: Por padrão, são fornecidos os valores médio, mínimo e máximo dos pixels, juntamente com a área da imagem... e isso é tudo. Não é muito.

source: Furthermore, if you make multiple measurements then they are added to the *same* results table, without any identifiers. This is especially confusing if you have several images open at the same time, and have no clue which row of the results table corresponds to measurements from which image.
es: Además, si realiza varias mediciones, se agregan a la *misma* tabla de resultados, sin ningún identificador. Esto es especialmente confuso si tiene varias imágenes abiertas al mismo tiempo y no tiene idea de qué fila de la tabla de resultados corresponde a las mediciones de cada imagen.
pt_br: Além disso, se você fizer múltiplas medições, elas serão adicionadas à *mesma* tabela de resultados, sem quaisquer identificadores. Isto é especialmente confuso se você tiver várias imagens abertas ao mesmo tempo e não tiver ideia de qual linha da tabela de resultados corresponde às medições de qual imagem.

source: {menuselection}`Analyze --> Set Measurements...` makes it possible to address both of these limitations. It not only provides many more measurements that can be selected, it includes a crucial {guilabel}`Display label` option that will cause the title of the image to be included in the results table ({numref}`fig-measure`).
es: {menuselection}`Analizar --> Establecer medidas...` hace posible abordar ambas limitaciones. No solo proporciona muchas más medidas que se pueden seleccionar, sino que incluye una opción crucial {guilabel}`Mostrar etiqueta` que hará que el título de la imagen se incluya en la tabla de resultados ( {numref}`fig-measure`).
pt_br: {menuselection}`Analyze --> Set Measurements...` torna possível abordar essas duas limitações. Ele não apenas fornece muito mais medidas que podem ser selecionadas, mas também inclui uma opção crucial {guilabel}`Exibir rótulo` que fará com que o título da imagem seja incluído na tabela de resultados ( {numref}`fig-measure`).

source: Measurement units matter -- but aren't displayed!
es: Las unidades de medida importan, ¡pero no se muestran!
pt_br: As unidades de medida são importantes – mas não são exibidas!

source: The results table does not include units for measurements, even though these are essential. Seeing an area of 10 *might* mean 10 pixels<sup>2</sup>, or 10 µm<sup>2</sup>... or something else entirely.
es: La tabla de resultados no incluye unidades de medida, aunque éstas son imprescindibles. Ver un área de 10 *podría* significar 10 píxeles<sup>2</sup>, o 10 µm <sup>2</sup>... o algo completamente distinto.
pt_br: A tabela de resultados não inclui unidades de medidas, embora estas sejam essenciais. Ver uma área de 10 *pode* significar 10 pixels<sup>2</sup> ou 10 µm <sup>2</sup>... ou algo totalmente diferente.

source: See {ref}`chap_pixel_size` for more information about why that matters for any measurements of size (area, length etc.), and how to check the units.
es: Consulte {ref}`chap_pixel_size` para obtener más información sobre por qué eso es importante para cualquier medida de tamaño (área, longitud, etc.) y cómo verificar las unidades.
pt_br: Consulte {ref}`chap_pixel_size` para obter mais informações sobre por que isso é importante para quaisquer medidas de tamanho (área, comprimento etc.) e como verificar as unidades.

source: Measurements made on an image are added to a results table. The choice of measurements to make can be changed using the {menuselection}`Analyze --> Set Measurements...` command.
es: Las medidas realizadas en una imagen se agregan a una tabla de resultados. La elección de las mediciones a realizar se puede cambiar usando el comando {menuselection}`Analizar --> Establecer medidas...`.
pt_br: As medições feitas em uma imagem são adicionadas a uma tabela de resultados. A escolha das medições a serem feitas pode ser alterada usando o comando {menuselection}`Analyze --> Set Measurements...`.

source: The 'One True Results Table' & its imposters
es: La 'Tabla de Resultados Verdaderos' y sus impostores
pt_br: A 'Tabela de Resultados Verdadeiros' e seus impostores

source: A small idiosyncrasy to be aware of is that, as far as ImageJ is concerned, there is only ever one 'official' results table -- the one with the title {guilabel}`Results`.
es: Una pequeña idiosincrasia a tener en cuenta es que, en lo que respecta a ImageJ, solo hay una tabla de resultados "oficial": la que tiene el título {guilabel}`Resultados` .
pt_br: Uma pequena idiossincrasia a ter em conta é que, no que diz respeito ao ImageJ, existe apenas uma tabela de resultados 'oficial' - aquela com o título {guilabel}`Results` .

source: Different, similar-looking tables can be created by different commands, or by duplicating an existing results table with {menuselection}`File --> Duplicate...`. Nevertheless, any new measurements you make with the {menuselection}`Measure` command will *only* be added to the original, official table. This also has an extra {guilabel}`Results` entry in its menu bar that other tables lack.
es: Se pueden crear tablas diferentes y de apariencia similar mediante diferentes comandos o duplicando una tabla de resultados existente con {menuselection}`Archivo --> Duplicar...`. Sin embargo, cualquier medición nueva que realice con el comando {menuselection}`Measure` *solo* se agregará a la tabla oficial original. Esto también tiene una entrada {guilabel}`Resultados` adicional en su barra de menú de la que carecen otras tablas.
pt_br: Tabelas diferentes e de aparência semelhante podem ser criadas por comandos diferentes ou pela duplicação de uma tabela de resultados existente com {menuselection}`File --> Duplicate...`. No entanto, quaisquer novas medições que você fizer com o comando {menuselection}`Measure` serão *apenas* adicionadas à tabela oficial original. Isso também tem uma entrada {guilabel}`Results` extra em sua barra de menu que falta em outras tabelas.

source: Choosing which measurements to select
es: Elegir qué medidas seleccionar
pt_br: Escolhendo quais medidas selecionar

source: Some options within {menuselection}`Analyze --> Set Measurements...` are so universally useful that they should pretty much always be set. Conversely, some options are manifestly confusing and dangerous and should be used rarely -- or not at all.
es: Algunas opciones dentro de {menuselection}`Analizar --> Establecer medidas...` son tan universalmente útiles que casi siempre deberían estar configuradas. Por el contrario, algunas opciones son manifiestamente confusas y peligrosas y deberían usarse rara vez, o no usarse en absoluto.
pt_br: Algumas opções em {menuselection}`Analyze --> Set Measurements...` são tão universalmente úteis que devem ser sempre definidas. Por outro lado, algumas opções são manifestamente confusas e perigosas e devem ser usadas raramente – ou nunca.

source: Options to **always** select:
es: Opciones para seleccionar **siempre**:
pt_br: Opções para **sempre** selecionar:

source: {guilabel}`Area`, {guilabel}`Mean gray value`, {guilabel}`Standard deviation`, {guilabel}`Min & max gray value` -- basic summary values
es: {guilabel}`Área`, {guilabel}`Valor de gris medio`, {guilabel}` Desviación estándar`, {guilabel}`Valor de gris mínimo y máximo`: valores resumidos básicos
pt_br: {guilabel}`Área`, {guilabel}`Valor médio de cinza`, {guilabel}` Desvio padrão`, {guilabel}`Valor cinza mínimo e máximo` - valores básicos de resumo

source: {guilabel}`Display label` -- includes the image title
es: {guilabel}`Display label`: incluye el título de la imagen
pt_br: {guilabel}`Exibir rótulo` -- inclui o título da imagem

source: {guilabel}`Stack Position` -- includes the 2D plane that has been measured in an image with {ref}`more dimensions <chap_dimensions>`.
es: {guilabel}`Stack Position`: incluye el plano 2D que se ha medido en una imagen con {ref}`más dimensiones <chap_dimensions>`.
pt_br: {guilabel}`Stack Position` -- inclui o plano 2D que foi medido em uma imagem com {ref}`mais dimensões <chap_dimensions>`.

source: Options to **avoid**:
es: Opciones para **evitar**:
pt_br: Opções para **evitar**:

source: {guilabel}`Limit to threshold` -- restricts the region being measured according to any {ref}`threshold <chap_thresholding>` that has been set; don't do this routinely, instead convert your threshold to a ROI and use that instead.
es: {guilabel}`Limitar al umbral`: restringe la región que se mide según cualquier {ref}`umbral <chap_thresholding>` que se ha configurado; no haga esto de forma rutinaria; en su lugar, convierta su umbral en un ROI y utilícelo en su lugar.
pt_br: {guilabel}`Limite ao limite` - restringe a região que está sendo medida de acordo com qualquer {ref}`limite <chap_thresholding>` que foi definido; não faça isso rotineiramente; em vez disso, converta seu limite em um ROI e use-o.

source: {guilabel}`Redirect to` -- measures a different image from the one that's selected. It sounds weird, but it's intended for cases where you have two corresponding images; one in which you can identify a region to measure, and one that contains the pixel values you should measure.
es: {guilabel}`Redireccionar a`: mide una imagen diferente de la seleccionada. Suena raro, pero está pensado para casos en los que tienes dos imágenes correspondientes; uno en el que puede identificar una región para medir y otro que contiene los valores de píxeles que debe medir.
pt_br: {guilabel}`Redirecionar para` - mede uma imagem diferente daquela selecionada. Parece estranho, mas é indicado para casos em que você tem duas imagens correspondentes; aquele em que você pode identificar uma região a ser medida e outro que contém os valores de pixel que você deve medir.

source: The two options that I think you should avoid can both result in something unexpected being measured if you don't know (or have forgotten) that either was selected under {menuselection}`Analyze --> Set Measurements...`.
es: Las dos opciones que creo que deberías evitar pueden resultar en que se mida algo inesperado si no sabes (o has olvidado) que alguna de ellas fue seleccionada en {menuselection}`Analyze -- > Establecer medidas...`.
pt_br: As duas opções que acho que você deve evitar podem resultar na medição de algo inesperado se você não souber (ou tiver esquecido) que uma delas foi selecionada em {menuselection}`Analisar -- > Definir medidas...`.

source: Fortunately, they are not really needed if you master the art of generating, managing and transferring regions of interest between images.
es: Afortunadamente, no son realmente necesarios si dominas el arte de generar, gestionar y transferir regiones de interés entre imágenes.
pt_br: Felizmente, eles não são realmente necessários se você dominar a arte de gerar, gerenciar e transferir regiões de interesse entre imagens.

source: Regions Of Interest
es: Regiones de interés
pt_br: Regiões de interesse

source: **Regions Of Interest (ROIs)** can be used to define specific parts of an image that should be processed independently or measured. Only pixels within any ROI we draw will be included in the calculations when we run {menuselection}`Analyze --> Measure`.
es: **Las regiones de interés (ROI)** se pueden utilizar para definir partes específicas de una imagen que deben procesarse o medirse de forma independiente. Solo los píxeles dentro de cualquier ROI que dibujemos se incluirán en los cálculos cuando ejecutemos {menuselection}`Analizar --> Medir`.
pt_br: **Regiões de interesse (ROIs)** podem ser usadas para definir partes específicas de uma imagem que devem ser processadas de forma independente ou medidas. Somente pixels dentro de qualquer ROI que desenharmos serão incluídos nos cálculos quando executarmos {menuselection}`Analyze --> Measure`.

source: ROI drawing tools are found on the left side of the ImageJ tool bar (A). The ROI in (B) was created by drawing one rectangular and two circular ROIs, holding down the {kbd}`Shift` key between each so that the regions were combined.
es: Las herramientas de dibujo de ROI se encuentran en el lado izquierdo de la barra de herramientas de ImageJ (A). El ROI en (B) se creó dibujando un ROI rectangular y dos circulares, manteniendo presionada la tecla {kbd}`Shift` entre cada uno para que las regiones se combinaran.
pt_br: As ferramentas de desenho ROI são encontradas no lado esquerdo da barra de ferramentas ImageJ (A). O ROI em (B) foi criado desenhando um ROI retangular e dois circulares, mantendo pressionada a tecla {kbd}`Shift` entre cada um para que as regiões fossem combinadas.

source: ROIs of different types (e.g. rectangles, circles, lines, points, polygons, freehand shapes) can be drawn using the commands in the tool bar ({numref}`fig-roi_drawing`), and are invariably 2D. Right-clicking the tools often provides access to related tools, while double-clicking may give additional options. When drawing a ROI, pressing {kbd}`Shift` or {kbd}`Control` before releasing the mouse button adds the ROI being drawn to any existing ROI already present.
es: Se pueden dibujar ROI de diferentes tipos (por ejemplo, rectángulos, círculos, líneas, puntos, polígonos, formas a mano alzada) usando los comandos en la barra de herramientas ({numref}`fig-roi_drawing`), y son invariablemente 2D. Hacer clic con el botón derecho en las herramientas a menudo proporciona acceso a herramientas relacionadas, mientras que hacer doble clic puede brindar opciones adicionales. Al dibujar una ROI, presionar {kbd}`Shift` o {kbd}`Control` antes de soltar el botón del mouse agrega la ROI que se está dibujando. cualquier ROI existente ya presente.
pt_br: ROIs de diferentes tipos (por exemplo, retângulos, círculos, linhas, pontos, polígonos, formas à mão livre) podem ser desenhadas usando os comandos na barra de ferramentas ({numref}`fig-roi_drawing`), e são invariavelmente 2D. Clicar com o botão direito nas ferramentas geralmente fornece acesso a ferramentas relacionadas, enquanto clicar duas vezes pode fornecer opções adicionais. Ao desenhar um ROI, pressionar {kbd}`Shift` ou {kbd}`Control` antes de soltar o botão do mouse adiciona o ROI que está sendo desenhado qualquer ROI existente já presente.

source: **ROIs** in ImageJ are sometimes called **selections** -- meaning the same thing
es: Los **ROI** en ImageJ a veces se denominan **selecciones**, lo que significa lo mismo
pt_br: **ROIs** no ImageJ às vezes são chamados de **seleções** - significando a mesma coisa

source: Somewhat confusingly, ROIs are sometimes referred to as **selections** in ImageJ. This is why some extra commands to create or adjust ROIs appear under the {menuselection}`Edit --> Selection` submenu.
es: De manera algo confusa, los ROI a veces se denominan **selecciones** en ImageJ. Es por eso que algunos comandos adicionales para crear o ajustar ROI aparecen en el submenú {menuselection}`Editar --> Selección`.
pt_br: Um tanto confuso, os ROIs às vezes são chamados de **seleções** no ImageJ. É por isso que alguns comandos extras para criar ou ajustar ROIs aparecem no submenu {menuselection}`Editar --> Seleção`.
