Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/2-measurements/imagej.po
Languages: es, pt_br

source: The way around this is to use the {menuselection}`Image --> Overlay --> Flatten` command. This creates an _RGB copy of the image in which the pixel values have been changed_ so that any ROIs or overlays will appear whenever you open the image elsewhere. Therefore you may well want to use this command when creating figures or presentations, but you do _not_ want to subsequently apply your analysis to the image you have flattened – always use the original instead.
es: La forma de solucionar esto es utilizar el comando {menuselection}`Imagen --> Superponer --> Aplanar`. Esto crea una _copia RGB de la imagen en la que se han cambiado los valores de píxeles_ para que cualquier ROI o superposición aparezca cada vez que abra la imagen en otro lugar. Por lo tanto, es posible que desee utilizar este comando al crear figuras o presentaciones, pero _no_ desea aplicar posteriormente su análisis a la imagen que ha aplanado; utilice siempre el original.
pt_br: A maneira de contornar isso é usar o comando {menuselection}`Image --> Overlay --> Flatten`. Isso cria uma _cópia RGB da imagem na qual os valores de pixel foram alterados_ para que quaisquer ROIs ou sobreposições apareçam sempre que você abrir a imagem em outro lugar. Portanto, você pode querer usar este comando ao criar figuras ou apresentações, mas _não_ deseja aplicar posteriormente sua análise à imagem que você aplainou – sempre use o original.

source: For more details on the impact of converting an image to RGB, see {ref}`chap_colors`.
es: Para obtener más detalles sobre el impacto de convertir una imagen a RGB, consulte {ref}`chap_colors`.
pt_br: Para obter mais detalhes sobre o impacto da conversão de uma imagem em RGB, consulte {ref}`chap_colors`.

source: ROIs and overlays are displayed on top of images, and so can be removed easily without having any effect upon the pixel values. Flattened images may appear the same on screen, but are invariably RGB (see {ref}`chap_colors`) and have had their pixel values permanently changed to show any annotations.
es: Las ROI y las superposiciones se muestran encima de las imágenes y, por lo tanto, se pueden eliminar fácilmente sin tener ningún efecto sobre los valores de los píxeles. Las imágenes aplanadas pueden aparecer iguales en la pantalla, pero invariablemente son RGB (ver {ref}`chap_colors`) y sus valores de píxeles han cambiado permanentemente para mostrar cualquier anotación.
pt_br: ROIs e sobreposições são exibidas na parte superior das imagens e, portanto, podem ser removidas facilmente sem afetar os valores dos pixels. Imagens achatadas podem parecer iguais na tela, mas são invariavelmente RGB (veja {ref}`chap_colors`) e tiveram seus valores de pixel alterados permanentemente para mostrar quaisquer anotações.

source: Open the images *Annotated_Cyclists_1.tif* and *Annotated_Cyclists_2.tif*, which depict the 3 main cyclist characteristics I found most disconcerting as a pedestrian in Heidelberg.
es: Abra las imágenes *Annotated_Cyclists_1.tif* y *Annotated_Cyclists_2.tif*, que representan las 3 características principales de los ciclistas que encontré más desconcertantes como peatones en Heidelberg.
pt_br: Abra as imagens *Annotated_Cyclists_1.tif* e *Annotated_Cyclists_2.tif*, que retratam as três principais características do ciclista que achei mais desconcertantes como pedestre em Heidelberg.

source: The images should initially look the same, but in one the text is an overlay, while in the other the image has been flattened. Which is which? Try to think of several ways to investigate this.
es: Inicialmente, las imágenes deberían verse iguales, pero en una el texto está superpuesto, mientras que en la otra la imagen se ha aplanado. ¿Cual es cual? Intente pensar en varias formas de investigar esto.
pt_br: As imagens inicialmente deveriam ter a mesma aparência, mas em uma o texto é uma sobreposição, enquanto na outra a imagem foi achatada. Qual e qual? Tente pensar em várias maneiras de investigar isso.

source: **Tip:** Zooming in may help. So might searching the menus for overlay-related commands (aided by {kbd}`L`).
es: **Consejo:** Acercar puede ser útil. También podría ser posible buscar en los menús comandos relacionados con la superposición (con la ayuda de {kbd}`L`).
pt_br: **Dica:** Aumentar o zoom pode ajudar. O mesmo ocorre com a pesquisa nos menus por comandos relacionados à sobreposição (auxiliados por {kbd}`L`).

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_2.tif)
es: [![lanzamiento ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_2.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/Annotated_Cyclists_2.tif)

source: *Annotated_Cyclists_1.tif* is the one with the overlay.
es: *Annotated_Cyclists_1.tif* es el que tiene la superposición.
pt_br: *Annotated_Cyclists_1.tif* é aquele com a sobreposição.

source: Five ways to determine whether an annotation is an overlay or not:
es: Cinco formas de determinar si una anotación es una superposición o no:
pt_br: Cinco maneiras de determinar se uma anotação é uma sobreposição ou não:

source: Zoom in very closely to the region containing the annotation. If it becomes 'blocky', i.e. made up of pixels, it is not an overlay. If it remains smooth, then it is an overlay.
es: Acérquese mucho a la región que contiene la anotación. Si se vuelve "en bloques", es decir, formado por píxeles, no es una superposición. Si permanece liso, entonces es una superposición.
pt_br: Amplie bem de perto a região que contém a anotação. Se ficar 'bloco', ou seja, composto de pixels, não é uma sobreposição. Se permanecer suave, então é uma sobreposição.

source: Move your cursor over the region where the annotation appears, and look at the pixel values. If the values are all the same where the annotation is present, but different elsewhere, then it is unlikely to be an overlay: the annotation is influencing the pixel values.
es: Mueva el cursor sobre la región donde aparece la anotación y observe los valores de píxeles. Si los valores son todos iguales donde está presente la anotación, pero diferentes en otros lugares, entonces es poco probable que se trate de una superposición: la anotación está influyendo en los valores de los píxeles.
pt_br: Mova o cursor sobre a região onde a anotação aparece e observe os valores dos pixels. Se os valores forem todos iguais onde a anotação está presente, mas diferentes em outros lugares, é improvável que seja uma sobreposição: a anotação está influenciando os valores dos pixels.

source: Using the paintbrush <img src="../../../images/imagej/icons/brush.png" /> tool from the toolbar, try putting some other color where the annotation appears. If the annotation remains visible on top of where you drew, it must be on an overlay.
es: Usando la herramienta Pincel <img src="../../../images/imagej/icons/brush.png" /> de la barra de herramientas, intente poner algún otro color donde aparece la anotación. Si la anotación permanece visible encima de donde dibujó, debe estar en una superposición.
pt_br: Usando a ferramenta pincel <img src="../../../images/imagej/icons/brush.png" /> da barra de ferramentas, tente colocar alguma outra cor onde a anotação aparece. Se a anotação permanecer visível na parte superior de onde você desenhou, ela deverá estar em uma sobreposição.

source: Choose {menuselection}`Image --> Overlay --> Hide Overlay` and see if the annotation disappears.
es: Elija {menuselection}`Imagen --> Superposición --> Ocultar superposición` y vea si la anotación desaparece.
pt_br: Escolha {menuselection}`Imagem --> Sobreposição --> Ocultar sobreposição` e veja se a anotação desaparece.

source: Choose {menuselection}`Image --> Overlay --> To ROI Manager` and see if anything happens at all.
es: Elija {menuselection}`Imagen --> Superposición --> Al Administrador de ROI` y vea si sucede algo.
pt_br: Escolha {menuselection}`Image --> Overlay --> To ROI Manager` e veja se alguma coisa acontece.

source: Using the cyclist image containing the overlay from the previous practical, rearrange the annotations so that they are each positioned next to different cyclists.
es: Utilizando la imagen del ciclista que contiene la superposición de la práctica anterior, reorganice las anotaciones para que cada una se ubique junto a diferentes ciclistas.
pt_br: Usando a imagem do ciclista que contém a sobreposição da prática anterior, reorganize as anotações para que cada uma fique posicionada ao lado de ciclistas diferentes.

source: You could do this by deleting the overlay and starting again, but there are other, faster possibilities (using a technique mentioned before, or the {menuselection}`Image --> Overlay --> To ROI Manager` command).
es: Puedes hacer esto eliminando la superposición y comenzando de nuevo, pero hay otras posibilidades más rápidas (usando una técnica mencionada anteriormente, o la {menuselection}`Imagen --> Superposición --> Al comando ROI Manager`).
pt_br: Você poderia fazer isso excluindo a sobreposição e começando novamente, mas existem outras possibilidades mais rápidas (usando uma técnica mencionada anteriormente, ou o {menuselection}`Image --> Overlay --> Para o comando do ROI Manager).

source: Click the annotation while holding down the {kbd}`Alt` key, to bring it to life so it can be moved around again. This only works if certain tools are selected, e.g. {guilabel}`Rectangle` or {guilabel}`Text`, because some other tools have more overriding functions, such as zooming in or scrolling.
es: Haga clic en la anotación mientras mantiene presionada la tecla {kbd}`Alt` para darle vida y poder moverla nuevamente. Esto sólo funciona si se seleccionan determinadas herramientas, p. {guilabel}`Rectangle` o {guilabel}`Text`, porque algunas otras herramientas tienen funciones más primordiales, como acercar o desplazarse.
pt_br: Clique na anotação enquanto mantém pressionada a tecla {kbd}`Alt`, para trazê-la à vida e poder ser movida novamente. Isso só funciona se certas ferramentas forem selecionadas, por ex. {guilabel}`Rectangle` ou {guilabel}`Text`, porque algumas outras ferramentas têm funções mais importantes, como aumentar o zoom ou rolar.

source: Generating histograms
es: Generando histogramas
pt_br: Gerando histogramas

source: Creating a histogram in ImageJ, via {menuselection}`Analyze --> Histogram` or simply pressing {kbd}`H`, results in a new histogram window being created. Like with {menuselection}`Analyze --> Measure`, this will use a ROI if it is available; otherwise it will use the full image.
es: Crear un histograma en ImageJ, a través de {menuselection}`Analyze --> Histogram` o simplemente presionando {kbd}`H`, da como resultado un Se está creando una nueva ventana de histograma. Al igual que con {menuselection}`Analizar --> Medir`, esto utilizará un ROI si está disponible; de lo contrario utilizará la imagen completa.
pt_br: Criar um histograma no ImageJ, via {menuselection}`Analyze --> Histogram` ou simplesmente pressionando {kbd}`H`, resulta em um nova janela de histograma sendo criada. Assim como {menuselection}`Analyze --> Measure`, isso usará um ROI se estiver disponível; caso contrário, usará a imagem completa.

source: An ImageJ histogram is displayed above some basic summary statistics and four intriguing buttons:
es: Se muestra un histograma de ImageJ encima de algunas estadísticas resumidas básicas y cuatro botones intrigantes:
pt_br: Um histograma ImageJ é exibido acima de algumas estatísticas básicas de resumo e quatro botões intrigantes:

source: {guilabel}`List` -- to list the actual bins and counts associated with the histogram
es: {guilabel}`List`: para enumerar los contenedores reales y los recuentos asociados con el histograma
pt_br: {guilabel}`List` - para listar os compartimentos e contagens reais associados ao histograma

source: {guilabel}`Copy` -- to copy the list above to the clipboard
es: {guilabel}`Copiar`: para copiar la lista anterior al portapapeles
pt_br: {guilabel}`Copy` -- para copiar a lista acima para a área de transferência

source: {guilabel}`Log` -- to change the y axis to show the log of the counts for each bin; this is helpful to distinguish between counts that are very small
es: {guilabel}`Log` -- para cambiar el eje y para mostrar el registro de los recuentos de cada contenedor; esto es útil para distinguir entre recuentos que son muy pequeños
pt_br: {guilabel}`Log` -- para alterar o eixo y para mostrar o log das contagens para cada compartimento; isso é útil para distinguir entre contagens que são muito pequenas

source: {guilabel}`Live` -- to make the histogram responsive to whatever you do with the image -- including changing the LUT, or any ROI
es: {guilabel}`Live`: para hacer que el histograma responda a cualquier cosa que hagas con la imagen, incluido el cambio de LUT o cualquier ROI
pt_br: {guilabel}`Live` - para tornar o histograma responsivo a tudo o que você faz com a imagem - incluindo alterar o LUT ou qualquer ROI

source: An image with its histogram in ImageJ.
es: Una imagen con su histograma en ImageJ.
pt_br: Uma imagem com seu histograma em ImageJ.

source: A histogram of an image... and an image of a histogram
es: Un histograma de una imagen... y una imagen de un histograma
pt_br: Um histograma de uma imagem... e uma imagem de um histograma

source: A slightly odd feature of ImageJ histograms is that *the histogram is also an image*. That means you can draw ROIs and even make measurements on it. We will revisit this in {ref}`chap_pixel_size`.
es: Una característica ligeramente extraña de los histogramas de ImageJ es que *el histograma también es una imagen*. Eso significa que puede dibujar ROI e incluso realizar mediciones al respecto. Revisaremos esto en {ref}`chap_pixel_size`.
pt_br: Uma característica um pouco estranha dos histogramas ImageJ é que *o histograma também é uma imagem*. Isso significa que você pode desenhar ROIs e até mesmo fazer medições sobre eles. Voltaremos a isso em {ref}`chap_pixel_size`.

source: If you have a stack, you also may need to explore {guilabel}`More >> Options...` to define whether all ROIs are shown on all slices, or only on the slices on which they were first created.
es: Si tiene una pila, es posible que también necesite explorar {guilabel}`Más >> Opciones...` para definir si todas las ROI se muestran en todos los sectores o solo en los sectores. en el que fueron creados por primera vez.
pt_br: Se você tiver uma pilha, também pode ser necessário explorar {guilabel}`Mais >> Opções...` para definir se todos os ROIs serão mostrados em todas as fatias ou apenas nas fatias em que foram criados pela primeira vez.
