Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/2-measurements/measurements.po
Languages: de, es, pt_br

source: Default Caption
de: Standard-Beschriftung
es: Leyenda por defecto
pt_br: Legenda padrão

source: Measurements & histograms
de: Messungen und Histogramme
es: Medidas e histogramas
pt_br: Medições e histogramas

source: Chapter outline
de: Gliederung des Kapitels
es: Esquema del capítulo
pt_br: Esboço do capítulo

source: **Measurements** can be made in images by calculating statistics from the pixel values
de: **Messungen** können in Bildern durch die Berechnung von Statistiken aus den Pixelwerten vorgenommen werden
es: **Se pueden realizar mediciones** en imágenes calculando estadísticas a partir de los valores de los píxeles.
pt_br: **Medições** podem ser feitas em imagens calculando estatísticas a partir dos valores dos pixels

source: **Histograms** show the distribution of pixel values in an image, and are extremely useful to compare images & diagnose problems
de: **Histogramme** zeigen die Verteilung der Pixelwerte in einem Bild und sind äußerst nützlich, um Bilder zu vergleichen und Probleme zu diagnostizieren
es: **Los histogramas** muestran la distribución de los valores de los píxeles de una imagen y son muy útiles para comparar imágenes y diagnosticar problemas.
pt_br: **Histogramas** mostram a distribuição dos valores de pixel em uma imagem e são extremamente úteis para comparar imagens e diagnosticar problemas

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: {ref}`chap_pixels` demonstrated how looks can be deceiving: the visual appearance of an image isn't enough to determine what data it contains.
de: {ref}chap_pixels" hat gezeigt, dass der Schein trügen kann: Das visuelle Erscheinungsbild eines Bildes reicht nicht aus, um zu bestimmen, welche Daten es enthält.
es: {ref}`chap_pixels` ha demostrado que las apariencias engañan: el aspecto visual de una imagen no basta para determinar qué datos contiene.
pt_br: {ref}`chap_pixels` demonstrou como a aparência pode enganar: a aparência visual de uma imagem não é suficiente para determinar quais dados ela contém.

source: Because scientific image analysis depends upon having the right pixel values in the first place, this leads to the important admonition:
de: Da die wissenschaftliche Bildanalyse davon abhängt, dass man überhaupt die richtigen Pixelwerte hat, führt dies zu der wichtigen Ermahnung:
es: Dado que el análisis científico de imágenes depende en primer lugar de disponer de los valores correctos de los píxeles, esto nos lleva a una importante advertencia:
pt_br: Como a análise científica de imagens depende, em primeiro lugar, de ter os valores de pixel corretos, isso leva a uma importante advertência:

source: Keep your original pixel values safe!
de: Bewahren Sie Ihre ursprünglichen Pixelwerte sicher auf!
es: Mantén a salvo tus valores de píxeles originales
pt_br: Mantenha seus valores de pixel originais seguros!

source: The pixel values in your original image are your raw data: it's essential to protect these from unwanted changes.
de: Die Pixelwerte in Ihrem Originalbild sind Ihre Rohdaten: Es ist wichtig, diese vor unerwünschten Änderungen zu schützen.
es: Los valores de los píxeles de la imagen original son los datos en bruto: es esencial protegerlos de cambios no deseados.
pt_br: Os valores de pixel na sua imagem original são seus dados brutos: é essencial protegê-los contra alterações indesejadas.

source: This is really important because there are lots of ways to accidentally compromise the raw data of an image -- such as by using the wrong software to adjust the brightness and contrast, or saving the files [in the wrong format](chap_files). This can cause the results of analysis to be wrong.
de: Dies ist sehr wichtig, da es viele Möglichkeiten gibt, die Rohdaten eines Bildes versehentlich zu verfälschen, z. B. durch die Verwendung einer falschen Software zur Einstellung von Helligkeit und Kontrast oder durch das Speichern der Dateien [im falschen Format] (chap_files). Dies kann dazu führen, dass die Ergebnisse der Analyse falsch sind.
es: Esto es realmente importante porque hay muchas formas de comprometer accidentalmente los datos en bruto de una imagen -- como por ejemplo utilizando el software equivocado para ajustar el brillo y el contraste, o guardando los archivos [en el formato equivocado](chap_files). Esto puede hacer que los resultados del análisis sean erróneos.
pt_br: Isso é muito importante porque há muitas maneiras de comprometer acidentalmente os dados brutos de uma imagem - como usar o software errado para ajustar o brilho e o contraste ou salvar os arquivos [no formato errado] (chap_files). Isso pode fazer com que os resultados da análise estejam errados.

source: What makes this especially tricky is that trustworthy and untrustworthy images can *look* identical. Therefore, we need a way to see beyond LUTs to compare the content of images easily and efficiently.
de: Besonders knifflig ist dabei, dass vertrauenswürdige und nicht vertrauenswürdige Bilder identisch *aussehen* können. Daher brauchen wir eine Möglichkeit, über LUTs hinaus zu sehen, um den Inhalt von Bildern einfach und effizient zu vergleichen.
es: Lo que lo hace especialmente complicado es que las imágenes fiables y las que no lo son pueden *parecer* idénticas. Por lo tanto, necesitamos una forma de ver más allá de las LUT para comparar el contenido de las imágenes de forma fácil y eficaz.
pt_br: O que torna isso especialmente complicado é que imagens confiáveis e não confiáveis podem *parecer* idênticas. Portanto, precisamos ver além dos LUTs para comparar o conteúdo das imagens de maneira fácil e eficiente.

source: Comparing histograms & statistics
de: Vergleich von Histogrammen und Statistiken
es: Comparación de histogramas y estadísticas
pt_br: Comparando histogramas e estatísticas

source: In principle, if we want to compare two images we could check that every corresponding pixel value is identical in both images. We will use this approach later, but isn't always necessary.
de: Wenn wir zwei Bilder vergleichen wollen, könnten wir im Prinzip prüfen, ob jeder entsprechende Pixelwert in beiden Bildern identisch ist. Wir werden diesen Ansatz später verwenden, aber er ist nicht immer notwendig.
es: En principio, si queremos comparar dos imágenes podríamos comprobar que cada valor de píxel correspondiente es idéntico en ambas imágenes. Utilizaremos este método más adelante, pero no siempre es necesario.
pt_br: Em princípio, se quisermos comparar duas imagens, poderemos verificar se cada valor de pixel correspondente é idêntico em ambas as imagens. Usaremos essa abordagem mais tarde, mas nem sempre é necessária.

source: There are two other things we can do, which are often much faster and easier:
de: Es gibt zwei andere Möglichkeiten, die oft viel schneller und einfacher sind:
es: Hay otras dos cosas que podemos hacer, que suelen ser mucho más rápidas y sencillas:
pt_br: Há duas outras coisas que podemos fazer, que geralmente são muito mais rápidas e fáceis:

source: Calculate some **summary statistics** from the pixel values, such as the average (mean) pixel value, standard deviation, minimum and maximum values.
de: Berechnen Sie einige **zusammenfassende Statistiken** aus den Pixelwerten, wie z. B. den durchschnittlichen (mittleren) Pixelwert, die Standardabweichung, den Mindest- und den Höchstwert.
es: Calcular algunos **estadísticos resumidos** a partir de los valores de los píxeles, como el valor medio de los píxeles, la desviación estándar y los valores mínimo y máximo.
pt_br: Calcule algumas **estatísticas resumidas** dos valores de pixel, como o valor médio (médio) do pixel, desvio padrão, valores mínimo e máximo.

source: Check out the image **histogram**. This graphically depicts the distribution of pixel values in the image.
de: Sehen Sie sich das Bild **Histogramm** an. Hier wird die Verteilung der Pixelwerte im Bild grafisch dargestellt.
es: Compruebe el **histograma** de la imagen. Representa gráficamente la distribución de los valores de los píxeles de la imagen.
pt_br: Confira a imagem **histograma**. Isso representa graficamente a distribuição dos valores de pixel na imagem.

source: Putting these into action, we can recreate {numref}`fig-images_look_same` but this time add
de: Um dies in die Tat umzusetzen, können wir {numref}`fig-images_look_same` neu erstellen, aber dieses Mal hinzufügen
es: Poniendo esto en acción, podemos recrear {numref}`fig-images_look_same` pero esta vez añadiendo
pt_br: Colocando isso em ação, podemos recriar {numref}`fig-images_look_same` mas desta vez adicionar

source: the LUT (shown as a colored bar below the image)
de: die LUT (dargestellt als farbiger Balken unter dem Bild)
es: la LUT (se muestra como una barra de color debajo de la imagen)
pt_br: o LUT (mostrado como uma barra colorida abaixo da imagem)

source: a histogram
de: ein Histogramm
es: un histograma
pt_br: um histograma

source: summary statistics
de: zusammenfassende Statistiken
es: resumen estadístico
pt_br: estatísticas resumidas

source: Recreation of {numref}`fig-images_look_same` showing images that *look* the same, but contain *different* pixels values -- this time with measurements and histograms included.
de: Neuauflage von {numref}`fig-images_look_same`, die Bilder zeigt, die *gleich* aussehen, aber *unterschiedliche* Pixelwerte enthalten - diesmal mit Messungen und Histogrammen.
es: Recreación de {numref}`fig-images_look_same` mostrando imágenes que *parecen* iguales, pero contienen valores de píxeles *diferentes* -- esta vez con medidas e histogramas incluidos.
pt_br: Recriação de {numref}`fig-images_look_same` mostrando imagens que *parecem* iguais, mas contêm valores de pixels *diferentes* - desta vez com medidas e histogramas incluídos.

source: With the additional information at our disposal, we can immediately see that the images really **do** contain different underlying values -- and therefore potentially quite different information -- despite their initial similar appearance. We can also see that the LUTs are different; they show the same colors (shades of gray), but in each case these map to different values.
de: Mit den zusätzlichen Informationen, die uns zur Verfügung stehen, können wir sofort erkennen, dass die Bilder trotz ihres anfänglich ähnlichen Aussehens tatsächlich **unterschiedliche zugrunde liegende Werte** enthalten - und damit potenziell ganz unterschiedliche Informationen. Wir können auch sehen, dass die LUTs unterschiedlich sind; sie zeigen die gleichen Farben (Grautöne), aber in jedem Fall werden diese auf unterschiedliche Werte abgebildet.
es: Con la información adicional a nuestra disposición, podemos ver inmediatamente que las imágenes realmente **contienen** valores subyacentes diferentes -y por lo tanto información potencialmente muy diferente- a pesar de su apariencia inicial similar. También podemos ver que las LUT son diferentes; muestran los mismos colores (tonos de gris), pero en cada caso se asignan a valores diferentes.
pt_br: Com as informações adicionais à nossa disposição, podemos ver imediatamente que as imagens realmente **contêm** diferentes valores subjacentes - e, portanto, informações potencialmente bastante diferentes - apesar de sua aparência inicial semelhante. Também podemos ver que as LUTs são diferentes; eles mostram as mesmas cores (tons de cinza), mas em cada caso são mapeados para valores diferentes.

source: By contrast, when we apply the same steps to {numref}`fig-images_look_different` we see that the histograms and statistics are identical -- only the LUT has been changed in each case. This suggests that any analysis we perform on each of these images should give the same results, since the pixel values remain intact.
de: Wenn wir dagegen die gleichen Schritte auf {numref}`fig-images_look_different` anwenden, sehen wir, dass die Histogramme und Statistiken identisch sind - nur die LUT wurde in jedem Fall geändert. Dies deutet darauf hin, dass jede Analyse, die wir mit jedem dieser Bilder durchführen, die gleichen Ergebnisse liefern sollte, da die Pixelwerte intakt bleiben.
es: Por el contrario, cuando aplicamos los mismos pasos a {numref}`fig-images_look_different` vemos que los histogramas y las estadísticas son idénticos -- sólo se ha cambiado la LUT en cada caso. Esto sugiere que cualquier análisis que realicemos en cada una de estas imágenes debería dar los mismos resultados, ya que los valores de los píxeles permanecen intactos.
pt_br: Por outro lado, quando aplicamos as mesmas etapas a {numref}`fig-images_look_ Different` vemos que os histogramas e estatísticas são idênticos - apenas o LUT foi alterado em cada caso. Isto sugere que qualquer análise que realizarmos em cada uma dessas imagens deverá dar os mesmos resultados, uma vez que os valores dos pixels permanecem intactos.

source: Recreation of {numref}`fig-images_look_different` showing images that *look* different, but contain *the same* pixel values -- this time with measurements and histograms included.
de: Neuauflage von {numref}`fig-images_look_different`, die Bilder zeigt, die *unterschiedlich* aussehen, aber *die gleichen* Pixelwerte enthalten - diesmal mit Messungen und Histogrammen.
es: Recreación de {numref}`fig-images_look_different` mostrando imágenes que *parecen* diferentes, pero contienen *los mismos* valores de píxel -- esta vez con medidas e histogramas incluidos.
pt_br: Recriação de {numref}`fig-images_look_ Different` mostrando imagens que *parecem* diferentes, mas contêm *os mesmos* valores de pixels - desta vez com medições e histogramas incluídos.

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: If two images have identical histograms and summary statistics (mean, min, max, standard deviation), does this **prove** that the images are identical?
de: Wenn zwei Bilder identische Histogramme und zusammenfassende Statistiken (Mittelwert, Minimum, Maximum, Standardabweichung) aufweisen, ist das ein **Beweis** dafür, dass die Bilder identisch sind?
es: Si dos imágenes tienen histogramas y estadísticas de resumen idénticos (media, mínimo, máximo, desviación estándar), ¿esto **prueba** que las imágenes son idénticas?
pt_br: Se duas imagens tiverem histogramas e estatísticas resumidas idênticas (média, mínimo, máximo, desvio padrão), isso **prova** que as imagens são idênticas?

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: No! For example, we might have the same pixel values in a different arrangement. If I randomly shuffle the pixels in the image then the basic statistics and histogram remain unchanged -- but the image itself is very different.
de: Nein! Wir könnten zum Beispiel die gleichen Pixelwerte in einer anderen Anordnung haben. Wenn ich die Pixel im Bild zufällig mische, bleiben die grundlegenden Statistiken und das Histogramm unverändert - aber das Bild selbst sieht ganz anders aus.
es: No. Por ejemplo, podemos tener los mismos valores de píxeles en una disposición diferente. Si barajo aleatoriamente los píxeles de la imagen, las estadísticas básicas y el histograma no cambian, pero la imagen en sí es muy diferente.
pt_br: Não! Por exemplo, podemos ter os mesmos valores de pixel em um arranjo diferente. Se eu embaralhar aleatoriamente os pixels da imagem, as estatísticas básicas e o histograma permanecerão inalterados - mas a imagem em si é muito diferente.

source: This means that, technically, we can only really use histograms and summary measurements to prove that images are definitely *not* the same.
de: Das bedeutet, dass wir technisch gesehen nur Histogramme und zusammenfassende Messungen verwenden können, um zu beweisen, dass die Bilder definitiv *nicht* gleich sind.
es: Esto significa que, técnicamente, sólo podemos utilizar histogramas y medidas de resumen para demostrar que las imágenes no son iguales.
pt_br: Isso significa que, tecnicamente, só podemos usar histogramas e medidas resumidas para provar que as imagens definitivamente *não* são iguais.

source: However, in practice this is usually enough. If two images have identical histograms and summary statistics *and* look similar, it is *very likely* that they are the same.
de: In der Praxis ist dies jedoch in der Regel ausreichend. Wenn zwei Bilder identische Histogramme und zusammenfassende Statistiken aufweisen *und* ähnlich aussehen, ist es *sehr wahrscheinlich*, dass sie identisch sind.
es: Sin embargo, en la práctica suele ser suficiente. Si dos imágenes tienen histogramas y estadísticas de resumen idénticos *y* un aspecto similar, es *muy probable* que sean la misma.
pt_br: No entanto, na prática, isso geralmente é suficiente. Se duas imagens tiverem histogramas e estatísticas resumidas idênticas *e* parecerem semelhantes, é *muito provável* que sejam iguais.

source: Conceivably, someone might try to deceive us by making some very subtle change to an image that preserves the statistics, such as as swapping two pixels amongst millions so that we don't notice the difference. Later, we'll see how to overcome even that by checking every single pixel -- but such elaborate trickery probably isn't a very real risk for most of us.
de: Es ist denkbar, dass jemand versucht, uns zu täuschen, indem er eine sehr subtile Änderung an einem Bild vornimmt, bei der die Statistik erhalten bleibt, z. B. indem er zwei Pixel unter Millionen von Pixeln austauscht, so dass wir den Unterschied nicht bemerken. Später werden wir sehen, wie man selbst das umgehen kann, indem man jedes einzelne Pixel überprüft - aber solche ausgeklügelten Tricks sind wahrscheinlich für die meisten von uns kein wirkliches Risiko.
es: Es concebible que alguien intente engañarnos haciendo algún cambio muy sutil en una imagen que preserve las estadísticas, como intercambiar dos píxeles entre millones para que no notemos la diferencia. Más adelante veremos cómo evitarlo comprobando cada uno de los píxeles, pero un truco tan elaborado probablemente no sea un riesgo muy real para la mayoría de nosotros.
pt_br: É concebível que alguém possa tentar nos enganar fazendo alguma alteração muito sutil em uma imagem que preserve as estatísticas, como trocar dois pixels entre milhões para que não percebamos a diferença. Mais tarde, veremos como superar isso verificando cada pixel - mas esses truques elaborados provavelmente não são um risco muito real para a maioria de nós.

source: Most of the time, when things go wrong with scientific images the histogram and statistics will be compromised in an obvious way -- we just need to remember to check for these changes.
de: Wenn bei wissenschaftlichen Bildern etwas schief läuft, werden das Histogramm und die Statistiken in den meisten Fällen auf offensichtliche Weise beeinträchtigt - wir müssen nur daran denken, auf diese Veränderungen zu achten.
es: La mayoría de las veces, cuando las cosas van mal con las imágenes científicas, el histograma y las estadísticas se verán comprometidos de forma obvia: sólo tenemos que acordarnos de comprobar estos cambios.
pt_br: Na maioria das vezes, quando as coisas correm mal com as imagens científicas, o histograma e as estatísticas ficam comprometidos de uma forma óbvia - só precisamos de nos lembrar de verificar estas alterações.

source: The ability to quickly generate and interpret histograms is an essential skill for any image analyst. We will use histograms a lot throughout this text, both to help diagnose problems with the data and to figure out which techniques we should use.
de: Die Fähigkeit, Histogramme schnell zu erstellen und zu interpretieren, ist eine wesentliche Fähigkeit für jeden Bildanalytiker. Wir werden in diesem Text häufig Histogramme verwenden, sowohl um Probleme mit den Daten zu diagnostizieren als auch um herauszufinden, welche Techniken wir verwenden sollten.
es: La capacidad de generar e interpretar rápidamente histogramas es una habilidad esencial para cualquier analista de imágenes. Utilizaremos mucho los histogramas a lo largo de este texto, tanto para ayudar a diagnosticar problemas con los datos como para averiguar qué técnicas debemos utilizar.
pt_br: A capacidade de gerar e interpretar histogramas rapidamente é uma habilidade essencial para qualquer analista de imagens. Utilizaremos muito histogramas ao longo deste texto, tanto para ajudar a diagnosticar problemas com os dados quanto para descobrir quais técnicas devemos utilizar.

source: Make histograms a habit!
de: Machen Sie Histogramme zur Gewohnheit!
es: Convierta los histogramas en un hábito
pt_br: Faça dos histogramas um hábito!

source: When working with new images, it's a good habit to *always* check histograms. This can give a deeper understanding of the data, and help flag up potential problems.
de: Bei der Arbeit mit neuen Bildern ist es eine gute Angewohnheit, *immer* die Histogramme zu überprüfen. Dies kann zu einem besseren Verständnis der Daten führen und hilft, potenzielle Probleme zu erkennen.
es: Cuando se trabaja con imágenes nuevas, es una buena costumbre comprobar *siempre* los histogramas. De este modo se obtiene una comprensión más profunda de los datos y se pueden detectar posibles problemas.
pt_br: Ao trabalhar com novas imagens, é um bom hábito *sempre* verificar os histogramas. Isso pode proporcionar uma compreensão mais profunda dos dados e ajudar a sinalizar possíveis problemas.
