Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/2-measurements/python.po
Languages: es

source: Python: Measurements & histograms
es: Python: Medidas e histogramas

source: Here, we will explore how to make measurements and generate histograms with Python.
es: Aquí exploraremos cómo realizar mediciones y generar histogramas con Python.

source: Introduction to NumPy arrays
es: Introducción a las matrices NumPy

source: The images we are working with in Python are **NumPy arrays** - https://numpy.org
es: Las imágenes con las que trabajamos en Python son matrices **NumPy** - https://numpy.org

source: Rather than plotting the image with `plt.imshow`, we can also simply print its values. Since there can be a *lot* of values (i.e. millions of pixels per image), only a few are shown by default.
es: En lugar de trazar la imagen con `plt.imshow`, también podemos simplemente imprimir sus valores. Como puede haber *muchos* valores (es decir, millones de píxeles por imagen), por defecto sólo se muestran unos pocos.

source: If we want to know how many values are in an image, we can query its `shape`.
es: Si queremos saber cuántos valores hay en una imagen, podemos consultar su `forma`.

source: This returns the size in the order `(height, width)`.
es: Devuelve el tamaño en el orden `(alto, ancho)`.

source: Whenever we have a 2D NumPy array, we can easily transpose it - which will switch the width and height values.
es: Siempre que tengamos un array NumPy 2D, podemos transponerlo fácilmente - lo que cambiará los valores de anchura y altura.

source: Calculating statistics
es: Cálculo de estadísticas

source: A more meaningful benefit of working with NumPy arrays, for our purposes at least, is that they enable us to calculate some summary statistics *extremely* easily.
es: Un beneficio más significativo de trabajar con matrices NumPy, para nuestros propósitos al menos, es que nos permiten calcular algunas estadísticas de resumen *extremadamente* fácil.

source: For example, to compute the average (mean) pixel value we can simply use `im.mean()`.
es: Por ejemplo, para calcular el valor medio de un píxel podemos utilizar `im.mean()`.

source: If that's the last thing we add to a code cell, then the result will be displayed in our notebook.
es: Si eso es lo último que añadimos a una celda de código, el resultado se mostrará en nuestro cuaderno.

source: However, if we want to print multiple values - and multiple statistics - in quick succession we should use the `print` function again.
es: Sin embargo, si queremos imprimir varios valores -y varias estadísticas- en rápida sucesión, debemos utilizar de nuevo la función `print`.

source: Formatting output
es: Formatear la salida

source: Things become more readable if we add some extra text, rather than just printing numbers.
es: Las cosas resultan más legibles si añadimos algo de texto adicional, en lugar de limitarnos a imprimir números.

source: One of the easiest ways to do this is to use an 'f-string', which is in the form `f'Some text {some_variable}`.
es: Una de las formas más sencillas de hacerlo es utilizar una 'cadena-f', que tiene la forma `f'Algún texto {some_variable}`.

source: The part between the braces `{}` can be a calculation, and if you add `:.2f` at the end this will optionally limit the number of decimal places (here, to two).
es: La parte entre llaves `{}` puede ser un cálculo, y si se añade `:.2f` al final se limitará opcionalmente el número de decimales (aquí, a dos).

source: Generating histograms
es: Generación de histogramas

source: We can now try to generate image histograms, using `plt.hist`.
es: Ahora podemos intentar generar histogramas de imagen, utilizando `plt.hist`.

source: You might expect `plt.hist(im)` to work, just as `plt.imshow(im)` did previously. However, the result can be a bit surprising.
es: Es de esperar que `plt.hist(im)` funcione, al igual que `plt.imshow(im)` lo hizo anteriormente. Sin embargo, el resultado puede ser un poco sorprendente.

source: The problem is that the image is 2D, and `plt.hist` is expecting just a single 1D list of values. We can generate that with a call to `.flatten()`, and use the flattened array to create the histogram.
es: El problema es que la imagen es 2D, y `plt.hist` espera sólo una lista de valores 1D. Podemos generar eso con una llamada a `.flatten()`, y utilizar la matriz aplanada para crear el histograma.

source: As with `plt.imshow`, we have lots of options to customize the histogram. This includes the ability to set the color or number of histogram bins.
es: Al igual que con `plt.imshow`, tenemos muchas opciones para personalizar el histograma. Esto incluye la posibilidad de establecer el color o el número de bins del histograma.

source: **Parentheses**
es: **Paréntesis**

source: It may initially be confusing why we sometimes need parentheses `()` and sometimes we don't, e.g. `im.flatten()` vs. `im.shape`.
es: Al principio puede resultar confuso por qué a veces necesitamos paréntesis `()` y a veces no, por ejemplo `im.flatten()` frente a `im.shape`.

source: As a general rule, parentheses indicate that we're calling a method that *does* something (e.g. prints a value, calculates an average, flattens an array).
es: Por regla general, los paréntesis indican que estamos llamando a un método que *hace* algo (por ejemplo, imprime un valor, calcula una media, aplana una matriz).

source: When we don't see parentheses, this indicates that we're accessing a field or property (e.g. the shape of an array).
es: Cuando no vemos paréntesis, esto indica que estamos accediendo a un campo o propiedad (por ejemplo, la forma de un array).

source: In practice, the distinction can sometimes be a bit murky as you get deeper into Python - but it helps as a general guide.
es: En la práctica, la distinción puede resultar un poco confusa a medida que se profundiza en Python, pero sirve como guía general.
