Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/imagej.po
Languages: de, pt_br

source: ImageJ: Images & pixels
de: ImageJ: Bilder & Pixel
pt_br: ImageJ: imagens e pixels

source: Introduction
de: Einführung
pt_br: Introdução

source: This is the first section that takes the ideas described in the main chapter and shows how they relate to software: in this case **ImageJ**.
de: Dies ist der erste Abschnitt, der die im Hauptkapitel beschriebenen Ideen aufgreift und zeigt, wie sie sich auf Software beziehen: in diesem Fall **ImageJ**.
pt_br: Esta é a primeira seção que pega as ideias descritas no capítulo principal e mostra como elas se relacionam com o software: neste caso **ImageJ**.

source: We begin with a brief introduction to what ImageJ is, how to get it, and how to navigate the interface to open and display images.
de: Wir beginnen mit einer kurzen Einführung darüber, was ImageJ ist, wie man es erhält und wie man in der Benutzeroberfläche navigiert, um Bilder zu öffnen und anzuzeigen.
pt_br: Começamos com uma breve introdução sobre o que é ImageJ, como obtê-lo e como navegar na interface para abrir e exibir imagens.

source: What is ImageJ?
de: Was ist ImageJ?
pt_br: O que é ImageJ?

source: **ImageJ** is open-source software for image analysis.
de: **ImageJ** ist eine Open-Source-Software zur Bildanalyse.
pt_br: **ImageJ** é um software de código aberto para análise de imagens.

source: Created by **Wayne Rasband** at the National Institutes of Health, ImageJ has become indispensable to the research community over more than 20 years. It continues to be updated regularly and is by far the most discussed topic on the [Scientific Community Image Forum](https://forum.image.sc) -- with [more than 10,000 topics](https://forum.image.sc/tags) at the time of writing, and more added every day.
de: ImageJ wurde von **Wayne Rasband** an den National Institutes of Health entwickelt und ist in mehr als 20 Jahren für die Forschungsgemeinschaft unverzichtbar geworden. Es wird weiterhin regelmäßig aktualisiert und ist mit Abstand das am meisten diskutierte Thema im [Scientific Community Image Forum](https://forum.image.sc) – mit [mehr als 10.000 Themen](https://forum.image .sc/tags) zum Zeitpunkt des Schreibens, und jeden Tag kommen weitere hinzu.
pt_br: Criado por **Wayne Rasband** no National Institutes of Health, o ImageJ tornou-se indispensável para a comunidade de pesquisa ao longo de mais de 20 anos. Ele continua sendo atualizado regularmente e é de longe o tópico mais discutido no [Scientific Community Image Forum](https://forum.image.sc) -- com [mais de 10.000 tópicos](https://forum.image .sc/tags) no momento em que este artigo foi escrito e mais adicionados todos os dias.

source: ImageJ's success is due not only to the features of the software itself, but to its openness and extensibility. The source code is in the public domain, meaning that others can adapt it as needed. But usually this isn't necessary, because users can write (and share) custom macros, plugins or scripts to add new functionality -- without changing ImageJ itself.
de: Der Erfolg von ImageJ ist nicht nur auf die Funktionen der Software selbst zurückzuführen, sondern auch auf ihre Offenheit und Erweiterbarkeit. Der Quellcode ist gemeinfrei, d. h. andere können ihn bei Bedarf anpassen. Dies ist jedoch normalerweise nicht erforderlich, da Benutzer benutzerdefinierte Makros, Plugins oder Skripts schreiben (und freigeben) können, um neue Funktionen hinzuzufügen – ohne ImageJ selbst zu ändern.
pt_br: O sucesso do ImageJ se deve não apenas aos recursos do software em si, mas também à sua abertura e extensibilidade. O código-fonte é de domínio público, o que significa que outros podem adaptá-lo conforme necessário. Mas geralmente isso não é necessário, porque os usuários podem escrever (e compartilhar) macros, plug-ins ou scripts personalizados para adicionar novas funcionalidades - sem alterar o próprio ImageJ.

source: I personally have found ImageJ phenomenally useful throughout my career, to the extent that I am convinced that *anyone* working with biomedical images benefits if they know how to use it. Even if you ultimately use other software for your analysis, or even write your own, the ability to quickly check things in ImageJ is extremely helpful.
de: Ich persönlich habe ImageJ während meiner gesamten Karriere als phänomenal nützlich empfunden und bin davon überzeugt, dass *jeder*, der mit biomedizinischen Bildern arbeitet, davon profitiert, wenn er weiß, wie man es verwendet. Auch wenn Sie letztendlich eine andere Software für Ihre Analyse verwenden oder sogar eine eigene Software schreiben, ist die Möglichkeit, Dinge in ImageJ schnell zu überprüfen, äußerst hilfreich.
pt_br: Pessoalmente, achei o ImageJ extremamente útil ao longo da minha carreira, a ponto de estar convencido de que *qualquer pessoa* que trabalhe com imagens biomédicas se beneficiará se souber como usá-lo. Mesmo que você use outro software para sua análise, ou até mesmo escreva o seu próprio, a capacidade de verificar rapidamente as coisas no ImageJ é extremamente útil.

source: These sections are intended to help any interested reader develop a strong working knowledge of ImageJ itself, while simultaneously gaining a deeper understanding of image analysis in general.
de: Diese Abschnitte sollen jedem interessierten Leser dabei helfen, fundierte Kenntnisse über ImageJ selbst zu entwickeln und gleichzeitig ein tieferes Verständnis der Bildanalyse im Allgemeinen zu erlangen.
pt_br: Estas seções têm como objetivo ajudar qualquer leitor interessado a desenvolver um forte conhecimento prático do próprio ImageJ, ao mesmo tempo que obtém uma compreensão mais profunda da análise de imagens em geral.

source: Getting ImageJ
de: ImageJ abrufen
pt_br: Obtendo ImageJ

source: ImageJ is available in multiple forms. Three of the most important ones for our purposes are:
de: ImageJ ist in mehreren Formen verfügbar. Drei der wichtigsten für unsere Zwecke sind:
pt_br: ImageJ está disponível em vários formatos. Três dos mais importantes para nossos propósitos são:

source: 1. ImageJ
de: 1. BildJ
pt_br: 1. Imagem J

source: **Download from https://imagej.nih.gov/ij/**
de: **Download von https://imagej.nih.gov/ij/**
pt_br: **Baixe em https://imagej.nih.gov/ij/**

source: The 'original' download of ImageJ contains all the core functionality, but no extra user plugins.
de: Der „ursprüngliche“ Download von ImageJ enthält alle Kernfunktionen, jedoch keine zusätzlichen Benutzer-Plugins.
pt_br: O download 'original' do ImageJ contém todas as funcionalidades básicas, mas nenhum plug-in de usuário extra.

source: The core of the application is a tiny file *ij.jar* (~2.5 MB) that runs on Java. You can download a platform-specific package that includes both ImageJ and Java for Windows, Mac or Linux. Including Java makes the download bigger, but makes the application self-contained and easy to run.
de: Der Kern der Anwendung ist eine winzige Datei *ij.jar* (~2,5 MB), die auf Java läuft. Sie können ein plattformspezifisches Paket herunterladen, das sowohl ImageJ als auch Java für Windows, Mac oder Linux enthält. Durch die Einbeziehung von Java wird der Download größer, die Anwendung ist jedoch eigenständig und einfach auszuführen.
pt_br: O núcleo do aplicativo é um pequeno arquivo *ij.jar* (~2,5 MB) que roda em Java. Você pode baixar um pacote específico da plataforma que inclui ImageJ e Java para Windows, Mac ou Linux. A inclusão de Java aumenta o download, mas torna o aplicativo independente e fácil de executar.

source: 2. Fiji
de: 2. Fidschi

source: **Download from https://fiji.sc/**
de: **Download von https://fiji.sc/**
pt_br: ** Baixe em https://fiji.sc/**

source: **Fiji**, which stands for _**F**iji **I**s **J**ust **I**mageJ_, is a distribution of ImageJ that comes bundled with a plethora of plugins and extra features that are especially useful for life scientists. It also has a powerful script editor that helps a lot when developing macros or scripts, an updater to help manage all the additions, and even a ['Big Data Viewer'](https://imagej.net/plugins/bdv/) for particularly huge images.
de: **Fiji**, was für _**F**iji **I**s **J**ust **I**mageJ_ steht, ist eine Distribution von ImageJ, die mit einer Vielzahl von Plugins und mehr gebündelt ist Funktionen, die besonders für Biowissenschaftler nützlich sind. Es verfügt außerdem über einen leistungsstarken Skripteditor, der bei der Entwicklung von Makros oder Skripten sehr hilfreich ist, einen Updater zur Verwaltung aller Ergänzungen und sogar einen ['Big Data Viewer'](https://imagej.net/plugins/bdv/). für besonders große Bilder.
pt_br: **Fiji**, que significa _**F**iji **I**s **J**ust **I**mageJ_, é uma distribuição do ImageJ que vem com uma infinidade de plug-ins e extras recursos que são especialmente úteis para cientistas da vida. Ele também possui um poderoso editor de scripts que ajuda muito no desenvolvimento de macros ou scripts, um atualizador para ajudar a gerenciar todas as adições e até um ['Big Data Viewer'](https://imagej.net/plugins/bdv/) para imagens particularmente grandes.

source: **Run at https://ij.imjoy.io**
de: **Ausführen unter https://ij.imjoy.io**
pt_br: **Corra em https://ij.imjoy.io**

source: ImageJ.JS is a web version of the original ImageJ, capable of running in a browser. It has a few extra features, but not as many as Fiji. It was put together and is maintained by the [ImJoy team](https://github.com/imjoy-team) led by Wei Ouyang.
de: ImageJ.JS ist eine Webversion des ursprünglichen ImageJ, die in einem Browser ausgeführt werden kann. Es gibt ein paar zusätzliche Funktionen, aber nicht so viele wie Fidschi. Es wurde vom [ImJoy-Team](https://github.com/imjoy-team) unter der Leitung von Wei Ouyang zusammengestellt und wird gepflegt.
pt_br: ImageJ.JS é uma versão web do ImageJ original, capaz de rodar em um navegador. Possui alguns recursos extras, mas não tantos quanto Fiji. Ele foi elaborado e é mantido pela [equipe ImJoy](https://github.com/imjoy-team) liderada por Wei Ouyang.

source: For more information, see https://imagej.net/software/imagej-js
de: Weitere Informationen finden Sie unter https://imagej.net/software/imagej-js
pt_br: Para obter mais informações, consulte https://imagej.net/software/imagej-js

source: More interactivity with ImageJ.JS!
de: Mehr Interaktivität mit ImageJ.JS!
pt_br: Mais interatividade com ImageJ.JS!

source: Whenever you see a button like this [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif) it can be used to launch ImageJ.JS directly from this book, often with a relevant image opened.
de: Immer wenn Sie eine Schaltfläche wie diese sehen [![Launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy. io?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif) kann verwendet werden, um ImageJ.JS direkt aus diesem Buch heraus zu starten, oft mit geöffnetem relevanten Bild.
pt_br: Sempre que você vir um botão como este [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy. io?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif) pode ser usado para iniciar o ImageJ.JS diretamente deste livro, geralmente com uma imagem relevante aberta.

source: launch ImageJ.JS
de: Starten Sie ImageJ.JS
pt_br: iniciar ImageJ.JS

source: By default, ImageJ.JS will open in the same browser tab. If you want it to open in a new tab, then there's probably an easy trick in your browser to do that (on a computer, my guess is that it'll be pressing {kbd}`Ctrl` or {kbd}`⌘` when clicking the link).
de: Standardmäßig wird ImageJ.JS im selben Browser-Tab geöffnet. Wenn Sie möchten, dass es in einem neuen Tab geöffnet wird, gibt es wahrscheinlich einen einfachen Trick in Ihrem Browser, um dies zu tun (auf einem Computer vermute ich, dass er {kbd} drückt). „Strg“ oder {kbd}`⌘` beim Klicken auf den Link).
pt_br: Por padrão, ImageJ.JS será aberto na mesma guia do navegador. Se você quiser que ele abra em uma nova guia, provavelmente há um truque fácil no seu navegador para fazer isso (em um computador, meu palpite é que ele pressionará {kbd} `Ctrl` ou {kbd}`⌘` ao clicar no link).

source: Which ImageJ do I choose?
de: Welches ImageJ wähle ich?
pt_br: Qual ImageJ eu escolho?

source: I would say: *all of them*. I always install both ImageJ and Fiji on any computer I will use regularly. ImageJ.JS doesn't require any installation: just a modern web browser.
de: Ich würde sagen: *alle*. Ich installiere ImageJ und Fiji immer auf jedem Computer, den ich regelmäßig verwende. ImageJ.JS erfordert keine Installation: lediglich einen modernen Webbrowser.
pt_br: Eu diria: *todos eles*. Eu sempre instalo o ImageJ e o Fiji em qualquer computador que usarei regularmente. ImageJ.JS não requer nenhuma instalação: apenas um navegador moderno.

source: Everything ImageJ can do can also be accomplished in Fiji (because Fiji contains the full ImageJ inside it), but the converse is not true (because Fiji contains many extra bits) Therefore Fiji is my first choice for more extensive analysis tasks. Its main disadvantage is that it's a lot bigger: taking longer to start up and run update checks, and containing a lot of commands that I don't always need.
de: Alles, was ImageJ kann, kann auch in Fidschi ausgeführt werden (da Fidschi das vollständige ImageJ enthält), aber das Gegenteil trifft nicht zu (weil Fidschi viele zusätzliche Bits enthält). Daher ist Fidschi meine erste Wahl für umfangreichere Analyseaufgaben. Der Hauptnachteil besteht darin, dass es viel größer ist: Das Starten und Ausführen von Update-Prüfungen dauert länger und es enthält viele Befehle, die ich nicht immer benötige.
pt_br: Tudo o que o ImageJ pode fazer também pode ser realizado em Fiji (porque Fiji contém o ImageJ completo), mas o inverso não é verdadeiro (porque Fiji contém muitos bits extras). Portanto, Fiji é minha primeira escolha para tarefas de análise mais extensas. Sua principal desvantagem é que ele é muito maior: demora mais para inicializar e executar verificações de atualização e contém muitos comandos que nem sempre preciso.

source: By contrast, the original ImageJ is very small and lightweight. On my computer, it starts almost instantly. It remains my first choice for quick, common tasks with images.
de: Im Gegensatz dazu ist das ursprüngliche ImageJ sehr klein und leicht. Auf meinem Computer startet es fast sofort. Es bleibt meine erste Wahl für schnelle, häufige Aufgaben mit Bildern.
pt_br: Por outro lado, o ImageJ original é muito pequeno e leve. No meu computador, ele inicia quase instantaneamente. Continua sendo minha primeira escolha para tarefas rápidas e comuns com imagens.

source: *Most* ImageJ-related practicals in this course only use core features, and so can be done using any of ImageJ, Fiji or ImageJ.JS. Sometimes in this book I will refer to explicitly to Fiji, indicating that the relevant command is *only* available in Fiji.
de: *Die meisten* ImageJ-bezogenen Praktika in diesem Kurs verwenden nur Kernfunktionen und können daher mit ImageJ, Fiji oder ImageJ.JS durchgeführt werden. Manchmal beziehe ich mich in diesem Buch explizit auf Fidschi und weise darauf hin, dass der entsprechende Befehl *nur* auf Fidschi verfügbar ist.
pt_br: *A maioria* das práticas relacionadas ao ImageJ neste curso usa apenas recursos básicos e, portanto, podem ser feitas usando qualquer ImageJ, Fiji ou ImageJ.JS. Às vezes, neste livro, me referirei explicitamente a Fiji, indicando que o comando relevante está *apenas* disponível em Fiji.

source: Remember to cite the software you use!
de: Denken Sie daran, die von Ihnen verwendete Software anzugeben!
pt_br: Lembre-se de citar o software que você usa!

source: A lot of open-source software is developed and supported by academics, who invest a huge amount of time into development and support. They need funding to continue that work[^fn_1], and paper citations to help get that funding.
de: Viele Open-Source-Software wird von Wissenschaftlern entwickelt und unterstützt, die viel Zeit in Entwicklung und Support investieren. Sie benötigen Finanzmittel, um diese Arbeit fortzusetzen[^fn_1], und Papierzitate, um diese Finanzierung zu erhalten.
pt_br: Muitos softwares de código aberto são desenvolvidos e apoiados por acadêmicos, que investem muito tempo em desenvolvimento e suporte. Eles precisam de financiamento para continuar esse trabalho[^fn_1] e de citações em artigos para ajudar a conseguir esse financiamento.

source: If you use software for research you plan to publish, please spend a few minutes searching for how the developers of the software want it to be cited.
de: Wenn Sie Software für Recherchen verwenden, die Sie veröffentlichen möchten, nehmen Sie sich bitte ein paar Minuten Zeit, um herauszufinden, wie die Entwickler der Software zitiert werden sollen.
pt_br: Se você usa software para pesquisas que planeja publicar, gaste alguns minutos procurando como os desenvolvedores do software desejam que ele seja citado.

source: For ImageJ & Fiji, see https://imagej.net/contribute/citing
de: Für ImageJ und Fidschi siehe https://imagej.net/contribute/citing
pt_br: Para ImageJ e Fiji, consulte https://imagej.net/contribute/citing

source: For other software, search for *citing [software name]*
de: Suchen Sie für andere Software nach *unter Angabe von [Softwarename]*
pt_br: Para outro software, pesquise *citando [nome do software]*

source: The ImageJ Interface
de: Die ImageJ-Schnittstelle
pt_br: A interface ImageJ

source: ImageJ's user interface is rather minimalistic. It's centered around a toolbar. Everything else (images, histograms, measurement tables, dialogs) appears within separate windows.
de: Die Benutzeroberfläche von ImageJ ist eher minimalistisch. Im Mittelpunkt steht eine Symbolleiste. Alles andere (Bilder, Histogramme, Messtabellen, Dialoge) erscheint in separaten Fenstern.
pt_br: A interface de usuário do ImageJ é bastante minimalista. Está centralizado em torno de uma barra de ferramentas. Todo o resto (imagens, histogramas, tabelas de medição, caixas de diálogo) aparece em janelas separadas.

source: The main ImageJ user interface.
de: Die Hauptbenutzeroberfläche von ImageJ.
pt_br: A interface de usuário principal do ImageJ.

source: But despite the simple appearance, ImageJ is powerful. The depth of the software is evident from its abundance of menus and submenus.
de: Aber trotz des einfachen Erscheinungsbilds ist ImageJ leistungsstark. Die Tiefe der Software zeigt sich in der Fülle an Menüs und Untermenüs.
pt_br: Mas apesar da aparência simples, o ImageJ é poderoso. A profundidade do software é evidente pela abundância de menus e submenus.

source: Which leads to the **most important tip for using ImageJ**:
de: Was zum **wichtigsten Tipp für die Verwendung von ImageJ** führt:
pt_br: O que leva à **dica mais importante para usar ImageJ**:

source: Don't memorize the menus -- search!
de: Merken Sie sich die Menüs nicht – suchen Sie!
pt_br: Não memorize os menus – pesquise!

source: ImageJ has a lot of options, buried in a lot of menus... and submenus... and sometimes sub-submenus.
de: ImageJ verfügt über viele Optionen, die in vielen Menüs … und Untermenüs … und manchmal auch Unteruntermenüs vergraben sind.
pt_br: ImageJ tem muitas opções, enterradas em vários menus... e submenus... e às vezes sub-submenus.

source: Fortunately, there's no reason to memorize where they all are to be found. Rather, just remember one shortcut key: {kbd}`L`
de: Glücklicherweise gibt es keinen Grund, sich zu merken, wo sie alle zu finden sind. Denken Sie lieber an eine Tastenkombination: {kbd}`L`
pt_br: Felizmente, não há razão para memorizar onde todos eles podem ser encontrados. Em vez disso, lembre-se apenas de uma tecla de atalho: {kbd}`L`

source: Pressing {kbd}`L` effectively brings up at **list** of all the commands from the menus, ready for each search.
de: Durch Drücken von {kbd}`L` wird effektiv eine **Liste** aller Befehle aus den Menüs angezeigt, die für jede Suche bereit sind.
pt_br: Pressionar {kbd}`L` efetivamente traz uma **lista** de todos os comandos dos menus, prontos para cada pesquisa.

source: For ImageJ, you see the *Command Finder* window where you can begin to type the name of the command you want. You can then run it either by double-clicking on the entry, or by using the up or down arrow keys followed by {kbd}`Enter`.
de: Für ImageJ sehen Sie das Fenster *Command Finder*, in dem Sie mit der Eingabe des Namens des gewünschten Befehls beginnen können. Sie können es dann ausführen, indem Sie entweder auf den Eintrag doppelklicken oder die Aufwärts- oder Abwärtspfeiltasten gefolgt von {kbd}`Enter` verwenden.
pt_br: Para ImageJ, você verá a janela *Command Finder* onde poderá começar a digitar o nome do comando desejado. Você pode então executá-lo clicando duas vezes na entrada ou usando as teclas de seta para cima ou para baixo seguidas de {kbd}`Enter`.

source: The *Command Finder* dialog
de: Das *Command Finder*-Dialogfeld
pt_br: A caixa de diálogo *Localizador de Comandos*

source: In Fiji, you might see the *Command Finder* or you can alternatively switch on a *search bar* by selecting it under {menuselection}`Edit --> Options --> Search Bar...`. The idea is the same. The search bar can also be activated using {kbd}`L` and used to find and run commands.
de: In Fidschi sehen Sie möglicherweise den *Command Finder* oder Sie können alternativ eine *Suchleiste* einschalten, indem Sie sie unter {menuselection}`Bearbeiten --> Optionen --> Suchleiste auswählen ...`. Die Idee ist dieselbe. Die Suchleiste kann auch mit {kbd}`L` aktiviert und zum Suchen und Ausführen von Befehlen verwendet werden.
pt_br: Em Fiji, você pode ver o *Command Finder* ou, como alternativa, ativar uma *barra de pesquisa* selecionando-a em {menuselection}`Editar --> Opções --> Barra de pesquisa ...`. A ideia é a mesma. A barra de pesquisa também pode ser ativada usando {kbd}`L` e usada para localizar e executar comandos.

source: {menuselection}`Edit --> Options --> Misc...` dialog
de: {menuselection}Dialogfeld „Bearbeiten --> Optionen --> Sonstiges...“.
pt_br: {menuselection}`Editar --> Opções --> Diversos...`

source: Losing control
de: Die Kontrolle verlieren
pt_br: Perdendo controle

source: In most software, shortcut keys often require pressing {kbd}`Ctrl` (on Windows, Linux) or {kbd}`⌘` (Mac). Therefore the shortcut to search for a command would be {kbd}`Ctrl+L` or {kbd}`⌘ + L`.
de: In den meisten Programmen erfordern Tastenkombinationen oft das Drücken von {kbd}`Strg` (unter Windows, Linux) oder {kbd}`⌘` (Mac). ). Daher wäre die Tastenkombination zum Suchen nach einem Befehl {kbd}`Strg+L` oder {kbd}`⌘ + L`.
pt_br: Na maioria dos softwares, as teclas de atalho geralmente exigem o pressionamento de {kbd}`Ctrl` (no Windows, Linux) ou {kbd}`⌘` (Mac ). Portanto, o atalho para procurar um comando seria {kbd}`Ctrl+L` ou {kbd}`⌘ + L`.

source: This works in ImageJ, but isn't necessary. Under {menuselection}`Edit --> Options --> Misc...`, you can specify whether the {kbd}`Ctrl` or {kbd}`⌘` key is needed along with the letter for the shortcut.
de: Dies funktioniert in ImageJ, ist aber nicht notwendig. Unter {menuselection}`Edit --> Options --> Misc...` können Sie angeben, ob die {kbd}`Strg` oder {kbd}Die Taste „⌘“ wird zusammen mit dem Buchstaben für die Verknüpfung benötigt.
pt_br: Isso funciona no ImageJ, mas não é necessário. Em {menuselection}`Editar --> Opções --> Diversos...`, você pode especificar se {kbd}`Ctrl` ou a tecla {kbd}`⌘` é necessária junto com a letra do atalho.
