Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/images_and_pixels.po
Languages: de

source: Default Caption
de: Standard-Beschriftung

source: Images & pixels
de: Bilder und Pixel

source: Chapter outline
de: Gliederung des Kapitels

source: Digital images are composed of **pixels**
de: Digitale Bilder sind aus **Pixeln** zusammengesetzt.

source: Each pixel has a **numeric value** (often related to detected light)
de: Jedes Pixel hat einen **numerischen Wert** (oft in Verbindung mit dem erkannten Licht)

source: The same pixel values can be displayed differently using **lookup tables (LUTs)**
de: Dieselben Pixelwerte können mithilfe von **Lookup-Tables (LUTs)** unterschiedlich dargestellt werden.

source: We can modify image appearance in two main ways:
de: Wir können das Erscheinungsbild von Bildern auf zwei Arten verändern:

source: **Change the pixel values**
de: **Ändern Sie die Pixelwerte**

source: **Change the LUT**
de: **Die LUT ändern**

source: **Preserving pixel values is crucial** for most analysis -- so it's essential to know what your software is doing
de: **Die Beibehaltung der Pixelwerte ist für die meisten Analysen von entscheidender Bedeutung** - daher ist es wichtig, dass Sie wissen, was Ihre Software tut.

source: Introduction
de: Einführung

source: Image are composed of **pixels**.
de: Bilder sind aus **Pixeln** zusammengesetzt.

source: The word 'pixel' is derived from **pic**ture **el**ement and, as far as the computer is concerned, each pixel is just a number.
de: Das Wort "Pixel" leitet sich von **pic**ture **el**ement ab, und für den Computer ist jedes Pixel nur eine Zahl.

source: When the image data is displayed, the values of pixels are usually converted into squares of particular colors – but *this is only for our benefit*. The colored squares are nothing more than a helpful visualization that enable us to gain a fast impression of the image contents, i.e. the approximate values of pixels and where they are in relation to one another.
de: Bei der Darstellung der Bilddaten werden die Werte der Pixel in der Regel in Quadrate bestimmter Farben umgewandelt - aber *das ist nur zu unserem Vorteil*. Die farbigen Quadrate sind nichts weiter als eine hilfreiche Visualisierung, die es uns ermöglicht, einen schnellen Eindruck vom Bildinhalt zu bekommen, d.h. von den ungefähren Werten der Pixel und wo sie zueinander stehen.

source: When it comes to processing and analysis, we need to get past the display and delve into the real data: the numbers ({numref}`fig-image_array`).
de: Wenn es um die Verarbeitung und Analyse geht, müssen wir über die Anzeige hinausgehen und uns mit den echten Daten befassen: den Zahlen ({numref}`fig-image_array`).

source: An image depicting an interestingly-matched couple I saw when walking home from work. (A) & (B) The image is shown using small squares of different shades of gray, where each square corresponds to a single pixel. This is only a convention used for display; the pixels themselves are stored as arrays of numbers \(C) -- but looking at the numbers directly it's pretty hard for us to visualize what the image contains.
de: Ein Bild, das ein interessantes Paar zeigt, das ich auf dem Heimweg von der Arbeit gesehen habe. (A) &amp; (B) Das Bild wird mit kleinen Quadraten in verschiedenen Grautönen dargestellt, wobei jedes Quadrat einem einzelnen Pixel entspricht. Dies ist nur eine Konvention, die für die Darstellung verwendet wird; die Pixel selbst sind als Zahlenfelder gespeichert \(C) -- aber wenn man sich die Zahlen direkt ansieht, ist es ziemlich schwierig für uns, zu erkennen, was das Bild enthält.

source: Image data & its display
de: Bilddaten und ihre Anzeige

source: The distinction between a pixel's numeric value and the color used to display it might seem like a minor detail, but it definitely isn't: failing to recognise this difference underlies a *lot* of errors.
de: Die Unterscheidung zwischen dem numerischen Wert eines Pixels und der Farbe, mit der es dargestellt wird, mag wie ein unbedeutendes Detail erscheinen, ist es aber definitiv nicht: Das Nicht-Erkennen dieses Unterschieds liegt einer *großen* Zahl von Fehlern zugrunde.

source: If we aren't careful, two related facts can cause us an enormous amount of trouble:
de: Wenn wir nicht aufpassen, können uns zwei zusammenhängende Tatsachen enorme Schwierigkeiten bereiten:

source: Images that **look the same** can contain **different** pixel values
de: Bilder, die **gleich aussehen**, können **unterschiedliche** Pixelwerte enthalten

source: Images that **look different** can still contain **the same** pixel values
de: Bilder, die **unterschiedlich** aussehen, können trotzdem **die gleichen** Pixelwerte enthalten

source: Images that *look* the same, but contain *different* pixel values.\ Measuring each of these images would give different results, for reasons we shall see in later chapters.
de: Bilder, die *gleich aussehen*, aber *unterschiedliche* Pixelwerte enthalten.\ Die Messung jedes dieser Bilder würde aus Gründen, die wir in späteren Kapiteln sehen werden, unterschiedliche Ergebnisse liefern.

source: Images that *look* different, but contain *the same* pixel values.\ Measuring each of these images would give the same results.
de: Bilder, die *unterschiedlich* aussehen, aber *gleiche* Pixelwerte enthalten. Die Messung jedes dieser Bilder würde die gleichen Ergebnisse liefern.

source: This is crucial because it's entirely possible to analyze two different images that *appear* identical, but to get very different (and very wrong) results.
de: Dies ist von entscheidender Bedeutung, da es durchaus möglich ist, zwei verschiedene Bilder zu analysieren, die *anscheinend* identisch sind, aber sehr unterschiedliche (und sehr falsche) Ergebnisse liefern.

source: This is far from a theoretical problem. It happens a lot in practice whenever someone innocently makes an adjustment to an image (e.g. to make it look brighter, or change the colors for display) without realising that the adjustment has actually changed the pixel values -- and thereby compromised the underlying data. This can fatally undermine the integrity of any later analysis.
de: Dies ist bei weitem kein theoretisches Problem. Es tritt in der Praxis häufig auf, wenn jemand unschuldig eine Anpassung an einem Bild vornimmt (z. B. um es heller aussehen zu lassen oder die Farben für die Anzeige zu ändern), ohne zu bemerken, dass die Anpassung tatsächlich die Pixelwerte verändert hat - und damit die zugrunde liegenden Daten gefährdet. Dies kann die Integrität einer späteren Analyse auf fatale Weise untergraben.

source: What's worse, these errors can go completely unnoticed, surreptitiously compounding the problem of replicability in science.
de: Noch schlimmer ist, dass diese Fehler völlig unbemerkt bleiben können, was das Problem der Reproduzierbarkeit in der Wissenschaft heimlich verschärft.

source: Which brings us to the key message of this chapter:
de: Das bringt uns zur Schlüsselbotschaft dieses Kapitels:

source: Don't (just) trust your eyes!
de: Trauen Sie nicht (nur) Ihren Augen!

source: In science, we need to know what is happening whenever we open, adjust and save our images. If we don't, we risk misinterpreting our data.
de: In der Wissenschaft müssen wir wissen, was passiert, wenn wir unsere Bilder öffnen, anpassen und speichern. Wenn wir das nicht tun, laufen wir Gefahr, unsere Daten falsch zu interpretieren.

source: Fortunately, knowing just a little bit about imaging and image analysis is enough to avoid making these mistakes. Knowing more than a little bit can open up new worlds of possibility to extract useful information from scientific images.
de: Glücklicherweise genügt es, nur ein wenig über Bildgebung und Bildanalyse zu wissen, um diese Fehler zu vermeiden. Mehr als nur ein bisschen Wissen kann neue Möglichkeiten eröffnen, um nützliche Informationen aus wissenschaftlichen Bildern zu gewinnen.

source: The goal of this handbook is to explain these ideas. We'll start by considering two questions:
de: Ziel dieses Handbuchs ist es, diese Ideen zu erläutern. Wir beginnen mit der Betrachtung zweier Fragen:

source: **Where do the pixel values come from?**
de: **Woher kommen die Pixelwerte?**

source: **How are pixel values converted into colors for display?**
de: **Wie werden Pixelwerte in Farben für die Anzeige umgewandelt?**

source: It's hard to give a detailed-but-general answer to the first question, because the origin and interpretation of the pixel values depends upon how the image was created, and there are many different ways to generate an image.
de: Es ist schwierig, eine detaillierte, aber allgemeine Antwort auf die erste Frage zu geben, da der Ursprung und die Interpretation der Pixelwerte davon abhängen, wie das Bild erstellt wurde, und es gibt viele verschiedene Möglichkeiten, ein Bild zu erzeugen.

source: Nevertheless, the key ideas are similar everywhere. By way of illustration, we'll consider a very common case in bioimaging where the pixel values relate to detected light -- specifically, using the example of a fluorescence microscope -- before moving how to see how these values are displayed.
de: Dennoch sind die Grundgedanken überall ähnlich. Zur Veranschaulichung betrachten wir einen sehr häufigen Fall in der Biobildgebung, bei dem sich die Pixelwerte auf erkanntes Licht beziehen - konkret am Beispiel eines Fluoreszenzmikroskops -, bevor wir uns ansehen, wie diese Werte angezeigt werden.

source: A simple microscope
de: Ein einfaches Mikroskop

source: When I work with fluorescence images, I have a very simple picture in my head of how the image is formed. It may not be very exact, but I find it extremely useful as a basis to which we can add detail whenever we need it. We will revisit this picture later in the book to help organize the interrelating imaging considerations relevant to analysis.
de: Wenn ich mit Fluoreszenzbildern arbeite, habe ich ein sehr einfaches Bild im Kopf, wie das Bild zustande kommt. Es mag nicht sehr genau sein, aber ich finde es als Grundlage, der wir bei Bedarf Details hinzufügen können, äußerst nützlich. Wir werden dieses Bild im weiteren Verlauf des Buches wieder aufgreifen, um die zusammenhängenden Überlegungen zur Bildgebung, die für die Analyse relevant sind, zu organisieren.

source: In my simplified model, there are only three components that we need to worry about:
de: In meinem vereinfachten Modell gibt es nur drei Komponenten, um die wir uns kümmern müssen:

source: **Sample** -- the thing we want to look at
de: **Beispiel** -- die Sache, die wir uns ansehen wollen

source: **Objective lens** -- the thing that gathers the light and focusses it for detection
de: **Objektivlinse** - das Ding, das das Licht sammelt und für die Erkennung fokussiert

source: **Detector** -- the thing that detects the light to form the digital image (here, a CCD camera)
de: **Detektor** - das Gerät, das das Licht erkennt, um das digitale Bild zu erstellen (hier eine CCD-Kamera)

source: The process is illustrated below:
de: Das Verfahren ist im Folgenden dargestellt:

source: There are a couple of things to note at this point:
de: An dieser Stelle gibt es einige Dinge zu beachten:

source: Not *all* the light emitted from the sample is detected. A lot of it never enters the objective lens.
de: Nicht *alles* von der Probe emittierte Licht wird erfasst. Ein großer Teil davon gelangt nie in die Objektivlinse.

source: Our images aren't perfect. We will explore problems of blur, noise and pixel size later.
de: Unsere Bilder sind nicht perfekt. Wir werden uns später mit Problemen wie Unschärfe, Rauschen und Pixelgröße befassen.

source: For now, we are mostly interested in the detection step and how it generates a digital image. Zooming in to look at this in more detail, we can imagine what happens as light hits the camera. The sensor of the camera itself is divided into **physical pixels**, which will correspond to the pixels in the final image. When a photon strikes the detector, an electron may be released at one of the physical pixels. During the acquisition of an image, many photons strike the detector, which can cause many electrons to be released at different physical pixels. These electrons contribute to the value of a pixel in the final image: more electrons &rarr; higher pixel values.
de: Im Moment interessieren wir uns vor allem für den Erkennungsschritt und wie er ein digitales Bild erzeugt. Wenn wir uns das genauer ansehen, können wir uns vorstellen, was passiert, wenn Licht auf die Kamera trifft. Der Sensor der Kamera selbst ist in **physikalische Pixel** unterteilt, die den Pixeln im endgültigen Bild entsprechen werden. Wenn ein Photon auf den Detektor trifft, kann ein Elektron in einem der physikalischen Pixel freigesetzt werden. Während der Aufnahme eines Bildes treffen viele Photonen auf den Detektor, was dazu führen kann, dass viele Elektronen an verschiedenen physikalischen Pixeln freigesetzt werden. Diese Elektronen tragen zum Wert eines Pixels im endgültigen Bild bei: mehr Elektronen &rarr; höhere Pixelwerte.

source: The important point is that **pixel values are only *indirectly* related to whatever it is in our sample that we want to measure**.
de: Der wichtige Punkt ist, dass **Pixelwerte nur *indirekt* mit dem zusammenhängen, was wir in unserer Probe messen wollen**.

source: In this example, they have been derived by quantifying the charge of electron clouds gathered at each physical pixel. This should be proportional to the amount of detected light that originated from a particular volume of the sample. This, in turn, depends upon what is actually present in the sample -- but there are *a lot* of things that can influence the final values in connection with acquisition parameters, conversion factors, and physics. These are not usually related directly to the thing you might want to quantify.
de: In diesem Beispiel wurden sie abgeleitet, indem die Ladung der Elektronenwolken, die sich an jedem physikalischen Pixel angesammelt haben, quantifiziert wurde. Diese sollte proportional zu der Menge des erfassten Lichts sein, das aus einem bestimmten Volumen der Probe stammt. Dies wiederum hängt davon ab, was tatsächlich in der Probe vorhanden ist - aber es gibt *viele* Dinge, die die endgültigen Werte im Zusammenhang mit Erfassungsparametern, Umrechnungsfaktoren und der Physik beeinflussen können. Diese Faktoren stehen in der Regel nicht in direktem Zusammenhang mit der Sache, die Sie quantifizieren möchten.

source: Some of the factors influencing pixel values
de: Einige der Faktoren, die die Pixelwerte beeinflussen

source: **Amount of time spent detecting photons**
de: **Die Zeit, die für die Erkennung von Photonen aufgewendet wird**

source: *More time → More photons → More electrons → Higher pixel values*
de: *Mehr Zeit → Mehr Photonen → Mehr Elektronen → Höhere Pixelwerte*

source: **Numerical aperture of the objective lens**
de: **Numerische Apertur des Objektivs**

source: This relates to the **angle** of light accepted by the objective
de: Dies bezieht sich auf den **Winkel** des Lichts, das vom Objektiv aufgenommen wird

source: *Higher NA → Larger angle → More photons → More electrons → Higher pixel values*
de: *Höhere NA → Größerer Winkel → Mehr Photonen → Mehr Elektronen → Höhere Pixelwerte*

source: **Sensitivity of the detector (Quantum Efficiency)**
de: **Empfindlichkeit des Detektors (Quantenwirkungsgrad)**

source: Not all photons necessarily produce an electron; I think of this as the photon hitting the detector, but not hard enough to dislodge an electron. A detector with low sensitivity is likely to 'miss' more photons, so that they never contribute to the pixel value.
de: Nicht alle Photonen erzeugen notwendigerweise ein Elektron; ich stelle mir das so vor, dass das Photon zwar auf den Detektor trifft, aber nicht hart genug, um ein Elektron herauszulösen. Ein Detektor mit geringer Empfindlichkeit wird wahrscheinlich mehr Photonen "verpassen", so dass sie nie zum Pixelwert beitragen.

source: *Higher sensitivity → More electrons → Higher pixel values*
de: *Höhere Empfindlichkeit → Mehr Elektronen → Höhere Pixelwerte*

source: Ultimately, this leads to the warning:
de: Letztlich führt dies zu der Warnung:

source: Don't over-interpret pixel values!
de: Überinterpretieren Sie die Pixelwerte nicht!

source: Individual pixel values are rarely very meaningful in isolation: we're usually interested in *relative* differences between groups of pixels.
de: Einzelne Pixelwerte sind für sich genommen selten sehr aussagekräftig: Wir sind in der Regel an *relativen* Unterschieden zwischen Gruppen von Pixeln interessiert.

source: As we shall see, this means that we often need to average values and normalize to something whenever we want to make measurements in an image. We can't usually untangle the influences well enough to infer anything with confidence from a single pixel value.
de: Wie wir noch sehen werden, bedeutet dies, dass wir oft Durchschnittswerte bilden und auf etwas normalisieren müssen, wenn wir Messungen in einem Bild vornehmen wollen. Normalerweise können wir die Einflüsse nicht gut genug entwirren, um von einem einzelnen Pixelwert mit Sicherheit auf etwas schließen zu können.

source: But the limitations in what pixel values can tell us don't diminish their importance: on the contrary, pixel values remain our raw data and it's essential that we preserve them as faithfully as possible. That's a lot harder than you might expect. It requires knowing when and how pixel values might become changed whenever we are working with our images. This is so crucial that it will be the focus throughout the entire first part of this book.
de: Die begrenzten Möglichkeiten, die uns Pixelwerte bieten, schmälern jedoch nicht ihre Bedeutung: Im Gegenteil, Pixelwerte bleiben unsere Rohdaten, und es ist wichtig, dass wir sie so originalgetreu wie möglich erhalten. Das ist viel schwieriger, als Sie vielleicht erwarten. Dazu muss man wissen, wann und wie sich die Pixelwerte bei der Arbeit mit unseren Bildern verändern können. Dies ist so wichtig, dass es im gesamten ersten Teil dieses Buches im Mittelpunkt steht.

source: Lookup tables
de: Nachschlagetabellen

source: LUTs vs. Colormaps
de: LUTs vs. Farbkarten

source: **Lookup tables** are sometimes referred to as **colormaps**.
de: **Lookup-Tabellen** werden manchmal auch als **Farbkarten** bezeichnet.

source: For our purposes, the terms are interchangeable -- you may see either depending upon which software you are using.
de: Für unsere Zwecke sind die Begriffe austauschbar - je nachdem, welche Software Sie verwenden, können Sie beide Begriffe sehen.

source: So images are really comprised of a lot of numbers -- the pixel values -- even though we normally visualize them as shapes and colors.
de: Bilder bestehen also in Wirklichkeit aus vielen Zahlen - den Pixelwerten -, auch wenn wir sie normalerweise als Formen und Farben visualisieren.

source: It's time then to consider our second question: **How are pixel values converted for display?**
de: Es ist also an der Zeit, sich mit der zweiten Frage zu befassen: **Wie werden Pixelwerte für die Anzeige umgewandelt?**

source: The basic idea is simple: the software displaying the image uses a **lookup table (LUT)** that maps each pixel value to a color. When it comes to showing the image, each pixel is replaced by a little dot or square on screen that has the corresponding color.
de: Die Grundidee ist einfach: Die Software, die das Bild anzeigt, verwendet eine **Lookup Table (LUT)**, die jeden Pixelwert einer Farbe zuordnet. Wenn das Bild angezeigt wird, wird jedes Pixel durch einen kleinen Punkt oder ein Quadrat auf dem Bildschirm ersetzt, das die entsprechende Farbe hat.

source: LUTs therefore provide a way to **change the appearance of an image without changing its pixel values**.
de: LUTs bieten daher eine Möglichkeit, **das Erscheinungsbild eines Bildes zu verändern, ohne seine Pixelwerte zu verändern**.

source: This is extremely useful in practice. Since images in biology often have rather low pixel values (formed from a small amount of detected light), we very often want to change their brightness for display.
de: Dies ist in der Praxis äußerst nützlich. Da Bilder in der Biologie oft recht niedrige Pixelwerte haben (die aus einer geringen Menge an erkanntem Licht gebildet werden), wollen wir sehr oft ihre Helligkeit für die Anzeige ändern.

source: One way we *could* make an image brighter is to change the pixel values themselves -- multiply them by 2, for example. That would indeed usually make the image look brighter, but we risk making a terrible mess of our data if we permit ourselves to make such changes. As described above, we really don't want to modify our raw data unnecessarily.
de: Eine Möglichkeit, ein Bild heller zu machen, besteht darin, die Pixelwerte selbst zu ändern, z. B. sie mit 2 zu multiplizieren. Das würde das Bild in der Regel tatsächlich heller erscheinen lassen, aber wir riskieren ein schreckliches Durcheinander in unseren Daten, wenn wir uns erlauben, solche Änderungen vorzunehmen. Wie oben beschrieben, wollen wir unsere Rohdaten wirklich nicht unnötig verändern.

source: A **much** better way to change the brightness of an image is to change the LUT only.
de: Eine **viel** bessere Möglichkeit, die Helligkeit eines Bildes zu ändern, ist, nur die LUT zu ändern.

source: The danger is that **not all software cares so much about preserving pixel values**. Someone wanting to enhance their holiday photos isn't likely to care about retaining the original pixel values for quantification later; rather, they just want the images to look as nice as possible.
de: Die Gefahr besteht darin, dass **nicht jede Software so viel Wert auf die Erhaltung der Pixelwerte legt**. Jemand, der seine Urlaubsfotos verbessern möchte, ist wahrscheinlich nicht daran interessiert, die ursprünglichen Pixelwerte für eine spätere Quantifizierung beizubehalten; er möchte einfach nur, dass die Bilder so schön wie möglich aussehen.

source: For this reason, a lot of software designed for working with images really *will* rescale the pixel values when you do something as simple as adjusting the brightness. And so it is entirely possible to open an image, adjust the display slightly to see things more clearly, and in doing so irreparably damage the image -- losing the raw data required for later analysis.
de: Aus diesem Grund skalieren viele Programme, die für die Arbeit mit Bildern entwickelt wurden, die Pixelwerte um, wenn Sie etwas so Einfaches wie die Helligkeit einstellen. Es ist also durchaus möglich, ein Bild zu öffnen, die Anzeige geringfügig anzupassen, um die Dinge klarer zu sehen, und dabei das Bild irreparabel zu beschädigen - und damit die für die spätere Analyse erforderlichen Rohdaten zu verlieren.

source: This is why you should **use scientific software for scientific image analysis** -- and not just any general imaging editing software you might find.
de: Aus diesem Grund sollten Sie **wissenschaftliche Software für die wissenschaftliche Bildanalyse** verwenden und nicht irgendeine allgemeine Bildbearbeitungssoftware, die Sie finden.

source: But even when using scientific software, it's often possible to change pixel values whenever you'd really rather only be changing lookup tables. The next chapter will show how to check when this is happening.
de: Aber auch bei der Verwendung wissenschaftlicher Software ist es oft möglich, Pixelwerte zu ändern, wenn man eigentlich nur Lookup-Tabellen ändern möchte. Im nächsten Kapitel erfahren Sie, wie Sie überprüfen können, wann dies der Fall ist.
