Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/imagej.po
Languages: de, pt_br

source: By default, this option is turned off -- so pressing {kbd}`L` alone is enough. You may find this might make it too easy to accidentally run commands, in which case you should select the option to turn it on.
de: Standardmäßig ist diese Option deaktiviert – es reicht also aus, nur {kbd}„L“ zu drücken. Sie werden möglicherweise feststellen, dass dies die versehentliche Ausführung von Befehlen zu einfach macht. In diesem Fall sollten Sie die Option zum Aktivieren auswählen.
pt_br: Por padrão, esta opção está desativada - então pressionar {kbd}`L` por si só é suficiente. Você pode descobrir que isso pode tornar muito fácil a execução acidental de comandos; nesse caso, você deve selecionar a opção para ativá-lo.

source: Opening images & viewing pixels
de: Bilder öffnen und Pixel anzeigen
pt_br: Abrindo imagens e visualizando pixels

source: I am always taken aback when I see someone open an image in ImageJ through the menus, by choosing {menuselection}`File --> Open...`.
de: Ich bin immer verblüfft, wenn ich sehe, wie jemand ein Bild in ImageJ über die Menüs öffnet, indem er {menuselection}`Datei -> Öffnen...` wählt.
pt_br: Sempre fico surpreso quando vejo alguém abrir uma imagem no ImageJ através dos menus, escolhendo {menuselection}`Arquivo --> Abrir...`.

source: Although this can work, it's unnecessarily slow and awkward. The more elegant way to open an image is to simply drag the image file onto ImageJ's toolbar.
de: Das kann zwar funktionieren, ist aber unnötig langsam und umständlich. Die elegantere Möglichkeit, ein Bild zu öffnen, besteht darin, die Bilddatei einfach auf die Symbolleiste von ImageJ zu ziehen.
pt_br: Embora isso possa funcionar, é desnecessariamente lento e estranho. A maneira mais elegante de abrir uma imagem é simplesmente arrastar o arquivo de imagem para a barra de ferramentas do ImageJ.

source: As the cursor is then moved over the image, the value for the pixel under the cursor is displayed in ImageJ's status bar. Images can be navigated as follows:
de: Wenn der Cursor dann über das Bild bewegt wird, wird der Wert für das Pixel unter dem Cursor in der Statusleiste von ImageJ angezeigt. Bilder können wie folgt navigiert werden:
pt_br: À medida que o cursor é movido sobre a imagem, o valor do pixel sob o cursor é exibido na barra de status do ImageJ. As imagens podem ser navegadas da seguinte forma:

source: **Zoom in**
de: **Hineinzoomen**
pt_br: **Mais Zoom**

source: Select the <img src="../../../images/imagej/icons/zoom.png" /> tool, then **left-click** on the image, or
de: Wählen Sie das Tool <img src="../../../images/imagej/icons/zoom.png" /> aus und **klicken Sie dann** auf das Bild, oder
pt_br: Selecione a ferramenta <img src="../../../images/imagej/icons/zoom.png" /> e **clique com o botão esquerdo** na imagem ou

source: Press the {kbd}`+` key
de: Drücken Sie die Taste „+“.
pt_br: Pressione a tecla {kbd}`+`

source: **Zoom out**
de: **Rauszoomen**
pt_br: **Reduzir o zoom**

source: Select the <img src="../../../images/imagej/icons/zoom.png" /> tool, then **right-click** on the image, or
de: Wählen Sie das Tool <img src="../../../images/imagej/icons/zoom.png" /> aus und **klicken Sie dann** auf das Bild, oder
pt_br: Selecione a ferramenta <img src="../../../images/imagej/icons/zoom.png" /> e **clique com o botão direito** na imagem ou

source: Press the {kbd}`-` key
de: Drücken Sie die Taste {kbd}`-`
pt_br: Pressione a tecla {kbd}`-`

source: **Pan**
de: **Pfanne**
pt_br: **Frigideira**

source: Select the <img src="../../../images/imagej/icons/hand.png" /> tool, then click and drag on the image, or
de: Wählen Sie das Tool <img src="../../../images/imagej/icons/hand.png" /> aus, klicken Sie dann auf das Bild und ziehen Sie es, oder
pt_br: Selecione a ferramenta <img src="../../../images/imagej/icons/hand.png" /> e clique e arraste na imagem ou

source: Press the {kbd}`spacebar`, then click and drag on the image
de: Drücken Sie die Leertaste, klicken Sie dann auf das Bild und ziehen Sie es
pt_br: Pressione a {kbd}`barra de espaço` e clique e arraste na imagem

source: When the image is larger than the visible region, a small (purple) overview appears in the top left to indicate which part can currently be seen.
de: Wenn das Bild größer als der sichtbare Bereich ist, erscheint oben links eine kleine (lila) Übersicht, die anzeigt, welcher Teil gerade sichtbar ist.
pt_br: Quando a imagem é maior que a região visível, uma pequena visão geral (roxa) aparece no canto superior esquerdo para indicar qual parte pode ser vista no momento.

source: Practical
de: Praktisch
pt_br: Prático

source: The status bar also shows the x and y coordinates for the pixel under the cursor. However, to interpret these you need to know the *origin*, i.e. the location of the pixel at x=0, y=0.
de: Die Statusleiste zeigt auch die X- und Y-Koordinaten für das Pixel unter dem Cursor an. Um diese zu interpretieren, müssen Sie jedoch den *Ursprung* kennen, d. h. die Position des Pixels bei x=0, y=0.
pt_br: A barra de status também mostra as coordenadas xey do pixel sob o cursor. No entanto, para interpretá-los você precisa saber a *origem*, ou seja, a localização do pixel em x=0, y=0.

source: Where is the origin of the image in ImageJ?
de: Wo ist der Ursprung des Bildes in ImageJ?
pt_br: Onde está a origem da imagem no ImageJ?

source: Top left corner
de: Obere linke Ecke
pt_br: Canto superior esquerdo

source: Top right corner
de: Obere rechte Ecke
pt_br: Canto superior direito

source: Bottom left corner
de: Untere linke Ecke
pt_br: Canto inferior esquerdo

source: Bottom right corner
de: Rechte untere Ecke
pt_br: Canto inferior direito

source: Image center
de: Bildmitte
pt_br: Centro de imagem

source: **Tip:** You should be able to answer this question by opening an image in ImageJ, and observing the coordinates in the toolbar as you move the cursor over the image.
de: **Tipp:** Sie sollten diese Frage beantworten können, indem Sie ein Bild in ImageJ öffnen und die Koordinaten in der Symbolleiste beobachten, während Sie den Cursor über das Bild bewegen.
pt_br: **Dica:** Você poderá responder a essa pergunta abrindo uma imagem no ImageJ e observando as coordenadas na barra de ferramentas enquanto move o cursor sobre a imagem.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)

source: Solution
de: Lösung
pt_br: Solução

source: The origin of the image is at the top left, i.e. the top left pixel is identified with the coordinate x=0, y=0.
de: Der Ursprung des Bildes liegt oben links, d. h. der Pixel oben links wird mit der Koordinate x=0, y=0 identifiziert.
pt_br: A origem da imagem está no canto superior esquerdo, ou seja, o pixel superior esquerdo é identificado com a coordenada x=0, y=0.

source: Changing appearance
de: Aussehen verändern
pt_br: Mudando a aparência

source: Adjusting Brightness & Contrast
de: Helligkeit und Kontrast anpassen
pt_br: Ajustando brilho e contraste

source: *Brightness/Contrast* dialog
de: Dialog *Helligkeit/Kontrast*
pt_br: Caixa de diálogo *Brilho/Contraste*

source: The main command to change the brightness of an image is {menuselection}`Image --> Adjust --> Brightness/Contrast...`. Since you're likely to use it a lot, it is worth learning the shortcut: {kbd}`Shift+C`.
de: Der Hauptbefehl zum Ändern der Helligkeit eines Bildes ist {menuselection}`Image --> Adjust --> Brightness/Contrast...`. Da Sie es wahrscheinlich häufig verwenden werden, lohnt es sich, die Tastenkombination {kbd}`Umschalt+C` zu lernen.
pt_br: O comando principal para alterar o brilho de uma imagem é {menuselection}`Imagem --> Ajustar --> Brilho/Contraste...`. Como você provavelmente o usará muito, vale a pena aprender o atalho: {kbd}`Shift+C`.

source: The Brightness/Contrast dialog has four sliders: {guilabel}`Minimum`, {guilabel}`Maximum`, {guilabel}`Brightness` & {guilabel}`Contrast`. They are linked together: changing either of the first two also results in a change to the last two, and vice versa.
de: Das Dialogfeld „Helligkeit/Kontrast“ verfügt über vier Schieberegler: {guilabel}`Minimum`, {guilabel}`Maximum`, {guilabel}„Helligkeit“ und {guilabel}„Kontrast“. Sie sind miteinander verknüpft: Eine Änderung einer der ersten beiden führt auch zu einer Änderung der letzten beiden und umgekehrt.
pt_br: A caixa de diálogo Brilho/Contraste possui quatro controles deslizantes: {guilabel}`Mínimo`, {guilabel}`Máximo`, {guilabel}`Brilho` & {guilabel}`Contraste`. Eles estão interligados: a alteração de qualquer um dos dois primeiros também resulta na alteração dos dois últimos e vice-versa.

source: Supposing you have a grayscale LUT, with colors ranging from black to white, you should see that
de: Angenommen, Sie haben eine Graustufen-LUT mit Farben von Schwarz bis Weiß, dann sollten Sie das sehen
pt_br: Supondo que você tenha uma LUT em tons de cinza, com cores que variam do preto ao branco, você verá que

source: All pixels with a value less than or equal to the {guilabel}`Minimum` will be shown as black
de: Alle Pixel mit einem Wert kleiner oder gleich dem {guilabel}`Minimum` werden schwarz angezeigt
pt_br: Todos os pixels com valor menor ou igual ao {guilabel}`Minimum` serão mostrados em preto

source: All pixels with a value greater than or equal to the {guilabel}`Maximum` will be shown as white
de: Alle Pixel mit einem Wert größer oder gleich dem {guilabel}`Maximum` werden weiß angezeigt
pt_br: Todos os pixels com valor maior ou igual a {guilabel}`Maximum` serão mostrados em branco

source: All other pixels with a value in between will be shown using a shade of gray
de: Alle anderen Pixel mit einem Wert dazwischen werden in einem Grauton dargestellt
pt_br: Todos os outros pixels com um valor intermediário serão mostrados em um tom de cinza

source: Use the minimum & maximum sliders
de: Verwenden Sie die Schieberegler für Minimum und Maximum
pt_br: Use os controles deslizantes mínimo e máximo

source: Despite the name of the command implying {guilabel}`Brightness` and {guilabel}`Contrast` are the star perfomers, I would argue that the {guilabel}`Minimum` and {guilabel}`Maximum` sliders are far more intuitive.
de: Obwohl der Name des Befehls impliziert, dass {guilabel}`Helligkeit` und {guilabel}"Kontrast" die Star-Performer sind, würde ich behaupten, dass die Die Schieberegler „Minimum“ und „Maximum“ sind weitaus intuitiver.
pt_br: Apesar do nome do comando implicar {guilabel}`Brightness` e {guilabel}`Contrast` são os artistas principais, eu diria que o {guilabel}Os controles deslizantes `Mínimo` e {guilabel}`Máximo` são muito mais intuitivos.

source: I use {guilabel}`Minimum` and {guilabel}`Maximum` almost exclusively.
de: Ich verwende fast ausschließlich {guilabel}„Minimum“ und {guilabel}„Maximum“.
pt_br: Eu uso {guilabel}`Minimum` e {guilabel}`Maximum` quase exclusivamente.

source: Does adjusting any of the sliders in the brightness & contrast dialog change the pixel values or only the LUT?
de: Ändert das Anpassen eines der Schieberegler im Dialogfeld „Helligkeit und Kontrast“ die Pixelwerte oder nur die LUT?
pt_br: Ajustar algum dos controles deslizantes na caixa de diálogo de brilho e contraste altera os valores dos pixels ou apenas o LUT?

source: What happens if you press {guilabel}`Apply`?
de: Was passiert, wenn Sie auf {guilabel}„Übernehmen“ klicken?
pt_br: O que acontece se você pressionar {guilabel}`Aplicar`?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/bioimagebook.github.io/blob/main/chapters/1-concepts/1-images_and_pixels/images/couple.png)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/bioimagebook.github.io/blob/main/chapters/1-concepts/1-images_and_pixels/images/pair.png)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/bioimagebook.github.io/blob/main/chapters/1-concepts/1-images_and_pixels/images/couple.png)

source: Adjusting the sliders changes the LUT -- and *not* the pixel values.
de: Das Anpassen der Schieberegler ändert die LUT – und *nicht* die Pixelwerte.
pt_br: Ajustar os controles deslizantes altera o LUT - e *não* os valores dos pixels.

source: That is, unless you press {guilabel}`Apply`. If you do press {guilabel}`Apply` then the pixel values are changed.
de: Das heißt, es sei denn, Sie drücken {guilabel}„Übernehmen“. Wenn Sie {guilabel}„Übernehmen“ drücken, werden die Pixelwerte geändert.
pt_br: Isto é, a menos que você pressione {guilabel}`Aplicar`. Se você pressionar {guilabel}`Apply` então os valores dos pixels serão alterados.

source: Recent versions of ImageJ give a warning when pressing {guilabel}`Apply`, but previous versions did not... which made it an extremely dangerous button for new users of the software. In most cases, the rule is:
de: Aktuelle Versionen von ImageJ geben eine Warnung aus, wenn auf {guilabel}„Übernehmen“ geklickt wird, in früheren Versionen war dies jedoch nicht der Fall ... was die Schaltfläche für neue Benutzer der Software zu einer äußerst gefährlichen Schaltfläche machte. In den meisten Fällen gilt:
pt_br: Versões recentes do ImageJ emitem um aviso ao pressionar {guilabel}`Aplicar`, mas as versões anteriores não... o que o tornou um botão extremamente perigoso para novos usuários do software. Na maioria dos casos, a regra é:

source: **When adjusting the brightness & contrast in ImageJ, don't press {guilabel}`Apply`!**
de: **Wenn Sie die Helligkeit und den Kontrast in ImageJ anpassen, drücken Sie nicht {guilabel}„Übernehmen“!**
pt_br: **Ao ajustar o brilho e o contraste no ImageJ, não pressione {guilabel}`Apply`!**

source: You shouldn't break this rule without a good reason!
de: Sie sollten diese Regel nicht ohne guten Grund brechen!
pt_br: Você não deve quebrar esta regra sem um bom motivo!

source: Switching LUTs
de: LUTs wechseln
pt_br: Trocando LUTs

source: You can change the colors of the LUT by selecting an alternative option from the {menuselection}`Image --> Lookup tables -->` submenu.
de: Sie können die Farben der LUT ändern, indem Sie eine alternative Option aus dem Untermenü {menuselection}`Image --> Lookup tables -->` auswählen.
pt_br: Você pode alterar as cores da LUT selecionando uma opção alternativa no submenu {menuselection}`Image --> Lookup Tables -->`.

source: Use the Control Panel to frequently access the same menu
de: Verwenden Sie die Systemsteuerung, um häufig auf dasselbe Menü zuzugreifen
pt_br: Use o Painel de Controle para acessar frequentemente o mesmo menu

source: If you want to explore LUTs quickly, use {menuselection}`Plugins --> Utilities --> Control Panel`. This opens a window that allows you to double-click on commands from any menu or submenu to apply that command quickly.
de: Wenn Sie LUTs schnell erkunden möchten, verwenden Sie {menuselection}`Plugins –> Dienstprogramme –> Systemsteuerung“. Dadurch wird ein Fenster geöffnet, in dem Sie in jedem Menü oder Untermenü auf Befehle doppelklicken können, um diesen Befehl schnell anzuwenden.
pt_br: Se você quiser explorar LUTs rapidamente, use {menuselection}`Plugins --> Utilitários --> Painel de Controle`. Isso abre uma janela que permite clicar duas vezes nos comandos de qualquer menu ou submenu para aplicar esse comando rapidamente.

source: Sometimes they also need a kind word or a compliment, because they are human. Supporting software can be time-consuming, hard and stressful -- and is usually something they do for free, in their limited spare time.
de: Manchmal brauchen sie auch ein nettes Wort oder ein Kompliment, denn sie sind Menschen. Der Support von Software kann zeitaufwändig, mühsam und stressig sein – und ist in der Regel etwas, das sie in ihrer begrenzten Freizeit kostenlos tun.
pt_br: Às vezes também precisam de uma palavra gentil ou de um elogio, porque são humanos. O software de suporte pode ser demorado, difícil e estressante – e geralmente é algo que eles fazem de graça, em seu tempo livre limitado.

source: 3. ImageJ.JS
pt_br: 3. ImagemJ.JS
