Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/python.po
Languages: de, pt_br

source: Python: Images & pixels
de: Python: Bilder und Pixel
pt_br: Python: imagens e pixels

source: The goal of these sections is to provide an interactive illustration of image analysis concepts through the popular [Python](https://www.python.org) programming language.
de: Ziel dieser Abschnitte ist die interaktive Veranschaulichung von Bildanalysekonzepten mit Hilfe der beliebten Programmiersprache [Python] (https://www.python.org).
pt_br: O objetivo destas seções é fornecer uma ilustração interativa dos conceitos de análise de imagens por meio da popular linguagem de programação [Python](https://www.python.org).

source: Feel free to skip this!
de: Sie können dies gerne überspringen!
pt_br: Sinta-se à vontade para pular isso!

source: If you're more interested in concepts and/or ImageJ, I would recommend skipping the Python chapters at the beginning - you don't need them to follow the rest of the book.
de: Wenn Sie mehr an Konzepten und/oder ImageJ interessiert sind, würde ich empfehlen, die Python-Kapitel am Anfang zu überspringen - Sie brauchen sie nicht, um dem Rest des Buches zu folgen.
pt_br: Se você estiver mais interessado em conceitos e/ou ImageJ, recomendo pular os capítulos sobre Python no início - você não precisa deles para seguir o restante do livro.

source: However, if you *are* interested, I hope these sections can help provide an alternative view of image analysis.
de: Wenn Sie jedoch daran interessiert sind, hoffe ich, dass diese Abschnitte Ihnen einen alternativen Blick auf die Bildanalyse ermöglichen.
pt_br: No entanto, se você *estiver* interessado, espero que estas seções possam ajudar a fornecer uma visão alternativa da análise de imagens.

source: Even if you've never coded before, working through the examples will hopefully give you both a deeper understanding of image processing and some useful programming skills.
de: Selbst wenn Sie noch nie programmiert haben, werden Sie durch das Durcharbeiten der Beispiele hoffentlich sowohl ein tieferes Verständnis der Bildverarbeitung als auch einige nützliche Programmierkenntnisse erwerben.
pt_br: Mesmo que você nunca tenha codificado antes, trabalhar com os exemplos lhe dará uma compreensão mais profunda do processamento de imagens e algumas habilidades úteis de programação.

source: This page will introduce reading and displaying images. Later Python chapters in the handbook will build on these foundations.
de: Auf dieser Seite wird das Lesen und Anzeigen von Bildern vorgestellt. Spätere Python-Kapitel des Handbuchs werden auf diesen Grundlagen aufbauen.
pt_br: Esta página apresentará a leitura e exibição de imagens. Os capítulos posteriores sobre Python no manual se basearão nessas bases.

source: Make it interactive!
de: Machen Sie es interaktiv!
pt_br: Torne-o interativo!

source: Before continuing, you should [make the notebook interactive](sec-live-notebooks) so that you can run the code yourself - and explore what happens if you make changes.
de: Bevor Sie fortfahren, sollten Sie [das Notizbuch interaktiv machen] (sec-live-notebooks), damit Sie den Code selbst ausführen können - und herausfinden, was passiert, wenn Sie Änderungen vornehmen.
pt_br: Antes de continuar, você deve [tornar o notebook interativo](sec-live-notebooks) para poder executar o código sozinho - e explorar o que acontece se você fizer alterações.

source: Python overview
de: Python-Übersicht
pt_br: Visão geral do Python

source: If you want a quick introduction to Python, check out the [Python Primer](../../appendices/python/python.md) section.
de: Wenn Sie eine schnelle Einführung in Python wünschen, lesen Sie den Abschnitt [Python Primer](../../appendices/python/python.md).
pt_br: Se você quiser uma introdução rápida ao Python, confira a seção [Python Primer](../../appendices/python/python.md).

source: For lots more, see Robert Haase's [Bio-image Analysis Notebooks](https://haesleinhuepf.github.io/BioImageAnalysisNotebooks/).
de: Viele weitere Informationen finden Sie in den [Bio-image Analysis Notebooks] von Robert Haase (https://haesleinhuepf.github.io/BioImageAnalysisNotebooks/).
pt_br: Para muito mais, consulte [Cadernos de análise de bioimagem] de Robert Haase (https://haesleinhuepf.github.io/BioImageAnalysisNotebooks/).

source: Read & show an image using Python <a name="show-image-in-python" />
de: Lesen und Anzeigen eines Bildes mit Python <a name="show-image-in-python" />
pt_br: Leia e mostre uma imagem usando Python <a name="show-image-in-python" />

source: Let's begin by loading an image in Python, and then showing it using [matplotlib](https://matplotlib.org).
de: Beginnen wir damit, ein Bild in Python zu laden und es dann mit [matplotlib](https://matplotlib.org) darzustellen.
pt_br: Vamos começar carregando uma imagem em Python e depois exibi-la usando [matplotlib](https://matplotlib.org).

source: Changing lookup tables
de: Ändern von Nachschlagetabellen
pt_br: Alterando tabelas de pesquisa

source: The key method here is `plt.imshow`. We can pass additional parameters to customize the display in many ways.
de: Die wichtigste Methode hier ist "plt.imshow". Wir können zusätzliche Parameter übergeben, um die Anzeige auf viele Arten anzupassen.
pt_br: O método principal aqui é `plt.imshow`. Podemos passar parâmetros adicionais para personalizar a exibição de várias maneiras.

source: To see what is possible, I usually start to type the name and then press {kbd}`Shift+Tab` to prompt some documentation to appear.
de: Um zu sehen, was möglich ist, beginne ich normalerweise mit der Eingabe des Namens und drücke dann {kbd}`Umschalt+Tab`, damit eine Dokumentation erscheint.
pt_br: Para ver o que é possível, normalmente começo a digitar o nome e então pressiono {kbd}`Shift+Tab` para que alguma documentação apareça.

source: Alternatively, you can run either of the following lines
de: Alternativ können Sie auch eine der folgenden Zeilen ausführen
pt_br: Alternativamente, você pode executar qualquer uma das seguintes linhas

source: to display some help text.
de: um einen Hilfetext anzuzeigen.
pt_br: para exibir algum texto de ajuda.

source: This can sometimes reveal an overwhelming amount of information, and it can take a bit of time to figure out how to identify the key bits.
de: Dies kann manchmal zu einer überwältigenden Menge an Informationen führen, und es kann eine Weile dauern, bis man herausgefunden hat, wie man die wichtigsten Informationen erkennt.
pt_br: Às vezes, isso pode revelar uma quantidade enorme de informações e pode levar um pouco de tempo para descobrir como identificar os bits principais.

source: The important plotting options for our purposes are
de: Die für unsere Zwecke wichtigen Darstellungsoptionen sind
pt_br: As opções de plotagem importantes para nossos propósitos são

source: `cmap` to change the colormap (LUT)
de: cmap", um die Farbzuordnung (LUT) zu ändern
pt_br: `cmap` para alterar o mapa de cores (LUT)

source: `vmin` to change the pixel value corresponding to the first color in the colormap
de: vmin", um den Pixelwert zu ändern, der der ersten Farbe in der Farbkarte entspricht
pt_br: `vmin` para alterar o valor do pixel correspondente à primeira cor no mapa de cores

source: `vmax` to change the pixel value corresponding to the last color in the colormap
de: vmax", um den Pixelwert zu ändern, der der letzten Farbe in der Farbkarte entspricht
pt_br: `vmax` para alterar o valor do pixel correspondente à última cor no mapa de cores

source: The last two options control the brightness/contrast.
de: Die letzten beiden Optionen steuern Helligkeit/Kontrast.
pt_br: As duas últimas opções controlam o brilho/contraste.

source: Try running the following code cells to see the effect, and try out other changes.
de: Führen Sie die folgenden Code-Zellen aus, um die Auswirkungen zu sehen, und probieren Sie andere Änderungen aus.
pt_br: Tente executar as células de código a seguir para ver o efeito e experimente outras alterações.

source: There are many more colormaps available in matplotlib -- for details, see https://matplotlib.org/stable/tutorials/colors/colormaps.html
de: Es gibt noch viele weitere Farbkarten in matplotlib -- für Details siehe https://matplotlib.org/stable/tutorials/colors/colormaps.html
pt_br: Existem muitos outros mapas de cores disponíveis no matplotlib – para obter detalhes, consulte https://matplotlib.org/stable/tutorials/colors/colormaps.html

source: As you can see, the image may look *very* different depending upon the colormap and min/max values used.
de: Wie Sie sehen können, kann das Bild je nach der verwendeten Farbkarte und den Min-/Max-Werten *sehr* unterschiedlich aussehen.
pt_br: Como você pode ver, a imagem pode parecer *muito* diferente dependendo do mapa de cores e dos valores mínimo/máximo usados.

source: However, it's crucial that *we haven't modified the original image data itself*.
de: Entscheidend ist jedoch, dass *wir die ursprünglichen Bilddaten selbst nicht verändert haben*.
pt_br: No entanto, é crucial que *não tenhamos modificado os dados originais da imagem*.

source: To check this, try showing the image as we did initially - to make sure it looks the same.
de: Um dies zu überprüfen, zeigen Sie das Bild so an, wie wir es ursprünglich gemacht haben, um sicherzustellen, dass es gleich aussieht.
pt_br: Para verificar isso, tente mostrar a imagem como fizemos inicialmente - para ter certeza de que parece igual.

source: Further customizing image display
de: Weitere Anpassung der Bildanzeige
pt_br: Personalização adicional da exibição de imagens

source: Lots more can be done to customize appearance.
de: Es kann noch viel mehr getan werden, um das Aussehen anzupassen.
pt_br: Muito mais pode ser feito para personalizar a aparência.

source: In order to standardize things throughout this book, I normally turn off the outer axis (numbers around the boundary), set an image title, and use a grayscale lookup table.
de: Um die Dinge in diesem Buch zu standardisieren, schalte ich normalerweise die äußere Achse (Zahlen um die Begrenzung) aus, setze einen Bildtitel und verwende eine Graustufen-Lookup-Tabelle.
pt_br: Para padronizar as coisas ao longo deste livro, normalmente desativo o eixo externo (números ao redor do limite), defino um título de imagem e uso uma tabela de pesquisa em tons de cinza.

source: The code to do this is shown below.
de: Der entsprechende Code ist unten abgebildet.
pt_br: O código para fazer isso é mostrado abaixo.

source: Writing functions
de: Schreibfunktionen
pt_br: Funções de escrita

source: If you use the same customizations frequently, it helps to **define a function** that applies them. Then you don't need to copy and paste the same lines of code frequently; rather, you just call the function instead.
de: Wenn Sie häufig dieselben Anpassungen verwenden, ist es hilfreich, eine Funktion zu **definieren**, die diese anwendet. Dann müssen Sie nicht häufig dieselben Codezeilen kopieren und einfügen, sondern rufen stattdessen einfach die Funktion auf.
pt_br: Se você usa as mesmas personalizações com frequência, será útil **definir uma função** que as aplique. Então você não precisa copiar e colar as mesmas linhas de código com frequência; em vez disso, basta chamar a função.

source: The function definition starts with `def`. It is followed by
de: Die Funktionsdefinition beginnt mit "def". Es folgt
pt_br: A definição da função começa com `def`. É seguido por

source: The function name
de: Der Name der Funktion
pt_br: O nome da função

source: Parameters (within parentheses), sometimes with default values
de: Parameter (in Klammern), manchmal mit Standardwerten
pt_br: Parâmetros (entre parênteses), às vezes com valores padrão

source: A colon
de: Ein Doppelpunkt
pt_br: Dois pontos

source: The main code that implements the function - this needs to be indented (something Python is *very* fussy about)
de: Der Hauptcode, der die Funktion implementiert - dieser muss eingerückt werden (etwas, bei dem Python *sehr* pingelig ist)
pt_br: O código principal que implementa a função - precisa ser recuado (algo que o Python é *muito* exigente)

source: Helper functions in this book
de: Hilfsfunktionen in diesem Buch
pt_br: Funções auxiliares neste livro

source: I've written several helper functions to standardize image display throughout this handbook. They aren't part of any wider Python library, but we can use them here to make our scripts shorter and focus on the more important concepts.
de: Ich habe mehrere Hilfsfunktionen geschrieben, um die Bildanzeige in diesem Handbuch zu standardisieren. Sie sind nicht Teil einer größeren Python-Bibliothek, aber wir können sie hier verwenden, um unsere Skripte kürzer zu machen und uns auf die wichtigeren Konzepte zu konzentrieren.
pt_br: Escrevi diversas funções auxiliares para padronizar a exibição de imagens ao longo deste manual. Eles não fazem parte de nenhuma biblioteca Python mais ampla, mas podemos usá-los aqui para tornar nossos scripts mais curtos e focar nos conceitos mais importantes.

source: To use these helper functions, we need to import them once per Jupyter notebook. Then we can use the methods such as `load_image` and `show_image` (along with companions like `show_histogram`) to display images.
de: Um diese Hilfsfunktionen zu verwenden, müssen wir sie einmal pro Jupyter-Notebook importieren. Dann können wir die Methoden wie `load_image` und `show_image` (zusammen mit Begleitern wie `show_histogram`) verwenden, um Bilder anzuzeigen.
pt_br: Para usar essas funções auxiliares, precisamos importá-las uma vez por notebook Jupyter. Então podemos usar métodos como `load_image` e `show_image` (junto com companheiros como `show_histogram`) para exibir imagens.
