Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/appendices/python/python.po
Languages: pt_br

source: Python Primer
pt_br: Cartilha Python

source: Work in progress!
pt_br: Trabalho em progresso!

source: This section isn't complete yet.
pt_br: Esta seção ainda não está completa.

source: This section aims to provide *just enough* info to demystify the weird symbols and to get started with the Python [Python](https://www.python.org) programming language.
pt_br: Esta seção tem como objetivo fornecer informações *apenas suficientes* para desmistificar os símbolos estranhos e começar a usar a linguagem de programação Python [Python](https://www.python.org).

source: To make sense of the code throughout this handbook see, it helps to be familiar with four main things:
pt_br: Para entender o código ao longo deste manual, é útil estar familiarizado com quatro coisas principais:

source: **Comments** - which help explain what's happening
pt_br: **Comentários** - que ajudam a explicar o que está acontecendo

source: **Variables** - which store values
pt_br: **Variáveis** - que armazenam valores

source: **Functions** - which do stuff with variables
pt_br: **Funções** - que fazem coisas com variáveis

source: **Modules** - which need to be imported to use the useful stuff (like functions) they contain
pt_br: **Módulos** - que precisam ser importados para usar as coisas úteis (como funções) que eles contêm

source: This is far from everything you need to know to master programming, but it might just be enough to get started - and getting started if often the hardest part.
pt_br: Isso está longe de ser tudo que você precisa saber para dominar a programação, mas pode ser apenas o suficiente para começar - e começar é muitas vezes a parte mais difícil.

source: I think it's fair to say that experienced programmers pick up most of what they know as they go along: aided by a great deal of googling* along the way.
pt_br: Acho que é justo dizer que programadores experientes aprendem a maior parte do que sabem à medida que avançam: com a ajuda de muitas pesquisas no Google* ao longo do caminho.

source: *-Or the use of some other preferred search engine.
pt_br: *-Ou o uso de algum outro mecanismo de busca preferido.

source: Comments
pt_br: Comentários

source: Comments are explanations added to code that help explain what is going on. They aren't essential for the code to *run*, but often are essential to make sense of it. It's a very good idea to add comments to your own code - either for others to read, or for yourself in the future.
pt_br: Comentários são explicações adicionadas ao código que ajudam a explicar o que está acontecendo. Eles não são essenciais para a *execução* do código, mas geralmente são essenciais para entendê-lo. É uma boa ideia adicionar comentários ao seu próprio código - para que outras pessoas leiam ou para você mesmo no futuro.

source: In Python, a typical comment starts with a `#`
pt_br: Em Python, um comentário típico começa com um `#`

source: Variables
pt_br: Variáveis

source: Variables provide a place to store stuff: numbers, text, images and so on.
pt_br: As variáveis fornecem um local para armazenar coisas: números, texto, imagens e assim por diante.

source: You can think of it as a bit like algebra. If you see
pt_br: Você pode pensar nisso como se fosse álgebra. Se você ver

source: then *x* is the variable.
pt_br: então *x* é a variável.

source: When programming, you'll likely use variables all the time for different purposes and to represent different things. The type of the variable will determine what you can do with it. Some examples are given below.
pt_br: Ao programar, você provavelmente usará variáveis o tempo todo para finalidades diferentes e para representar coisas diferentes. O tipo da variável determinará o que você pode fazer com ela. Alguns exemplos são dados abaixo.

source: Numbers
pt_br: Números

source: A variable might be used to represent a number. You *assign* the number to the variable using `=`.
pt_br: Uma variável pode ser usada para representar um número. Você *atribui* o número à variável usando `=`.

source: It's important to note that `=` doesn't really mean 'is equal to' in this case. Rather, when I see
pt_br: É importante notar que `=` não significa realmente 'é igual a' neste caso. Em vez disso, quando vejo

source: in my mind I read *'x becomes 10'* or alternatively *'set x to 10'*.
pt_br: em minha mente eu li *'x se torna 10'* ou alternativamente *'definir x para 10'*.

source: The order is important: the variable being set is on the left and the value it is being set to is on the right. Switching the order can give an error - or a result you might not expect.
pt_br: A ordem é importante: a variável que está sendo definida está à esquerda e o valor para o qual está sendo definida está à direita. Mudar a ordem pode gerar um erro - ou um resultado inesperado.

source: If you want to test if a variable is equal to something, you need to use `==` instead. The output of that will be either `True` or `False`.
pt_br: Se você quiser testar se uma variável é igual a alguma coisa, você precisa usar `==`. A saída disso será `True` ou `False`.

source: Note that, when using `==`, the order doesn't matter like it does with `=`.
pt_br: Observe que, ao usar `==`, a ordem não importa como acontece com `=`.

source: You aren't restricted to testing whether a variable itself is equal to a specific value. Rather, you can incorporate extra calculations and compare the results of these calculations to other values or variables.
pt_br: Você não está restrito a testar se uma variável em si é igual a um valor específico. Em vez disso, você pode incorporar cálculos extras e comparar os resultados desses cálculos com outros valores ou variáveis.

source: Strings
pt_br: Cordas

source: In computer parlance, a piece of text tends to be called a *string*.
pt_br: Na linguagem informática, um pedaço de texto tende a ser chamado de *string*.

source: You can create a string by enclosing the text in some quotation marks.
pt_br: Você pode criar uma string colocando o texto entre aspas.

source: In Python, both single and double quotation marks can be used.
pt_br: Em Python, aspas simples e duplas podem ser usadas.

source: You can then do things like add strings together using the `+` symbol, which has the effect of concatenating them to create a new string.
pt_br: Você pode então fazer coisas como adicionar strings usando o símbolo `+`, que tem o efeito de concatená-las para criar uma nova string.

source: It doesn't *usually* matter whether you use single or double quotes, but it can matter if you want to include the other kind of quotation mark *within* the string.
pt_br: *normalmente* não importa se você usa aspas simples ou duplas, mas pode importar se você deseja incluir o outro tipo de aspas *dentro* da string.

source: In the example above, the `'` within 'wouldn't' was misinterpreted as the end of the string, and an error is the result.
pt_br: No exemplo acima, o `'` dentro de 'wouldn't' foi mal interpretado como o final da string, e o resultado é um erro.

source: There are two ways to get around that:
pt_br: Existem duas maneiras de contornar isso:

source: Use double-quotes
pt_br: Use aspas duplas

source: Use `\'` to 'escape' the first quotation mark
pt_br: Use `\'` para 'escapar' da primeira aspa

source: Another way to generate an error is to try to create a string that spans multiple lines.
pt_br: Outra maneira de gerar um erro é tentar criar uma string que abranja várias linhas.

source: One way to get around that is to define the string using *3* double quotation marks `"""`.
pt_br: Uma maneira de contornar isso é definir a string usando *3* aspas duplas `"""`.

source: You can use multiline strings like this as an alternative to comments, to avoid needing to add `#` at the beginning.
pt_br: Você pode usar strings multilinhas como esta como uma alternativa aos comentários, para evitar a necessidade de adicionar `#` no início.

source: Lists
pt_br: Listas

source: Tuples
pt_br: Tuplas

source: Numpy arrays
pt_br: Matrizes numpy

source: Dictionaries
pt_br: Dicionários

source: Functions
pt_br: Funções

source: Defining functions
pt_br: Definindo funções

source: Modules
pt_br: Módulos
