Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/appendices/next_steps/next_steps.po
Languages: es, pt_br

source: Beyond this book
es: Más allá de este libro
pt_br: Além deste livro

source: Starting out in image analysis can feel a bit like learning a language.
es: Comenzar en el análisis de imágenes puede parecer un poco como aprender un idioma.
pt_br: Começar na análise de imagens pode ser um pouco como aprender um idioma.

source: Initially, everything seems incomprehensible. If you can immerse yourself in the language sufficiently, patterns start to emerge and parts begin to make sense. But even so, speaking it fluently can still feel a long way away.
es: Al principio todo parece incomprensible. Si puedes sumergirte lo suficiente en el idioma, comenzarán a surgir patrones y las partes comenzarán a tener sentido. Pero aun así, hablarlo con fluidez todavía puede parecer muy lejano.
pt_br: Inicialmente, tudo parece incompreensível. Se você conseguir mergulhar suficientemente na linguagem, os padrões começarão a surgir e as partes começarão a fazer sentido. Mas mesmo assim, falar fluentemente ainda pode parecer muito distante.

source: This book tries to accelerate the process by systematically teaching the basic grammar and core vocabulary of image analysis: the rules, concepts, and tools that (bio)image analysts use every day. It aims to go beyond a superficial overview by describing many of the exceptions, pitfalls and messy realities encountered when working with images: the things I wish I had learned sooner when I started out myself. The things I didn't know that I needed to know, or didn't know even existed.
es: Este libro intenta acelerar el proceso enseñando sistemáticamente la gramática básica y el vocabulario básico del análisis de imágenes: las reglas, conceptos y herramientas que los analistas de (bio)imágenes utilizan todos los días. Su objetivo es ir más allá de una descripción superficial al describir muchas de las excepciones, obstáculos y realidades confusas que se encuentran al trabajar con imágenes: las cosas que desearía haber aprendido antes cuando comencé. Las cosas que no sabía que necesitaba saber, o que no sabía, ni siquiera existían.
pt_br: Este livro tenta acelerar o processo ensinando sistematicamente a gramática básica e o vocabulário básico da análise de imagens: as regras, conceitos e ferramentas que os analistas de (bio)imagem usam todos os dias. O objetivo é ir além de uma visão geral superficial, descrevendo muitas das exceções, armadilhas e realidades confusas encontradas ao trabalhar com imagens: as coisas que eu gostaria de ter aprendido antes, quando comecei. As coisas que eu não sabia que precisava saber, ou que nem sabia que existiam.

source: The book also covers a couple of major dialects (ImageJ and Python), in case you want to hang out in areas where they are spoken.
es: El libro también cubre un par de dialectos principales (ImageJ y Python), en caso de que quieras pasar el rato en áreas donde se hablan.
pt_br: O livro também cobre alguns dos principais dialetos (ImageJ e Python), caso você queira passear em áreas onde eles são falados.

source: If you've worked through the chapters, I hope that they could help you develop a solid basis to understand the language of image analysis. If you want to go further, my advice would be to start using it to communicate with others whenever you can.
es: Si ha trabajado en los capítulos, espero que puedan ayudarle a desarrollar una base sólida para comprender el lenguaje del análisis de imágenes. Si quieres ir más allá, mi consejo sería que empieces a utilizarlo para comunicarte con otros siempre que puedas.
pt_br: Se você leu os capítulos, espero que eles possam ajudá-lo a desenvolver uma base sólida para compreender a linguagem da análise de imagens. Se você quiser ir mais longe, meu conselho seria começar a usá-lo para se comunicar com outras pessoas sempre que puder.

source: The **Scientific Community Image Forum** at **https://forum.image.sc** is an *extremely* active and friendly discussion forum, populated by people who speak image analysis with varying levels of fluency. My own career has been shaped by the things I learned on the forum, and the mailing lists that predated it.
es: El **Foro de imágenes de la comunidad científica** en **https://forum.image.sc** es un foro de discusión *extremadamente* activo y amigable, poblado por personas que hablan sobre análisis de imágenes con distintos niveles de fluidez. Mi propia carrera ha sido moldeada por las cosas que aprendí en el foro y las listas de correo que lo precedieron.
pt_br: O **Fórum de Imagens da Comunidade Científica** em **https://forum.image.sc** é um fórum de discussão *extremamente* ativo e amigável, preenchido por pessoas que falam análise de imagens com vários níveis de fluência. Minha própria carreira foi moldada pelas coisas que aprendi no fórum e nas listas de discussão que o antecederam.

source: For that reason, I'd suggest participating in in the forum is the best next step. There, you'll find thousands of discussions on many topics related to scientific imaging in general.
es: Por esa razón, sugeriría que participar en el foro sea el mejor siguiente paso. Allí encontrará miles de debates sobre muchos temas relacionados con las imágenes científicas en general.
pt_br: Por esse motivo, sugiro que participar do fórum seja o melhor próximo passo. Lá, você encontrará milhares de discussões sobre diversos tópicos relacionados à imagem científica em geral.

source: One of the most common uses of image.sc is to ask the community for advice on how to solve a particular image analysis problem. As a result, the forum also contains thousands of searchable discussions that delve into the details of specific problems.
es: Uno de los usos más comunes de image.sc es pedir consejo a la comunidad sobre cómo resolver un problema de análisis de imágenes en particular. Como resultado, el foro también contiene miles de discusiones con capacidad de búsqueda que profundizan en los detalles de problemas específicos.
pt_br: Um dos usos mais comuns de image.sc é pedir conselhos à comunidade sobre como resolver um problema específico de análise de imagem. Como resultado, o fórum também contém milhares de discussões pesquisáveis que se aprofundam nos detalhes de problemas específicos.

source: image.sc also acts as the primary discussion channel for more than 50 open-source software projects, listed as 'Community partners', including ImageJ, Fiji, CellProfiler, scikit-image and QuPath.
es: image.sc también actúa como canal de discusión principal para más de 50 proyectos de software de código abierto, listados como 'socios comunitarios', incluidos ImageJ, Fiji, CellProfiler, scikit-image y QuPath.
pt_br: image.sc também atua como o principal canal de discussão para mais de 50 projetos de software de código aberto, listados como 'parceiros da comunidade', incluindo ImageJ, Fiji, CellProfiler, scikit-image e QuPath.

source: Community partners at image.sc in January 2022. <br /> There may well be more by the time you read this.
es: Socios de la comunidad en image.sc en enero de 2022. <br /> Es posible que haya más cuando lea esto.
pt_br: Parceiros da comunidade em image.sc em janeiro de 2022. <br /> Talvez haja mais quando você ler isto.

source: It's possible to learn a lot just by lurking (as I did for years...), absorbing new ideas and ways of thinking from the people who post. But I hope that, in the end, you might actively participate: posting your own questions, and also your own insights, opinions and answers.
es: Es posible aprender mucho simplemente acechando (como hice yo durante años...), absorbiendo nuevas ideas y formas de pensar de las personas que publican. Pero espero que, al final, puedas participar activamente: publicando tus propias preguntas y también tus propios conocimientos, opiniones y respuestas.
pt_br: É possível aprender muito apenas espreitando (como fiz durante anos...), absorvendo novas ideias e formas de pensar das pessoas que postam. Mas espero que, no final, você participe ativamente: postando suas próprias perguntas, e também seus próprios insights, opiniões e respostas.
