Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: de

source: Noise
de: Lärm

source: Chapter outline
de: Gliederung des Kapitels

source: There are two main types of noise in fluorescence microscopy: **photon noise & read noise**
de: In der Fluoreszenzmikroskopie gibt es zwei Hauptarten von Rauschen: **Photonenrauschen und Ausleserauschen**

source: **Photon noise** is _signal-dependent_, varying throughout an image
de: **Photonenrauschen** ist _signalabhängig_ und variiert im gesamten Bild

source: **Read noise** is _signal-independent_, and depends upon the detector
de: **Leserauschen** ist _signalunabhängig_ und hängt vom Detektor ab

source: **Detecting more photons** reduces the impact of both noise types
de: **Die Erfassung von mehr Photonen** reduziert die Auswirkungen beider Rauscharten

source: Introduction
de: Einführung

source: We could reasonably expect that a noise-free microscopy image should look pleasantly smooth, not least because the convolution with the PSF has a blurring effect that softens any sharp transitions. Yet in practice raw fluorescence microscopy images are not smooth. They are always, to a greater or lesser extent, corrupted by noise. This appears as a random 'graininess' throughout the image, which is often strong enough to obscure details.
de: Man könnte vernünftigerweise erwarten, dass ein rauschfreies Mikroskopiebild angenehm glatt aussieht, nicht zuletzt, weil die Faltung mit der PSF einen Unschärfeeffekt hat, der alle scharfen Übergänge abmildert. Doch in der Praxis sind Rohbilder der Fluoreszenzmikroskopie nicht glatt. Sie sind immer, mehr oder weniger stark, durch Rauschen beeinträchtigt. Dies äußert sich in einer zufälligen "Körnigkeit" des gesamten Bildes, die oft stark genug ist, um Details zu verdecken.

source: This chapter considers the nature of the noisiness, where it comes from, and what can be done about it. Before starting, it may be helpful to know the one major lesson of this chapter for the working microscopist is simply:
de: Dieses Kapitel befasst sich mit der Art des Rauschens, woher es kommt und was man dagegen tun kann. Bevor wir beginnen, ist es vielleicht hilfreich zu wissen, dass die wichtigste Lektion dieses Kapitels für den arbeitenden Mikroskopiker einfach ist:

source: **If you want to reduce noise, you need to detect more photons**
de: **Wenn man das Rauschen reduzieren will, muss man mehr Photonen erkennen**

source: This general guidance applies in the overwhelming majority of cases when a good quality microscope is functioning properly. Nevertheless, it may be helpful to know a bit more detail about why -- and what you might do if detecting more photons is not feasible.
de: Dieser allgemeine Leitfaden gilt für die überwältigende Mehrheit der Fälle, in denen ein hochwertiges Mikroskop ordnungsgemäß funktioniert. Dennoch kann es hilfreich sein, etwas genauer zu wissen, warum das so ist - und was Sie tun können, wenn die Erfassung von mehr Photonen nicht möglich ist.

source: Background
de: Hintergrund

source: Illustration of the difference between a noisy image that we can record (A), and the noise-free image we would prefer (B). The 'noise' itself is what would be left over if we subtracted one from the other \(C). The histogram in (D) resembles a normal (i.e. Gaussian) distribution and shows that the noise consists of positive and negative values, with a mean of 0.
de: Illustration des Unterschieds zwischen einem verrauschten Bild, das wir aufnehmen können (A), und dem rauschfreien Bild, das wir bevorzugen würden (B). Das "Rauschen" selbst ist das, was übrig bleiben würde, wenn man das eine vom anderen subtrahieren würde (C). Das Histogramm in (D) ähnelt einer Normalverteilung (d. h. einer Gaußschen Verteilung) und zeigt, dass das Rauschen aus positiven und negativen Werten besteht, mit einem Mittelwert von 0.

source: In general, we can assume that noise in fluorescence microscopy images has the following three characteristics, illustrated in {numref}`fig-noise_demo`:
de: Im Allgemeinen können wir davon ausgehen, dass das Rauschen in Fluoreszenzmikroskopie-Bildern die folgenden drei Merkmale aufweist, die in {numref}`fig-noise_demo` dargestellt sind:

source: **Noise is random** -- For any pixel, the noise is a random positive or negative number added to the 'true value' the pixel should have.
de: **Rauschen ist zufällig** -- Für jedes Pixel ist das Rauschen eine zufällige positive oder negative Zahl, die zu dem "wahren Wert", den das Pixel haben sollte, addiert wird.

source: **Noise is independent at each pixel** -- The value of the noise at any pixel does not depend upon where the pixel is, or what the noise is at any other pixel.
de: **Rauschen ist an jedem Pixel unabhängig** -- Der Wert des Rauschens an einem beliebigen Pixel hängt nicht davon ab, wo sich das Pixel befindet, oder wie hoch das Rauschen an einem anderen Pixel ist.

source: **Noise follows a particular distribution** -- Each noise value can be seen as a _random variable_ drawn from a particular distribution. If we have enough noise values, their histogram would resemble a plot of the distribution [^fn_1].
de: **Rauschen folgt einer bestimmten Verteilung** -- Jeder Rauschwert kann als _Zufallsvariable_ betrachtet werden, die aus einer bestimmten Verteilung gezogen wird. Wenn wir genügend Rauschwerte haben, würde ihr Histogramm einem Diagramm der Verteilung [^fn_1] ähneln.

source: There are many different possible noise distributions, but we only need to consider the **Poisson** and **Gaussian** cases. No matter which of these we have, the most interesting distribution parameter for us is the **standard deviation**. Assuming everything else stays the same, if the standard deviation of the noise is higher then the image looks worse ({numref}`fig-gaussian_hists`).
de: Es gibt viele verschiedene Rauschverteilungen, aber wir müssen nur die Fälle **Poisson** und **Gauß** betrachten. Unabhängig davon, welche dieser Verteilungen wir haben, ist der interessanteste Verteilungsparameter für uns die **Standardabweichung**. Unter der Annahme, dass alles andere gleich bleibt, sieht das Bild schlechter aus, wenn die Standardabweichung des Rauschens höher ist ({numref}`fig-gaussian_hists`).

source: Gaussian noise with different standard deviations added to an image. Noise with a higher standard deviation has a worse effect when added to an image. Its impact can be seen in the histogram, as the distribution of foreground and background pixels overlap more -- which is problematic for things like [thresholding](chap_thresholding).
de: Gaußsches Rauschen mit unterschiedlichen Standardabweichungen, das einem Bild hinzugefügt wird. Rauschen mit einer höheren Standardabweichung hat eine schlechtere Wirkung, wenn es einem Bild hinzugefügt wird. Seine Auswirkungen sind im Histogramm zu erkennen, da sich die Verteilung der Vordergrund- und Hintergrundpixel stärker überschneidet - was für Dinge wie [thresholding](chap_thresholding) problematisch ist.

source: The reason we will consider two distributions is that there are two main types of noise for us to worry about:
de: Der Grund, warum wir zwei Verteilungen betrachten, ist, dass es zwei Hauptarten von Rauschen gibt, die uns Sorgen bereiten:

source: **Photon noise**, from the emission (and detection) of the light itself. This follows a Poisson distribution, for which _the standard deviation changes with the local image brightness_.
de: **Photonenrauschen**, das durch die Emission (und Erfassung) des Lichts selbst entsteht. Dieses folgt einer Poisson-Verteilung, bei der sich _die Standardabweichung mit der lokalen Bildhelligkeit ändert_.

source: **Read noise**, arising from inaccuracies in quantifying numbers of detected photons. This follows a Gaussian distribution, for which _the standard deviation stays the same throughout the image_.
de: **Leserauschen**, das durch Ungenauigkeiten bei der Quantifizierung der Anzahl der erkannten Photonen entsteht. Dieses folgt einer Gaußschen Verteilung, bei der _die Standardabweichung über das gesamte Bild gleich bleibt_.

source: Therefore the noise in the image is really the result of adding two [^fn_2] separate random components together. In other words, to get the value of any pixel $P$ you need to calculate the sum of the 'true' (noise-free) value $T$, a random photon noise value $N_p$, and a random read noise value $N_r$, i.e.
de: Daher ist das Rauschen im Bild in Wirklichkeit das Ergebnis der Addition zweier [^fn_2] separater Zufallskomponenten. Mit anderen Worten, um den Wert eines beliebigen Pixels $P$ zu erhalten, muss man die Summe des "wahren" (rauschfreien) Wertes $T$, eines zufälligen Photonenrauschens $N_p$ und eines zufälligen Leserauschens $N_r$ berechnen, d.h.

source: In this case, we have $P$ in the image but we want $T$. Unfortunately, we don't know precisely what the random values $N_p$ and $N_r$ are.
de: In diesem Fall haben wir $P$ im Bild, aber wir wollen $T$. Leider wissen wir nicht genau, was die Zufallswerte $N_p$ und $N_r$ sind.

source: Finally, some useful maths:
de: Zum Schluss noch ein paar nützliche Rechenaufgaben:

source: Suppose we add two random noisy values together. Both are independent and drawn from distributions (Gaussian or Poisson) with standard deviations $\sigma_1$ and $\sigma_2$. The result is a third random value, drawn from a distribution with a standard deviation $\sqrt{\sigma_1^2 + \sigma_2^2}$.
de: Angenommen, wir addieren zwei zufällige verrauschte Werte zusammen. Beide sind unabhängig und werden aus Verteilungen (Gauß oder Poisson) mit Standardabweichungen $\sigma_1$ und $\sigma_2$ gezogen. Das Ergebnis ist ein dritter Zufallswert, der aus einer Verteilung mit einer Standardabweichung $\sqrt{\sigma_1^2 + \sigma_2^2}$ gezogen wird.

source: If we multiply a noisy value from a distribution with a standard deviation $\sigma_1$ by $k$, the result is noise from a distribution with a standard deviation $k\sigma_1$.
de: Multipliziert man einen verrauschten Wert aus einer Verteilung mit einer Standardabweichung $\sigma_1$ mit $k$, so erhält man Rauschen aus einer Verteilung mit einer Standardabweichung $k\sigma_1$.

source: These are all my most important noise facts, upon which the rest of this chapter is built. We will begin with Gaussian noise because it's easier to work with, found in many applications, and widely studied in the image processing literature. However, in _most_ fluorescence images photon noise is the more important factor. Fortunately, there's a close relationship between the Gaussian and Poisson noise -- and it's even possible to convert the latter to behave like the former.
de: Dies sind die wichtigsten Fakten zum Rauschen, auf denen der Rest dieses Kapitels aufbaut. Wir werden mit dem Gaußschen Rauschen beginnen, weil es einfacher zu handhaben ist, in vielen Anwendungen vorkommt und in der Bildverarbeitungsliteratur weithin untersucht wird. Bei _den meisten_ Fluoreszenzbildern ist jedoch das Photonenrauschen der wichtigere Faktor. Glücklicherweise gibt es eine enge Beziehung zwischen dem Gaußschen und dem Poisson-Rauschen - und es ist sogar möglich, letzteres so umzuwandeln, dass es sich wie ersteres verhält.

source: Gaussian noise
de: Gaußsches Rauschen

source: Gaussian noise is a common problem in fluorescence images acquired using a CCD camera (see {ref}`chap_microscope_types`). It arises at the stage of quantifying the number of photons detected for each pixel. Quantifying photons is hard to do with complete precision, and the result is likely to be wrong by at least a few photons. This error is the read noise.
de: Gaußsches Rauschen ist ein häufiges Problem bei Fluoreszenzbildern, die mit einer CCD-Kamera aufgenommen wurden (siehe {ref}`chap_microscope_types`). Es entsteht in der Phase der Quantifizierung der Anzahl der für jedes Pixel erkannten Photonen. Die Quantifizierung von Photonen ist schwer mit absoluter Präzision zu bewerkstelligen, und das Ergebnis ist wahrscheinlich um mindestens ein paar Photonen falsch. Dieser Fehler ist das Ausleserauschen.

source: Read noise typically follows a Gaussian distribution and has a mean of zero: this implies there is an equal likelihood of over or underestimating the number of photons. Furthermore, according to the properties of Gaussian distributions, we should expect around ~68% of measurements to be ±1 standard deviation from the true, read-noise-free value. If a detector has a low read noise standard deviation, this is then a good thing: it means the error should be small.
de: Das Ausleserauschen folgt in der Regel einer Gaußschen Verteilung und hat einen Mittelwert von Null: Dies bedeutet, dass die Wahrscheinlichkeit, die Anzahl der Photonen zu überschätzen oder zu unterschätzen, gleich groß ist. Darüber hinaus sollten wir gemäß den Eigenschaften von Gauß-Verteilungen erwarten, dass etwa ~68 % der Messungen um ±1 Standardabweichung vom wahren, rauschfreien Wert abweichen. Wenn ein Detektor eine niedrige Standardabweichung des Ausleserauschens hat, ist das eine gute Sache: Es bedeutet, dass der Fehler klein sein sollte.

source: Signal-to-Noise Ratio (SNR)
de: Signal-Rausch-Verhältnis (SNR)

source: Read noise is said to be **signal independent**: its standard deviation is constant, and does not depend upon how many photons are being quantified. However, the extent to which read noise is a problem probably _does_ depend upon the number of photons. For example, if we have detected 20 photons, a noise standard deviation of 10 photons is huge; if we have detected 10 000 photons, it's likely not so important.
de: Man sagt, dass das Ausleserauschen **signalunabhängig** ist: Seine Standardabweichung ist konstant und hängt nicht davon ab, wie viele Photonen gemessen werden. Das Ausmaß, in dem das Ausleserauschen ein Problem darstellt, _hängt_ jedoch wahrscheinlich von der Anzahl der Photonen ab. Wenn wir z. B. 20 Photonen erfasst haben, ist eine Rauschstandardabweichung von 10 Photonen enorm; wenn wir 10 000 Photonen erfasst haben, ist sie wahrscheinlich nicht so wichtig.

source: A better way to assess the noisiness of an image is then the ratio of the interesting component of each pixel (called the **signal**, which is here what we would ideally detect in terms of photons) to the noise standard deviation, which is known as the __Signal-to-Noise Ratio__ [^fn_3]:
de: Ein besserer Weg, die Verrauschtheit eines Bildes zu beurteilen, ist das Verhältnis der interessanten Komponente jedes Pixels (das so genannte **Signal**, das hier das ist, was wir idealerweise in Form von Photonen erkennen würden) zur Standardabweichung des Rauschens, was als __Signal-Rausch-Verhältnis__ [^fn_3] bekannt ist:

source: \textrm{SNR} = \frac{\textrm{Signal}}{\textrm{Noise standard deviation}}
de: \textrm{SNR} = \frac{\textrm{Signal}}{\textrm{Störstandardabweichung}}

source: Question
de: Frage

source: Calculate the SNR in the following cases:
de: Berechnen Sie das SNR für die folgenden Fälle:

source: We detect an average of 10 photons, read noise standard deviation 1 photon
de: Wir erkennen einen Durchschnitt von 10 Photonen, lesen Rauschen Standardabweichung 1 Photon

source: We detect an average of 100 photons, read noise standard deviation 10 photons
de: Wir erkennen einen Durchschnitt von 100 Photonen, lesen Rauschen Standardabweichung 10 Photonen

source: We detect an average of 1000 photons, read noise standard deviation 10 photons
de: Wir erkennen einen Durchschnitt von 1000 Photonen, lesen Rauschen Standardabweichung 10 Photonen

source: For the purposes of this question, you should assume that read noise is the only noise present (ignore photon noise).
de: Für die Zwecke dieser Frage sollten Sie davon ausgehen, dass das Leserauschen das einzige vorhandene Rauschen ist (ignorieren Sie das Photonenrauschen).

source: Answer
de: Antwort

source: We detect an average of 10 photons, read noise std. dev. 1 photon: _SNR = 10_
de: Wir erkennen durchschnittlich 10 Photonen, lesen Rauschen std. dev. 1 Photon: _SNR = 10_

source: We detect an average of 100 photons, read noise std. dev. 10 photons: _SNR = 10_
de: Wir erkennen einen Durchschnitt von 100 Photonen, lesen Rauschen std. dev. 10 Photonen: _SNR = 10_

source: We detect an average of 1000 photons, read noise std. dev. 10 photons: _SNR = 100_
de: Wir erkennen einen Durchschnitt von 1000 Photonen, lesen Rauschen std. dev. 10 Photonen: _SNR = 100_

source: The noise causes us a similar degree of uncertainty in the first two cases. In the third case, the noise is likely to be less problematic: higher SNRs are good.
de: Das Rauschen verursacht in den ersten beiden Fällen ein ähnliches Maß an Unsicherheit. Im dritten Fall ist das Rauschen wahrscheinlich weniger problematisch: höhere SNRs sind gut.

source: Exploring noise
de: Lärm erforschen

source: I find the best way to learn about noise is by creating simulation images, and exploring their properties through making and testing predictions.
de: Meiner Meinung nach lernt man am besten etwas über Rauschen, indem man Simulationsbilder erstellt und ihre Eigenschaften durch das Erstellen und Testen von Vorhersagen erforscht.

source: The figures in this chapter are generated using such simulations in Python. If you want to do something similar in ImageJ, you can add Gaussian noise with a fixed standard deviation to any image using {menuselection}`Process --> Noise --> Add Specified Noise...`.
de: Die Abbildungen in diesem Kapitel wurden mit Hilfe solcher Simulationen in Python erstellt. Wenn Sie etwas Ähnliches in ImageJ machen wollen, können Sie Gaußsches Rauschen mit einer festen Standardabweichung zu jedem Bild hinzufügen, indem Sie {menuselection}`Process --&gt; Noise --&gt; Add Specified Noise...` verwenden.

source: If needed, you can create an empty 32-bit image with {menuselection}`File --> New --> Image...` add noise to get an image containing nothing but noise.
de: Bei Bedarf können Sie ein leeres 32-Bit-Bild mit {menuselection}`Datei --&gt; Neu --&gt; Bild...` erstellen und Rauschen hinzufügen, um ein Bild zu erhalten, das nichts als Rauschen enthält.

source: Adding & averaging noisy images
de: Hinzufügen und Mittelwertbildung verrauschter Bilder

source: {ref}`At the beginning of this chapter<sec_noise_background>`, I stated how to calculate the new standard deviation of the noise whenever two noisy pixels are added together:
de: {ref}Am Anfang dieses Kapitels<sec_noise_background> habe ich erklärt, wie man die neue Standardabweichung des Rauschens berechnet, wenn zwei verrauschte Pixel zusammengefügt werden:

source: Square the original noise standard deviation to get the variance for each pixel
de: Quadrieren Sie die Standardabweichung des ursprünglichen Rauschens, um die Varianz für jedes Pixel zu erhalten.

source: Add the variances
de: Addieren Sie die Abweichungen

source: Take the square root of the result
de: Ziehen Sie die Quadratwurzel aus dem Ergebnis

source: Suppose that we have two (independent) images with the same Gaussian noise standard deviation, let's say 5. Applying this calculation, if we add the images together then the noise standard deviation of the resulting image is
de: Angenommen, wir haben zwei (unabhängige) Bilder mit der gleichen Gaußschen Rauschstandardabweichung, sagen wir 5. Wenn wir diese Berechnung anwenden und die Bilder addieren, dann ist die Rauschstandardabweichung des resultierenden Bildes

source: \sqrt{5^2 + 5^2} = \sqrt{50} \approx 7.07
de: \sqrt{5^2 + 5^2} = \sqrt{50} \ca. 7,07

source: The noise standard deviation of the resulting image is higher.
de: Die Standardabweichung des Rauschens im resultierenden Bild ist höher.

source: We might expect that the sum of two noisy image is therefore *worse*: we have increased the noise. *However*, we need to remember that the signal is also higher: in fact, it has been doubled (because we added two similar images).
de: Man könnte also erwarten, dass die Summe zweier verrauschter Bilder *schlechter* ist: wir haben das Rauschen erhöht. *Wir müssen jedoch bedenken, dass auch das Signal höher ist: es wurde sogar verdoppelt (weil wir zwei ähnliche Bilder addiert haben).

source: If we want an output image with similar signal to the originals, we should *average* the corresponding pixel values instead of adding. In this case, averaging is the same as adding, except that we divide by two. When we do this, the noise standard deviation is also halved and becomes approximately 3.54 -- i.e. it is *lower* than in either of the original two images.
de: Wenn wir ein Ausgabebild mit einem ähnlichen Signal wie die Originale wünschen, sollten wir die entsprechenden Pixelwerte *mitteln*, anstatt sie zu addieren. In diesem Fall ist die Mittelwertbildung dasselbe wie die Addition, nur dass wir durch zwei teilen. In diesem Fall halbiert sich auch die Standardabweichung des Rauschens und beträgt etwa 3,54, d. h. sie ist *niedriger* als in den beiden Originalbildern.

source: This matters, because it implies that if we were to average two independent noisy images of the same scene with similar SNRs, we would get a result that contains _less_ noise, i.e. a higher SNR.
de: Das ist wichtig, denn es bedeutet, dass wir, wenn wir zwei unabhängige verrauschte Bilder derselben Szene mit ähnlichen SNRs mitteln würden, ein Ergebnis erhalten würden, das _weniger_ Rauschen enthält, d. h. ein höheres SNR.

source: But you shouldn't just take my word for it. We can check that it really works by using a simulation. {numref}`fig-fig_noise_sum` demonstrates this, and has a very practical implication: noise reduction by averaging images creates a better peak separation in the histogram. This means it should usually give us an image that is more amenable to thresholding.
de: Aber Sie sollten sich nicht nur auf mein Wort verlassen. Wir können überprüfen, ob es wirklich funktioniert, indem wir eine Simulation verwenden. {numref}`fig-fig_noise_sum` demonstriert dies und hat eine sehr praktische Auswirkung: Rauschunterdrückung durch Mittelung von Bildern erzeugt eine bessere Trennung der Spitzen im Histogramm. Das bedeutet, dass wir in der Regel ein Bild erhalten, das sich besser für die Schwellenwertbildung eignet.

source: Adding and averaging two independent images with Gaussian noise. Both adding and averaging give an image with an improved SNR, as can be seen in the improved separation between the histogram peaks.
de: Addition und Mittelwertbildung zweier unabhängiger Bilder mit Gaußschem Rauschen. Sowohl die Addition als auch die Mittelwertbildung ergeben ein Bild mit einem verbesserten SNR, wie an der verbesserten Trennung zwischen den Histogrammspitzen zu erkennen ist.

source: Adding & averaging within an image
de: Hinzufügen und Mittelwertbildung innerhalb eines Bildes

source: All this means that *if* can acquire the same image multiple times, then averaging our different images would give a result with reduced noise.
de: All dies bedeutet, dass *wenn* wir dasselbe Bild mehrmals aufnehmen können, die Mittelung unserer verschiedenen Bilder ein Ergebnis mit geringerem Rauschen ergeben würde.

source: Of course, we don't usually have multiple independent images of everything we might want to analyze. Instead, we just have one image. However, we can explore the idea by splitting a single image into two -- provided we are willing to sacrifice some spatial resolution.
de: Natürlich haben wir normalerweise nicht mehrere unabhängige Bilder von allem, was wir analysieren wollen. Stattdessen haben wir nur ein Bild. Wir können jedoch die Idee erforschen, indem wir ein einzelnes Bild in zwei Bilder aufteilen - vorausgesetzt, wir sind bereit, etwas räumliche Auflösung zu opfern.
