Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: de

source: Yet if you remain unconvinced that the noise standard deviation can get bigger while the situation gets better, the following specific example might help. Suppose the true signal for a pixel is 4 photons. Assuming the actual measured value is within one noise standard deviation of the proper result (which it will be, about 68% of the time), one expects it to be in the range 2–6. The true signal at another pixel is twice as strong -- 8 photons -- and, by the same argument, one expects to measure a value in the range 5–11. _The ranges for both pixels overlap!_ With photon counts this low, even if one pixel has twice the value of another, we often cannot discern with confidence that the *true*, noise-free value for both pixels would be different at all.
de: Wenn Sie jedoch immer noch nicht überzeugt sind, dass die Standardabweichung des Rauschens größer werden kann, während die Situation besser wird, hilft Ihnen vielleicht das folgende konkrete Beispiel. Angenommen, das wahre Signal für ein Pixel beträgt 4 Photonen. Unter der Annahme, dass der tatsächlich gemessene Wert innerhalb einer Rauschstandardabweichung des richtigen Ergebnisses liegt (was in etwa 68 % der Fälle der Fall sein wird), erwartet man, dass er im Bereich von 2-6 liegt. Das tatsächliche Signal an einem anderen Pixel ist doppelt so stark - 8 Photonen - und mit dem gleichen Argument erwartet man einen Wert im Bereich 5-11 zu messen. Bei derart niedrigen Photonenzahlen können wir, selbst wenn ein Pixel den doppelten Wert eines anderen hat, oft nicht mit Sicherheit feststellen, dass der *wahre*, rauschfreie Wert für beide Pixel unterschiedlich ist.

source: On the other hand, suppose the true signal for the first pixel is 100 photons, so we measure something in the range of 90–110. The second pixel, still twice as bright, gives a measurement in the range 186–214. These ranges are larger, but crucially they are not even close to overlapping, so it's very easy to tell the pixels apart. Thus the noise standard deviation alone is not a very good measure of how noisy an image is. The SNR is much more informative: the simple rule is that higher is better. Or, if that still does not feel right, you can turn it upside down and consider the noise-to-signal ratio (the _relative noise_), in which case lower is better ({numref}`fig-snr_plot`).
de: Nehmen wir andererseits an, das tatsächliche Signal für das erste Pixel beträgt 100 Photonen, so dass wir etwas im Bereich von 90-110 messen. Das zweite Pixel, das immer noch doppelt so hell ist, ergibt eine Messung im Bereich von 186-214. Diese Bereiche sind zwar größer, aber sie überschneiden sich nicht einmal annähernd, so dass es sehr einfach ist, die Pixel voneinander zu unterscheiden. Daher ist die Standardabweichung des Rauschens allein kein gutes Maß dafür, wie verrauscht ein Bild ist. Das SNR ist viel aussagekräftiger: Die einfache Regel lautet: Je höher, desto besser. Wenn Ihnen das immer noch nicht passt, können Sie es auch auf den Kopf stellen und das Verhältnis von Rauschen zu Signal (das _relative Rauschen_) betrachten. In diesem Fall ist ein niedrigerer Wert besser ({numref}`fig-snr_plot`).

source: For Poisson noise, the standard deviation increases with the square root of the signal. So does the SNR, with the result that plots (A) and (B) look identical. This improvement in SNR despite the growing noise occurs because the signal is increasing faster than the noise, and so the noise is relatively smaller. Plotting the relative noise (1/SNR) shows this effect \(C).
de: Bei Poisson-Rauschen steigt die Standardabweichung mit der Quadratwurzel des Signals. Dies gilt auch für das SNR, so dass die Diagramme (A) und (B) identisch aussehen. Diese Verbesserung des SNR trotz des zunehmenden Rauschens ist darauf zurückzuführen, dass das Signal schneller zunimmt als das Rauschen, so dass das Rauschen relativ kleiner ist. Die Darstellung des relativen Rauschens (1/SNR) zeigt diesen Effekt \(C).

source: Poisson noise & detection
de: Poisson-Rauschen und Erkennung

source: So why should you care that photon noise is signal-dependent?
de: Warum sollte es Sie also interessieren, dass das Photonenrauschen signalabhängig ist?

source: One reason is that it can make features of identical sizes and brightnesses easier or harder to detect in an image purely because of the local background. This is illustrated in {numref}`fig-poisson_ramp`.
de: Ein Grund dafür ist, dass Merkmale gleicher Größe und Helligkeit in einem Bild allein aufgrund des lokalen Hintergrunds leichter oder schwerer zu erkennen sein können. Dies wird in {numref}`fig-poisson_ramp` veranschaulicht.

source: The signal-dependence of Poisson noise affects how visible (and therefore detectable) structures are in an image. (A) Nine spots of the same _absolute_ brightness are added to an image with a linearly increasing background _(top)_ and Poisson noise is added _(bottom)_. Because the noise variability becomes higher as the background increases, the spots in the darkest part of the image can be clearly seen in the profile but it's more difficult to discern spots in the brighter part. (B) Spots of the same brightness _relative_ to the background are added, along with Poisson noise. Because the noise is now relatively lower as the brightness increases, only the spots in the brightest part of the image can be seen, while those in the darker part are buried within the noise.
de: Die Signalabhängigkeit des Poisson-Rauschens beeinflusst die Sichtbarkeit (und damit die Erkennbarkeit) von Strukturen in einem Bild. (A) Neun Flecken mit der gleichen _absoluten_ Helligkeit werden zu einem Bild mit linear ansteigendem Hintergrund _(oben)_ hinzugefügt und Poisson-Rauschen wird hinzugefügt _(unten)_. Da die Rauschvariabilität mit zunehmendem Hintergrund größer wird, sind die Flecken im dunkelsten Teil des Bildes im Profil deutlich zu erkennen, während es schwieriger ist, Flecken im helleren Teil zu erkennen. (B) Flecken mit der gleichen Helligkeit _relativ_ zum Hintergrund werden zusammen mit Poisson-Rauschen hinzugefügt. Da das Rauschen nun mit zunehmender Helligkeit relativ gering ist, sind nur die Flecken im hellsten Teil des Bildes zu sehen, während die Flecken im dunkleren Teil unter dem Rauschen verborgen sind.

source: In general, if we want to see a fluorescence increase of a fixed number of photons, this is easier to do if the background is very dark. But if the fluorescence increase is defined _relative_ to the background, it will be much easier to identify if the background is high. Either way, when attempting to determine the number of any small structures in an image, for example, we need to remember that the numbers we will be able to detect will be affected by the background nearby. Therefore results obtained from bright and dark regions might not be directly comparable.
de: Im Allgemeinen ist es einfacher, eine Fluoreszenzzunahme bei einer bestimmten Anzahl von Photonen zu erkennen, wenn der Hintergrund sehr dunkel ist. Wenn die Fluoreszenzzunahme jedoch _relativ_ zum Hintergrund definiert wird, ist es viel einfacher zu erkennen, wenn der Hintergrund hoch ist. In jedem Fall müssen wir bei dem Versuch, die Anzahl kleiner Strukturen in einem Bild zu bestimmen, bedenken, dass die Anzahl, die wir erkennen können, durch den nahen Hintergrund beeinflusst wird. Daher sind die Ergebnisse aus hellen und dunklen Regionen möglicherweise nicht direkt vergleichbar.

source: Practical
de: Praktisch

source: Open the images *mystery_noise_1.tif* and *mystery_noise_2.tif* in ImageJ.
de: Öffnen Sie die Bilder *mystery_noise_1.tif* und *mystery_noise_2.tif* in ImageJ.

source: Both are noisy, but in one the noise follows a Gaussian distribution (like read noise) and in the other it follows a Poisson distribution (like photon noise). Which is which?
de: Beide sind verrauscht, aber in einem Fall folgt das Rauschen einer Gauß-Verteilung (wie Leserauschen) und im anderen Fall einer Poisson-Verteilung (wie Photonenrauschen). Welches ist welches?

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_1.tif&open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_2.tif)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_1.tif&amp;open=https://github.com/bioimagebook/practical-data/blob/main/images/mystery_noise_2.tif)

source: launch ImageJ.JS
de: ImageJ.JS starten

source: Solution
de: Lösung

source: The noise in *mystery_noise_1.tif* is Gaussian; the noise in *mystery_noise_2.tif* follows a Poisson distribution. Since there are reasonably flat regions within the cell and background, I would test this by drawing a ROI within each and measuring the standard deviations. Where these are similar, the noise is Gaussian; if there is a big difference, the noise is likely to be Poisson.
de: Das Rauschen in *mystery_noise_1.tif* ist gaußförmig; das Rauschen in *mystery_noise_2.tif* folgt einer Poisson-Verteilung. Da es innerhalb der Zelle und des Hintergrunds relativ flache Bereiche gibt, würde ich dies testen, indem ich in jedem Bereich eine ROI zeichne und die Standardabweichungen messe. Wenn diese ähnlich sind, ist das Rauschen gaußförmig; wenn es einen großen Unterschied gibt, ist das Rauschen wahrscheinlich poissonförmig.

source: If no flat regions were available, I would try applying a gradient filter with the coefficients `-1 1 0`, and inspecting the results. Alternatively, I might try plotting a fluorescence profile or subtracting a very slightly smoothed version of each image.
de: Wenn keine flachen Bereiche zur Verfügung stehen, würde ich versuchen, einen Verlaufsfilter mit den Koeffizienten `-1 1 0` anzuwenden und die Ergebnisse zu prüfen. Alternativ könnte ich versuchen, ein Fluoreszenzprofil zu erstellen oder eine sehr leicht geglättete Version der einzelnen Bilder zu subtrahieren.

source: Combining noise sources
de: Kombination von Lärmquellen

source: Combining our noise sources then, we can imagine an actual pixel value as being the sum of three values: the true rate of photon emission, the photon noise component, and the read noise component [^fn_5]. The first of these is what we want, while the latter two are random numbers that may be positive or negative.
de: Wenn wir unsere Rauschquellen kombinieren, können wir uns vorstellen, dass ein tatsächlicher Pixelwert die Summe dreier Werte ist: die wahre Rate der Photonenemission, die Photonenrauschkomponente und die Leserauschkomponente [^fn_5]. Der erste Wert ist das, was wir wollen, während die beiden letzteren Zufallszahlen sind, die positiv oder negativ sein können.

source: An illustration of how photon noise differs from read noise. When both are added to a signal (here, a series of steps in which the value doubles at each higher step), the relative importance of each depends upon the value of the signal. At low signal levels this doubling is very difficult to discern amidst either type of noise, and even more so when both noise components are present.
de: Eine Veranschaulichung des Unterschieds zwischen Photonenrauschen und Leserauschen. Wenn beide zu einem Signal addiert werden (hier eine Reihe von Schritten, bei denen sich der Wert bei jedem höheren Schritt verdoppelt), hängt die relative Bedeutung der beiden Komponenten vom Wert des Signals ab. Bei niedrigen Signalpegeln ist diese Verdopplung inmitten eines der beiden Rauscharten nur sehr schwer zu erkennen, und noch schwerer, wenn beide Rauschkomponenten vorhanden sind.

source: This is illustrated in {numref}`fig-noise_steps` using a simple 1D signal consisting of a series of steps. Random values are added to this to simulate photon and read noise. Whenever the signal is very low (indicating few photons), the variability in the photon noise is very low -- but high _relative_ to the signal (B)! This variability increases when the signal increases. However, in the read noise case \(C), the variability is similar everywhere. When both noise types are combined in (D), the read noise dominates completely when there are few photons, but has very little impact whenever the signal increases. Photon noise has already made detecting relative differences in brightness difficult when there are few photons; with read noise, it can become hopeless.
de: Dies wird in {numref}`fig-noise_steps` anhand eines einfachen 1D-Signals dargestellt, das aus einer Reihe von Schritten besteht. Diesem werden Zufallswerte hinzugefügt, um Photonen- und Leserauschen zu simulieren. Immer wenn das Signal sehr niedrig ist (was auf wenige Photonen hinweist), ist die Variabilität des Photonenrauschens sehr niedrig - aber hoch _relativ_ zum Signal (B)! Diese Variabilität nimmt zu, wenn das Signal zunimmt. Im Fall des Leserauschens \(C) ist die Variabilität jedoch überall ähnlich. Wenn beide Rauscharten in (D) kombiniert werden, dominiert das Ausleserauschen vollständig, wenn nur wenige Photonen vorhanden sind, hat aber nur sehr geringe Auswirkungen, wenn das Signal zunimmt. Das Photonenrauschen hat die Erkennung von relativen Helligkeitsunterschieden bereits bei wenigen Photonen erschwert; mit dem Ausleserauschen kann es hoffnungslos werden.

source: Therefore overcoming read noise is critical for low-light imaging, and the choice of detector is extremely important (see {ref}`chap_microscope_types`). But, where possible, detecting more photons is an _extremely_ good thing anyway, since it helps to overcome _both_ types of noise.
de: Daher ist die Überwindung des Ausleserauschens entscheidend für die Bildgebung bei schwachem Licht, und die Wahl des Detektors ist extrem wichtig (siehe {ref}`chap_microscope_types`). Wo es möglich ist, ist die Erkennung von mehr Photonen ohnehin eine _extrem_ gute Sache, da sie hilft, _beide_ Arten von Rauschen zu überwinden.

source: Other noise sources
de: Andere Lärmquellen

source: Photon and read noise are the main sources of noise that need to be considered when designing and carrying out an experiment. One other source often mentioned in the literature is _dark noise_, which can be thought of as arising when a wayward electron causes the detector to register a photon even when there was not actually one there. In very low-light images, this lead to spurious bright pixels. However, dark noise is less likely to cause problems if many true photons are detected, and many detectors reduce its occurrence by cooling the sensor.
de: Photonen- und Ausleserauschen sind die wichtigsten Rauschquellen, die bei der Planung und Durchführung eines Experiments berücksichtigt werden müssen. Eine weitere, in der Literatur häufig erwähnte Quelle ist das _Dunkelrauschen_, das entsteht, wenn ein verirrtes Elektron den Detektor veranlasst, ein Photon zu registrieren, auch wenn eigentlich kein Photon vorhanden war. Bei sehr lichtschwachen Bildern führt dies zu ungewollt hellen Pixeln. Das Dunkelrauschen ist jedoch weniger problematisch, wenn viele echte Photonen erfasst werden, und viele Detektoren verringern sein Auftreten durch Kühlung des Sensors.

source: If the equipment is functioning properly, other noise sources could probably not be distinguished from these three. Nevertheless, brave souls who wish to know more may find a concise, highly informative, list of more than 40 sources of imprecision in _The 39 steps: a cautionary tale of quantitative 3-D fluorescence microscopy_ by James Pawley (available online from various sources).
de: Wenn die Ausrüstung ordnungsgemäß funktioniert, können andere Rauschquellen wahrscheinlich nicht von diesen drei unterschieden werden. Mutige, die mehr wissen wollen, finden jedoch eine kurze, sehr informative Liste von mehr als 40 Quellen für Ungenauigkeiten in _The 39 steps: a cautionary tale of quantitative 3-D fluorescence microscopy_ von James Pawley (online bei verschiedenen Quellen erhältlich).

source: Suppose you have an image that does not contain much light, but has some isolated bright pixels.
de: Nehmen wir an, Sie haben ein Bild, das nicht viel Licht enthält, aber einige isolierte helle Pixel.

source: Which kind of filter could you use to remove them? And is it safe to assume they are due to dark noise or something similar, or might the pixels correspond to actual bright structures?
de: Welche Art von Filter könnten Sie verwenden, um sie zu entfernen? Und kann man davon ausgehen, dass sie auf dunkles Rauschen oder ähnliches zurückzuführen sind, oder könnten die Pixel tatsächlich hellen Strukturen entsprechen?

source: A median filter is a popular choice for removing isolated bright pixels, although when using ImageJ I sometimes prefer {menuselection}`Process --> Noise --> Remove Outliers...` because this only puts the median-filtered output in the image if the original value was really extreme (according to some user-defined threshold). This then preserves the independence of the noise at all other pixels -- so it still behaves reliably and predictably like Poisson + Gaussian noise. We can reduce the remaining noise with a Gaussian filter if necessary.
de: Ein Median-Filter ist eine beliebte Wahl, um isolierte helle Pixel zu entfernen, obwohl ich bei der Verwendung von ImageJ manchmal {menuselection}`Process --&gt; Noise --&gt; Remove Outliers...` bevorzuge, weil dies nur den Median-gefilterten Output in das Bild einfügt, wenn der ursprüngliche Wert wirklich extrem war (gemäß einem benutzerdefinierten Schwellenwert). Dadurch bleibt die Unabhängigkeit des Rauschens an allen anderen Pixeln erhalten - es verhält sich also immer noch zuverlässig und vorhersehbar wie Poisson + Gaußsches Rauschen. Wir können das verbleibende Rauschen bei Bedarf mit einem Gauß-Filter reduzieren.

source: Assuming that the size of a pixel is smaller than the PSF (which is usually the case in microscopy), it's a good idea to remove these outliers. They _cannot_ be real structures, because any real structure would have to extend over a region at least as large as the PSF. However if the pixel size is very large, then we may not be able to rule out that the 'outliers' are caused by some real, bright structures.
de: Unter der Annahme, dass die Größe eines Pixels kleiner ist als die PSF (was in der Mikroskopie normalerweise der Fall ist), ist es eine gute Idee, diese Ausreißer zu entfernen. Es kann sich nicht um echte Strukturen handeln, denn jede echte Struktur müsste sich über einen Bereich erstrecken, der mindestens so groß ist wie die PSF. Wenn die Pixelgröße jedoch sehr groß ist, können wir möglicherweise nicht ausschließen, dass die "Ausreißer" durch echte, helle Strukturen verursacht werden.

source: Finding photons
de: Die Suche nach Photonen

source: There are various places from which the extra photons required to overcome noise might come. One is to simply acquire images more slowly, spending more time detecting light. If this is too harsh on the sample, it may be possible to record multiple images quickly. If there is little movement between exposures, these images could be added or averaged to get a similar effect ({numref}`fig-noise_averaging`).
de: Die zusätzlichen Photonen, die zur Überwindung des Rauschens benötigt werden, können aus verschiedenen Quellen stammen. Eine Möglichkeit besteht darin, die Bilder einfach langsamer aufzunehmen und mehr Zeit für die Lichterfassung zu verwenden. Wenn dies für die Probe zu anstrengend ist, kann man auch mehrere Bilder schnell aufnehmen. Wenn sich zwischen den Aufnahmen wenig bewegt, können diese Bilder addiert oder gemittelt werden, um einen ähnlichen Effekt zu erzielen ({numref}`fig-noise_averaging`).

source: The effect of adding (or averaging) multiple noisy images, each independent with a similar SNR.
de: Die Auswirkung der Addition (oder Mittelung) mehrerer verrauschter Bilder, die jeweils unabhängig voneinander einen ähnlichen SNR aufweisen.

source: An alternative would be to increase the pixel size, so that each pixel incorporates photons from larger regions -- although clearly this comes at a cost in spatial information. One way to do this is though [binning](sec_detectors_binning).
de: Eine Alternative wäre, die Pixelgröße zu erhöhen, so dass jedes Pixel Photonen aus größeren Regionen aufnimmt - obwohl dies natürlich mit einem Verlust an räumlicher Information einhergeht. Eine Möglichkeit, dies zu tun, ist [binning](sec_detectors_binning).

source: However, noise cannot be completely eliminated during acquisition. Understanding its behavior, and especially how [filters](chap_filters) can reduce it, can help us cope with it during analysis.
de: Das Rauschen kann jedoch während der Erfassung nicht vollständig eliminiert werden. Wenn wir sein Verhalten verstehen und vor allem wissen, wie [filters](chap_filters) es reduzieren kann, können wir es bei der Analyse besser bewältigen.

source: Nyquist sampling & choosing a pixel size
de: Nyquist-Abtastung und Auswahl einer Pixelgröße

source: Small pixels are needed to see detail, but also reduce the number of photons per pixel and thereby increase noise. However, {ref}`chap_formation_spatial` has already argued that ultimately it's not pixel size, but rather the PSF that limits spatial resolution -- which suggests that there is a minimum pixel size below which nothing is gained, and the only result is that more noise is added.
de: Kleine Pixel sind notwendig, um Details zu erkennen, verringern aber auch die Anzahl der Photonen pro Pixel und erhöhen damit das Rauschen. {ref} `chap_formation_spatial` hat jedoch bereits argumentiert, dass letztlich nicht die Pixelgröße, sondern die PSF die räumliche Auflösung begrenzt - was darauf hindeutet, dass es eine Mindestpixelgröße gibt, unterhalb derer nichts gewonnen wird, und das einzige Ergebnis ist, dass mehr Rauschen hinzugefügt wird.

source: This size can be determined based upon knowledge of the PSF and the **Nyquist-Shannon sampling theorem** ({numref}`fig-nyquist_shannon`). Images acquired with this pixel size are said to be **Nyquist sampled** (although see Alvy Ray Smith's epic *A Biography of the Pixel* for the case why credit for the sampling theorem really belongs to **Vladimir Kotelnikov**).
de: Diese Größe kann auf der Grundlage der Kenntnis der PSF und des **Nyquist-Shannon-Sampling-Theorems** ({numref}`fig-nyquist_shannon`) bestimmt werden. Bilder, die mit dieser Pixelgröße aufgenommen wurden, gelten als **Nyquist-abgetastet** (siehe jedoch Alvy Ray Smiths Epos *A Biography of the Pixel*, in dem erläutert wird, warum der Verdienst für das Abtasttheorem eigentlich **Vladimir Kotelnikov** zukommt).

source: The easiest way I know to determine the corresponding pixel size for a given experiment is to use the online calculator provided by *Scientific Volume Imaging* at https://svi.nl/NyquistCalculator. You may need larger pixels to reduce noise or see a wider field of view, but you do not get anything extra by using smaller pixels.
de: Die einfachste Methode, die ich kenne, um die entsprechende Pixelgröße für ein bestimmtes Experiment zu bestimmen, ist die Verwendung des Online-Rechners von *Scientific Volume Imaging* unter https://svi.nl/NyquistCalculator. Möglicherweise benötigen Sie größere Pixel, um das Rauschen zu reduzieren oder ein breiteres Sichtfeld zu erhalten, aber Sie erhalten keinen zusätzlichen Nutzen, wenn Sie kleinere Pixel verwenden.
