Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: de

source: If we take the pixels from every second column of the image, we can extract these and combine them to form another image that looks like a squished version of the original. We can do the same process for all the columns we skipped -- thereby giving us two squished images, one from the even-numbered columns and one from the odd-numbered columns.
de: Wenn wir die Pixel aus jeder zweiten Spalte des Bildes nehmen, können wir diese extrahieren und zu einem anderen Bild kombinieren, das wie eine verkleinerte Version des Originals aussieht. Wir können den gleichen Prozess für alle übersprungenen Spalten durchführen - so erhalten wir zwei verkleinerte Bilder, eines aus den geraden und eines aus den ungeraden Spalten.

source: You can see in Figure {numref}`fig-fig_noise_split` that our squished images do look almost identical, because adjacent pixels usually do have very similar values -- apart from the differences caused by noise. If we average these images together, these differences average out and we have another similar-looking image -- but with reduced noise.
de: In Abbildung {numref}`fig-fig_noise_split` können Sie sehen, dass unsere gequetschten Bilder fast identisch aussehen, weil benachbarte Pixel normalerweise sehr ähnliche Werte haben - abgesehen von den durch das Rauschen verursachten Unterschieden. Wenn wir diese Bilder zusammen mitteln, gleichen sich diese Unterschiede aus und wir erhalten ein weiteres, ähnlich aussehendes Bild - aber mit weniger Rauschen.

source: Creating two images from one by taking even and odd-numbered columns. If we then average our two images, noise is reduced. The difference is subtle, but can be seen in the better separation of the peaks in the histogram.
de: Aus einem Bild werden zwei Bilder erstellt, indem gerade und ungerade Spalten genommen werden. Wenn wir dann den Durchschnitt unserer beiden Bilder bilden, wird das Rauschen reduziert. Der Unterschied ist subtil, lässt sich aber an der besseren Trennung der Spitzen im Histogramm erkennen.

source: Of course, this trick has an obvious downside: the squishing is undesirable. Fortunately, we can avoid it simply by averaging adjacent columns but not splitting them into separate image. Then we can do the same with adjacent rows. And perhaps even adjacent diagonals, if we wish.
de: Natürlich hat dieser Trick eine offensichtliche Kehrseite: Die Quetschung ist unerwünscht. Glücklicherweise können wir dies vermeiden, indem wir benachbarte Spalten mitteln, ohne sie in ein separates Bild aufzuteilen. Dann können wir dasselbe mit benachbarten Zeilen tun. Und vielleicht sogar mit benachbarten Diagonalen, wenn wir wollen.

source: This is *precisely* the idea underlying our use of a [3×3 mean filter to reduce noise](chap_filters): we don't have independent images to average, so we average within an image instead ({numref}`fig-noise_filt_averaging`).
de: Dies ist *genau* die Idee, die unserer Verwendung eines [3×3 Mittelwertfilters zur Rauschunterdrückung] (chap_filters) zugrunde liegt: wir haben keine unabhängigen Bilder, die wir mitteln können, also mitteln wir stattdessen innerhalb eines Bildes ({numref}`fig-noise_filt_averaging`).

source: Noise reduction by averaging adjacent pixels. Even though the overall appearance of the image has not changed much, the histograms indicate a much bigger separation of the foreground and background -- meaning that thresholds are more likely to work well. In (C), the result is equivalent to applying a 3×3 mean filter.
de: Rauschunterdrückung durch Mittelwertbildung benachbarter Pixel. Obwohl sich das Gesamterscheinungsbild des Bildes nicht wesentlich verändert hat, zeigen die Histogramme eine viel stärkere Trennung von Vorder- und Hintergrund an, was bedeutet, dass die Schwellenwerte mit größerer Wahrscheinlichkeit gut funktionieren. In (C) ist das Ergebnis gleichbedeutend mit der Anwendung eines 3×3 Mittelwertfilters.

source: Hopefully this discussion helps build your intuition as to *why* filters are able to reduce Gaussian noise. In the next section, we'll see how many of the same ideas apply to Poisson noise as well.
de: Wir hoffen, dass diese Diskussion dazu beiträgt, ein Gefühl dafür zu entwickeln, *warum* Filter in der Lage sind, Gaußsches Rauschen zu reduzieren. Im nächsten Abschnitt werden wir sehen, wie viele der gleichen Ideen auch für Poisson-Rauschen gelten.

source: Poisson noise
de: Poisson-Rauschen

source: In 1898, Ladislaus Bortkiewicz published a book entitled _The Law of Small Numbers_. Among other things, it included a now-famous analysis of the number of soldiers in different corps of the Prussian cavalry who were killed by being kicked by a horse, measured over a 20-year period. Specifically, he showed that these numbers follows a **Poisson distribution**.
de: Im Jahr 1898 veröffentlichte Ladislaus Bortkiewicz ein Buch mit dem Titel _The Law of Small Numbers_. Es enthielt unter anderem eine berühmt gewordene Analyse der Anzahl der Soldaten in verschiedenen Korps der preußischen Kavallerie, die durch einen Pferdetritt getötet wurden, gemessen über einen Zeitraum von 20 Jahren. Konkret zeigte er, dass diese Zahlen einer **Poisson-Verteilung** folgen.

source: This distribution, introduced by Siméon Denis Poisson in 1838, gives the probability of an event happening a certain number of times, given that we know (1) the average rate at which it occurs, and (2) that all of its occurrences are independent. However, the usefulness of the Poisson distribution extends far beyond gruesome military analysis to many, quite different applications -- including the probability of photon emission, which is itself inherently random.
de: Diese von Siméon Denis Poisson im Jahr 1838 eingeführte Verteilung gibt die Wahrscheinlichkeit an, dass ein Ereignis eine bestimmte Anzahl von Malen eintritt, vorausgesetzt, wir kennen (1) die durchschnittliche Häufigkeit, mit der es eintritt, und (2) dass alle Ereignisse unabhängig sind. Die Nützlichkeit der Poisson-Verteilung geht jedoch weit über die grausame militärische Analyse hinaus und erstreckt sich auf viele, ganz andere Anwendungen - einschließlich der Wahrscheinlichkeit der Photonenemission, die selbst von Natur aus zufällig ist.

source: Siméon Denis Poisson and his distribution. (A) Poisson is said to have been extremely clumsy and uncoordinated with his hands. This contributed to him giving up an apprenticeship as a surgeon and entering mathematics, where the problem was less debilitating -- although apparently this meant his diagrams tended not to very well drawn (see https://mathshistory.st-andrews.ac.uk/Biographies/Poisson/). (B) The 'Probability Mass Function' of the Poisson distribution for several different values of λ. This allows one to see for any 'true signal' λ the probability of actually counting any actual value k. Although it's more likely that one will count exactly k = λ than any other possible k, as λ increases the probability of getting precisely this value becomes smaller and smaller.
de: Siméon Denis Poisson und seine Verteilung. (A) Poisson soll extrem ungeschickt und unkoordiniert mit seinen Händen gewesen sein. Dies trug dazu bei, dass er seine Ausbildung zum Chirurgen aufgab und sich der Mathematik zuwandte, wo das Problem weniger lästig war - auch wenn dies offenbar dazu führte, dass seine Diagramme nicht sehr gut gezeichnet waren (siehe https://mathshistory.st-andrews.ac.uk/Biographies/Poisson/). (B) Die "Wahrscheinlichkeits-Masse-Funktion" der Poisson-Verteilung für verschiedene Werte von λ. Daraus lässt sich für jedes "wahre Signal" λ die Wahrscheinlichkeit ablesen, dass tatsächlich ein beliebiger Wert k gezählt wird. Obwohl es wahrscheinlicher ist, dass genau k = λ gezählt wird als jedes andere mögliche k, wird die Wahrscheinlichkeit, genau diesen Wert zu erhalten, mit zunehmendem λ immer geringer.

source: Suppose that, on average, a single photon will be emitted from some part of a fluorescing sample within a particular time interval. The randomness entails that we cannot say for sure what will happen on any one occasion when we look; sometimes one photon will be emitted, sometimes none, sometimes two, occasionally even more. What we are really interested in, therefore, is not precisely _how many_ photons are emitted, which varies every time we look, but rather the _rate_ at which they would be emitted under fixed conditions, which is a constant. The difference between the number of photons actually emitted and the true rate of emission is the **photon noise**. The trouble is that keeping the conditions fixed might not be possible: leaving us with the problem of trying to figure out rates from single, noisy measurements.
de: Nehmen wir an, dass im Durchschnitt ein einziges Photon von einem Teil einer fluoreszierenden Probe innerhalb eines bestimmten Zeitintervalls emittiert wird. Die Zufälligkeit bringt es mit sich, dass wir nicht mit Sicherheit sagen können, was bei einer bestimmten Gelegenheit passieren wird, wenn wir hinschauen; manchmal wird ein Photon emittiert, manchmal keines, manchmal zwei, manchmal sogar mehr. Was uns also wirklich interessiert, ist nicht die genaue _Anzahl_ der emittierten Photonen, die jedes Mal, wenn wir hinschauen, variiert, sondern die _Rate_, mit der sie unter festen Bedingungen emittiert würden, die eine Konstante ist. Die Differenz zwischen der Anzahl der tatsächlich emittierten Photonen und der tatsächlichen Emissionsrate ist das **Photonenrauschen**. Das Problem besteht darin, dass es möglicherweise nicht möglich ist, die Bedingungen konstant zu halten, so dass wir vor dem Problem stehen, die Raten aus einzelnen, verrauschten Messungen zu ermitteln.

source: Signal-dependent noise
de: Signalabhängiges Rauschen

source: Clearly, since it's a rate that we want, we could get that with more accuracy if we averaged many observations: just like with Gaussian noise, averaging reduces photon noise. Therefore, we can expect smoothing filters to work similarly for both noise types -- and they do.
de: Da es sich um eine gewünschte Rate handelt, könnten wir diese mit größerer Genauigkeit erhalten, wenn wir viele Beobachtungen mitteln würden: Genau wie beim Gaußschen Rauschen reduziert die Mittelung das Photonenrauschen. Daher können wir erwarten, dass Glättungsfilter für beide Rauscharten ähnlich funktionieren - und das tun sie auch.

source: The primary distinction between the noise types, however, is that Poisson noise is **signal-dependent**, and _does_ change according to the number of emitted (or detected) photons. Fortunately, the relationship is simple: if the rate of photon emission is $\lambda$, the noise variance is also $\lambda$, and the noise standard deviation is $\sqrt{\lambda}$.
de: Der Hauptunterschied zwischen den beiden Rauscharten besteht jedoch darin, dass das Poisson-Rauschen **signalabhängig** ist und sich entsprechend der Anzahl der emittierten (oder detektierten) Photonen ändert. Glücklicherweise ist die Beziehung einfach: Wenn die Rate der Photonenemission $\lambda$ beträgt, ist auch die Rauschvarianz $\lambda$, und die Standardabweichung des Rauschens ist $\sqrt{\lambda}$.

source: This is not really as unexpected as it might first seem (see {numref}`fig-fishing`). It can even be observed from a very close inspection of {numref}`fig-noise_neuron`, in which the increased variability in the neuron causes its ghostly appearance even in an image that ought to consist (almost) exclusively of noise.
de: Dies ist nicht wirklich so unerwartet, wie es zunächst scheinen mag (siehe {numref}`fig-fishing`). Es kann sogar bei einer sehr genauen Betrachtung von {numref}`fig-noise_neuron` beobachtet werden, bei der die erhöhte Variabilität des Neurons sein geisterhaftes Aussehen selbst in einem Bild verursacht, das (fast) ausschließlich aus Rauschen bestehen sollte.

source: __'The standard deviation of photon noise is equal to the square root of the expected value.'__ To understand this better, it may help to imagine a fisherman, fishing many times at the same location and under the same conditions. If he catches 10 fish on average, it would be quite reasonable to catch 7 or 13 on any one day -- while 20 would be exceptional. If, however, he caught 100 on average, then it would be unexceptional if he caught 90 or 110 on a particular day, although catching only 10 would be strange (and presumably disappointing). Intuitively, the range of values that would be considered likely is related to the expected value. If nothing else, this imperfect analogy may at least help remember the name of the distribution that photon noise follows.
de: Die Standardabweichung des Photonenrauschens ist gleich der Quadratwurzel aus dem Erwartungswert. Um dies besser zu verstehen, kann es hilfreich sein, sich einen Fischer vorzustellen, der viele Male am selben Ort und unter denselben Bedingungen fischt. Wenn er im Durchschnitt 10 Fische fängt, wäre es durchaus vertretbar, an einem Tag 7 oder 13 zu fangen, während 20 eine Ausnahme darstellen würden. Wenn er jedoch im Durchschnitt 100 Fische fängt, dann wäre es nicht außergewöhnlich, wenn er an einem bestimmten Tag 90 oder 110 fängt, obwohl es seltsam (und vermutlich enttäuschend) wäre, wenn er nur 10 fängt. Intuitiv hängt die Bandbreite der Werte, die als wahrscheinlich angesehen werden, mit dem erwarteten Wert zusammen. Zumindest kann diese unvollkommene Analogie helfen, sich an den Namen der Verteilung zu erinnern, der das Photonenrauschen folgt.

source: A demonstration that Poisson noise changes throughout an image. (A) Part of a fluorescence microscopy image. (B) A Gaussian filtered version of (A) using a very small filter ($\sigma$=0.25). Gaussian filtering reduces the noise in an image by replacing each pixel with a weighted average of neighboring pixels (see {ref}`chap_filters`). \(C) The difference between the original and filtered image contains the noise that the filtering removed. The brighter areas in the original image are still visible in this 'noise image' as regions of increased variability. This is partly an effect of Poisson noise having made the noise standard deviation larger in the brighter parts of the acquired image.
de: Eine Demonstration, dass sich das Poisson-Rauschen im Verlauf eines Bildes verändert. (A) Teil eines Fluoreszenzmikroskopie-Bildes. (B) Eine Gauß-gefilterte Version von (A) mit einem sehr kleinen Filter ($\sigma$=0,25). Die Gaußsche Filterung reduziert das Rauschen in einem Bild, indem jedes Pixel durch einen gewichteten Durchschnitt der benachbarten Pixel ersetzt wird (siehe {ref}`chap_filters`). \(C) Die Differenz zwischen dem Originalbild und dem gefilterten Bild enthält das Rauschen, das durch die Filterung entfernt wurde. Die helleren Bereiche im Originalbild sind in diesem "Rauschbild" immer noch als Regionen mit erhöhter Variabilität sichtbar. Dies ist teilweise ein Effekt des Poisson-Rauschens, das die Standardabweichung des Rauschens in den helleren Teilen des aufgenommenen Bildes vergrößert hat.

source: The formula for the probability mass function of the Poisson distribution is:
de: Die Formel für die Massenwahrscheinlichkeitsfunktion der Poisson-Verteilung lautet:

source: where
de: wobei

source: $\lambda$ is the mean rate of occurrence of the event (i.e. the noise-free photon emission rate we want)
de: $\lambda$ ist die mittlere Häufigkeit des Ereignisses (d. h. die gewünschte rauschfreie Photonenemissionsrate)

source: $k$ is an actual number of occurrences for which we want to compute the probability
de: $k$ ist eine tatsächliche Anzahl von Ereignissen, für die wir die Wahrscheinlichkeit berechnen wollen

source: $k!$ is the _factorial_ of $k$ (i.e. $k \times (k-1) \times (k-2) \times ... \times 1$)
de: $k!$ ist das _Faktorielle_ von $k$ (d.h. $k \mal (k-1) \mal (k-2) \mal ... \mal 1$)

source: So if you know that the rate of photon emission is 0.5, for example, you can put $\lambda = 0.5$ into the equation and determine the probability of getting any particular (integer) value of $k$ photons. Applying this, the probability of not detecting any photons ($k = 0$) is 0.6065, while the probability of detecting a single photon ($k = 1$) is $0.3033$.
de: Wenn man also weiß, dass die Photonenemissionsrate beispielsweise 0,5 beträgt, kann man $\lambda = 0,5$ in die Gleichung einsetzen und die Wahrscheinlichkeit bestimmen, einen bestimmten (ganzzahligen) Wert von $k$ Photonen zu erhalten. Die Wahrscheinlichkeit, kein einziges Photon zu entdecken ($k = 0$), beträgt demnach 0,6065, während die Wahrscheinlichkeit, ein einziges Photon zu entdecken ($k = 1$), $0,3033$ beträgt.

source: What we know for sure is that we can't possibly detect 0.5 photons: we'll get an integer value, not 'part of a photon'.
de: Was wir mit Sicherheit wissen, ist, dass wir unmöglich 0,5 Photonen nachweisen können: Wir erhalten einen ganzzahligen Wert, nicht den "Teil eines Photons".

source: Assuming the mean rate of photon emission is 1, use Equation {eq}`eqn-poisson` to calculate the probability of actually detecting 5 (which, at 5 times the true rate, would be an extremely inaccurate result). How common do you suppose it is to find pixels that are so noisy in the background region of a dark image?
de: Unter der Annahme, dass die mittlere Rate der Photonenemission 1 ist, verwenden Sie die Gleichung {eq}`eqn-poisson`, um die Wahrscheinlichkeit zu berechnen, dass tatsächlich 5 entdeckt werden (was bei der fünffachen wahren Rate ein extrem ungenaues Ergebnis wäre). Was glauben Sie, wie häufig es vorkommt, dass im Hintergrund eines dunklen Bildes derart verrauschte Pixel zu finden sind?

source: The probability of detecting 5 photons is approximately 0.0031.
de: Die Wahrscheinlichkeit, 5 Photonen zu entdecken, beträgt etwa 0,0031.

source: Although this is a very low probability, images contain so many pixels that one should expect to see such noisy values often. For example, in a rather dark and dull 512×512 pixel image in which the average photon emission rate is 1, we would expect 800 pixels to have a value of 5 -- and two pixels even to have a value of 8. The presence of isolated bright or dark pixels therefore usually tells us very little indeed, and it is only by processing the image more carefully and looking at surrounding values that we can (sometimes) discount the possibility these are simply the result of noise.
de: Obwohl dies eine sehr geringe Wahrscheinlichkeit ist, enthalten Bilder so viele Pixel, dass man erwarten sollte, solche verrauschten Werte häufig zu sehen. In einem eher dunklen und trüben Bild mit 512×512 Pixeln, in dem die durchschnittliche Photonenemissionsrate 1 beträgt, würden wir beispielsweise erwarten, dass 800 Pixel einen Wert von 5 haben - und zwei Pixel sogar einen Wert von 8. Das Vorhandensein einzelner heller oder dunkler Pixel sagt uns daher in der Regel sehr wenig, und nur durch eine sorgfältigere Verarbeitung des Bildes und die Betrachtung der umgebenden Werte können wir (manchmal) die Möglichkeit ausschließen, dass diese einfach das Ergebnis von Rauschen sind.

source: The SNR for Poisson noise
de: Der SNR für Poisson-Rauschen

source: If the standard deviation of noise was the only thing that mattered, this would suggest that we are better not detecting much light: then the photon noise standard deviation is lower. But the SNR is a much more reliable guide. For noise that follows a Poisson distribution this is particularly easy to calculate. Substituting into the formula for the SNR (Equation {eq}`eqn-snr`):
de: Wenn nur die Standardabweichung des Rauschens von Bedeutung wäre, würde dies darauf hindeuten, dass es besser ist, nicht viel Licht zu erkennen: Dann ist die Standardabweichung des Photonenrauschens geringer. Aber das SNR ist ein viel zuverlässigerer Anhaltspunkt. Für Rauschen, das einer Poisson-Verteilung folgt, ist dies besonders einfach zu berechnen. Man setzt sie in die Formel für das SNR ein (Gleichung {eq}`eqn-snr`):

source: Therefore **the SNR of photon noise is equal to the square root of the signal**!
de: Daher ist **das SNR des Photonenrauschens gleich der Quadratwurzel des Signals**!

source: This means that as the average number of emitted (and thus detected) photons increases, so too does the SNR. More photons &rarr; a better SNR, directly leading to the assertion
de: Das bedeutet, dass mit der durchschnittlichen Anzahl der emittierten (und damit nachgewiesenen) Photonen auch das SNR steigt. Mehr Photonen &rarr; <span class='transifex-protect'> </span> ein besseres SNR, was direkt zu der Behauptung führt

source: If you want to reduce photon noise, you need to detect more photons
de: Wenn man das Photonenrauschen verringern will, muss man mehr Photonen erkennen

source: We can visualize this using a simulation that displays how an image and its histogram change over time as more photons are detected.
de: Wir können dies anhand einer Simulation veranschaulichen, die zeigt, wie sich ein Bild und sein Histogramm im Laufe der Zeit verändern, wenn mehr Photonen erkannt werden.

source: This is really just the same as the insight that averaging reduces noise. Averaging and summing have the same effect, differing only by a constant scale factor.
de: Dies ist im Grunde dasselbe wie die Erkenntnis, dass die Mittelwertbildung das Rauschen reduziert. Mittelwertbildung und Summierung haben die gleiche Wirkung, sie unterscheiden sich nur durch einen konstanten Skalierungsfaktor.

source: Why relativity matters: a simple example
de: Warum die Relativitätstheorie wichtig ist: ein einfaches Beispiel

source: The SNR increases with the number of photons, even though the noise standard deviation increases too, because it's really _relative_ differences in the brightness in parts of the image that we are interested in. Absolute numbers usually are of very little importance -- which is fortunate, since not all photons are detected.
de: Das SNR nimmt mit der Anzahl der Photonen zu, auch wenn die Standardabweichung des Rauschens ebenfalls zunimmt, da wir uns eigentlich für die _relativen_ Helligkeitsunterschiede in Teilen des Bildes interessieren. Absolute Zahlen sind in der Regel von sehr geringer Bedeutung - was ein Glück ist, da nicht alle Photonen erkannt werden.
