Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/3-formation_noise/formation_noise.po
Languages: de

source: Harry Nyquist (1889-1975) and Claude Shannon (1916-2001), sampled using different pixel sizes. Their work is used when determining the pixel sizes needed to maximize the available information when acquiring images, which depends upon the size of the PSF.
de: Harry Nyquist (1889-1975) und Claude Shannon (1916-2001), die mit unterschiedlichen Pixelgrößen abgetastet haben. Ihre Arbeit wird bei der Bestimmung der Pixelgrößen verwendet, die erforderlich sind, um die verfügbaren Informationen bei der Aufnahme von Bildern zu maximieren, was von der Größe der PSF abhängt.

source: Specifically its probability density or mass function -- which for a Gaussian distribution is the familiar bell curve.
de: Insbesondere die Wahrscheinlichkeitsdichte oder Massenfunktion, die bei einer Gaußschen Verteilung die bekannte Glockenkurve ist.

source: Actually more. But the two mentioned here are usually by far the most significant, and it does not matter to our model at all if they contain various other sub-components. The important fact remains that there is some noise that varies throughout the image, and some that does not.
de: Eigentlich mehr. Aber die beiden hier genannten sind in der Regel die bei weitem wichtigsten, und es spielt für unser Modell überhaupt keine Rolle, wenn sie verschiedene andere Unterkomponenten enthalten. Wichtig ist, dass es Rauschen gibt, das im gesamten Bild variiert, und solches, das nicht variiert.

source: This is one definition of SNR. Many other definitions appear in the literature, leading to different values. The fact that any interesting image will vary in brightness in different places means that the SNR is not necessarily the same at all pixels -- therefore computing it in practice involves coming up with some summary measurement for the whole image. This can be approached differently, but the general principle is always to compare how much noise we have relative to interesting things: where higher is better.
de: Dies ist eine Definition des SNR. In der Literatur finden sich viele andere Definitionen, die zu unterschiedlichen Werten führen. Die Tatsache, dass die Helligkeit eines interessanten Bildes an verschiedenen Stellen variiert, bedeutet, dass das SNR nicht notwendigerweise an allen Pixeln gleich ist - daher erfordert die Berechnung in der Praxis eine zusammenfassende Messung für das gesamte Bild. Dies kann unterschiedlich angegangen werden, aber das allgemeine Prinzip ist immer zu vergleichen, wie viel Rauschen wir im Verhältnis zu interessanten Dingen haben: je höher, desto besser.

source: For a fuller picture, gain and offset also need to be taken into consideration, see {ref}`chap_microscope_types`.
de: Um ein vollständigeres Bild zu erhalten, müssen auch Gain und Offset berücksichtigt werden, siehe {ref}`chap_microscope_types`.
