Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/4-microscope_types/microscope_types.po
Languages: es, pt_br

source: Previously we explored how CCDs can use 2×2 binning to combine the electrons corresponding to multiple pixels together into a single pixel, which is then 'less noisy'. A similar effect can be achieved by just acquiring an image without binning and applying a 2×2 filter, in which all the coefficients have values of one. Both techniques result in images that have roughly four times as many photons contributing to each pixel, and thus a better SNR.
es: Anteriormente exploramos cómo los CCD pueden utilizar la agrupación 2×2 para combinar los electrones correspondientes a varios píxeles en un solo píxel, que entonces es "menos ruidoso". Se puede lograr un efecto similar simplemente adquiriendo una imagen sin agrupar y aplicando un filtro de 2×2, en el que todos los coeficientes tienen valores de uno. Ambas técnicas dan como resultado imágenes que tienen aproximadamente cuatro veces más fotones contribuyendo a cada píxel y, por lo tanto, una mejor relación señal-ruido.
pt_br: Anteriormente, exploramos como os CCDs podem usar binning 2×2 para combinar os elétrons correspondentes a vários pixels em um único pixel, que é então “menos barulhento”. Um efeito semelhante pode ser alcançado apenas adquirindo uma imagem sem binning e aplicando um filtro 2×2, em que todos os coeficientes possuem valores iguais a um. Ambas as técnicas resultam em imagens que possuem aproximadamente quatro vezes mais fótons contribuindo para cada pixel e, portanto, um melhor SNR.

source: Think of one major advantage and one disadvantage of using filtering _after_ acquisition, rather than binning _during_ acquisition.
es: Piensa en una de las principales ventajas y desventajas de utilizar el filtrado _después_ de la adquisición, en lugar de agrupar _durante_ la adquisición.
pt_br: Pense em uma grande vantagem e uma desvantagem de usar a filtragem _após_ a aquisição, em vez de categorizar _durante_ a aquisição.

source: A 2×2 binned image contains 1/4 the number of pixels of the original image. This represents a considerable loss of spatial information, and you would get a different result if you were to start binning at the first or second row or column, since different pixels would be combined in each case. On the other hand, filtering has the advantage of giving you an image that is exactly the same size as the original. This is like getting all four possible binned images for the price of one (i.e. all four different ways to split the image into 2×2 pixel blocks, instead of just one way), so less spatial information is lost. With filtering you also have much more flexibility: you might choose a 3×3 filter instead, or a Gaussian filter, or a range of different filtering options to see which is best. With binning, you need to choose one option during acquisition and stick with it.
es: Una imagen agrupada de 2 × 2 contiene 1/4 del número de píxeles de la imagen original. Esto representa una pérdida considerable de información espacial y obtendrías un resultado diferente si comenzaras a agrupar en la primera o segunda fila o columna, ya que se combinarían diferentes píxeles en cada caso. Por otro lado, el filtrado tiene la ventaja de darte una imagen que tiene exactamente el mismo tamaño que la original. Esto es como obtener las cuatro imágenes agrupadas posibles por el precio de una (es decir, las cuatro formas diferentes de dividir la imagen en bloques de 2×2 píxeles, en lugar de solo una manera), por lo que se pierde menos información espacial. Con el filtrado también tienes mucha más flexibilidad: puedes elegir un filtro de 3×3, un filtro Gaussiano o una variedad de opciones de filtrado diferentes para ver cuál es mejor. Con la agrupación, debes elegir una opción durante la adquisición y ceñirte a ella.
pt_br: Uma imagem binada 2×2 contém 1/4 do número de pixels da imagem original. Isto representa uma perda considerável de informação espacial, e você obteria um resultado diferente se começasse a categorizar na primeira ou segunda linha ou coluna, uma vez que diferentes pixels seriam combinados em cada caso. Por outro lado, a filtragem tem a vantagem de fornecer uma imagem exatamente do mesmo tamanho da original. É como obter todas as quatro imagens possíveis pelo preço de uma (ou seja, todas as quatro maneiras diferentes de dividir a imagem em blocos de 2 × 2 pixels, em vez de apenas uma maneira), de forma que menos informações espaciais sejam perdidas. Com a filtragem você também tem muito mais flexibilidade: você pode escolher um filtro 3×3, ou um filtro gaussiano, ou uma variedade de opções de filtragem diferentes para ver qual é a melhor. Com o binning, você precisa escolher uma opção durante a aquisição e segui-la.

source: _However_, if _read noise_ is a major problem then filtering might not be such a good choice. This is because read noise is added to every acquired pixel once, and it does not matter if you have a few photons or many -- its standard deviation remains the same. Therefore, if the electrons from four pixels are combined by binning during acquisition, then only one 'unit' of read noise appears in the image corresponding to those pixels. But an unbinned image would have read noise added four times, and even after 2×2 filtering this is still more read noise than in a comparable binned image. Sometimes this extra noise is too high a cost for the flexibility of filtering, and binning is better. (In this regard, remember that read noise is typically worse for CCD cameras, but not such a problem for EMCCDs or PMTs.)
es: _Sin embargo_, si el _ruido de lectura_ es un problema importante, entonces el filtrado podría no ser una buena opción. Esto se debe a que el ruido de lectura se agrega una vez a cada píxel adquirido, y no importa si tienes pocos fotones o muchos: su desviación estándar sigue siendo la misma. Por lo tanto, si los electrones de cuatro píxeles se combinan mediante agrupamiento durante la adquisición, entonces solo aparece una "unidad" de ruido de lectura en la imagen correspondiente a esos píxeles. Pero una imagen no agrupada habría agregado ruido de lectura cuatro veces, e incluso después del filtrado 2×2, esto sigue siendo más ruido de lectura que en una imagen agrupada comparable. A veces, este ruido adicional supone un costo demasiado alto para la flexibilidad del filtrado, y la agrupación es mejor. (A este respecto, recuerda que el ruido de lectura suele ser peor para las cámaras CCD, pero no es un problema para las EMCCD o PMT).
pt_br: _No entanto_, se _ruído de leitura_ for um grande problema, a filtragem pode não ser uma escolha tão boa. Isso ocorre porque o ruído de leitura é adicionado uma vez a cada pixel adquirido, e não importa se você tem alguns fótons ou muitos - seu desvio padrão permanece o mesmo. Portanto, se os elétrons de quatro pixels forem combinados por binning durante a aquisição, então apenas uma “unidade” de ruído de leitura aparecerá na imagem correspondente a esses pixels. Mas uma imagem não agrupada teria ruído de leitura adicionado quatro vezes e, mesmo após a filtragem 2×2, ainda seria mais ruído de leitura do que em uma imagem agrupada comparável. Às vezes, esse ruído extra representa um custo muito alto para a flexibilidade da filtragem, e o binning é melhor. (A este respeito, lembre-se de que o ruído de leitura é normalmente pior para câmeras CCD, mas não é um problema tão grande para EMCCDs ou PMTs.)
