Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/4-microscope_types/microscope_types.po
Languages: es, pt_br

source: Nevertheless, sometimes a reduction in optical sectioning is a worthwhile cost -- such as when photons are very scarce, and some extra background is tolerable. Also, when recording a multichannel image then you may well have to set the pinhole size according to the Airy disk for one channel. But because the size of the disk depends upon the light wavelength (as described in Equation {eq}`eqn-res_lateral`), the pinhole diameter will differ in terms of Airy disk sizes for other channels.
es: Sin embargo, a veces una reducción en el seccionamiento óptico es un costo que vale la pena, como cuando los fotones son muy escasos y es tolerable algo de fondo adicional. Además, al grabar una imagen multicanal, es posible que tengas que configurar el tamaño del orificio de acuerdo con el disco Airy para un canal. Pero debido a que el tamaño del disco depende de la longitud de onda de la luz (como se describe en la Ecuación {eq}`eqn-res_lateral`), el diámetro del pinhole diferirá en términos de tamaños de disco de Airy para otros canales.
pt_br: No entanto, por vezes, uma redução no seccionamento óptico é um custo que vale a pena - como quando os fotões são muito escassos e algum fundo extra é tolerável. Além disso, ao gravar uma imagem multicanal, talvez seja necessário definir o tamanho do furo de acordo com o disco Airy para um canal. Mas como o tamanho do disco depende do comprimento de onda da luz (conforme descrito na Equação {eq}`eqn-res_lateral`), o diâmetro do furo será diferente em termos de tamanhos de disco Airy para outros canais.

source: Spinning disk confocal
es: Confocal de disco giratorio
pt_br: Disco giratório confocal

source: So a widefield system records all pixels at once without blocking the light from reaching the detector anywhere, whereas a LSCM can block out-of-focus light by only recording a single pixel at a time. Both options sound extreme: could there not be a compromise?
es: Por lo tanto, un sistema de campo amplio registra todos los píxeles a la vez sin impedir que la luz llegue al detector en ninguna parte, mientras que un LSCM puede bloquear la luz desenfocada grabando solo un píxel a la vez. Ambas opciones parecen extremas: ¿no podría haber un compromiso?
pt_br: Portanto, um sistema de campo amplo registra todos os pixels de uma vez sem bloquear a luz de atingir o detector em qualquer lugar, enquanto um LSCM pode bloquear a luz fora de foco registrando apenas um único pixel por vez. Ambas as opções parecem extremas: não poderia haver um compromisso?

source: **Spinning disk confocal microscopy (SDCM)** implements one such compromise by using a large number of pinholes punched into a disk, so that the fluorophores can be excited and light detected for many different _non-adjacent_ pixels simultaneously. By not trying to record adjacent pixels at the same time, pinholes can be used to block _most_ of the out-of-focus light for each pixel, since this originates close to the region of interest for that pixel (i.e. the PSF becomes very dim at locations far away from its center) -- but sufficiently-spaced pixels can still be recorded simultaneously with little influence on one another.
es: **La microscopía confocal de disco giratorio (SDCM)** implementa uno de esos compromisos mediante el uso de una gran cantidad de pinholes perforados en un disco, de modo que los fluoróforos puedan excitarse y detectarse la luz para muchos píxeles diferentes _no adyacentes_ simultáneamente. Al no intentar grabar píxeles adyacentes al mismo tiempo, se pueden utilizar pinholes para bloquear la mayor parte de la luz desenfocada de cada píxel, ya que se origina cerca de la región de interés de ese píxel (es decir, el PSF se vuelve muy tenue en ubicaciones alejadas de su centro), pero los píxeles suficientemente espaciados aún se pueden grabar simultáneamente con poca influencia entre sí.
pt_br: **Microscopia confocal de disco giratório (SDCM)** implementa um desses compromissos usando um grande número de furos perfurados em um disco, para que os fluoróforos possam ser excitados e a luz detectada para muitos pixels _não adjacentes_ diferentes simultaneamente. Ao não tentar gravar pixels adjacentes ao mesmo tempo, os furos podem ser usados para bloquear _a maior parte_ da luz fora de foco de cada pixel, uma vez que ela se origina perto da região de interesse desse pixel (ou seja, o PSF fica muito escuro em locais distantes de seu centro) - mas pixels suficientemente espaçados ainda podem ser gravados simultaneamente com pouca influência uns sobre os outros.

source: In practice, spinning disk confocal microscopy images are likely to be less sharp than laser scanning confocal images because some light does scatter through other pinholes. Also, the pinhole sizes cannot be adjusted to fine-tune the balance between noise and optical sectioning. However, the optical sectioning offered by SDCM is at least a considerable improvement over the widefield case, and an acceptable SNR can be achieved with much faster frame-rates using SDCM as opposed to LSCM.
es: En la práctica, es probable que las imágenes de microscopía confocal de disco giratorio sean menos nítidas que las imágenes confocales de escaneo láser porque parte de la luz se dispersa a través de otros pinholes. Además, los tamaños de los pinholes no se pueden ajustar para ajustar el equilibrio entre el ruido y el seccionamiento óptico. Sin embargo, el seccionamiento óptico que ofrece SDCM es al menos una mejora considerable con respecto al caso de campo amplio, y se puede lograr una SNR aceptable con velocidades de cuadros mucho más rápidas usando SDCM en lugar de LSCM.
pt_br: Na prática, as imagens de microscopia confocal de disco giratório são provavelmente menos nítidas do que as imagens confocal de varredura a laser porque alguma luz se espalha através de outros furos. Além disso, os tamanhos dos furos não podem ser ajustados para ajustar o equilíbrio entre ruído e seccionamento óptico. No entanto, o seccionamento óptico oferecido pelo SDCM é pelo menos uma melhoria considerável em relação ao caso de campo amplo, e um SNR aceitável pode ser alcançado com taxas de quadros muito mais rápidas usando SDCM em oposição ao LSCM.

source: Multiphoton microscopy
es: Microscopía multifotónica
pt_br: Microscopia multifotônica

source: As previously mentioned, if the size of excitation volume could be reduced enough, then we would know where the photons originated even without a pinhole being required -- but focused excitation is generally still subject to PSF-related issues, so that fluorophores throughout a whole hourglass-shaped volume can end up being excited. The main idea of **multiphoton microscopy** is that fluorophore excitation requires the _simultaneous absorption of multiple photons_, rather than only a single photon. The excitation light has a longer wavelength than would otherwise be required to cause molecular excitation with a single photon, but the energies of the multiple photons combine to cause the excitation.
es: Como se mencionó anteriormente, si el tamaño del volumen de excitación pudiera reducirse lo suficiente, entonces sabríamos dónde se originaron los fotones incluso sin que se requiera un pinhole. Pero la excitación enfocada generalmente todavía está sujeta a problemas relacionados con la PSF, por lo que los fluoróforos en todo un volumen en forma de reloj de arena pueden terminar excitandose. La idea principal de la **microscopía multifotónica** es que la excitación del fluoróforo requiere la _absorción simultánea de múltiples fotones_, en lugar de un solo fotón. La luz de excitación tiene una longitud de onda más larga que la que de otro modo sería necesaria para provocar la excitación molecular con un solo fotón, pero las energías de los múltiples fotones se combinan para provocar la excitación.
pt_br: Como mencionado anteriormente, se o tamanho do volume de excitação pudesse ser reduzido o suficiente, então saberíamos onde os fótons se originaram mesmo sem a necessidade de um furo - mas a excitação focada geralmente ainda está sujeita a problemas relacionados ao PSF, de modo que os fluoróforos em todo um todo o volume em forma de ampulheta pode acabar excitado. A ideia principal da **microscopia multifóton** é que a excitação do fluoróforo requer a _absorção simultânea de múltiplos fótons_, em vez de apenas um único fóton. A luz de excitação tem um comprimento de onda maior do que seria necessário para causar excitação molecular com um único fóton, mas as energias dos múltiplos fótons se combinam para causar a excitação.

source: The benefit of this is that the multiphoton excitation only occurs at the focal region of the excitation -- elsewhere within the 'specimen PSF' the light intensities are insufficient to produce the 'multiphoton effect' and raise the fluorophores into an excited state. This means that the region of the specimen emitting photons at any one time is much smaller than when using single photon excitation (as in LSCM), and also less damage is being caused to the sample outside of the sample plane. Furthermore, multiphoton microscopy is able to penetrate deeper into a specimen -- up to several hundred µm.
es: El beneficio de esto es que la excitación multifotónica solo ocurre en la región focal de la excitación; en otras partes dentro del 'PSF de muestra' las intensidades de la luz son insuficientes para producir el 'efecto multifotónico' y elevar los fluoróforos a un estado excitado. Esto significa que la región de la muestra que emite fotones en un momento dado es mucho más pequeña que cuando se utiliza la excitación de un solo fotón (como en LSCM), y también se causa menos daño a la muestra fuera del plano de muestra. Además, la microscopía multifotónica es capaz de penetrar más profundamente en una muestra, hasta varios cientos de µm.
pt_br: A vantagem disto é que a excitação multifotônica ocorre apenas na região focal da excitação - em outras partes do 'espécime PSF' as intensidades de luz são insuficientes para produzir o 'efeito multifotônico' e elevar os fluoróforos a um estado excitado. Isso significa que a região da amostra que emite fótons a qualquer momento é muito menor do que quando se usa excitação de fóton único (como no LSCM), e também menos danos são causados à amostra fora do plano da amostra. Além disso, a microscopia multifotônica é capaz de penetrar mais profundamente em uma amostra – até várias centenas de µm.

source: Total Internal Reflection Fluorescence
es: Fluorescencia de reflexión interna total
pt_br: Fluorescência de Reflexão Interna Total

source: As previously mentioned, widefield images of very thin specimens do not suffer much from out-of-focus blur because light is not emitted from many other planes. **Total Internal Reflection Fluorescence (TIRF)** microscopy makes use of this by stimulating fluorescence only in a very thin section of the sample close to the objective. Very briefly, TIRF microscopy involves using an illumination angled so that the change in refractive index encountered by the light as it approaches the specimen causes a further change in angle sufficient to prevent the light from directly entering the specimen (i.e. it is 'totally internally reflected'). Nevertheless, fluorophores can still be excited by an evanescent wave that is produced when this occurs. This wave decays exponentially, so that only fluorophores right at the surface are excited -- meaning fluorophores deeper within the specimen do not interfere with the recording.
es: Como se mencionó anteriormente, las imágenes de campo amplio de especímenes muy delgados no sufren mucho desenfoque porque la luz no se emite desde muchos otros planos. **La microscopía de fluorescencia de reflexión interna total (TIRF)** hace uso de esto estimulando la fluorescencia solo en una sección muy delgada de la muestra cerca del objetivo. Muy brevemente, la microscopía TIRF implica el uso de una iluminación en ángulo de modo que el cambio en el índice de refracción encontrado por la luz cuando se acerca a la muestra provoque un cambio adicional en el ángulo suficiente para evitar que la luz entre directamente en la muestra (es decir, se refleja totalmente internamente). Sin embargo, los fluoróforos aún pueden excitarse mediante una onda evanescente que se produce cuando esto ocurre. Esta onda decae exponencialmente, de modo que sólo se excitan los fluoróforos que se encuentran justo en la superficie, lo que significa que los fluoróforos más profundos dentro de la muestra no interfieren con la grabación.
pt_br: Como mencionado anteriormente, imagens de campo amplo de amostras muito finas não sofrem muito com o desfoque fora de foco porque a luz não é emitida por muitos outros planos. **A microscopia de Fluorescência de Reflexão Interna Total (TIRF)** faz uso disso estimulando a fluorescência apenas em uma seção muito fina da amostra próxima à objetiva. Muito brevemente, a microscopia TIRF envolve o uso de uma iluminação angulada de modo que a mudança no índice de refração encontrado pela luz à medida que ela se aproxima da amostra causa uma mudança adicional no ângulo suficiente para evitar que a luz entre diretamente na amostra (ou seja, é 'totalmente refletida internamente'). '). No entanto, os fluoróforos ainda podem ser excitados por uma onda evanescente produzida quando isso ocorre. Esta onda decai exponencialmente, de modo que apenas os fluoróforos na superfície são excitados - o que significa que os fluoróforos mais profundos na amostra não interferem na gravação.

source: Importantly, because the subsequent recording is essentially similar to that used when recording widefield images, photons are detected at all pixels in parallel and fast recording-rates are possible. Therefore if it's only necessary to see to a depth of about 100 nm, TIRF microscopy may be a good choice.
es: Es importante destacar que, debido a que la grabación posterior es esencialmente similar a la utilizada cuando se graban imágenes de campo amplio, los fotones se detectan en todos los píxeles en paralelo y son posibles velocidades de grabación rápidas. Por lo tanto, si sólo es necesario ver a una profundidad de unos 100 nm, la microscopía TIRF puede ser una buena opción.
pt_br: É importante ressaltar que, como a gravação subsequente é essencialmente semelhante àquela usada na gravação de imagens de campo amplo, os fótons são detectados em todos os pixels em paralelo e são possíveis taxas de gravação rápidas. Portanto, se for necessário apenas ver uma profundidade de cerca de 100 nm, a microscopia TIRF pode ser uma boa escolha.

source: Photon detectors
es: Detectores de fotones
pt_br: Detectores de fótons

source: Certain detectors are associated with certain types of microscopy, and differ according to the level and type of noise you can expect. Understanding the basic principles greatly helps when choosing sensible values for parameters such as gain, pixel size and binning during acquisition to optimize the useful information in the image. The following provides a very brief introduction to two common detectors, and extra one variation.
es: Ciertos detectores están asociados con ciertos tipos de microscopía y difieren según el nivel y el tipo de ruido que puedes esperar. Comprender los principios básicos es de gran ayuda a la hora de elegir valores sensatos para parámetros como la ganancia, el tamaño de píxel y la agrupación durante la adquisición para optimizar la información útil de la imagen. A continuación se proporciona una introducción muy breve a dos detectores comunes y una variación adicional.
pt_br: Certos detectores estão associados a certos tipos de microscopia e diferem de acordo com o nível e tipo de ruído esperado. Compreender os princípios básicos ajuda muito na escolha de valores sensíveis para parâmetros como ganho, tamanho de pixel e binning durante a aquisição para otimizar as informações úteis na imagem. A seguir fornece uma breve introdução a dois detectores comuns e uma variação extra.

source: PMTs: one pixel at a time
es: PMT: un píxel a la vez
pt_br: PMTs: um pixel por vez

source: If you only need to record one pixel at a time, a **photomultiplier tube (PMT)** might be what you need. The basic principle is this: a photon strikes a photocathode, hopefully producing an electron. When this occurs, the electron is accelerated towards a dynode, and any produced electrons accelerated towards further dynodes. By adjusting the 'gain', the acceleration of the electrons towards successive dynodes can be varied; higher accelerations mean there is an increased likelihood that the collision of the electrons with the dynode will produce a higher number of electrons moving into the next stage. The charge of the electrons is then quantified at the end ({numref}`fig-pmt`). Because the (possibly very small) number of original detected photons have now been amplified to a (possibly much) larger number electrons by the successive collisions with dynodes, the effect of read noise is usually minor for a PMT.
es: Si solo necesitas grabar un píxel a la vez, un **tubo fotomultiplicador (PMT)** podría ser lo que necesitas. El principio básico es el siguiente: un fotón choca contra un fotocátodo y, con suerte, produce un electrón. Cuando esto ocurre, el electrón se acelera hacia un dínodo y los electrones producidos se aceleran hacia más dinodos. Ajustando la "ganancia", se puede variar la aceleración de los electrones hacia sucesivos dinodos; Aceleraciones más altas significan que hay una mayor probabilidad de que la colisión de los electrones con el dínodo produzca una mayor cantidad de electrones que pasan a la siguiente etapa. La carga de los electrones se cuantifica al final ({numref}`fig-pmt`). Debido a que el número (posiblemente muy pequeño) de fotones originales detectados ahora se ha amplificado a un número (posiblemente mucho) mayor de electrones mediante las sucesivas colisiones con dinodos, el efecto del ruido de lectura suele ser menor para un PMT.
pt_br: Se você precisar gravar apenas um pixel por vez, um **tubo fotomultiplicador (PMT)** pode ser o que você precisa. O princípio básico é este: um fóton atinge um fotocátodo, produzindo, esperançosamente, um elétron. Quando isso ocorre, o elétron é acelerado em direção a um dínodo, e quaisquer elétrons produzidos são acelerados em direção a outros dínodos. Ajustando o 'ganho', a aceleração dos elétrons em direção a dínodos sucessivos pode ser variada; acelerações mais altas significam que há uma probabilidade maior de que a colisão dos elétrons com o dínodo produza um número maior de elétrons passando para o próximo estágio. A carga dos elétrons é então quantificada no final ({numref}`fig-pmt`). Como o número (possivelmente muito pequeno) de fótons originais detectados foi agora amplificado para um número (possivelmente muito) maior de elétrons pelas sucessivas colisões com dínodos, o efeito do ruído de leitura é geralmente menor para um PMT.

source: Diagram showing the detection of a photon by a PMT. Each photon can be 'multiplied' to produce many electrons by accelerating the first produced electron towards a dynode, and repeating the process for all electrons produced along a succession of dynodes. The charge of the electrons reaching the end of the process can then be quantified, and ought to be proportional to the number of photons that arrived at the PMT.
es: Diagrama que muestra la detección de un fotón por un PMT. Cada fotón puede "multiplicarse" para producir muchos electrones acelerando el primer electrón producido hacia un dínodo y repitiendo el proceso para todos los electrones producidos a lo largo de una sucesión de dínodos. La carga de los electrones que llegan al final del proceso se puede entonces cuantificar y debería ser proporcional al número de fotones que llegaron al PMT.
pt_br: Diagrama mostrando a detecção de um fóton por um PMT. Cada fóton pode ser 'multiplicado' para produzir muitos elétrons, acelerando o primeiro elétron produzido em direção a um dínodo e repetindo o processo para todos os elétrons produzidos ao longo de uma sucessão de dínodos. A carga dos elétrons que chegam ao final do processo pode então ser quantificada e deve ser proporcional ao número de fótons que chegaram ao PMT.

source: More problematically, PMTs can suffer from the problem of having a low **Quantum Efficiency (QE)**. The QE is a measure of the proportion of photons striking the detector which then produce electrons, and values for a conventional PMT may be as low as 10–15%: the majority of the photons reaching the PMT are simply wasted. Thus photon noise can be a major issue, especially if there is a low amount of light available to detect in the first place.
es: Lo que es más problemático es que los PMT pueden sufrir el problema de tener una baja **Eficiencia Cuántica (QE)**. El QE es una medida de la proporción de fotones que golpean el detector y que luego producen electrones, y los valores para un PMT convencional pueden ser tan bajos como 10-15%: la mayoría de los fotones que llegan al PMT simplemente se desperdician. Por lo tanto, el ruido de los fotones puede ser un problema importante, especialmente si, en primer lugar, hay poca cantidad de luz disponible para detectar.
pt_br: Mais problemático ainda, os PMTs podem sofrer com o problema de ter uma baixa **Eficiência Quântica (QE)**. O QE é uma medida da proporção de fótons que atingem o detector que então produz elétrons, e os valores para um PMT convencional podem ser tão baixos quanto 10–15%: a maioria dos fótons que atingem o PMT são simplesmente desperdiçados. Assim, o ruído do fóton pode ser um grande problema, especialmente se houver uma baixa quantidade de luz disponível para ser detectada.

source: Converting electrons to pixels
es: Convertir electrones en píxeles
pt_br: Convertendo elétrons em pixels

source: It's important to keep in mind that the final pixel values are not _equal_ to numbers of detected photons -- nor even numbers of counted electrons. They are rather proportional, often with an offset added.
es: Es importante tener en cuenta que los valores finales de los píxeles no son _iguales_ a la cantidad de fotones detectados, ni siquiera a la cantidad de electrones contados. Son bastante proporcionales, a menudo con una compensación añadida.
pt_br: É importante ter em mente que os valores finais dos pixels não são _iguais_ ao número de fótons detectados - nem mesmo ao número de elétrons contados. Eles são bastante proporcionais, muitas vezes com um deslocamento adicionado.

source: It's essential to estimate this offset (perhaps from a background region or an image acquired without using any excitation light) and subtract it if you need to compare pixel values in different images, in addition to using identical acquisition settings.
es: Es esencial estimar este desplazamiento (tal vez a partir de una región de fondo o una imagen adquirida sin usar luz de excitación) y restarlo si necesitas comparar valores de píxeles en diferentes imágenes, además de usar configuraciones de adquisición idénticas.
pt_br: É essencial estimar esse deslocamento (talvez de uma região de fundo ou de uma imagem adquirida sem usar nenhuma luz de excitação) e subtraí-lo se precisar comparar valores de pixel em imagens diferentes, além de usar configurações de aquisição idênticas.

source: CCDs: fast imaging when there are a lot of photons
es: CCD: imágenes rápidas cuando hay muchos fotones
pt_br: CCDs: imagens rápidas quando há muitos fótons
