Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/4-microscope_types/microscope_types.po
Languages: es, pt_br

source: Microscopes & detectors
es: Microscopios y detectores
pt_br: Microscópios e detectores

source: Chapter outline
es: Outline del capítulo
pt_br: Esboço do capítulo

source: The **choice of microscope** influences the **blur**, **noise** & **temporal resolution** of images
es: La **elección del microscopio** influye en el **desenfoque**, el **ruido** y la **resolución temporal** de las imágenes.
pt_br: A **escolha do microscópio** influencia o **desfoque**, o **ruído** e a **resolução temporal** das imagens

source: An **ideal detector** would have a high **Quantum Efficiency** & **low read noise**
es: Un **detector ideal** tendría una alta **eficiencia cuántica** y un **bajo ruido de lectura**
pt_br: Um **detector ideal** teria uma alta **Eficiência Quântica** e **baixo ruído de leitura**

source: Introduction
es: Introducción
pt_br: Introdução

source: Successfully analyzing an image requires that it actually contains the necessary information in the first place. There are various practical issues related to the biology (e.g. not interfering too much with processes, for example by inadvertently killing things) and data handling (bit-depths, file formats, anything else in Part I of this book). However, assuming that these are in order, there are three other main factors to consider connected to the image contents:
es: Para analizar con éxito una imagen es necesario, en primer lugar, que contenga realmente la información necesaria. Hay varias cuestiones prácticas relacionadas con la biología (por ejemplo, no interferir demasiado con los procesos, por ejemplo matando cosas sin querer) y el manejo de datos (profundidad de bits, formatos de archivos, cualquier otra cosa en la Parte I de este libro). Sin embargo, suponiendo que estén en orden, hay otros tres factores principales a considerar relacionados con el contenido de la imagen:
pt_br: A análise bem-sucedida de uma imagem exige, em primeiro lugar, que ela realmente contenha as informações necessárias. Existem várias questões práticas relacionadas à biologia (por exemplo, não interferir muito nos processos, por exemplo, matando coisas inadvertidamente) e ao tratamento de dados (profundidade de bits, formatos de arquivo, qualquer outra coisa na Parte I deste livro). No entanto, supondo que estes estejam em ordem, há três outros fatores principais a serem considerados relacionados ao conteúdo da imagem:

source: **Spatial information**, dependent on the size and shape of the PSF,
es: **Información espacial**, dependiendo del tamaño y forma del PSF,
pt_br: **Informações espaciais**, dependendo do tamanho e formato do PSF,

source: **Noise**, dependent on the number of photons detected,
es: **Ruido**, dependiendo del número de fotones detectados,
pt_br: **Ruído**, dependendo do número de fótons detectados,

source: **Temporal resolution**, dependent on the speed at which the microscope can record images.
es: **Resolución temporal**, dependiendo de la velocidad a la que el microscopio puede grabar imágenes.
pt_br: **Resolução temporal**, dependendo da velocidade com que o microscópio pode registrar imagens.

source: No one type of microscope is currently able to optimize all of these simultaneously, and so decisions and compromises need to be made. Temporal resolution and noise have an obvious relationship: a high temporal resolution means that less time is spent detecting photons in the image, leading to more photon noise. However, improving spatial information is also often related to one or both of the other two factors.
es: Actualmente, ningún tipo de microscopio es capaz de optimizarlos todos simultáneamente, por lo que es necesario tomar decisiones y hacer concesiones. La resolución temporal y el ruido tienen una relación obvia: una resolución temporal alta significa que se dedica menos tiempo a detectar fotones en la imagen, lo que genera más ruido de fotones. Sin embargo, la mejora de la información espacial también suele estar relacionada con uno o ambos de los otros dos factores.
pt_br: Atualmente, nenhum tipo de microscópio é capaz de otimizar tudo isso simultaneamente e, portanto, é necessário tomar decisões e fazer concessões. A resolução temporal e o ruído têm uma relação óbvia: uma alta resolução temporal significa que menos tempo é gasto na detecção de fótons na imagem, levando a mais ruído de fótons. No entanto, a melhoria da informação espacial também está frequentemente relacionada com um ou ambos os outros dois factores.

source: This chapter gives a very brief overview of the main features of several fluorescence microscopes from the point of view of how they balance the tradeoffs mentioned.
es: Este capítulo ofrece una descripción muy breve de las características principales de varios microscopios de fluorescencia desde el punto de vista de cómo equilibran las ventajas y desventajas mencionadas.
pt_br: Este capítulo fornece uma breve visão geral das principais características de vários microscópios de fluorescência do ponto de vista de como eles equilibram as compensações mencionadas.

source: **This discussion does _not_ do justice to all the complexities, variations and features of the microscopes it describes!**
es: **¡Esta discusión _no_ le hace justicia a todas las complejidades, variaciones y características de los microscopios que describe!**
pt_br: **Esta discussão _não_ faz justiça a todas as complexidades, variações e características dos microscópios que descreve!**

source: I'm by no means an expert in microscopy: I just analyze the data. But this chapter tries to distil the main things I learned that are relevant for analysis while working in an imaging center. It's a bit dated, but I've kept it anyway in case it might be useful to someone as a starting point.
es: De ninguna manera soy un experto en microscopía: solo analizo los datos. Pero este capítulo intenta resumir las principales cosas que aprendí y que son relevantes para el análisis mientras trabajaba en un centro de imágenes. Está un poco anticuado, pero lo he conservado de todos modos por si a alguien le puede resultar útil como punto de partida.
pt_br: Não sou de forma alguma um especialista em microscopia: apenas analiso os dados. Mas este capítulo tenta destilar as principais coisas que aprendi e que são relevantes para análise enquanto trabalho em um centro de imagem. Está um pouco desatualizado, mas guardei-o mesmo assim, caso possa ser útil para alguém como ponto de partida.

source: For a more extensive, and authoritative, description of the topics considered here, consider seeking out the _Handbook of Biological Confocal Microscopy_ edited by James Pawley. This contains many excellent chapters, some of which may be available to download from the publisher's website.
es: Para obtener una descripción más extensa y autorizada de los temas considerados aquí, considere buscar el _Handbook of Biological Confocal Microscopy_ editado por James Pawley. Contiene muchos capítulos excelentes, algunos de los cuales pueden estar disponibles para descargar desde el sitio web del editor.
pt_br: Para uma descrição mais extensa e confiável dos tópicos considerados aqui, considere procurar o _Handbook of Biological Confocal Microscopy_ editado por James Pawley. Contém muitos capítulos excelentes, alguns dos quais podem estar disponíveis para download no site da editora.

source: Types of microscope
es: Tipos de microscopio
pt_br: Tipos de microscópio

source: Schematic diagrams to show the differences in excitation patterns. Here, an inverted microscope is assumed (the cell is resting on a coverslip, and illuminated from below). During the recording of a pixel, light can potentially be detected if it arises from any part of the green-illuminated region, although in the laser scanning and spinning disk confocal cases the pinhole will only permit a fraction of this light to pass through. Note that, for the 2-photon microscope, the excitation is confined to only the small, central region, while the red light above and below is not capable of exciting the fluorophores that have been used.
es: Diagramas esquemáticos para mostrar las diferencias en los patrones de excitación. Aquí se supone un microscopio invertido (la célula descansa sobre un cubreobjetos y se ilumina desde abajo). Durante la grabación de un píxel, se puede detectar luz si surge de cualquier parte de la región iluminada en verde, aunque en el caso de confocales de escaneo láser y disco giratorio el pinhole solo permitirá que pase una fracción de esta luz. Ten en cuenta que, para el microscopio de 2 fotones, la excitación se limita sólo a la pequeña región central, mientras que la luz roja arriba y abajo no es capaz de excitar los fluoróforos que se han utilizado.
pt_br: Diagramas esquemáticos para mostrar as diferenças nos padrões de excitação. Aqui, assume-se um microscópio invertido (a célula está apoiada em uma lamela e iluminada por baixo). Durante a gravação de um pixel, a luz pode ser potencialmente detectada se surgir de qualquer parte da região iluminada em verde, embora nos casos confocal de varredura a laser e disco giratório o pinhole permita apenas a passagem de uma fração dessa luz. Observe que, para o microscópio de 2 fótons, a excitação está confinada apenas à pequena região central, enquanto a luz vermelha acima e abaixo não é capaz de excitar os fluoróforos que foram utilizados.

source: Widefield
es: Campo amplio
pt_br: Campo amplo

source: So far, our schematic diagrams and PSF discussion have concentrated on **widefield microscopes**. In widefield microscopy, the entire sample is bathed in light, so that many fluorophores throughout the sample can be excited and emit photons simultaneously. All of the light that enters the objective may then be detected and contribute to any image being recorded. Because photons are potentially emitted from everywhere in the sample, there will be a lot of blur present for a thick specimen (for a thin specimen there is not much light from out-of-focus planes because the planes simply do not contain anything that can fluoresce).
es: Hasta ahora, nuestros diagramas esquemáticos y discusión sobre PSF se han concentrado en **microscopios de campo amplio**. En la microscopía de campo amplio, toda la muestra está bañada en luz, de modo que muchos fluoróforos de toda la muestra pueden excitarse y emitir fotones simultáneamente. Luego, toda la luz que ingresa al objetivo puede detectarse y contribuir a la grabación de cualquier imagen. Debido a que los fotones se emiten potencialmente desde todas partes de la muestra, habrá mucho desenfoque en una muestra gruesa (en una muestra delgada no hay mucha luz procedente de planos desenfocados porque los planos simplemente no contienen nada que pueda ser fluorescente).
pt_br: Até agora, nossos diagramas esquemáticos e discussão sobre PSF concentraram-se em **microscópios de campo amplo**. Na microscopia de campo amplo, toda a amostra é banhada em luz, de modo que muitos fluoróforos em toda a amostra podem ser excitados e emitir fótons simultaneamente. Toda a luz que entra na objetiva pode então ser detectada e contribuir para a gravação de qualquer imagem. Como os fótons são potencialmente emitidos de todos os lugares da amostra, haverá muito desfoque presente em uma amostra espessa (para uma amostra fina, não há muita luz proveniente de planos fora de foco porque os planos simplesmente não contêm nada que possa fluorescer).

source: What we get in any single recorded image is effectively the sum of the light from the in-focus plane, and every other out-of-focus plane. Viewed in terms of PSFs, we capture part of the hourglass shape produced by every light-emitting point depending upon how in-focus it is in every image.
es: Lo que obtenemos en cualquier imagen grabada es efectivamente la suma de la luz del plano enfocado y de todos los demás planos desenfocados. Visto en términos de PSF, capturamos parte de la forma de reloj de arena producida por cada punto emisor de luz dependiendo de qué tan enfocado esté en cada imagen.
pt_br: O que obtemos em qualquer imagem gravada é efetivamente a soma da luz do plano em foco e de todos os outros planos fora de foco. Visto em termos de PSFs, capturamos parte da forma de ampulheta produzida por cada ponto emissor de luz, dependendo de quão focado ele está em cada imagem.

source: This is bad news for spatial information and also for detecting small structures in thick samples, because the out-of-focus light is essentially unhelpful background. On the other hand, widefield images tend to include a lot of photons, which overcomes read noise, even when they are recorded fast.
es: Esto es una mala noticia para la información espacial y también para la detección de estructuras pequeñas en muestras gruesas, porque la luz desenfocada es esencialmente un fondo inútil. Por otro lado, las imágenes de campo amplio tienden a incluir muchos fotones, lo que supera el ruido de lectura, incluso cuando se graban rápidamente.
pt_br: Isto é uma má notícia para a informação espacial e também para a detecção de pequenas estruturas em amostras espessas, porque a luz fora de foco é essencialmente um fundo inútil. Por outro lado, imagens de campo amplo tendem a incluir muitos fótons, o que supera o ruído de leitura, mesmo quando são gravadas rapidamente.

source: Laser scanning confocal
es: Confocal de escaneo láser
pt_br: Varredura a laser confocal

source: **Optical sectioning** is the ability to detect photons only from the plane of focus, rejecting those from elsewhere. This is necessary to look into thick samples without getting lost in the haze of other planes. **Laser Scanning Confocal Microscopy (LSCM)** achieves this by only concentrating on detecting light for one pixel at any time, and using a pinhole to try to only allow light from a corresponding point in the sample to be detected.
es: **El seccionamiento óptico** es la capacidad de detectar fotones solo desde el plano de enfoque, rechazando los de otros lugares. Esto es necesario para observar muestras gruesas sin perderse en la bruma de otros planos. La **microscopía confocal de barrido láser (LSCM)** logra esto concentrándose solo en detectar la luz de un píxel en cualquier momento y usando un pinhole para tratar de permitir que solo se detecte la luz de un punto correspondiente en la muestra.
pt_br: **Seccionamento óptico** é a capacidade de detectar fótons apenas no plano de foco, rejeitando aqueles de outros lugares. Isso é necessário para observar amostras espessas sem se perder na névoa de outros planos. A **Microscopia Confocal de Varredura a Laser (LSCM)** consegue isso concentrando-se apenas na detecção de luz para um pixel a qualquer momento e usando um orifício para tentar permitir que apenas a luz de um ponto correspondente na amostra seja detectada.

source: Because at most only one pixel is being recorded at any given moment, it does not make sense to illuminate the entire sample at once, which could do unnecessary damage. Rather, a laser illuminates only a small volume. If this would be made small enough, then a pinhole would not actually be needed because we would know that all emitted light _must_ be coming from the illuminated spot; however, the illumination itself is like an hour-glass PSF in the specimen. The pinhole is needed to make sure only the light from the central part reaches the detector. This then causes the final PSF, as it appears _in the image_, to take on more of a rugby-ball (or American football) appearance.
es: Debido a que como máximo sólo se registra un píxel en un momento dado, no tiene sentido iluminar toda la muestra a la vez, lo que podría causar daños innecesarios. Más bien, un láser ilumina sólo un pequeño volumen. Si esto fuera lo suficientemente pequeño, entonces no sería necesario un pinhole porque sabríamos que toda la luz emitida _debe_ provenir del punto iluminado; sin embargo, la iluminación en sí es como un PSF de reloj de arena en la muestra. El pinhole es necesario para que solo llegue al detector la luz de la parte central. Esto hace que el PSF final, tal como aparece _en la imagen_, adopte una apariencia más parecida a una pelota de rugby (o fútbol americano).
pt_br: Como no máximo apenas um pixel está sendo gravado em um determinado momento, não faz sentido iluminar toda a amostra de uma só vez, o que poderia causar danos desnecessários. Em vez disso, um laser ilumina apenas um pequeno volume. Se isto fosse suficientemente pequeno, então um furo não seria realmente necessário porque saberíamos que toda a luz emitida _deve_ vir do ponto iluminado; entretanto, a iluminação em si é como uma ampulheta PSF na amostra. O furo é necessário para garantir que apenas a luz da parte central chegue ao detector. Isso então faz com que o PSF final, como aparece _na imagem_, assuma mais a aparência de uma bola de rugby (ou futebol americano).

source: The end result is an image that has relatively little out-of-focus light. Compared to widefield microscopy, LSCM provide a significant improvement in what can be seen along the *z*-dimension, although the *xy* resolution is not very different. Also, because single pixels are recorded separately, the image can (potentially) be more or less any size and shape -- rather than limited by the pixel count on a camera.
es: El resultado final es una imagen que tiene relativamente poca luz desenfocada. En comparación con la microscopía de campo amplio, LSCM proporciona una mejora significativa en lo que se puede ver a lo largo de la dimensión *z*, aunque la resolución *xy* no es muy diferente. Además, debido a que los píxeles individuales se graban por separado, la imagen puede (potencialmente) tener más o menos cualquier tamaño y forma, en lugar de estar limitada por el recuento de píxeles de una cámara.
pt_br: O resultado final é uma imagem com relativamente pouca luz fora de foco. Comparado à microscopia de campo amplo, o LSCM fornece uma melhoria significativa no que pode ser visto ao longo da dimensão *z*, embora a resolução *xy* não seja muito diferente. Além disso, como os pixels únicos são gravados separadamente, a imagem pode (potencialmente) ter mais ou menos qualquer tamanho e formato - em vez de ser limitada pela contagem de pixels de uma câmera.

source: However, these advantages comes with a major drawback. Images usually contain thousands to millions of pixels, and so only a tiny fraction of the time required to record an image is spent detecting photons for any one pixel in a LSCM image -- unlike in the widefield case, where photons can be detected for all pixels over the entire image acquisition time. This can cause LSCM image acquisition to be comparatively slow, noisy (in terms of few detected photons) or both. Spatial information is therefore gained at a cost in noise and/or temporal resolution.
es: Sin embargo, estas ventajas conllevan un gran inconveniente. Las imágenes normalmente contienen miles o millones de píxeles, por lo que sólo una pequeña fracción del tiempo necesario para grabar una imagen se dedica a detectar fotones para cualquier píxel en una imagen LSCM, a diferencia del caso de campo amplio, donde los fotones se pueden detectar para todos los píxeles durante todo el tiempo de adquisición de la imagen. Esto puede hacer que la adquisición de imágenes LSCM sea comparativamente lenta, ruidosa (en términos de pocos fotones detectados) o ambas cosas. Por lo tanto, la información espacial se obtiene a un costo de ruido y/o resolución temporal.
pt_br: No entanto, essas vantagens apresentam uma grande desvantagem. As imagens geralmente contêm milhares a milhões de pixels e, portanto, apenas uma pequena fração do tempo necessário para registrar uma imagem é gasta na detecção de fótons para qualquer pixel em uma imagem LSCM - ao contrário do caso de campo amplo, onde os fótons podem ser detectados para todos pixels durante todo o tempo de aquisição da imagem. Isso pode fazer com que a aquisição da imagem LSCM seja comparativamente lenta, ruidosa (em termos de poucos fótons detectados) ou ambos. A informação espacial é, portanto, obtida com um custo de ruído e/ou resolução temporal.

source: Question
es: Pregunta
pt_br: Pergunta

source: Why is it often recommended that the pinhole in LSCM be set to have the same size as one Airy disk? And why is it sometimes better not to strictly follow this recommendation?
es: ¿Por qué a menudo se recomienda configurar el pinhole en LSCM para que tenga el mismo tamaño que un disco Airy? ¿Y por qué a veces es mejor no seguir estrictamente esta recomendación?
pt_br: Por que muitas vezes é recomendado que o furo no LSCM seja configurado para ter o mesmo tamanho de um disco Airy? E por que às vezes é melhor não seguir rigorosamente esta recomendação?

source: Answer
es: Respuesta
pt_br: Responder

source: As described in {ref}`chap_formation_spatial`, the vast majority of the light from the in-focus plane falls within the Airy disk. Using a pinhole smaller than this can result in so little light being detected that the image becomes too noisy to be useful. On the other hand, increasing the size of the pinhole will result in some more of the remaining light located in the outer rings of the Airy pattern, but _most_ extra photons will come from out-of-focus planes. This causes a reduction in the effectiveness of the optical sectioning. Therefore, a pinhole diameter of approximately 1 Airy disk provides a reasonable balance between detecting most of the in-focus light and achieving good optical sectioning.
es: Como se describe en {ref}`chap_formation_spatial`, la gran mayoría de la luz del plano enfocado cae dentro del disco de Airy. El uso de un pinhole más pequeño que este puede provocar que se detecte tan poca luz que la imagen se vuelva demasiado ruidosa para ser útil. Por otro lado, aumentar el tamaño del pinhole dará como resultado algo más de luz restante ubicada en los anillos exteriores del patrón de Airy, pero la mayoría de los fotones adicionales provendrán de planos desenfocados. Esto provoca una reducción de la eficacia del seccionamiento óptico. Por lo tanto, un diámetro de pinhole de aproximadamente 1 disco de Airy proporciona un equilibrio razonable entre detectar la mayor parte de la luz enfocada y lograr un buen seccionamiento óptico.
pt_br: Conforme descrito em {ref}`chap_formation_spatial`, a grande maioria da luz do plano em foco cai dentro do disco Airy. Usar um orifício menor que esse pode resultar na detecção de tão pouca luz que a imagem fica com muito ruído para ser útil. Por outro lado, aumentar o tamanho do furo resultará em um pouco mais da luz restante localizada nos anéis externos do padrão Airy, mas _a maioria_ dos fótons extras virão de planos fora de foco. Isto causa uma redução na eficácia do seccionamento óptico. Portanto, um diâmetro de furo de aproximadamente 1 disco Airy fornece um equilíbrio razoável entre a detecção da maior parte da luz em foco e a obtenção de um bom seccionamento óptico.
