Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/3-fluorescence/4-microscope_types/microscope_types.po
Languages: es, pt_br

source: A **Charged Coupled Device (CCD)** is a detector with a region devoted to sensing photons, and which is subdivided into different 'physical pixels' that correspond to pixels in the final image. Thus the image size cannot be changed arbitrarily, but it's possible to record photons for many pixels in parallel.
es: Un **Dispositivo de carga acoplada (CCD)** es un detector con una región dedicada a detectar fotones y que se subdivide en diferentes "píxeles físicos" que corresponden a los píxeles de la imagen final. Por lo tanto, el tamaño de la imagen no se puede cambiar arbitrariamente, pero es posible registrar fotones para muchos píxeles en paralelo.
pt_br: Um **Charged Coupled Device (CCD)** é um detector com uma região dedicada à detecção de fótons e que é subdividido em diferentes 'pixels físicos' que correspondem aos pixels da imagem final. Assim, o tamanho da imagem não pode ser alterado arbitrariamente, mas é possível registrar fótons para muitos pixels em paralelo.

source: When a photon strikes a pixel in the sensing part of the CCD, this often releases an electron -- the QE is typically high (perhaps 90%). After a certain exposure time, different 'electron clouds' have then formed at each physical pixel on the sensor, each of which has a charge related to the number of colliding photons. This charge is then measured by passing the electrons through a charge amplifier, and the results used to assign an intensity value to the pixel in the final image ({numref}`fig-ccd`).
es: Cuando un fotón golpea un píxel en la parte sensora del CCD, esto a menudo libera un electrón; el QE suele ser alto (quizás 90%). Después de un cierto tiempo de exposición, en cada píxel físico del sensor se forman diferentes "nubes de electrones", cada una de las cuales tiene una carga relacionada con el número de fotones en colisión. Luego, esta carga se mide pasando los electrones a través de un amplificador de carga y los resultados se utilizan para asignar un valor de intensidad al píxel en la imagen final ({numref}`fig-ccd`) .
pt_br: Quando um fóton atinge um pixel na parte de detecção do CCD, isso geralmente libera um elétron – o QE é normalmente alto (talvez 90%). Após um certo tempo de exposição, diferentes “nuvens de elétrons” se formaram em cada pixel físico do sensor, cada uma delas com uma carga relacionada ao número de fótons em colisão. Essa carga é então medida passando os elétrons por um amplificador de carga, e os resultados são usados para atribuir um valor de intensidade ao pixel na imagem final ({numref}`fig-ccd`) .

source: An illustration of the basic operation of a CCD camera (using frame transfer). First, photons strike a sense register, which is divided into pixels. This causes small clouds of electrons to be released and gather behind the pixels (A). These are then rapidly shifted downwards into another register of the same size, thereby freeing the sense register to continue detecting photons (B). The electron clouds are then shifted downwards again, one row at a time, with each row finally being shifted sequentially through a charge amplifier \(C). This quantifies the charge of the electron clouds, from which pixel values for the final image are determined.
es: Una ilustración del funcionamiento básico de una cámara CCD (mediante transferencia de fotogramas). En primer lugar, los fotones inciden en un registro sensorial, que se divide en píxeles. Esto hace que se liberen pequeñas nubes de electrones que se acumulan detrás de los píxeles (A). Luego, estos se desplazan rápidamente hacia abajo a otro registro del mismo tamaño, liberando así el registro sensorial para continuar detectando fotones (B). Luego, las nubes de electrones se desplazan hacia abajo nuevamente, una fila a la vez, y cada fila finalmente se desplaza secuencialmente a través de un amplificador de carga \(C). Esto cuantifica la carga de las nubes de electrones, a partir de las cuales se determinan los valores de píxeles para la imagen final.
pt_br: Uma ilustração da operação básica de uma câmera CCD (usando transferência de quadros). Primeiro, os fótons atingem um registro sensorial, que é dividido em pixels. Isso faz com que pequenas nuvens de elétrons sejam liberadas e se acumulem atrás dos pixels (A). Estes são então rapidamente deslocados para baixo, para outro registro do mesmo tamanho, liberando assim o registro de detecção para continuar detectando fótons (B). As nuvens de elétrons são então deslocadas para baixo novamente, uma fileira de cada vez, com cada fileira sendo finalmente deslocada sequencialmente através de um amplificador de carga \(C). Isso quantifica a carga das nuvens de elétrons, a partir das quais são determinados os valores dos pixels para a imagem final.

source: The electron clouds for each pixel might be larger than in the PMT case, both because of the higher QE and because more time can be spent detecting photons (since this is carried out for all pixels simultaneously). However, the step of amplifying the numbers of electrons safely above the read noise before quantification is missing. Consequently, read noise is potentially more problematic, and in some cases can even dominate the result.
es: Las nubes de electrones para cada píxel pueden ser más grandes que en el caso de PMTs, tanto por el mayor QE como porque se puede dedicar más tiempo a detectar fotones (ya que esto se lleva a cabo para todos los píxeles simultáneamente). Sin embargo, falta el paso de amplificar el número de electrones de forma segura por encima del ruido de lectura antes de la cuantificación. En consecuencia, el ruido de lectura es potencialmente más problemático y, en algunos casos, incluso puede dominar el resultado.
pt_br: As nuvens de elétrons para cada pixel podem ser maiores do que no caso PMT, tanto por causa do maior QE quanto porque mais tempo pode ser gasto na detecção de fótons (uma vez que isso é realizado para todos os pixels simultaneamente). No entanto, falta a etapa de amplificar o número de elétrons com segurança acima do ruído de leitura antes da quantificação. Consequentemente, o ruído de leitura é potencialmente mais problemático e, em alguns casos, pode até dominar o resultado.

source: Pixel binning
es: Agrupación de píxeles (binning)
pt_br: Compartimentação de pixels

source: One way to address the issue of CCD read noise is to use **pixel binning**. In this case, the electrons from 4 (i.e. 2×2) pixels of the CCD are added together before being quantified: the electron clouds are approximately 4 times bigger relative to the read noise ({numref}`fig-ccd_binning`), and readout can be faster because fewer electron clouds need to be quantified. The obvious disadvantage of this is that one cannot then put the electrons from the 4 pixels 'back where they belong'. As a result, the binned measurement is simply treated as a single (bigger) pixel. The recorded image contains 25% of the pixels in the unbinned image, while still covering the same field of view, so spatial information is lost. Larger bins may also be used, with a correspondingly more dramatic impact upon image size ({numref}`fig-ccd_binning`D).
es: Una forma de abordar el problema del ruido de lectura del CCD es utilizar **agrupación de píxeles** o binning. En este caso, los electrones de 4 (es decir, 2×2) píxeles del CCD se suman antes de ser cuantificados: las nubes de electrones son aproximadamente 4 veces más grandes en relación con el ruido de lectura ({numref}`fig-ccd_binning`), y la lectura puede ser más rápida porque es necesario cuantificar menos nubes de electrones. La desventaja obvia de esto es que no es posible devolver los electrones de los 4 píxeles a su lugar original. Como resultado, la medición agrupada simplemente se trata como un único píxel (más grande). La imagen grabada contiene el 25 % de los píxeles de la imagen sin agrupar, aunque sigue cubriendo el mismo campo de visión, por lo que se pierde información espacial. También se pueden utilizar contenedores más grandes, con un impacto correspondientemente más dramático en el tamaño de la imagen ({numref}`fig-ccd_binning`D).
pt_br: Uma maneira de resolver o problema do ruído de leitura do CCD é usar **binning de pixels**. Neste caso, os elétrons de 4 (ou seja, 2×2) pixels do CCD são somados antes de serem quantificados: as nuvens de elétrons são aproximadamente 4 vezes maiores em relação ao ruído de leitura ({numref}`fig-ccd_binning`), e a leitura pode ser mais rápida porque menos nuvens de elétrons precisam ser quantificadas. A desvantagem óbvia disto é que não se pode então colocar os electrões dos 4 pixels “de volta ao lugar a que pertencem”. Como resultado, a medição agrupada é simplesmente tratada como um único pixel (maior). A imagem gravada contém 25% dos pixels da imagem não binada, enquanto ainda cobre o mesmo campo de visão, portanto, a informação espacial é perdida. Caixas maiores também podem ser usadas, com um impacto correspondentemente mais dramático no tamanho da imagem ({numref}`fig-ccd_binning`D).

source: Illustration of the effect of binning applied to an image suffering from photon and (severe) read noise. As the bin size increases, the photons from neighboring pixels are combined into a single (larger) pixel before the read noise is added. As a consequence, the image becomes brighter relative to the read noise -- but at a cost of spatial information.
es: Ilustración del efecto de agrupamiento aplicado a una imagen que sufre de ruido de fotones y de lectura (grave). A medida que aumenta el tamaño del contenedor, los fotones de los píxeles vecinos se combinan en un solo píxel (más grande) antes de agregar el ruido de lectura. Como consecuencia, la imagen se vuelve más brillante en relación al ruido leído, pero a costa de información espacial.
pt_br: Ilustração do efeito de binning aplicado a uma imagem que sofre de fótons e ruído de leitura (grave). À medida que o tamanho do compartimento aumenta, os fótons dos pixels vizinhos são combinados em um único pixel (maior) antes que o ruído de leitura seja adicionado. Como consequência, a imagem torna-se mais brilhante em relação ao ruído de leitura – mas à custa de informação espacial.

source: EMCCDs: fast imaging with low light levels
es: EMCCD: imágenes rápidas con bajos niveles de luz
pt_br: EMCCDs: imagens rápidas com baixos níveis de luz

source: And so you might wonder whether it is possible to increase the electron clouds (like with the PMT) with an CCD, and so get its advantages without the major inconvenience of read noise. **Electron Multiplying CCDs (EMCCDs)** achieve this to some extent. Here, the electrons are first passed through an additional 'gain register' before quantification. At every stage of this gain register, each electron has a small probability -- perhaps only 1% -- of being amplified (through 'impact ionisation') and giving rise to two electrons entering the next stage. Despite the small probability, by incorporating > 500 such stages, the size of the electron cloud arising from even a single photon may be amplified safely above the read noise.
es: Por lo tanto, cabría preguntarse si es posible aumentar las nubes de electrones (como con el PMT) con un CCD y así obtener sus ventajas sin el mayor inconveniente del ruido de lectura. **Los multiplicadores CCD de electrones (EMCCD)** logran esto hasta cierto punto. Aquí, los electrones pasan primero a través de un "registro de ganancia" adicional antes de la cuantificación. En cada etapa de este registro de ganancia, cada electrón tiene una pequeña probabilidad -tal vez sólo el 1%- de ser amplificado (mediante "ionización por impacto") y dar lugar a dos electrones que ingresan a la siguiente etapa. A pesar de la pequeña probabilidad, al incorporar > 500 de estas etapas, el tamaño de la nube de electrones que surge incluso de un solo fotón puede amplificarse de manera segura por encima del ruido leído.
pt_br: E então você pode estar se perguntando se é possível aumentar as nuvens de elétrons (como no PMT) com um CCD, e assim obter suas vantagens sem o grande inconveniente do ruído de leitura. **CCDs de multiplicação de elétrons (EMCCDs)** conseguem isso até certo ponto. Aqui, os elétrons passam primeiro por um “registro de ganho” adicional antes da quantificação. Em cada fase deste registo de ganho, cada electrão tem uma pequena probabilidade - talvez apenas 1% - de ser amplificado (através da 'ionização por impacto') e dar origem a dois electrões que entram na fase seguinte. Apesar da pequena probabilidade, ao incorporar > 500 desses estágios, o tamanho da nuvem de elétrons resultante de um único fóton pode ser amplificado com segurança acima do ruído de leitura.

source: However, the randomness of the amplification process itself introduces a new source of uncertainty, so that the final outcome can be thought of as having the same precision as if perhaps only around half as many photons were detected (see {ref}`chap_formation_noise` for the relationship between noise and the number of photons). Therefore read noise is effectively overcome at the cost of more photon noise.
es: Sin embargo, la aleatoriedad del proceso de amplificación en sí introduce una nueva fuente de incertidumbre, por lo que se puede considerar que el resultado final tiene la misma precisión que si quizás sólo se detectaran alrededor de la mitad de fotones (ver {ref}`chap_formation_noise` para la relación entre el ruido y el número de fotones). Por lo tanto, el ruido de lectura se supera eficazmente a costa de más ruido de fotones.
pt_br: No entanto, a aleatoriedade do próprio processo de amplificação introduz uma nova fonte de incerteza, de modo que o resultado final pode ser considerado como tendo a mesma precisão como se talvez apenas cerca de metade dos fótons fossem detectados (ver {ref}`chap_formation_noise` para a relação entre o ruído e o número de fótons). Portanto, o ruído de leitura é efetivamente superado ao custo de mais ruído de fótons.

source: A simplified diagram comparing a conventional CCD (with and without binning) and an EMCCD. While each has the same physical number of pixels, when binning is used electrons from several pixels are combined before readout -- thereby making the 'logical' pixels in the final image bigger. For the EMCCD, the electrons are shifted through a 'gain register' prior to quantification. See {numref}`fig-ccd` for additional labels; the sense register has been omitted for simplicity.
es: Un diagrama simplificado que compara un CCD convencional (con y sin agrupamiento) y un EMCCD. Si bien cada uno tiene el mismo número físico de píxeles, cuando se utiliza el agrupamiento, los electrones de varios píxeles se combinan antes de la lectura, lo que hace que los píxeles "lógicos" de la imagen final sean más grandes. Para el EMCCD, los electrones se desplazan a través de un "registro de ganancia" antes de la cuantificación. Consulta {numref}`fig-ccd` para obtener etiquetas adicionales; el registro sensorial se ha omitido por simplicidad.
pt_br: Um diagrama simplificado comparando um CCD convencional (com e sem binning) e um EMCCD. Embora cada um tenha o mesmo número físico de pixels, quando o binning é usado, os elétrons de vários pixels são combinados antes da leitura - aumentando assim os pixels 'lógicos' na imagem final. Para o EMCCD, os elétrons são deslocados através de um “registro de ganho” antes da quantificação. Veja {numref}`fig-ccd` para rótulos adicionais; o registro de sentido foi omitido por simplicidade.

source: From a practical point of view, an EMCCD is rather like having a CCD with no read noise, but with half the QE. Under what circumstances (i.e. high or low numbers of photons) is an EMCCD preferable to a CCD?
es: Desde un punto de vista práctico, un EMCCD es como tener un CCD sin ruido de lectura, pero con la mitad de QE. ¿En qué circunstancias (es decir, números altos o bajos de fotones) es preferible un EMCCD a un CCD?
pt_br: Do ponto de vista prático, um EMCCD é como ter um CCD sem ruído de leitura, mas com metade do QE. Em que circunstâncias (isto é, números elevados ou baixos de fotões) é um EMCCD preferível a um CCD?

source: The gain register of EMCCDs offers benefits primarily when few photons are available (i.e. when read-noise is the main problem, such as in SDCM). CCDs are preferable when many photons are available (e.g. in widefield).
es: El registro de ganancia de los EMCCD ofrece beneficios principalmente cuando hay pocos fotones disponibles (es decir, cuando el ruido de lectura es el principal problema, como en SDCM). Los CCD son preferibles cuando hay muchos fotones disponibles (por ejemplo, en campo amplio).
pt_br: O registro de ganho dos EMCCDs oferece benefícios principalmente quando poucos fótons estão disponíveis (ou seja, quando o ruído de leitura é o principal problema, como no SDCM). Os CCDs são preferíveis quando muitos fótons estão disponíveis (por exemplo, em campo amplo).

source: If you are skeptical about this, consider an image in which your read noise standard deviation is 10 electrons and you detect on average 9 electrons (originally photons). The photon noise then has a standard deviation of 3. The read noise is much larger and will completely dominate the image: nothing interesting will be visible. It's then worth the cost of even more photon noise to be able to eliminate the read noise. The final image will still look pretty bad, but at least interpreting it is not hopeless.
es: Si eres escéptico acerca de esto, considera una imagen en la que la desviación estándar del ruido de lectura sea de 10 electrones y detectas en promedio 9 electrones (originalmente fotones). El ruido del fotón tiene entonces una desviación estándar de 3. El ruido de lectura es mucho mayor y dominará completamente la imagen: no se verá nada interesante. Entonces vale la pena gastar aún más ruido de fotones para poder eliminar el ruido de lectura. La imagen final seguirá teniendo un aspecto bastante malo, pero al menos interpretarla no es inútil.
pt_br: Se você está cético quanto a isso, considere uma imagem na qual o desvio padrão do ruído de leitura é de 10 elétrons e você detecta em média 9 elétrons (originalmente fótons). O ruído do fóton tem então um desvio padrão de 3. O ruído de leitura é muito maior e dominará completamente a imagem: nada de interessante será visível. Então vale a pena gastar ainda mais ruído de fótons para poder eliminar o ruído de leitura. A imagem final ainda parecerá muito ruim, mas pelo menos interpretá-la não é impossível.

source: But suppose you happen to have 90000 detected photons instead, in which case the standard deviation of the photon noise is now 300. The read noise of 10 is comparatively insignificant, and there is nothing to gain from electron multiplication and making the photon noise situation worse.
es: Pero supongamos que en su lugar tienes 90000 fotones detectados, en cuyo caso la desviación estándar del ruido de los fotones ahora es 300. El ruido de lectura de 10 es comparativamente insignificante, y no hay nada que ganar con la multiplicación de electrones ni empeorando la situación del ruido de los fotones. .
pt_br: Mas suponha que você tenha 90.000 fótons detectados, caso em que o desvio padrão do ruído do fóton é agora 300. O ruído de leitura de 10 é comparativamente insignificante e não há nada a ganhar com a multiplicação dos elétrons e com o agravamento da situação do ruído do fóton. .

source: Based upon the above descriptions, which detectors seem most appropriate (generally!) for (a) widefield microscopy, (b) SDCM and (c) LSCM?
es: Según las descripciones anteriores, ¿qué detectores parecen más apropiados (¡en general!) para (a) microscopía de campo amplio, (b) SDCM y (c) LSCM.
pt_br: Com base nas descrições acima, quais detectores parecem mais apropriados (geralmente!) para (a) microscopia de campo amplo, (b) SDCM e (c) LSCM?

source: The following are reasonable rules of thumb:
es: Las siguientes son reglas generales razonables:
pt_br: A seguir estão regras práticas razoáveis:

source: _Widefield microscopy:_ A CCD is suitable because of its ability to record many pixels simultaneously. The large number of photons normally detected means that read noise is not usually a big issue, and an EMCCD can make the problem of noise worse instead of better.
es: _Microscopía de campo amplio:_ Un CCD es adecuado debido a su capacidad para registrar muchos píxeles simultáneamente. La gran cantidad de fotones que normalmente se detectan significa que el ruido de lectura no suele ser un gran problema, y un EMCCD puede empeorar el problema del ruido en lugar de mejorarlo.
pt_br: _Microscopia de campo amplo:_ Um CCD é adequado devido à sua capacidade de gravar muitos pixels simultaneamente. O grande número de fótons normalmente detectados significa que o ruído de leitura geralmente não é um grande problema, e um EMCCD pode piorar o problema do ruído em vez de melhorá-lo.

source: _Spinning Disk Confocal Microscopy:_ A CCD may be used, but an EMCCD (or other CCD variant) is often preferable. This is because SDCM usually gives lower photon counts (certainly lower than in a comparable widefield image), which can mean that read noise would dominate the result unless the photons are somehow amplified.
es: _Microscopía confocal de disco giratorio:_ Se puede utilizar un CCD, pero a menudo es preferible un EMCCD (u otra variante de CCD). Esto se debe a que SDCM generalmente proporciona recuentos de fotones más bajos (ciertamente más bajos que en una imagen de campo amplio comparable), lo que puede significar que el ruido de lectura dominaría el resultado a menos que los fotones se amplifiquen de alguna manera.
pt_br: _Microscopia confocal de disco giratório:_ Um CCD pode ser usado, mas um EMCCD (ou outra variante de CCD) geralmente é preferível. Isso ocorre porque o SDCM geralmente fornece contagens de fótons mais baixas (certamente mais baixas do que em uma imagem de campo amplo comparável), o que pode significar que o ruído de leitura dominaria o resultado, a menos que os fótons fossem de alguma forma amplificados.

source: _Laser Scanning Confocal Microscopy:_ PMTs are suitable, since the image is built up one pixel at a time.
es: _Microscopía confocal de barrido láser:_ Los PMT son adecuados, ya que la imagen se construye un píxel a la vez.
pt_br: _Microscopia confocal de varredura a laser:_ PMTs são adequados, pois a imagem é construída um pixel por vez.
