Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/2-formation_spatial/formation_spatial.po
Languages: de, pt_br

source: Blur & the PSF
de: Unschärfe und die PSF
pt_br: Desfoque e o PSF

source: Chapter outline
de: Gliederung des Kapitels
pt_br: Esboço do capítulo

source: Measurements in fluorescence microscopy are affected by **blur**
de: Messungen in der Fluoreszenzmikroskopie werden durch **Unschärfe** beeinträchtigt
pt_br: As medições na microscopia de fluorescência são afetadas por **desfoque**

source: Blur acts as a convolution with the microscope's **Point Spread Function (PSF)**
de: Unschärfe wirkt wie eine Faltung mit der **Point Spread Function (PSF)** des Mikroskops
pt_br: O desfoque atua como uma convolução com a **Função de dispersão de pontos (PSF)** do microscópio

source: The size of the PSF depends on the **microscope type**, **light wavelength** & **objective lens Numerical Aperture (NA)**, and is on the order of hundreds of nm
de: Die Größe der PSF hängt vom **Mikroskoptyp**, der **Lichtwellenlänge** und der **Numerischen Apertur (NA)** des Objektivs ab und liegt in der Größenordnung von Hunderten von nm.
pt_br: O tamanho do PSF depende do **tipo de microscópio**, **comprimento de onda da luz** e **abertura numérica (NA) da lente objetiva** e é da ordem de centenas de nm

source: In the focal plane, the PSF is an **Airy pattern**
de: In der Brennebene ist die PSF ein **Airy-Muster**
pt_br: No plano focal, o PSF é um **padrão aéreo**

source: **Spatial resolution** is a measure of how close structures can be distinguished. It's better in _xy_ than along the _z_ dimension.
de: Die **Raumauflösung** ist ein Maß dafür, wie nahe Strukturen unterschieden werden können. Sie ist in der _xy_-Dimension besser als entlang der _z_-Dimension.
pt_br: **Resolução espacial** é uma medida de quão próximas estruturas podem ser distinguidas. É melhor em _xy_ do que na dimensão _z_.

source: Introduction
de: Einführung
pt_br: Introdução

source: Microscopy images normally look blurry because light originating from one point in the sample is not all detected at a single pixel: usually it is detected over several pixels and _z_-slices. This is _not_ simply because we cannot use perfect lenses; rather, it's caused by a fundamental limit imposed by the nature of light. The end result is as if the light that we detect is redistributed slightly throughout our data ({numref}`fig-castles`).
de: Mikroskopische Bilder sehen normalerweise unscharf aus, weil das Licht, das von einem Punkt in der Probe ausgeht, nicht alle in einem einzigen Pixel erfasst wird, sondern in der Regel über mehrere Pixel und _z_-Scheiben verteilt ist. Das liegt _nicht_ daran, dass wir keine perfekten Objektive verwenden können, sondern an einer grundsätzlichen Beschränkung, die durch die Natur des Lichts bedingt ist. Das Endergebnis ist so, als ob das Licht, das wir erkennen, in unseren Daten leicht umverteilt ist ({numref}`fig-castles`).
pt_br: As imagens microscópicas normalmente parecem borradas porque a luz originada de um ponto na amostra não é detectada em um único pixel: geralmente ela é detectada em vários pixels e fatias _z_. Isto _não_ é simplesmente porque não podemos usar lentes perfeitas; pelo contrário, é causado por um limite fundamental imposto pela natureza da luz. O resultado final é como se a luz que detectamos fosse ligeiramente redistribuída pelos nossos dados ({numref}`fig-castles`).

source: Schematic diagram showing the effects of blur. Think of the sand as photons, and the [height of the sandcastle as the intensity values of pixels](fig-transform_surface) (a greater height indicates more photons, and thus a brighter pixel). The ideal data would be sharp and could contain fine details (A), but after blurring it's not only harder to discriminate details, but intensities in the brighter regions have been reduced and sizes increased (B). If we then wish to determine the size or height of one of the sandcastle's towers, for example, we need to remember that any results we get by measuring (B) will differ from those we would have got if we could have measured (A) itself. Note, however, that approximately the same _amount_ of signal (sand or photons) is present in both cases –- only the arrangement has been changed.
de: Schematisches Diagramm zur Darstellung der Auswirkungen der Unschärfe. Stellen Sie sich den Sand als Photonen und die [Höhe der Sandburg als die Intensitätswerte der Pixel](fig-transform_surface) vor (eine größere Höhe bedeutet mehr Photonen und damit ein helleres Pixel). Die idealen Daten wären scharf und könnten feine Details enthalten (A), aber nach der Unschärfe ist es nicht nur schwieriger, Details zu unterscheiden, sondern die Intensitäten in den helleren Regionen wurden reduziert und die Größe erhöht (B). Wenn wir nun z. B. die Größe oder Höhe eines der Türme der Sandburg bestimmen wollen, müssen wir bedenken, dass die Ergebnisse, die wir durch die Messung von (B) erhalten, sich von denen unterscheiden, die wir erhalten hätten, wenn wir (A) selbst hätten messen können. Beachten Sie jedoch, dass in beiden Fällen ungefähr die gleiche _Menge_ an Signal (Sand oder Photonen) vorhanden ist - nur die Anordnung hat sich geändert.
pt_br: Diagrama esquemático mostrando os efeitos do desfoque. Pense na areia como fótons e na [altura do castelo de areia como os valores de intensidade dos pixels](fig-transform_surface) (uma altura maior indica mais fótons e, portanto, um pixel mais brilhante). Os dados ideais seriam nítidos e poderiam conter detalhes finos (A), mas após o desfoque não só é mais difícil discriminar os detalhes, como as intensidades nas regiões mais brilhantes foram reduzidas e os tamanhos aumentados (B). Se quisermos então determinar o tamanho ou a altura de uma das torres do castelo de areia, por exemplo, precisamos lembrar que quaisquer resultados que obtivermos medindo (B) serão diferentes daqueles que obteríamos se pudéssemos medir (A). em si. Observe, entretanto, que aproximadamente a mesma quantidade de sinal (areia ou fótons) está presente em ambos os casos – apenas o arranjo foi alterado.

source: This is important for three reasons:
de: Dies ist aus drei Gründen wichtig:
pt_br: Isto é importante por três razões:

source: Blur affects the apparent **size** of structures
de: Unschärfe beeinflusst die scheinbare **Größe** von Strukturen
pt_br: O desfoque afeta o **tamanho** aparente das estruturas

source: Blur affects the apparent **intensity** (i.e. brightnesses) of structures
de: Unschärfe beeinflusst die scheinbare **Intensität** (d. h. die Helligkeit) von Strukturen
pt_br: O desfoque afeta a **intensidade** aparente (ou seja, brilho) das estruturas

source: Blur (sometimes) affects the apparent **number** of structures
de: Unschärfe beeinträchtigt (manchmal) die scheinbare **Anzahl** der Strukturen
pt_br: O desfoque (às vezes) afeta o **número** aparente de estruturas

source: Therefore, _almost every measurement_ we might want to make can be affected by blurring to some degree.
de: Daher kann _fast jede Messung_, die wir vornehmen wollen, bis zu einem gewissen Grad durch Unschärfe beeinträchtigt werden.
pt_br: Portanto, _quase todas as medições_ que possamos querer fazer podem ser afetadas pelo desfoque até certo ponto.

source: That's the bad news about blur. The good news is that it's rather well understood, and we can take some comfort that it is not random. In fact, the main ideas have already been described in {ref}`chap_filters`, because blurring in fluorescence microscopy is mathematically described by a **convolution** involving the microscope's **Point Spread Function (PSF)**. In other words, the PSF acts like a linear filter applied to the perfect, sharp data we would like but can never directly acquire.
de: Das ist die schlechte Nachricht über die Unschärfe. Die gute Nachricht ist, dass die Unschärfe ziemlich gut verstanden ist und wir uns damit trösten können, dass sie nicht zufällig ist. Tatsächlich wurden die wichtigsten Ideen bereits in {ref}`chap_filters` beschrieben, denn Unschärfe in der Fluoreszenzmikroskopie wird mathematisch durch eine **Faltung** beschrieben, die die **Point Spread Function (PSF)** des Mikroskops einbezieht. Mit anderen Worten: Die PSF wirkt wie ein linearer Filter, der auf die perfekten, scharfen Daten angewendet wird, die wir gerne hätten, aber nie direkt erhalten können.
pt_br: Essa é a má notícia sobre o desfoque. A boa notícia é que é bastante bem compreendido e podemos ter algum conforto de que não é aleatório. Na verdade, as ideias principais já foram descritas em {ref}`chap_filters`, porque o desfoque na microscopia de fluorescência é descrito matematicamente por uma **convolução** envolvendo o **Point Spread do microscópio Função (PSF)**. Em outras palavras, o PSF atua como um filtro linear aplicado aos dados perfeitos e nítidos que gostaríamos, mas que nunca poderemos adquirir diretamente.

source: Previously, we saw how smoothing (e.g. mean or Gaussian) filters could helpfully reduce noise, but as the filter size increased we would [lose more and more detail](chap_filters_gaussian_size). At that time, we could choose the size and shapes of filters ourselves, changing them arbitrarily by modifying coefficients to get the noise-reduction vs. lost-detail balance we liked best. But the microscope's blurring differs in at least two important ways. Firstly, it's effectively applied to our data _before_ noise gets involved, so offers no noise-reduction benefits. Secondly, because it occurs before we ever set our eyes on our images, the size and shape of the filter used (i.e. the PSF) are only indirectly (and in a very limited way) under our control. It would therefore be much nicer just to dispense with the blurring completely since it offers no real help, but unfortunately light conspires to make this not an option: we just need to cope with it.
de: Zuvor hatten wir gesehen, wie Glättungsfilter (z. B. Mittelwert- oder Gauß-Filter) das Rauschen reduzieren können, aber mit zunehmender Filtergröße würden wir [immer mehr Details verlieren] (chap_filters_gaussian_size). Damals konnten wir die Größe und die Form der Filter selbst wählen und sie durch Ändern der Koeffizienten beliebig verändern, um ein ausgewogenes Verhältnis zwischen Rauschunterdrückung und Detailverlust zu erzielen, das uns am besten gefiel. Die Unschärfe des Mikroskops unterscheidet sich jedoch in mindestens zwei wichtigen Punkten. Erstens wird sie effektiv auf unsere Daten angewendet, _bevor_ Rauschen ins Spiel kommt, und bietet daher keine Vorteile bei der Rauschreduzierung. Zweitens sind Größe und Form des verwendeten Filters (d. h. die PSF) nur indirekt (und in sehr begrenztem Maße) von uns beeinflussbar, da die Unschärfe auftritt, bevor wir unsere Bilder überhaupt betrachten. Es wäre daher viel schöner, auf die Unschärfe ganz zu verzichten, da sie keine wirkliche Hilfe bietet, aber leider macht das Licht diese Möglichkeit unmöglich: Wir müssen einfach damit zurechtkommen.
pt_br: Anteriormente, vimos como os filtros de suavização (por exemplo, médios ou gaussianos) poderiam reduzir o ruído de maneira útil, mas à medida que o tamanho do filtro aumentasse, [perderíamos cada vez mais detalhes] (chap_filters_gaussian_size). Naquela época, podíamos escolher nós mesmos o tamanho e a forma dos filtros, alterando-os arbitrariamente, modificando os coeficientes para obter o equilíbrio entre redução de ruído e perda de detalhes que mais gostávamos. Mas o desfoque do microscópio difere em pelo menos dois aspectos importantes. Em primeiro lugar, é efetivamente aplicado aos nossos dados _antes_ que o ruído seja envolvido, portanto não oferece benefícios de redução de ruído. Em segundo lugar, porque ocorre antes mesmo de colocarmos os olhos nas nossas imagens, o tamanho e a forma do filtro utilizado (ou seja, o PSF) estão apenas indiretamente (e de uma forma muito limitada) sob o nosso controlo. Seria, portanto, muito melhor simplesmente dispensar completamente o desfoque, já que ele não oferece nenhuma ajuda real, mas infelizmente a luz conspira para que isso não seja uma opção: só precisamos lidar com isso.

source: The purpose of this chapter is to offer a practical introduction to why the blurring occurs, what a widefield microscope's PSF looks like, and why all this matters. Detailed optics and threatening integrals are not included, although several equations make appearances. Fortunately for the mathematically unenthusiastic, these are both short and useful.
de: Ziel dieses Kapitels ist es, eine praktische Einführung in die Gründe für die Unschärfe zu geben, wie die PSF eines Weitfeldmikroskops aussieht und warum dies alles wichtig ist. Detaillierte Optik und bedrohliche Integrale sind nicht enthalten, obwohl einige Gleichungen auftauchen. Zum Glück für die mathematisch Uninteressierten sind diese sowohl kurz als auch nützlich.
pt_br: O objetivo deste capítulo é oferecer uma introdução prática sobre por que ocorre o embaçamento, como é o PSF de um microscópio de campo amplo e por que tudo isso é importante. Óptica detalhada e integrais ameaçadoras não estão incluídas, embora várias equações apareçam. Felizmente para os que não estão entusiasmados com a matemática, estes são curtos e úteis.

source: Blur & convolution
de: Unschärfe und Faltung
pt_br: Desfoque e convolução

source: As stated above, the fundamental cause of blur is that light originating from an infinitesimally small point cannot then be detected at a similar point, no matter how great our lenses or detectors might be. Rather, it ends up being focused to some larger volume known as the PSF, which has a minimum size dependent upon both the light's wavelength and the lens being used.
de: Wie bereits erwähnt, liegt die grundlegende Ursache der Unschärfe darin, dass Licht, das von einem winzig kleinen Punkt ausgeht, nicht an einem ähnlichen Punkt erfasst werden kann, egal wie groß unsere Objektive oder Detektoren auch sein mögen. Vielmehr wird es auf ein größeres Volumen fokussiert, das als PSF bezeichnet wird und eine Mindestgröße hat, die sowohl von der Wellenlänge des Lichts als auch vom verwendeten Objektiv abhängt.
pt_br: Como afirmado acima, a causa fundamental do desfoque é que a luz originada de um ponto infinitesimalmente pequeno não pode ser detectada em um ponto semelhante, não importa quão grandes sejam as nossas lentes ou detectores. Em vez disso, acaba sendo focado em um volume maior conhecido como PSF, que tem um tamanho mínimo que depende do comprimento de onda da luz e da lente usada.

source: Although it might not be obvious at low magnification (A), an image can be viewed as composed of small points (B). This gives us a useful way to understand what has happened in a blurred image: each point has simply been replaced by a more diffuse blob, the PSF. Images appear more or less blurred depending upon how large the blobby PSFs are \(C) and (D). This is equivalent to applying the PSF to an image as a linear filter.
de: Auch wenn es bei geringer Vergrößerung nicht offensichtlich ist (A), kann ein Bild als aus kleinen Punkten zusammengesetzt betrachtet werden (B). Dies gibt uns eine nützliche Möglichkeit zu verstehen, was in einem unscharfen Bild passiert ist: Jeder Punkt wurde einfach durch einen diffuseren Fleck, die PSF, ersetzt. Je nachdem, wie groß die PSF-Kleckse sind (C) und (D), erscheinen die Bilder mehr oder weniger unscharf. Dies ist gleichbedeutend mit der Anwendung der PSF auf ein Bild als linearer Filter.
pt_br: Embora possa não ser óbvio em baixa ampliação (A), uma imagem pode ser vista como composta de pequenos pontos (B). Isto dá-nos uma forma útil de compreender o que aconteceu numa imagem desfocada: cada ponto foi simplesmente substituído por uma bolha mais difusa, o PSF. As imagens aparecem mais ou menos desfocadas dependendo do tamanho dos PSFs blobby \(C) e (D). Isto equivale a aplicar o PSF a uma imagem como um filtro linear.

source: This becomes more practically relevant if we consider that _any_ fluorescing sample can be viewed as composed of many similar, exceedingly small light-emitting points -- you may think of each point being a fluorophore. Our image would ideally then include individual points too, digitized into pixels with values proportional to the emitted light. But what we get instead is an image in which every point has been replaced by its PSF, scaled according to the point's brightness. Where these PSFs overlap, the detected light intensities are simply added together. Exactly how blurry this causes the image to be depends upon the size of the PSF ({numref}`fig-psf_sizes`).
de: Praktisch relevant wird dies, wenn man bedenkt, dass _jede_ fluoreszierende Probe aus vielen ähnlichen, äußerst kleinen Licht emittierenden Punkten besteht - man kann sich vorstellen, dass jeder Punkt ein Fluorophor ist. Unser Bild würde dann idealerweise auch einzelne Punkte enthalten, die in Pixel mit Werten proportional zum emittierten Licht digitalisiert werden. Stattdessen erhalten wir ein Bild, in dem jeder Punkt durch seine PSF ersetzt wurde, die entsprechend der Helligkeit des Punktes skaliert ist. Wo sich diese PSFs überschneiden, werden die ermittelten Lichtintensitäten einfach addiert. Wie unscharf das Bild dadurch wird, hängt von der Größe der PSF ab ({numref}`fig-psf_sizes`).
pt_br: Isso se torna mais relevante do ponto de vista prático se considerarmos que _qualquer_ amostra fluorescente pode ser vista como composta de muitos pontos emissores de luz semelhantes e extremamente pequenos - você pode pensar que cada ponto é um fluoróforo. Idealmente, nossa imagem também incluiria pontos individuais, digitalizados em pixels com valores proporcionais à luz emitida. Mas o que obtemos é uma imagem em que cada ponto foi substituído pelo seu PSF, dimensionado de acordo com o brilho do ponto. Onde estes PSFs se sobrepõem, as intensidades de luz detectadas são simplesmente somadas. O grau exato de desfoque da imagem depende do tamanho do PSF ({numref}`fig-psf_sizes`).

source: This blurring process is equivalent to **convolving** the (impossible) ideal point image with the PSF: i.e. applying a linear filter, as described in {ref}`chap_filters`. Because every point is blurred in the same way (at least in the ideal case; extra aberrations can cause some variations), this means that if we know the PSF then we can characterize the blur throughout the entire image -- and thereby make inferences about the extent to which blurring will impact upon anything we measure.
de: Dieser Unschärfeprozess ist gleichbedeutend mit der **Faltung** des (unmöglichen) idealen Punktbildes mit der PSF: d.h. mit der Anwendung eines linearen Filters, wie in {ref}`chap_filters` beschrieben. Da jeder Punkt auf die gleiche Weise unscharf wird (zumindest im Idealfall; zusätzliche Aberrationen können einige Abweichungen verursachen), bedeutet dies, dass wir, wenn wir die PSF kennen, die Unschärfe im gesamten Bild charakterisieren können - und damit Rückschlüsse auf das Ausmaß der Auswirkungen der Unschärfe auf alles, was wir messen, ziehen können.
pt_br: Este processo de desfoque é equivalente a **convoluir** a (impossível) imagem do ponto ideal com o PSF: ou seja, aplicar um filtro linear, conforme descrito em {ref}`chap_filters`. Como cada ponto é desfocado da mesma maneira (pelo menos no caso ideal; aberrações extras podem causar algumas variações), isso significa que se conhecermos o PSF então poderemos caracterizar o desfoque em toda a imagem - e assim fazer inferências sobre até que ponto a indefinição terá impacto sobre qualquer coisa que medimos.

source: The shape of the PSF
de: Die Form der PSF
pt_br: A forma do PSF

source: We can gain an initial impression of a microscope's PSF by recording a *z*-stack of a small, fluorescent bead, which represents an ideal light-emitting point. {numref}`fig-psf_bead` shows that, for a widefield microscope, the bead appears like a bright blob when it is in focus. More curiously, when viewed from the side (__xz__ or __yz__), it has a somewhat hourglass-like appearance -- albeit with some extra patterns. This exact shape is well enough understood that PSFs can also be generated theoretically based upon the type of microscope and objective lenses used (C).
de: Wir können einen ersten Eindruck von der PSF eines Mikroskops gewinnen, indem wir einen *z*-Stapel eines kleinen, fluoreszierenden Kügelchens aufnehmen, das einen idealen Lichtaustrittspunkt darstellt. {numref}`fig-psf_bead` zeigt, dass das Kügelchen bei einem Weitwinkelmikroskop wie ein heller Fleck erscheint, wenn es im Fokus ist. Von der Seite betrachtet (__xz__ oder __yz__) hat es ein sanduhrähnliches Aussehen - wenn auch mit einigen zusätzlichen Mustern. Diese genaue Form ist so gut bekannt, dass PSFs auch theoretisch auf der Grundlage der Art des Mikroskops und der verwendeten Objektive erzeugt werden können (C).
pt_br: Podemos obter uma impressão inicial do PSF de um microscópio gravando uma pilha *z* de uma pequena esfera fluorescente, que representa um ponto ideal de emissão de luz. {numref}`fig-psf_bead` mostra que, para um microscópio de campo amplo, a esfera aparece como uma bolha brilhante quando está em foco. Mais curiosamente, quando visto de lado (__xz__ ou __yz__), tem uma aparência semelhante a uma ampulheta - embora com alguns padrões extras. Esta forma exata é bem compreendida e os PSFs também podem ser gerados teoricamente com base no tipo de microscópio e lentes objetivas utilizadas (C).

source: PSFs for a widefield microscope. (A) and (B) are from z-stacks acquired of a small fluorescent bead, displayed using linear contrast and after applying a gamma transform to make fainter details easier to discern (see {ref}`chap_point_operations` for more information). \(C) shows a theoretical PSF for a similar microscope. It differs in appearance partly because the bead is not really an infinitesimally small point, and partly because the real microscope's objective lens is less than perfect. Nevertheless, the overall shapes are similar.
de: PSFs für ein Weitfeldmikroskop. (A) und (B) stammen von z-Stapeln, die von einem kleinen fluoreszierenden Kügelchen aufgenommen wurden. Sie werden mit linearem Kontrast und nach Anwendung einer Gammatransformation dargestellt, um schwächere Details besser erkennbar zu machen (siehe {ref}`chap_point_operations` für weitere Informationen). \(C) zeigt eine theoretische PSF für ein ähnliches Mikroskop. Sie sieht anders aus, zum einen, weil das Kügelchen nicht wirklich ein winzig kleiner Punkt ist, und zum anderen, weil die Objektivlinse des realen Mikroskops nicht ganz perfekt ist. Dennoch sind die Gesamtformen ähnlich.
pt_br: PSFs para um microscópio de campo amplo. (A) e (B) são de pilhas z adquiridas de uma pequena esfera fluorescente, exibidas usando contraste linear e após a aplicação de uma transformação gama para facilitar a identificação de detalhes mais fracos (consulte {ref}`chap_point_operações` para mais informações). \(C) mostra um PSF teórico para um microscópio semelhante. Sua aparência difere em parte porque o cordão não é realmente um ponto infinitesimalmente pequeno e em parte porque a lente objetiva do microscópio real não é perfeita. No entanto, as formas gerais são semelhantes.

source: Generating PSFs
de: Erzeugen von PSFs
pt_br: Gerando PSFs

source: ImageJ plugins to create theoretical PSFs are available from
de: ImageJ-Plugins zur Erstellung theoretischer PSFs sind erhältlich bei
pt_br: Plug-ins ImageJ para criar PSFs teóricos estão disponíveis em

source: In & out of focus
de: Unscharf und unscharf
pt_br: Dentro e fora de foco
