Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/2-formation_spatial/formation_spatial.po
Languages: de, pt_br

source: {numref}`fig-psf_planes` attempts to show that the hourglass aspect of the PSF is really perfectly intuitive. When recording a *z*-stack of a light-emitting point, we would _prefer_ that the light ended up at a single pixel in a single slice. But the light itself is oblivious to our wishes, and will cheerfully be detected if it happens to strike a detector, no matter where that is. Therefore we should expect the light to be detected across a small region only if the image is in-focus; otherwise it will be spread out to an extent that depends upon how far from the focal point it is detected. From the side (__xz__ or __yz__), this leads to an hourglass shape.
de: {numref}`fig-psf_planes` versucht zu zeigen, dass der Sanduhr-Aspekt der PSF wirklich vollkommen intuitiv ist. Wenn wir einen *z*-Stapel eines lichtemittierenden Punktes aufnehmen, würden wir es _vorziehen_, dass das Licht in einem einzigen Pixel in einer einzigen Scheibe landet. Aber das Licht selbst schert sich nicht um unsere Wünsche und wird freudig erfasst, wenn es auf einen Detektor trifft, egal wo dieser ist. Daher sollten wir erwarten, dass das Licht nur dann in einem kleinen Bereich erfasst wird, wenn das Bild scharf ist; andernfalls wird es in einem Ausmaß gestreut, das davon abhängt, wie weit es vom Brennpunkt entfernt erfasst wird. Von der Seite (__xz__ oder __yz__) betrachtet, ergibt sich eine Sanduhrform.
pt_br: {numref}`fig-psf_planes` tenta mostrar que o aspecto da ampulheta do PSF é realmente perfeitamente intuitivo. Ao registrar uma pilha *z* de um ponto emissor de luz, _preferiríamos_ que a luz terminasse em um único pixel em uma única fatia. Mas a luz em si ignora os nossos desejos e será alegremente detectada se atingir um detector, não importa onde ele esteja. Portanto, devemos esperar que a luz seja detectada através de uma pequena região apenas se a imagem estiver focada; caso contrário, ele se espalhará até um ponto que dependerá da distância do ponto focal em que for detectado. Do lado (__xz__ ou __yz__), isso leva a uma forma de ampulheta.

source: Simplified diagram to help visualize how a light-emitting point would be imaged using a widefield microscope. Some of the light originating from the point is captured by a lens. If you imagine the light then being directed towards a focal point, this leads to an hourglass shape. If a detector is placed close to the focal point, the spot-like image formed by the light striking the detector would be small and bright. However, if the detector were positioned above or below this focal plane, the intensity of the spot would decrease and its size would increase.
de: Vereinfachtes Diagramm zur Veranschaulichung, wie ein Licht emittierender Punkt mit einem Weitfeldmikroskop abgebildet wird. Ein Teil des von dem Punkt ausgehenden Lichts wird von einer Linse eingefangen. Wenn man sich vorstellt, dass das Licht dann auf einen Brennpunkt gerichtet wird, ergibt sich eine Sanduhrform. Befindet sich ein Detektor in der Nähe des Brennpunkts, wäre das punktförmige Bild, das durch das auf den Detektor auftreffende Licht entsteht, klein und hell. Würde der Detektor jedoch oberhalb oder unterhalb dieser Brennebene positioniert, würde die Intensität des Flecks abnehmen und seine Größe zunehmen.
pt_br: Diagrama simplificado para ajudar a visualizar como um ponto emissor de luz seria visualizado usando um microscópio de campo amplo. Parte da luz proveniente do ponto é capturada por uma lente. Se você imaginar a luz sendo direcionada para um ponto focal, isso resultará em uma forma de ampulheta. Se um detector for colocado próximo ao ponto focal, a imagem pontual formada pela luz que atinge o detector seria pequena e brilhante. Porém, se o detector fosse posicionado acima ou abaixo deste plano focal, a intensidade do ponto diminuiria e seu tamanho aumentaria.

source: Question
de: Frage
pt_br: Pergunta

source: In focus, a light-emitting point looks like a small, bright blob. Out of focus, it's much less bright and extends over a wider area.
de: In der Schärfe sieht ein Licht emittierender Punkt wie ein kleiner, heller Fleck aus. Im unscharfen Zustand ist er viel weniger hell und erstreckt sich über einen größeren Bereich.
pt_br: Em foco, um ponto emissor de luz parece uma bolha pequena e brilhante. Fora de foco, é muito menos brilhante e se estende por uma área mais ampla.

source: However, how would you expect the _total amount_ of light to differ in a widefield image depending upon whether a plane is in-focus or not? In other words, would you expect more or less light in the focal plane than in other planes above or below it?
de: Wie würde sich jedoch die _gesamte Lichtmenge_ in einem Weitwinkel-Bild unterscheiden, je nachdem, ob eine Ebene fokussiert ist oder nicht? Mit anderen Worten, würden Sie mehr oder weniger Licht in der Fokusebene erwarten als in anderen Ebenen darüber oder darunter?
pt_br: No entanto, como você esperaria que a _quantidade total_ de luz fosse diferente em uma imagem de campo amplo, dependendo se o avião está em foco ou não? Em outras palavras, você esperaria mais ou menos luz no plano focal do que em outros planos acima ou abaixo dele?

source: Answer
de: Antwort
pt_br: Responder

source: In a widefield image, every plane we can record contains in-focus light along with _all_ the detectable light from _all_ other planes added together. Therefore we should expect approximately _the same total amount of light_ within each plane of a *z*-stack – just differently distributed. That's potentially a lot of light in the 'wrong' place, especially if looking at a thick sample.
de: In einem Weitwinkel-Bild enthält jede Ebene, die wir aufnehmen können, fokussiertes Licht sowie _alles_ erkennbare Licht aus _allen_ anderen Ebenen zusammen. Daher sollten wir ungefähr _die gleiche Gesamtmenge an Licht_ in jeder Ebene eines *z*-Stapels erwarten - nur unterschiedlich verteilt. Das ist potenziell eine Menge Licht an der "falschen" Stelle, besonders wenn man eine dicke Probe betrachtet.
pt_br: Em uma imagem de campo amplo, cada plano que podemos registrar contém luz em foco junto com _toda_ a luz detectável de _todos_ os outros planos somados. Portanto, devemos esperar aproximadamente _a mesma quantidade total de luz_ dentro de cada plano de uma pilha *z* - apenas distribuída de forma diferente. É potencialmente muita luz no lugar “errado”, especialmente se olharmos para uma amostra espessa.

source: At least, this would be so for an infinitely-large detector, or a small, centered sample. In practice, if the light originates from a location so out-of-focus that its light spills over the side of the detector then this plane would contain less light.
de: Zumindest wäre dies bei einem unendlich großen Detektor oder einer kleinen, zentrierten Probe der Fall. In der Praxis, wenn das Licht von einer Stelle ausgeht, die so unscharf ist, dass das Licht über die Seite des Detektors hinausgeht, würde diese Ebene weniger Licht enthalten.
pt_br: Pelo menos, isso seria assim para um detector infinitamente grande ou para uma amostra pequena e centrada. Na prática, se a luz se origina de um local tão fora de foco que sua luz se espalha pela lateral do detector, então este plano conteria menos luz.

source: The appearance of interference
de: Das Auftreten von Störungen
pt_br: O aparecimento de interferência

source: {numref}`fig-psf_planes` is quite limited in what it shows: it doesn't begin to explain the extra patterns of the PSF, which appear on each 2D plane as concentric rings (see {numref}`fig-bead_slices`) nor why the PSF doesn't shrink to a single point in the focal plane. These factors relate to the interference of light waves. While it's important to know that the rings occur -- if only to avoid ever misinterpreting them as extra ring-like structures being really present in a sample -- they have limited influence upon any analysis because the central region of the PSF is overwhelmingly brighter. Therefore for our purposes they can mostly be disregarded.
de: {numref}`fig-psf_planes` ist in seiner Darstellung recht begrenzt: Es erklärt weder die zusätzlichen Muster der PSF, die in jeder 2D-Ebene als konzentrische Ringe erscheinen (siehe {numref}`fig-bead_slices`), noch warum die PSF nicht auf einen einzigen Punkt in der Brennebene schrumpft. Diese Faktoren hängen mit der Interferenz von Lichtwellen zusammen. Es ist zwar wichtig zu wissen, dass die Ringe auftreten - und sei es nur, um zu vermeiden, dass sie als zusätzliche ringförmige Strukturen in einer Probe fehlinterpretiert werden -, aber sie haben nur begrenzten Einfluss auf die Analyse, da der zentrale Bereich der PSF überwiegend heller ist. Für unsere Zwecke können sie daher weitgehend vernachlässigt werden.
pt_br: {numref}`fig-psf_planes` é bastante limitado no que mostra: ele não explica os padrões extras do PSF, que aparecem em cada plano 2D como anéis concêntricos ( veja {numref}`fig-bead_slices`) nem por que o PSF não encolhe para um único ponto no plano focal. Esses fatores estão relacionados à interferência das ondas de luz. Embora seja importante saber que os anéis ocorrem - pelo menos para evitar interpretá-los erroneamente como estruturas extras semelhantes a anéis realmente presentes em uma amostra - eles têm influência limitada em qualquer análise porque a região central do PSF é esmagadoramente mais brilhante. Portanto, para nossos propósitos, eles podem ser em grande parte desconsiderados.

source: Ten slices from a z-stack acquired of a fluorescent bead, starting from above and moving down to the focal plane. The same linear contrast settings have been applied to each slice for easy comparison, although this causes the in-focus bead to appear saturated since otherwise the rings would not be visible at all. Because the image is (approximately) symmetrical along the z-axis, additional slices moving below the focal plane would appear similar.
de: Zehn Schnitte aus einem Z-Stapel, der von einer fluoreszierenden Perle aufgenommen wurde, beginnend von oben und nach unten zur Fokusebene. Um einen einfachen Vergleich zu ermöglichen, wurden für jede Schicht dieselben linearen Kontrasteinstellungen verwendet, obwohl dies dazu führt, dass die fokussierte Perle gesättigt erscheint, da die Ringe sonst überhaupt nicht sichtbar wären. Da das Bild (annähernd) symmetrisch entlang der z-Achse ist, würden zusätzliche Schnitte unterhalb der Fokusebene ähnlich aussehen.
pt_br: Dez fatias de uma pilha z adquirida de uma conta fluorescente, começando de cima e descendo até o plano focal. As mesmas configurações de contraste linear foram aplicadas a cada fatia para facilitar a comparação, embora isso faça com que o cordão em foco pareça saturado, caso contrário os anéis não seriam visíveis. Como a imagem é (aproximadamente) simétrica ao longo do eixo z, fatias adicionais movendo-se abaixo do plano focal pareceriam semelhantes.

source: The Airy disk
de: Die luftige Scheibe
pt_br: O disco arejado

source: Finally for this section, the PSF in the focal plane is important enough to deserve some attention, since we tend to want to measure things where they are most in-focus. This entire *xy* plane, including its interfering ripples, is called an **Airy pattern**, while the bright central part alone is the **Airy disk** ({numref}`fig-airy`). In the best possible case, when all the light in a 2D image comes from in-focus structures, what we can image would already have been blurred by a filter that looks like this.
de: In diesem Abschnitt ist die PSF in der Fokusebene wichtig genug, um einige Aufmerksamkeit zu verdienen, da wir die Dinge dort messen wollen, wo sie am meisten im Fokus sind. Diese gesamte *xy*-Ebene, einschließlich der störenden Wellen, wird **Airy-Muster** genannt, während der helle zentrale Teil allein die **Airy-Scheibe** ist ({numref}`fig-airy`). Im günstigsten Fall, wenn das gesamte Licht in einem 2D-Bild von unscharfen Strukturen stammt, wäre das, was wir abbilden können, bereits durch einen Filter, der so aussieht, unscharf gemacht worden.
pt_br: Finalmente, para esta seção, o PSF no plano focal é importante o suficiente para merecer alguma atenção, uma vez que tendemos a querer medir as coisas onde elas estão mais em foco. Todo esse plano *xy*, incluindo suas ondulações interferentes, é chamado de **padrão aéreo**, enquanto a parte central brilhante sozinha é o **disco aéreo** ({numref} `fig-arejado`). Na melhor das hipóteses, quando toda a luz em uma imagem 2D vem de estruturas em foco, o que podemos imaginar já teria sido desfocado por um filtro parecido com este.

source: George Biddell Airy and the Airy pattern. (A) During his schooldays, Airy had been renowned for being skilled _'in the construction of peashooters and other such devices'_ (see <https://mathshistory.st-andrews.ac.uk/Biographies/Airy/>). The rings surrounding the Airy disk have been likened to the ripples on a pond. Although the rings phenomenon was already known, Airy wrote the first theoretical treatment of it in 1835 (<https://en.wikipedia.org/wiki/Airy_disk>). (B) An Airy pattern looks much like a 2D Gaussian function, although when the contrast is enhanced (C) small outer rings can be seen surrounding the Airy disk.
de: George Biddell Airy und das Airy-Muster. (A) Während seiner Schulzeit war Airy dafür bekannt, dass er sich mit der Konstruktion von Erbsenschießern und anderen Vorrichtungen dieser Art auskannte (siehe <https://mathshistory.st-andrews.ac.uk/Biographies/Airy/>). Die Ringe, die die Airy-Scheibe umgeben, wurden mit den Wellen auf einem Teich verglichen. Obwohl das Phänomen der Ringe bereits bekannt war, schrieb Airy die erste theoretische Abhandlung darüber im Jahr 1835 (<https://en.wikipedia.org/wiki/Airy_disk>). (B) Ein Airy-Muster sieht ähnlich aus wie eine 2D-Gauß-Funktion, obwohl bei erhöhtem Kontrast (C) kleine äußere Ringe um die Airy-Scheibe zu sehen sind.
pt_br: George Biddell Airy e o padrão Airy. (A) Durante seus tempos de escola, Airy era conhecido por ser habilidoso _'na construção de lança-ervilhas e outros dispositivos semelhantes'_ (veja <https://mathshistory.st-andrews.ac.uk/Biographies/Airy/>). Os anéis que circundam o disco Airy foram comparados às ondulações de um lago. Embora o fenômeno dos anéis já fosse conhecido, Airy escreveu o primeiro tratamento teórico dele em 1835 (<https://en.wikipedia.org/wiki/Airy_disk>). (B) Um padrão Airy se parece muito com uma função gaussiana 2D, embora quando o contraste é aumentado (C) pequenos anéis externos podem ser vistos ao redor do disco Airy.

source: The Airy disk should look familiar. If we ignore the little interfering ripples around its edges, it can be very well approximated by a Gaussian function ({numref}`fig-psf_surface`). Therefore _the blur of a microscope in 2D is similar to applying a Gaussian filter_, at least in the focal plane.
de: Die Airy-Scheibe sollte Ihnen bekannt vorkommen. Wenn wir die kleinen störenden Wellen an den Rändern ignorieren, kann sie sehr gut durch eine Gauß-Funktion approximiert werden ({numref}`fig-psf_surface`). Daher ist _die Unschärfe eines Mikroskops in 2D ähnlich der Anwendung eines Gauß-Filters_, zumindest in der Brennebene.
pt_br: O disco Airy deve parecer familiar. Se ignorarmos as pequenas ondulações interferentes em torno de suas bordas, ela pode ser muito bem aproximada por uma função gaussiana ({numref}`fig-psf_surface`). Portanto _o desfoque de um microscópio em 2D é semelhante à aplicação de um filtro gaussiano_, pelo menos no plano focal.

source: Comparison of an Airy disk and a Gaussian of a similar size, using two wireframe plots and a correspnding 1D cross-section. The Gaussian is a *very* close match to the Airy disk, apart from the faint ripples at the sides, so we can often approximate the blur of a PSF using a Gaussian filter.
de: Vergleich eines Airy-Scheibchens und eines Gauß-Scheibchens ähnlicher Größe anhand von zwei Drahtgitterplots und einem entsprechenden 1D-Querschnitt. Der Gauß entspricht *sehr* gut der Airy-Scheibe, abgesehen von den schwachen Wellen an den Seiten, so dass wir die Unschärfe einer PSF oft mit einem Gauß-Filter annähern können.
pt_br: Comparação de um disco Airy e um Gaussiano de tamanho semelhante, usando dois gráficos de wireframe e uma seção transversal 1D correspondente. O Gaussiano é *muito* próximo do disco Airy, exceto pelas leves ondulações nas laterais, então muitas vezes podemos aproximar o desfoque de um PSF usando um filtro Gaussiano.

source: The size of the PSF
de: Die Größe der PSF
pt_br: O tamanho do PSF

source: So much for appearances. To judge how the blurring will affect what we can see and measure, we need to know the _size_ of the PSF. Because we don't tend to want our images to be blurry, smaller would be preferable.
de: So viel zu den Äußerlichkeiten. Um zu beurteilen, wie sich die Unschärfe auf das auswirkt, was wir sehen und messen können, müssen wir die _Größe_ der PSF kennen. Da wir in der Regel nicht wollen, dass unsere Bilder unscharf sind, wäre eine kleinere Größe vorzuziehen.
pt_br: Chega de aparências. Para avaliar como a indefinição afetará o que podemos ver e medir, precisamos saber o _tamanho_ do PSF. Como não queremos que nossas imagens fiquem borradas, seria preferível um tamanho menor.

source: The size requires some defining: the PSF actually continues indefinitely, but has extremely low intensity values when far from its center. One approach for characterizing the Airy disk size is to consider its radius $r_{airy}$ as the distance from the center to the first _minimum_: the lowest point before the first of the outer ripples begins. This is is given by:
de: Die Größe erfordert eine gewisse Definition: Die PSF setzt sich eigentlich unendlich fort, hat aber extrem niedrige Intensitätswerte, wenn sie weit von ihrem Zentrum entfernt ist. Ein Ansatz zur Charakterisierung der Größe der Airy-Scheibe besteht darin, ihren Radius $r_{airy}$ als die Entfernung vom Zentrum zum ersten _Minimum_ zu betrachten: dem niedrigsten Punkt, bevor die erste der äußeren Wellen beginnt. Dies ist gegeben durch:
pt_br: O tamanho requer alguma definição: o PSF na verdade continua indefinidamente, mas tem valores de intensidade extremamente baixos quando longe do seu centro. Uma abordagem para caracterizar o tamanho do disco Airy é considerar seu raio $r_{airy}$ como a distância do centro ao primeiro _mínimo_: o ponto mais baixo antes da primeira das ondulações externas começa. Isso é dado por:

source: where $\lambda$ is the light wavelength and NA is the numerical aperture of the objective lens [^fn_1].
de: wobei $\lambda$ die Lichtwellenlänge und NA die numerische Apertur des Objektivs [^fn_1] ist.
pt_br: onde $\lambda$ é o comprimento de onda da luz e NA é a abertura numérica da lente objetiva [^fn_1].

source: A comparable measurement to $r_{airy}$ between the center and first minimum along the *z* axis is:
de: Ein vergleichbares Maß wie $r_{airy}$ zwischen dem Mittelpunkt und dem ersten Minimum entlang der *z*-Achse ist:
pt_br: Uma medida comparável a $r_{airy}$ entre o centro e o primeiro mínimo ao longo do eixo *z* é:

source: where $\eta$ is the refractive index of the objective lens immersion medium (which is a value related to the speed of light through that medium).
de: Dabei ist $\eta$ der Brechungsindex des Immersionsmediums der Objektivlinse (ein Wert, der mit der Lichtgeschwindigkeit durch dieses Medium zusammenhängt).
pt_br: onde $\eta$ é o índice de refração do meio de imersão da lente objetiva (que é um valor relacionado à velocidade da luz através desse meio).

source: The practical importance of these equations is that they reveal the key factors that influence how blurry an image will be. This hints at some ways we might be able to reduce blurring at the acquisition stage.
de: Die praktische Bedeutung dieser Gleichungen liegt darin, dass sie die Schlüsselfaktoren aufzeigen, die Einfluss darauf haben, wie unscharf ein Bild sein wird. Daraus ergeben sich Hinweise darauf, wie wir die Unschärfe in der Aufnahmephase verringern können.
pt_br: A importância prática destas equações é que elas revelam os principais fatores que influenciam o quão desfocada uma imagem ficará. Isso sugere algumas maneiras pelas quais podemos reduzir o desfoque no estágio de aquisição.

source: According to Equation {eq}`eqn-res_lateral`, the equation for the Airy disk size, what are the two variables we _may_ be able to control that influence the amount of blur in our images? And how must they be changed (increased or decreased) for the images to have less blur?
de: Wie laut Gleichung {eq}`eqn-res_lateral`, der Gleichung für die Größe der Airy-Scheibe, lauten die beiden Variablen, die wir _möglicherweise_ steuern können und die die Stärke der Unschärfe in unseren Bildern beeinflussen? Und wie müssen sie verändert werden (erhöht oder verringert), damit die Bilder weniger unscharf werden?
pt_br: De acordo com a equação {eq}`eqn-res_lateral`, a equação para o tamanho do disco Airy, quais são as duas variáveis que _podemos_ ser capazes de controlar que influenciam a quantidade de desfoque em nossas imagens ? E como elas devem ser alteradas (aumentadas ou diminuídas) para que as imagens fiquem menos desfocadas?

source: If the wavelength $\lambda$ is _lower_ or the objective NA is _higher_, $r_{airy}$ decreases and we have less blur.
de: Wenn die Wellenlänge $\lambda$ _kleiner_ oder die objektive NA _größer_ ist, nimmt $r_{airy}$ ab und die Unschärfe nimmt ab.
pt_br: Se o comprimento de onda $\lambda$ for _inferior_ ou o objetivo NA for _maior_, $r_{airy}$ diminui e temos menos desfoque.

source: Does the NA have more influence on blur in the *xy* plane, or along the *z* axis?
de: Hat die NA mehr Einfluss auf die Unschärfe in der *xy*-Ebene oder entlang der *z*-Achse?
pt_br: O NA tem mais influência no desfoque no plano *xy* ou ao longo do eixo *z*?

source: Because of the squaring, the NA has a much greater influence on blur along the *z* axis than in *xy*. This can be seen clearly in {numref}`fig-psf_na`.
de: Wegen der Quadrierung hat die NA einen viel größeren Einfluss auf die Unschärfe entlang der *z*-Achse als in *xy*. Dies ist deutlich zu sehen in {numref}`fig-psf_na`.
pt_br: Por causa da quadratura, o NA tem uma influência muito maior no desfoque ao longo do eixo *z* do que em *xy*. Isso pode ser visto claramente em {numref}`fig-psf_na`.

source: Examples of theoretical PSFs generated with different Numerical Apertures.
de: Beispiele für theoretische PSFs, die mit verschiedenen numerischen Aperturen erzeugt wurden.
pt_br: Exemplos de PSFs teóricos gerados com diferentes aberturas numéricas.

source: Numerical Aperture
de: Numerische Apertur
pt_br: Abertura numerica

source: The equations for the PSF size show that if you can use an objective lens with a higher NA, you can potentially reduce blur in an image -- especially along the *z* axis ({numref}`fig-psf_na`). Unfortunately, one soon reaches another limit in terms of what increasing the NA can achieve. This can be seen from the equation used to define it:
de: Die Gleichungen für die PSF-Größe zeigen, dass die Verwendung eines Objektivs mit einer höheren NA die Unschärfe in einem Bild verringern kann - insbesondere entlang der *z*-Achse ({numref}`fig-psf_na`). Leider stößt man bald an eine weitere Grenze, was die Erhöhung der NA anbelangt. Dies geht aus der Gleichung hervor, die zur Definition der NA verwendet wird:
pt_br: As equações para o tamanho do PSF mostram que se você puder usar uma lente objetiva com um NA mais alto, poderá reduzir potencialmente o desfoque em uma imagem - especialmente ao longo do eixo *z* ({numref}`fig-psf_na`). Infelizmente, rapidamente se atinge outro limite em termos do que o aumento da NA pode alcançar. Isso pode ser visto na equação usada para defini-lo:
