Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/3-fluorescence/2-formation_spatial/formation_spatial.po
Languages: de, pt_br

source: where $\eta$ is again the refractive index of the immersion medium and $\theta$ is the half-angle of the cone of light accepted by the objective. Because $\sin{\theta}$ can never exceed 1, the NA can never exceed $\eta$, which itself has fixed values (e.g. around 1.0 for air, 1.34 for water, or 1.5 for oil). High NA lenses can therefore reduce blur only to a limited degree.
de: wobei $\eta$ wiederum der Brechungsindex des Immersionsmediums und $\theta$ der Halbwinkel des vom Objektiv aufgenommenen Lichtkegels ist. Da $\sin{\theta}$ nie größer als 1 sein kann, kann auch die NA nie größer als $\eta$ sein, das wiederum feste Werte hat (z. B. etwa 1,0 für Luft, 1,34 für Wasser oder 1,5 für Öl). Objektive mit hoher NA können daher die Unschärfe nur in begrenztem Maße verringern.
pt_br: onde $\eta$ é novamente o índice de refração do meio de imersão e $\theta$ é o meio ângulo do cone de luz aceito pela objetiva. Como $\sin{\theta}$ nunca pode exceder 1, o NA nunca pode exceder $\eta$, que por sua vez tem valores fixos (por exemplo, cerca de 1,0 para ar, 1,34 para água ou 1,5 para óleo). As lentes de alta NA podem, portanto, reduzir o desfoque apenas até um grau limitado.

source: An important additional consideration is that the highest NAs are possible when the immersion refractive index is high, but if this does not match the refractive index of the medium surrounding the sample we get **spherical aberration**. This is a phenomenon whereby the PSF becomes asymmetrical at increasing depth and the blur becomes weirder. Therefore, matching the refractive indices of the immersion and embedding media is often _strongly_ preferable to using the highest NA objective available: it's usually better to have a larger PSF than a highly irregular one.
de: Ein wichtiger zusätzlicher Gesichtspunkt ist, dass die höchsten NAs möglich sind, wenn der Brechungsindex der Immersion hoch ist, aber wenn dieser nicht mit dem Brechungsindex des die Probe umgebenden Mediums übereinstimmt, kommt es zu **sphärischer Aberration**. Dabei handelt es sich um ein Phänomen, bei dem die PSF mit zunehmender Tiefe asymmetrisch wird und die Unschärfe zunimmt. Daher ist die Anpassung der Brechungsindizes des Immersions- und des Einbettungsmediums oft _stark_ der Verwendung des höchstmöglichen NA-Objektivs vorzuziehen: Es ist in der Regel besser, eine größere PSF zu haben als eine stark unregelmäßige.
pt_br: Uma consideração adicional importante é que os NAs mais altos são possíveis quando o índice de refração de imersão é alto, mas se isso não corresponder ao índice de refração do meio que envolve a amostra, obteremos **aberração esférica**. Este é um fenômeno em que o PSF se torna assimétrico com o aumento da profundidade e o desfoque fica mais estranho. Portanto, combinar os índices de refração da mídia de imersão e incorporação é muitas vezes _fortemente_ preferível a usar a objetiva de NA mais alta disponível: geralmente é melhor ter um PSF maior do que um altamente irregular.

source: For an interactive tutorial on the effect of using different NAs, see <https://www.microscopyu.com/tutorials/imageformation-airyna>.
de: Ein interaktives Lernprogramm über die Auswirkungen der Verwendung verschiedener NAs finden Sie unter <https://www.microscopyu.com/tutorials/imageformation-airyna>.
pt_br: Para um tutorial interativo sobre o efeito do uso de diferentes NAs, consulte <https://www.microscopyu.com/tutorials/imageformation-airyna>.

source: Convince yourself that $z_{min}$ will be considerably higher than $r_{airy}$ using one of the following methods:
de: Überzeugen Sie sich mit einer der folgenden Methoden, dass $z_{min}$ deutlich höher ist als $r_{airy}$:
pt_br: Convença-se de que $z_{min}$ será consideravelmente maior que $r_{airy}$ usando um dos seguintes métodos:

source: Put an example refractive index (e.g. $\eta = 1.34$ for water), and some reasonable values of $\lambda$ and the NA into the equations for the lateral {eq}`eqn-res_lateral` and axial {eq}`eqn-res_axial` resolution, and compare the results
de: Setzen Sie einen Beispiel-Brechungsindex (z. B. $\eta = 1,34$ für Wasser) und einige vernünftige Werte für $\lambda$ und die NA in die Gleichungen für die laterale {eq}`eqn-res_lateral` und axiale {eq}`eqn-res_axial` Auflösung ein und vergleichen Sie die Ergebnisse
pt_br: Coloque um exemplo de índice de refração (por exemplo, $\eta = 1,34$ para água) e alguns valores razoáveis de $\lambda$ e o NA nas equações para a {eq}`eqn lateral -res_lateral` e resolução axial {eq}`eqn-res_axial` e compare os resultados

source: Calculate the ratio $z_{min} / r_{airy}$ and substitute in the equation for the NA. This should reveal that the ratio is bigger than 1, i.e. that $z_{min}$ is larger.
de: Berechnen Sie das Verhältnis $z_{min} / r_{airy}$ und setzen Sie die Gleichung für die NA ein. Dies sollte zeigen, dass das Verhältnis größer als 1 ist, d.h. dass $z_{min}$ größer ist.
pt_br: Calcule a proporção $z_{min} / r_{airy}$ e substitua NA na equação. Isso deve revelar que a proporção é maior que 1, ou seja, que $z_{min}$ é maior.

source: What is the main implication of this observation, in terms of how separated structures need to be along different dimensions for them still to be distinguishable?
de: Was bedeutet diese Beobachtung vor allem in Bezug auf die Frage, wie weit die Strukturen entlang verschiedener Dimensionen voneinander entfernt sein müssen, damit sie noch unterscheidbar sind?
pt_br: Qual é a principal implicação desta observação, em termos de como as estruturas precisam estar separadas ao longo de diferentes dimensões para que ainda sejam distinguíveis?

source: The ratio is
de: Das Verhältnis ist
pt_br: A proporção é

source: \frac{z_{min}}{r_{airy}} = \frac{2 \lambda \times \eta}{\textrm{NA}^2} \times \frac{\textrm{NA}}{0.61 \lambda} = \frac{3.28\eta}{\textrm{NA}} = \frac{3.28}{\sin\theta}
de: \frac{z_{min}}{r_{airy}} = \frac{2 \lambda \times \eta}{\textrm{NA}^2} \mal \frac{\textrm{NA}}{0.61 \lambda} = \frac{3.28\eta}{\textrm{NA}} = \frac{3.28}{\sin\theta}

source: Therefore, even as $\sin\theta$ becomes close to 1 (i.e. a very high NA objective is used), the value of $z_{min}$ remains over 3 times larger than $r_{airy}$ -- the *z* resolution is much worse. When the NA is lower, the difference is even more.
de: Selbst wenn $\sin\theta$ nahe bei 1 liegt (d. h. ein sehr hohes NA-Objektiv verwendet wird), bleibt der Wert von $z_{min}$ mehr als dreimal so groß wie $r_{airy}$ - die *z*-Auflösung ist viel schlechter. Wenn die NA niedriger ist, ist der Unterschied noch größer.
pt_br: Portanto, mesmo quando $\sin\theta$ se aproxima de 1 (ou seja, um objetivo de NA muito alto é usado), o valor de $z_{min}$ permanece mais de 3 vezes maior que $r_{airy}$ - a resolução *z* é muito pior. Quando o NA é menor, a diferença é ainda maior.

source: The main practical implication is that it's more likely that you will be able to distinguish structures that are separated from one another by a short distance in *xy* than similarly separated in *z*. If you really need information along the *z*-dimension more than anywhere else, maybe rotating your sample could help?
de: Die wichtigste praktische Auswirkung ist, dass es wahrscheinlicher ist, Strukturen zu unterscheiden, die in der *xy*-Dimension nur einen kurzen Abstand voneinander haben, als Strukturen, die in der *z*-Dimension ähnlich weit voneinander entfernt sind. Wenn Sie wirklich Informationen entlang der *z*-Dimension mehr als irgendwo anders benötigen, könnte eine Drehung der Probe vielleicht helfen.
pt_br: A principal implicação prática é que é mais provável que você consiga distinguir estruturas que estão separadas umas das outras por uma curta distância em *xy* do que separadas de forma semelhante em *z*. Se você realmente precisa de informações na dimensão *z* mais do que em qualquer outro lugar, talvez girar sua amostra possa ajudar?

source: Spatial resolution
de: Räumliche Auflösung
pt_br: Resolução espacial

source: **Spatial resolution** is concerned with how close two structures can be while they are still distinguishable. This is a somewhat subjective and fuzzy idea, but one way to define it is by the **Rayleigh Criterion**, according to which two equally bright spots are said to be resolved (i.e. distinguishable) if they are separated by the distances calculated in the lateral {eq}`eqn-res_lateral` and axial {eq}`eqn-res_axial` equations above. If the spots are closer than this, they are likely to be seen as one. In the in-focus plane, this is illustrated in {numref}`fig-rayleigh`.
de: Bei der **Raumauflösung** geht es darum, wie nahe zwei Strukturen beieinander liegen können, ohne dass sie sich voneinander unterscheiden lassen. Dies ist eine etwas subjektive und unscharfe Vorstellung, aber eine Möglichkeit, sie zu definieren, ist das **Rayleigh-Kriterium**, nach dem zwei gleich helle Flecken als aufgelöst (d. h. unterscheidbar) gelten, wenn sie durch die in den obigen Gleichungen {eq}"eqn-res_lateral" und {eq}"eqn-res_axial" berechneten Abstände getrennt sind. Wenn die Flecken näher beieinander liegen, werden sie wahrscheinlich als ein einziger gesehen. In der In-Focus-Ebene wird dies in {numref}`fig-rayleigh` dargestellt.
pt_br: **Resolução espacial** preocupa-se com o quão próximas duas estruturas podem estar enquanto ainda são distinguíveis. Esta é uma ideia um tanto subjetiva e confusa, mas uma maneira de defini-la é pelo **Critério de Rayleigh**, segundo o qual dois pontos igualmente brilhantes são considerados resolvidos (ou seja, distinguíveis) se estiverem separados pelas distâncias calculadas em as equações laterais {eq}`eqn-res_lateral` e axiais {eq}`eqn-res_axial` acima. Se os pontos estiverem mais próximos do que isso, é provável que sejam vistos como um só. No plano em foco, isso é ilustrado em {numref}`fig-rayleigh`.

source: Airy patterns separated by different distances, defined in terms of Airy disk radii. The top row contains the patterns themselves, while the bottom row shows intensity profiles computed across the centers of the patterns. Two distinct spots are clearly visible whenever separated by at least one disk radius, and there is a dip apparent in the profile. However, if the separation is less than one radius, the contrast rapidly decreases until only one structure is apparent. By a separation of 0.5 radii, the two structures appear indistinguishable as a single, brighter structure.
de: Airy-Muster, die durch verschiedene Abstände voneinander getrennt sind, definiert durch die Radien der Airy-Scheiben. Die obere Reihe enthält die Muster selbst, während die untere Reihe die über die Zentren der Muster berechneten Intensitätsprofile zeigt. Zwei deutliche Flecken sind immer dann sichtbar, wenn sie mindestens einen Scheibenradius voneinander entfernt sind, und das Profil weist eine deutliche Senke auf. Ist der Abstand jedoch geringer als ein Radius, nimmt der Kontrast schnell ab, bis nur noch eine Struktur zu erkennen ist. Bei einem Abstand von 0,5 Radien sind die beiden Strukturen als eine einzige, hellere Struktur nicht mehr zu erkennen.
pt_br: Padrões arejados separados por diferentes distâncias, definidos em termos de raios do disco arejado. A linha superior contém os próprios padrões, enquanto a linha inferior mostra perfis de intensidade calculados nos centros dos padrões. Dois pontos distintos são claramente visíveis sempre que separados por pelo menos um raio do disco, e há uma queda aparente no perfil. Contudo, se a separação for inferior a um raio, o contraste diminui rapidamente até que apenas uma estrutura seja aparente. Por uma separação de 0,5 raios, as duas estruturas parecem indistinguíveis como uma estrutura única e mais brilhante.

source: It should be kept in mind that the use of $r_{airy}$ and $z_{min}$ in the Rayleigh criterion is somewhat arbitrary -- and the effects of brightness differences, finite pixel sizes and noise further complicate the situation, so that in practice a greater distance may well be required for us to confidently distinguish structures. Nevertheless, the Rayleigh criterion is helpful to give some idea of the scale of distances involved, i.e. hundreds of nanometers when using visible light.
de: Es ist zu bedenken, dass die Verwendung von $r_{airy}$ und $z_{min}$ im Rayleigh-Kriterium etwas willkürlich ist - und die Auswirkungen von Helligkeitsunterschieden, endlichen Pixelgrößen und Rauschen verkomplizieren die Situation zusätzlich, so dass in der Praxis ein größerer Abstand erforderlich sein kann, damit wir Strukturen sicher unterscheiden können. Nichtsdestotrotz ist das Rayleigh-Kriterium hilfreich, um eine Vorstellung von der Größenordnung der Entfernungen zu bekommen, d. h. von Hunderten von Nanometern, wenn sichtbares Licht verwendet wird.
pt_br: Deve-se ter em mente que o uso de $r_{airy}$ e $z_{min}$ no critério de Rayleigh é um tanto arbitrário - e os efeitos das diferenças de brilho, tamanhos finitos de pixels e ruído complicam ainda mais a situação, de modo que, na prática, pode ser necessária uma distância maior para distinguirmos estruturas com segurança. No entanto, o critério de Rayleigh é útil para dar uma ideia da escala de distâncias envolvidas, ou seja, centenas de nanômetros quando se utiliza luz visível.

source: Suppose the diameter of the Airy disk is around 500 nm, and you are looking at an image containing separate, well-spaced structures that are 2 nm, 20 nm and 200 nm in size. Assuming that you have imaged all of these exactly in focus (after all, you are a brilliant microscopist), how will these structures appear in the image?
de: Nehmen wir an, der Durchmesser der Airy-Scheibe beträgt etwa 500 nm, und Sie betrachten ein Bild mit separaten, gut verteilten Strukturen, die 2 nm, 20 nm und 200 nm groß sind. Angenommen, Sie haben alle diese Strukturen genau scharf abgebildet (schließlich sind Sie ein brillanter Mikroskopiker), wie werden diese Strukturen im Bild erscheinen?
pt_br: Suponha que o diâmetro do disco Airy seja de cerca de 500 nm e você esteja olhando para uma imagem contendo estruturas separadas e bem espaçadas com tamanhos de 2 nm, 20 nm e 200 nm. Supondo que você tenha imaginado tudo isso exatamente em foco (afinal, você é um microscopista brilhante), como essas estruturas aparecerão na imagem?

source: _Note:_ This is a particularly important question! Think of both the size and brightness.
de: Hinweis:_ Dies ist eine besonders wichtige Frage! Denken Sie sowohl an die Größe als auch an die Helligkeit.
pt_br: _Nota:_ Esta é uma questão particularmente importante! Pense no tamanho e no brilho.

source: Because even an infinitesimally small point cannot appear smaller than the Airy disk in the recorded image, _potentially all 3 of these structures look the same!_ There may be _some_ increase in size visible with the 200 nm structure (because it is larger than a single point, this makes it like many different, slightly-shifted-but-mostly-overlapping Airy disks added together), but it will certainly not appear 10 or 100 times larger than the others.
de: Da selbst ein winzig kleiner Punkt nicht kleiner als die Airy-Scheibe im aufgenommenen Bild erscheinen kann, sehen _möglicherweise alle 3 dieser Strukturen gleich aus!_ Bei der 200-nm-Struktur ist zwar _eine gewisse_ Vergrößerung sichtbar (da sie größer als ein einzelner Punkt ist, wirkt sie wie viele verschiedene, leicht verschobene, aber größtenteils überlappende Airy-Scheiben zusammengenommen), aber sie erscheint sicher nicht 10- oder 100-mal größer als die anderen.
pt_br: Como mesmo um ponto infinitesimalmente pequeno não pode parecer menor do que o disco de Airy na imagem gravada, _potencialmente todas essas 3 estruturas parecem iguais!_ Pode haver _algum_ aumento no tamanho visível com a estrutura de 200 nm (porque é maior que um único ponto, isso o torna semelhante a muitos discos Airy diferentes, ligeiramente deslocados, mas principalmente sobrepostos, somados), mas certamente não parecerá 10 ou 100 vezes maior que os outros.

source: _However_, because smaller objects typically emit fewer photons, the smaller structures may well appear less bright -- if they are bright enough to be visible at all. Therefore, at this scale accurate measurements of size are impossible from (conventional, non-super-resolution) fluorescence microscopy images, but the actual size may have some relationship with brightness.
de: Da kleinere Objekte jedoch in der Regel weniger Photonen aussenden, erscheinen die kleineren Strukturen auch weniger hell - wenn sie überhaupt hell genug sind, um sichtbar zu sein. Daher sind in diesem Maßstab genaue Messungen der Größe anhand von (konventionellen, nicht hochauflösenden) Fluoreszenzmikroskopie-Bildern unmöglich, aber die tatsächliche Größe kann eine gewisse Beziehung zur Helligkeit haben.
pt_br: _No entanto_, como objetos menores normalmente emitem menos fótons, as estruturas menores podem parecer menos brilhantes - se forem brilhantes o suficiente para serem visíveis. Portanto, nesta escala, medições precisas de tamanho são impossíveis a partir de imagens de microscopia de fluorescência (convencionais, sem super-resolução), mas o tamanho real pode ter alguma relação com o brilho.

source: Measuring PSFs & small structures
de: Messung von PSFs und kleinen Strukturen
pt_br: Medição de PSFs e pequenas estruturas

source: Knowing that the Airy disk resembles a Gaussian function is extremely useful, because any time we see an Airy disk we can fit a 2D Gaussian to it. The parameters of the function will then tell us the Gaussian's center exactly, which corresponds to where the fluorescing structure really is -- admittedly not with complete accuracy, but potentially still beyond the accuracy of even the pixel size (noise is the real limitation). This idea is fundamental to single-molecule localization techniques, including those in super-resolution microscopes like STORM and PALM, but requires that PSFs are sufficiently well-spaced that they do not interfere with one another and thereby ruin the fitting.
de: Das Wissen, dass die Airy-Scheibe einer Gauß-Funktion ähnelt, ist äußerst nützlich, denn jedes Mal, wenn wir eine Airy-Scheibe sehen, können wir einen 2D-Gauß an sie anpassen. Die Parameter der Funktion sagen uns dann genau, wo sich das Zentrum des Gaußschen Kreises befindet, was der tatsächlichen Position der fluoreszierenden Struktur entspricht - zugegebenermaßen nicht mit absoluter Genauigkeit, aber möglicherweise immer noch über die Genauigkeit der Pixelgröße hinaus (das Rauschen ist die eigentliche Einschränkung). Diese Idee ist von grundlegender Bedeutung für Einzelmolekül-Lokalisierungstechniken, einschließlich derer in Super-Resolution-Mikroskopen wie STORM und PALM, erfordert aber, dass die PSFs ausreichend weit voneinander entfernt sind, damit sie sich nicht gegenseitig stören und dadurch die Anpassung ruinieren.
pt_br: Saber que o disco Airy se assemelha a uma função Gaussiana é extremamente útil, porque sempre que vemos um disco Airy podemos ajustar-lhe uma Gaussiana 2D. Os parâmetros da função nos dirão exatamente o centro de Gauss, que corresponde a onde realmente está a estrutura fluorescente - reconhecidamente não com precisão total, mas potencialmente ainda além da precisão até mesmo do tamanho do pixel (o ruído é a limitação real). Esta ideia é fundamental para técnicas de localização de moléculas únicas, incluindo aquelas em microscópios de super-resolução como STORM e PALM, mas requer que os PSFs sejam suficientemente espaçados para não interferirem uns com os outros e, assim, arruinarem o encaixe.

source: In ImageJ, we can somewhat approximate this localization by drawing a line profile across the peak of a PSF and then running {menuselection}`Analyze --> Tools --> Curve Fitting...`. There we can fit a 1D Gaussian function, for which the equation used is
de: In ImageJ können wir uns dieser Lokalisierung annähern, indem wir ein Linienprofil über den Peak einer PSF zeichnen und dann {menuselection}`Analyze --&gt; Tools --&gt; Curve Fitting...` ausführen. Dort können wir eine 1D-Gauß-Funktion anpassen, für die die folgende Gleichung verwendet wird
pt_br: No ImageJ, podemos aproximar essa localização desenhando um perfil de linha através do pico de um PSF e então executando {menuselection}`Analyze --> Tools --> Curve Fitting... `. Lá podemos ajustar uma função gaussiana 1D, para a qual a equação usada é

source: $a$ is simply a background constant, $b$ tells you the peak amplitude (i.e. the maximum value of the Gaussian with the background subtracted), and $c$ gives the location of the peak along the profile line. But potentially the most useful parameter here is $d$, which corresponds to the $\sigma$ value of a Gaussian filter. So if you know this value for a PSF, you can approximate the same amount of blurring with a Gaussian filter. This may come in useful in {ref}`chap_macro_simulating`.
de: $a$ ist einfach eine Hintergrundkonstante, $b$ gibt die Peak-Amplitude an (d.h. den Maximalwert des Gauß-Filters nach Abzug des Hintergrunds), und $c$ gibt die Lage des Peaks entlang der Profillinie an. Der möglicherweise nützlichste Parameter ist jedoch $d$, der dem $\sigma$-Wert eines Gauß-Filters entspricht. Wenn man also diesen Wert für eine PSF kennt, kann man die gleiche Unschärfe mit einem Gauß-Filter annähern. Dies kann in {ref}`chap_macro_simulating` nützlich sein.
pt_br: $a$ é simplesmente uma constante de fundo, $b$ informa a amplitude do pico (ou seja, o valor máximo da Gaussiana com o fundo subtraído) e $c$ fornece a localização do pico ao longo da linha do perfil. Mas potencialmente o parâmetro mais útil aqui é $d$, que corresponde ao valor $\sigma$ de um filtro gaussiano. Portanto, se você conhece esse valor para um PSF, pode aproximar a mesma quantidade de desfoque com um filtro gaussiano. Isto pode ser útil em {ref}`chap_macro_simulating`.

source: Note that this is the _limit_ of the Airy disk size, and assumes that the system is free of any aberrations. In other words, this is the best that we can hope for: the Airy disk cannot be made smaller simply by better focusing, although it could easily be made worse by a less-than-perfect objective lens
de: Beachten Sie, dass dies die _Grenze_ der Größe des Airy-Scheibchens ist und voraussetzt, dass das System frei von Aberrationen ist. Mit anderen Worten, dies ist das Beste, was wir uns erhoffen können: Das Airy-Scheibchen kann nicht einfach durch eine bessere Fokussierung verkleinert werden, obwohl es durch ein nicht ganz perfektes Objektiv leicht vergrößert werden könnte
pt_br: Observe que este é o _limite_ do tamanho do disco Airy e pressupõe que o sistema está livre de quaisquer aberrações. Em outras palavras, isso é o melhor que podemos esperar: o disco Airy não pode ser diminuído simplesmente por uma melhor focagem, embora possa facilmente ser piorado por uma lente objetiva menos que perfeita.

source: r_{airy} = \frac{0.61 \lambda}{\textrm{NA}}
pt_br: r_{arejado} = \frac{0,61 \lambda}{\textrm{NA}}
