Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/images_and_pixels.po
Languages: es, pt_br

source: Default Caption
es: Título predeterminado
pt_br: Legenda padrão

source: Images & pixels
es: Imágenes y píxeles
pt_br: Imagens e pixels

source: Chapter outline
es: Esquema del capítulo
pt_br: Esboço do capítulo

source: Digital images are composed of **pixels**
es: Las imágenes digitales se componen de **píxeles**
pt_br: As imagens digitais são compostas por **pixels**

source: Each pixel has a **numeric value** (often related to detected light)
es: Cada píxel tiene un **valor numérico** (a menudo relacionado con la luz detectada)
pt_br: Cada pixel tem um **valor numérico** (geralmente relacionado à luz detectada)

source: The same pixel values can be displayed differently using **lookup tables (LUTs)**
es: Los mismos valores de píxeles se pueden mostrar de forma diferente usando **tablas de búsqueda (LUT)**
pt_br: Os mesmos valores de pixel podem ser exibidos de maneira diferente usando **tabelas de pesquisa (LUTs)**

source: We can modify image appearance in two main ways:
es: Podemos modificar la apariencia de la imagen de dos formas principales:
pt_br: Podemos modificar a aparência da imagem de duas maneiras principais:

source: **Change the pixel values**
es: **Cambiar los valores de píxeles**
pt_br: **Altere os valores dos pixels**

source: **Change the LUT**
es: **Cambiar la LUT**
pt_br: **Alterar o LUT**

source: **Preserving pixel values is crucial** for most analysis -- so it's essential to know what your software is doing
es: **Preservar los valores de los píxeles es crucial** para la mayoría de los análisis, por lo que es esencial saber qué está haciendo su software.
pt_br: **Preservar os valores dos pixels é crucial** para a maioria das análises. Por isso, é essencial saber o que o seu software está fazendo

source: Introduction
es: Introducción
pt_br: Introdução

source: Image are composed of **pixels**.
es: La imagen está compuesta de **píxeles**.
pt_br: As imagens são compostas por **pixels**.

source: The word 'pixel' is derived from **pic**ture **el**ement and, as far as the computer is concerned, each pixel is just a number.
es: La palabra 'píxel' se deriva de **pic**ture **el**ement (elemento de imagen por su traducción en inglés) y, en lo que respecta a la computadora, cada píxel es solo un número.
pt_br: A palavra 'pixel' é derivada de **pic**ture **el**ement e, no que diz respeito ao computador, cada pixel é apenas um número.

source: When the image data is displayed, the values of pixels are usually converted into squares of particular colors – but *this is only for our benefit*. The colored squares are nothing more than a helpful visualization that enable us to gain a fast impression of the image contents, i.e. the approximate values of pixels and where they are in relation to one another.
es: Cuando se muestran los datos de la imagen, los valores de los píxeles generalmente se convierten en cuadrados de colores particulares, pero *esto es sólo para nuestro beneficio*. Los cuadrados de colores no son más que una visualización útil que nos permite obtener una impresión rápida del contenido de la imagen, es decir, los valores aproximados de los píxeles y su ubicación relativa.
pt_br: Quando os dados da imagem são exibidos, os valores dos pixels são geralmente convertidos em quadrados de cores específicas – mas *isso é apenas para nosso benefício*. Os quadrados coloridos nada mais são do que uma visualização útil que nos permite ter uma impressão rápida do conteúdo da imagem, ou seja, os valores aproximados dos pixels e onde eles estão em relação uns aos outros.

source: When it comes to processing and analysis, we need to get past the display and delve into the real data: the numbers ({numref}`fig-image_array`).
es: Cuando se trata de procesamiento y análisis, debemos ir más allá de la visualización y profundizar en los datos reales: los números ({numref}`fig-image_array`).
pt_br: Quando se trata de processamento e análise, precisamos ir além da exibição e nos aprofundar nos dados reais: os números ({numref}`fig-image_array`).

source: An image depicting an interestingly-matched couple I saw when walking home from work. (A) & (B) The image is shown using small squares of different shades of gray, where each square corresponds to a single pixel. This is only a convention used for display; the pixels themselves are stored as arrays of numbers \(C) -- but looking at the numbers directly it's pretty hard for us to visualize what the image contains.
es: Una imagen que muestra una pareja interesante que vi mientras caminaba a casa desde el trabajo. (A) y (B) La imagen se muestra utilizando pequeños cuadrados de diferentes tonos de gris, donde cada cuadrado corresponde a un solo píxel. Esta es sólo una convención utilizada para visualización; los píxeles mismos se almacenan como matrices de números \(C), pero al mirar los números directamente nos resulta bastante difícil visualizar los contenidos de la imagen.
pt_br: Uma imagem que retrata um casal interessante que vi quando voltava do trabalho para casa. (A) e (B) A imagem é mostrada usando pequenos quadrados de diferentes tons de cinza, onde cada quadrado corresponde a um único pixel. Esta é apenas uma convenção usada para exibição; os próprios pixels são armazenados como matrizes de números \(C) - mas olhando diretamente para os números é muito difícil visualizar o que a imagem contém.

source: Image data & its display
es: Datos de imagen y su visualización.
pt_br: Dados de imagem e sua exibição

source: The distinction between a pixel's numeric value and the color used to display it might seem like a minor detail, but it definitely isn't: failing to recognise this difference underlies a *lot* of errors.
es: La distinción entre el valor numérico de un píxel y el color utilizado para mostrarlo puede parecer un detalle menor, pero definitivamente no lo es: no reconocer esta diferencia es la fuente de *muchos* errores.
pt_br: A distinção entre o valor numérico de um pixel e a cor usada para exibi-lo pode parecer um detalhe menor, mas definitivamente não é: falhar em reconhecer essa diferença está subjacente a muitos erros.

source: If we aren't careful, two related facts can cause us an enormous amount of trouble:
es: Si no tenemos cuidado, dos hechos relacionados pueden causarnos una enorme cantidad de problemas:
pt_br: Se não tomarmos cuidado, dois fatos relacionados podem nos causar enormes problemas:

source: Images that **look the same** can contain **different** pixel values
es: Las imágenes que **parecen iguales** pueden contener valores de píxeles **diferentes**
pt_br: Imagens que **têm a mesma aparência** podem conter valores de pixel **diferentes**

source: Images that **look different** can still contain **the same** pixel values
es: Las imágenes que **se ven diferentes** pueden contener **los mismos** valores de píxeles
pt_br: Imagens que **parecem diferentes** ainda podem conter **os mesmos** valores de pixel

source: Images that *look* the same, but contain *different* pixel values.\ Measuring each of these images would give different results, for reasons we shall see in later chapters.
es: Imágenes que *parecen* iguales, pero contienen valores de píxeles *diferentes*.\ Medir cada una de estas imágenes daría resultados diferentes, por razones que veremos en capítulos posteriores.
pt_br: Imagens que *parecem* iguais, mas contêm valores de pixels *diferentes*.\ Medir cada uma dessas imagens daria resultados diferentes, por razões que veremos em capítulos posteriores.

source: Images that *look* different, but contain *the same* pixel values.\ Measuring each of these images would give the same results.
es: Imágenes que *parecen* diferentes, pero contienen *los mismos* valores de píxeles.\ Medir cada una de estas imágenes daría los mismos resultados.
pt_br: Imagens que *parecem* diferentes, mas contêm *os mesmos* valores de pixel.\ Medir cada uma dessas imagens daria os mesmos resultados.

source: This is crucial because it's entirely possible to analyze two different images that *appear* identical, but to get very different (and very wrong) results.
es: Esto es crucial porque es completamente posible analizar dos imágenes diferentes que *parecen* idénticas, pero obtener resultados muy diferentes (y muy incorrectos).
pt_br: Isto é crucial porque é perfeitamente possível analisar duas imagens diferentes que *parecem* idênticas, mas obter resultados muito diferentes (e muito errados).

source: This is far from a theoretical problem. It happens a lot in practice whenever someone innocently makes an adjustment to an image (e.g. to make it look brighter, or change the colors for display) without realising that the adjustment has actually changed the pixel values -- and thereby compromised the underlying data. This can fatally undermine the integrity of any later analysis.
es: Esto está lejos de ser un problema teórico. Sucede mucho en la práctica cuando alguien inocentemente hace un ajuste a una imagen (por ejemplo, para hacerla lucir más brillante o cambiar los colores de visualización) sin darse cuenta de que el ajuste en realidad ha cambiado los valores de los píxeles y, por lo tanto, ha comprometido los datos subyacentes. Esto puede socavar fatalmente la integridad de cualquier análisis posterior.
pt_br: Isso está longe de ser um problema teórico. Na prática, isso acontece muito sempre que alguém inocentemente faz um ajuste em uma imagem (por exemplo, para torná-la mais brilhante ou alterar as cores de exibição) sem perceber que o ajuste na verdade alterou os valores dos pixels - e, portanto, comprometeu os dados subjacentes. Isto pode minar fatalmente a integridade de qualquer análise posterior.

source: What's worse, these errors can go completely unnoticed, surreptitiously compounding the problem of replicability in science.
es: Lo que es peor, estos errores pueden pasar completamente desapercibidos, agravando subrepticiamente el problema de la replicabilidad en la ciencia.
pt_br: O que é pior, estes erros podem passar completamente despercebidos, agravando sub-repticiamente o problema da replicabilidade na ciência.

source: Which brings us to the key message of this chapter:
es: Lo que nos lleva al mensaje clave de este capítulo:
pt_br: O que nos leva à mensagem principal deste capítulo:

source: Don't (just) trust your eyes!
es: ¡No confíes (simplemente) en tus ojos!
pt_br: Não (apenas) confie nos seus olhos!

source: In science, we need to know what is happening whenever we open, adjust and save our images. If we don't, we risk misinterpreting our data.
es: En ciencia, necesitamos saber qué sucede cada vez que abrimos, ajustamos y guardamos nuestras imágenes. Si no lo hacemos, corremos el riesgo de malinterpretar nuestros datos.
pt_br: Na ciência, precisamos saber o que acontece sempre que abrimos, ajustamos e salvamos nossas imagens. Se não o fizermos, corremos o risco de interpretar mal os nossos dados.

source: Fortunately, knowing just a little bit about imaging and image analysis is enough to avoid making these mistakes. Knowing more than a little bit can open up new worlds of possibility to extract useful information from scientific images.
es: Afortunadamente, saber un poco sobre imágenes y análisis de imágenes es suficiente para evitar cometer estos errores. Saber más que un poquito puede abrir nuevos mundos de posibilidades para extraer información útil de imágenes científicas.
pt_br: Felizmente, saber um pouco sobre imagens e análise de imagens é suficiente para evitar cometer esses erros. Saber mais do que um pouco pode abrir novos mundos de possibilidades para extrair informações úteis de imagens científicas.

source: The goal of this handbook is to explain these ideas. We'll start by considering two questions:
es: El objetivo de este manual es explicar estas ideas. Comenzaremos considerando dos preguntas:
pt_br: O objetivo deste manual é explicar essas idéias. Começaremos considerando duas questões:

source: **Where do the pixel values come from?**
es: **¿De dónde provienen los valores de píxeles?**
pt_br: **De onde vêm os valores de pixel?**

source: **How are pixel values converted into colors for display?**
es: **¿Cómo se convierten los valores de píxeles en colores para su visualización?**
pt_br: **Como os valores de pixel são convertidos em cores para exibição?**

source: It's hard to give a detailed-but-general answer to the first question, because the origin and interpretation of the pixel values depends upon how the image was created, and there are many different ways to generate an image.
es: Es difícil dar una respuesta detallada, y a la vez general, a la primera pregunta, porque el origen y la interpretación de los valores de los píxeles dependen de cómo se creó la imagen y hay muchas formas diferentes de generar una imagen.
pt_br: É difícil dar uma resposta detalhada, mas geral, à primeira pergunta, porque a origem e a interpretação dos valores dos pixels dependem de como a imagem foi criada e há muitas maneiras diferentes de gerar uma imagem.

source: Nevertheless, the key ideas are similar everywhere. By way of illustration, we'll consider a very common case in bioimaging where the pixel values relate to detected light -- specifically, using the example of a fluorescence microscope -- before moving how to see how these values are displayed.
es: Sin embargo, las ideas clave son similares en todas partes. A modo de ilustración, consideraremos un caso muy común en bioimagen donde los valores de píxeles se relacionan con la luz detectada, específicamente, usando el ejemplo de un microscopio de fluorescencia, antes de pasar a ver cómo se muestran estos valores.
pt_br: No entanto, as ideias-chave são semelhantes em todos os lugares. A título de ilustração, consideraremos um caso muito comum em bioimagem em que os valores dos pixels se relacionam com a luz detectada - especificamente, usando o exemplo de um microscópio de fluorescência - antes de passarmos a ver como esses valores são exibidos.

source: A simple microscope
es: Un microscopio simple
pt_br: Um microscópio simples

source: When I work with fluorescence images, I have a very simple picture in my head of how the image is formed. It may not be very exact, but I find it extremely useful as a basis to which we can add detail whenever we need it. We will revisit this picture later in the book to help organize the interrelating imaging considerations relevant to analysis.
es: Cuando trabajo con imágenes de fluorescencia, tengo en mi cabeza una imagen muy sencilla de cómo se forma la imagen. Puede que no sea muy exacta, pero lo encuentro extremadamente útil como base a la que podemos añadir detalles cuando los necesitemos. Revisaremos esta imagen más adelante en el libro para ayudar a organizar las consideraciones interrelacionadas, relevantes para el análisis de imágenes.
pt_br: Quando trabalho com imagens de fluorescência, tenho na minha cabeça uma imagem muito simples de como a imagem é formada. Pode não ser muito exato, mas considero-o extremamente útil como base à qual podemos acrescentar detalhes sempre que necessário. Revisitaremos esse quadro mais adiante neste livro para ajudar a organizar as considerações inter-relacionadas sobre imagens relevantes para a análise.

source: In my simplified model, there are only three components that we need to worry about:
es: En mi modelo simplificado, sólo hay tres componentes de los que debemos preocuparnos:
pt_br: No meu modelo simplificado, existem apenas três componentes com os quais precisamos nos preocupar:

source: **Sample** -- the thing we want to look at
es: **Muestra**: lo que queremos ver
pt_br: **Amostra**: aquilo que queremos ver

source: **Objective lens** -- the thing that gathers the light and focusses it for detection
es: **Lente objetivo**: lo que capta la luz y la enfoca para su detección.
pt_br: **Lente objetiva** – aquilo que capta a luz e a focaliza para detecção

source: **Detector** -- the thing that detects the light to form the digital image (here, a CCD camera)
es: **Detector**: lo que detecta la luz para formar la imagen digital (en este caso, una cámara CCD)
pt_br: **Detector** - aquilo que detecta a luz para formar a imagem digital (aqui, uma câmera CCD)

source: The process is illustrated below:
es: El proceso se ilustra a continuación:
pt_br: O processo é ilustrado abaixo:

source: There are a couple of things to note at this point:
es: Hay un par de cosas a tener en cuenta en este punto:
pt_br: Há algumas coisas a serem observadas neste momento:

source: Not *all* the light emitted from the sample is detected. A lot of it never enters the objective lens.
es: No se detecta *toda* la luz emitida por la muestra. Gran parte nunca entra en la lente del objetivo.
pt_br: Nem *toda* a luz emitida pela amostra é detectada. Muito disso nunca entra nas lentes objetivas.

source: Our images aren't perfect. We will explore problems of blur, noise and pixel size later.
es: Nuestras imágenes no son perfectas. Exploraremos los problemas de desenfoque, ruido y tamaño de píxel más adelante.
pt_br: Nossas imagens não são perfeitas. Exploraremos problemas de desfoque, ruído e tamanho de pixel posteriormente.

source: For now, we are mostly interested in the detection step and how it generates a digital image. Zooming in to look at this in more detail, we can imagine what happens as light hits the camera. The sensor of the camera itself is divided into **physical pixels**, which will correspond to the pixels in the final image. When a photon strikes the detector, an electron may be released at one of the physical pixels. During the acquisition of an image, many photons strike the detector, which can cause many electrons to be released at different physical pixels. These electrons contribute to the value of a pixel in the final image: more electrons &rarr; higher pixel values.
es: Por ahora, lo que más nos interesa es el paso de detección y cómo genera una imagen digital. Acercándonos para ver esto con más detalle, podemos imaginar lo que sucede cuando la luz incide en la cámara. El sensor de la cámara en sí está dividido en **píxeles físicos**, que corresponderán a los píxeles de la imagen final. Cuando un fotón choca contra el detector, es posible que se libere un electrón en uno de los píxeles físicos. Durante la adquisición de una imagen, muchos fotones chocan contra el detector, lo que puede provocar que se liberen muchos electrones en diferentes píxeles físicos. Estos electrones contribuyen al valor de un píxel en la imagen final: más electrones &rarr; valores de píxel más altos.
pt_br: Por enquanto, estamos mais interessados na etapa de detecção e como ela gera uma imagem digital. Aumentando o zoom para ver isso com mais detalhes, podemos imaginar o que acontece quando a luz atinge a câmera. O sensor da câmera em si é dividido em **pixels físicos**, que corresponderão aos pixels da imagem final. Quando um fóton atinge o detector, um elétron pode ser liberado em um dos pixels físicos. Durante a aquisição de uma imagem, muitos fótons atingem o detector, o que pode fazer com que muitos elétrons sejam liberados em diferentes pixels físicos. Esses elétrons contribuem para o valor de um pixel na imagem final: mais elétrons &rarr; valores de pixel mais altos.

source: The important point is that **pixel values are only *indirectly* related to whatever it is in our sample that we want to measure**.
es: El punto importante es que **los valores de píxeles solo están relacionados *indirectamente* con lo que sea que queramos medir** en nuestra muestra.
pt_br: O ponto importante é que **os valores de pixel estão apenas *indiretamente* relacionados com tudo o que queremos medir em nossa amostra**.

source: In this example, they have been derived by quantifying the charge of electron clouds gathered at each physical pixel. This should be proportional to the amount of detected light that originated from a particular volume of the sample. This, in turn, depends upon what is actually present in the sample -- but there are *a lot* of things that can influence the final values in connection with acquisition parameters, conversion factors, and physics. These are not usually related directly to the thing you might want to quantify.
es: En este ejemplo, se obtuvieron cuantificando la carga de las nubes de electrones reunidas en cada píxel físico. Esto debe ser proporcional a la cantidad de luz detectada que se originó en un volumen particular de la muestra. Esto, a su vez, depende de lo que realmente está presente en la muestra, pero hay *muchas* cosas que pueden influir en los valores finales en relación con los parámetros de adquisición, los factores de conversión y la física. Por lo general, estos no están relacionados directamente con lo que desea cuantificar.
pt_br: Neste exemplo, eles foram derivados quantificando a carga das nuvens de elétrons reunidas em cada pixel físico. Isto deve ser proporcional à quantidade de luz detectada proveniente de um determinado volume da amostra. Isto, por sua vez, depende do que está realmente presente na amostra - mas há *muitas* coisas que podem influenciar os valores finais em conexão com parâmetros de aquisição, fatores de conversão e física. Geralmente, eles não estão diretamente relacionados ao que você deseja quantificar.

source: Some of the factors influencing pixel values
es: Algunos de los factores que influyen en los valores de los píxeles.
pt_br: Alguns dos fatores que influenciam os valores dos pixels

source: **Amount of time spent detecting photons**
es: **Cantidad de tiempo dedicado a detectar fotones**
pt_br: **Quantidade de tempo gasto na detecção de fótons**

source: *More time → More photons → More electrons → Higher pixel values*
es: *Más tiempo → Más fotones → Más electrones → Valores de píxeles más altos*
pt_br: *Mais tempo → Mais fótons → Mais elétrons → Valores de pixel mais altos*

source: **Numerical aperture of the objective lens**
es: **Apertura numérica de la lente del objetivo**
pt_br: **Abertura numérica da lente objetiva**

source: This relates to the **angle** of light accepted by the objective
es: Esto se relaciona con el **ángulo** de luz aceptado por el objetivo.
pt_br: Isso está relacionado ao **ângulo** de luz aceito pela objetiva

source: *Higher NA → Larger angle → More photons → More electrons → Higher pixel values*
es: *Mayor NA → Mayor ángulo → Más fotones → Más electrones → Valores de píxeles más altos*
pt_br: *NA maior → Ângulo maior → Mais fótons → Mais elétrons → Valores de pixel mais altos*

source: **Sensitivity of the detector (Quantum Efficiency)**
es: **Sensibilidad del detector (Eficiencia Cuántica)**
pt_br: **Sensibilidade do detector (Eficiência Quântica)**

source: Not all photons necessarily produce an electron; I think of this as the photon hitting the detector, but not hard enough to dislodge an electron. A detector with low sensitivity is likely to 'miss' more photons, so that they never contribute to the pixel value.
es: No todos los fotones producen necesariamente un electrón. Pienso en esto como si el fotón golpeara el detector, pero no con la fuerza suficiente para desalojar un electrón. Es probable que un detector con baja sensibilidad "pierda" más fotones, de modo que nunca contribuyan al valor del píxel.
pt_br: Nem todos os fótons produzem necessariamente um elétron; Penso nisso como o fóton atingindo o detector, mas não com força suficiente para desalojar um elétron. É provável que um detector com baixa sensibilidade “perca” mais fótons, de modo que eles nunca contribuam para o valor do pixel.

source: *Higher sensitivity → More electrons → Higher pixel values*
es: *Mayor sensibilidad → Más electrones → Valores de píxeles más altos*
pt_br: *Maior sensibilidade → Mais elétrons → Maiores valores de pixel*
