Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/imagej.po
Languages: es

source: ImageJ: Images & pixels
es: ImageJ: Imágenes y píxeles

source: Introduction
es: Introducción

source: This is the first section that takes the ideas described in the main chapter and shows how they relate to software: in this case **ImageJ**.
es: Esta es la primera sección que toma las ideas descritas en el capítulo principal y muestra cómo se relacionan con el software: en este caso **ImageJ**.

source: We begin with a brief introduction to what ImageJ is, how to get it, and how to navigate the interface to open and display images.
es: Comenzamos con una breve introducción a qué es ImageJ, cómo obtenerlo y cómo navegar por la interfaz para abrir y mostrar imágenes.

source: What is ImageJ?
es: ¿Qué es ImageJ?

source: **ImageJ** is open-source software for image analysis.
es: **ImageJ** es un software de código abierto para análisis de imágenes.

source: Created by **Wayne Rasband** at the National Institutes of Health, ImageJ has become indispensable to the research community over more than 20 years. It continues to be updated regularly and is by far the most discussed topic on the [Scientific Community Image Forum](https://forum.image.sc) -- with [more than 10,000 topics](https://forum.image.sc/tags) at the time of writing, and more added every day.
es: Creado por **Wayne Rasband** de los Institutos Nacionales de Salud, ImageJ se ha vuelto indispensable para la comunidad de investigación durante más de 20 años. Continúa actualizándose periódicamente y es, con diferencia, el tema más discutido en el [Foro de imagen de la comunidad científica](https://forum.image.sc), con [más de 10 000 temas](https://forum.image .sc/tags) al momento de escribir este artículo, y se agregan más cada día.

source: ImageJ's success is due not only to the features of the software itself, but to its openness and extensibility. The source code is in the public domain, meaning that others can adapt it as needed. But usually this isn't necessary, because users can write (and share) custom macros, plugins or scripts to add new functionality -- without changing ImageJ itself.
es: El éxito de ImageJ se debe no sólo a las características del software en sí, sino también a su apertura y extensibilidad. El código fuente es de dominio público, lo que significa que otros pueden adaptarlo según sea necesario. Pero normalmente esto no es necesario, porque los usuarios pueden escribir (y compartir) macros, complementos o scripts personalizados para agregar nuevas funciones, sin cambiar ImageJ.

source: I personally have found ImageJ phenomenally useful throughout my career, to the extent that I am convinced that *anyone* working with biomedical images benefits if they know how to use it. Even if you ultimately use other software for your analysis, or even write your own, the ability to quickly check things in ImageJ is extremely helpful.
es: Personalmente, he encontrado ImageJ fenomenalmente útil a lo largo de mi carrera, hasta el punto de que estoy convencido de que *cualquiera* que trabaje con imágenes biomédicas se beneficia si sabe cómo utilizarlo. Incluso si finalmente utiliza otro software para su análisis, o incluso escribe el suyo propio, la capacidad de verificar cosas rápidamente en ImageJ es extremadamente útil.

source: These sections are intended to help any interested reader develop a strong working knowledge of ImageJ itself, while simultaneously gaining a deeper understanding of image analysis in general.
es: Estas secciones están destinadas a ayudar a cualquier lector interesado a desarrollar un sólido conocimiento práctico del propio ImageJ y, al mismo tiempo, obtener una comprensión más profunda del análisis de imágenes en general.

source: Getting ImageJ
es: Obteniendo imagenJ

source: ImageJ is available in multiple forms. Three of the most important ones for our purposes are:
es: ImageJ está disponible en múltiples formas. Tres de los más importantes para nuestros propósitos son:

source: 1. ImageJ
es: 1. ImagenJ

source: **Download from https://imagej.nih.gov/ij/**
es: **Descargar desde https://imagej.nih.gov/ij/**

source: The 'original' download of ImageJ contains all the core functionality, but no extra user plugins.
es: La descarga 'original' de ImageJ contiene todas las funciones principales, pero no complementos de usuario adicionales.

source: The core of the application is a tiny file *ij.jar* (~2.5 MB) that runs on Java. You can download a platform-specific package that includes both ImageJ and Java for Windows, Mac or Linux. Including Java makes the download bigger, but makes the application self-contained and easy to run.
es: El núcleo de la aplicación es un pequeño archivo *ij.jar* (~2,5 MB) que se ejecuta en Java. Puede descargar un paquete específico de la plataforma que incluye ImageJ y Java para Windows, Mac o Linux. La inclusión de Java hace que la descarga sea más grande, pero hace que la aplicación sea autónoma y fácil de ejecutar.

source: 2. Fiji
es: 2. Fiyi

source: **Download from https://fiji.sc/**
es: **Descargar desde https://fiji.sc/**

source: **Fiji**, which stands for _**F**iji **I**s **J**ust **I**mageJ_, is a distribution of ImageJ that comes bundled with a plethora of plugins and extra features that are especially useful for life scientists. It also has a powerful script editor that helps a lot when developing macros or scripts, an updater to help manage all the additions, and even a ['Big Data Viewer'](https://imagej.net/plugins/bdv/) for particularly huge images.
es: **Fiji**, que significa _**F**iji **I**s **J**ust **I**mageJ_, es una distribución de ImageJ que viene con una gran cantidad de complementos y funciones adicionales. características que son especialmente útiles para los científicos de la vida. También tiene un potente editor de scripts que ayuda mucho a la hora de desarrollar macros o scripts, un actualizador para ayudar a gestionar todas las adiciones e incluso un ['Big Data Viewer'](https://imagej.net/plugins/bdv/) para imágenes particularmente grandes.

source: 3. ImageJ.JS
es: 3. ImagenJ.JS

source: **Run at https://ij.imjoy.io**
es: **Ejecutar en https://ij.imjoy.io**

source: ImageJ.JS is a web version of the original ImageJ, capable of running in a browser. It has a few extra features, but not as many as Fiji. It was put together and is maintained by the [ImJoy team](https://github.com/imjoy-team) led by Wei Ouyang.
es: ImageJ.JS es una versión web del ImageJ original, capaz de ejecutarse en un navegador. Tiene algunas características adicionales, pero no tantas como Fiji. Fue elaborado y mantenido por el [equipo ImJoy](https://github.com/imjoy-team) dirigido por Wei Ouyang.

source: For more information, see https://imagej.net/software/imagej-js
es: Para obtener más información, consulte https://imagej.net/software/imagej-js

source: More interactivity with ImageJ.JS!
es: ¡Más interactividad con ImageJ.JS!

source: Whenever you see a button like this [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif) it can be used to launch ImageJ.JS directly from this book, often with a relevant image opened.
es: Siempre que vea un botón como este [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy. io?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif) se puede utilizar para iniciar ImageJ.JS directamente desde este libro, a menudo con una imagen relevante abierta.

source: launch ImageJ.JS
es: lanzar ImageJ.JS

source: By default, ImageJ.JS will open in the same browser tab. If you want it to open in a new tab, then there's probably an easy trick in your browser to do that (on a computer, my guess is that it'll be pressing {kbd}`Ctrl` or {kbd}`⌘` when clicking the link).
es: De forma predeterminada, ImageJ.JS se abrirá en la misma pestaña del navegador. Si desea que se abra en una nueva pestaña, entonces probablemente haya un truco sencillo en su navegador para hacerlo (en una computadora, supongo que presionará {kbd} `Ctrl` o {kbd}`⌘` al hacer clic en el enlace).

source: Which ImageJ do I choose?
es: ¿Qué ImageJ elijo?

source: I would say: *all of them*. I always install both ImageJ and Fiji on any computer I will use regularly. ImageJ.JS doesn't require any installation: just a modern web browser.
es: Yo diría: *todos*. Siempre instalo ImageJ y Fiji en cualquier computadora que uso regularmente. ImageJ.JS no requiere ninguna instalación: sólo un navegador web moderno.

source: Everything ImageJ can do can also be accomplished in Fiji (because Fiji contains the full ImageJ inside it), but the converse is not true (because Fiji contains many extra bits) Therefore Fiji is my first choice for more extensive analysis tasks. Its main disadvantage is that it's a lot bigger: taking longer to start up and run update checks, and containing a lot of commands that I don't always need.
es: Todo lo que ImageJ puede hacer también se puede lograr en Fiji (porque Fiji contiene el ImageJ completo en su interior), pero lo contrario no es cierto (porque Fiji contiene muchos bits adicionales). Por lo tanto, Fiji es mi primera opción para tareas de análisis más extensas. Su principal desventaja es que es mucho más grande: tarda más en iniciarse y ejecutar comprobaciones de actualizaciones, y contiene muchos comandos que no siempre necesito.

source: By contrast, the original ImageJ is very small and lightweight. On my computer, it starts almost instantly. It remains my first choice for quick, common tasks with images.
es: Por el contrario, el ImageJ original es muy pequeño y liviano. En mi computadora, se inicia casi instantáneamente. Sigue siendo mi primera opción para tareas rápidas y comunes con imágenes.

source: *Most* ImageJ-related practicals in this course only use core features, and so can be done using any of ImageJ, Fiji or ImageJ.JS. Sometimes in this book I will refer to explicitly to Fiji, indicating that the relevant command is *only* available in Fiji.
es: *La mayoría* de las prácticas relacionadas con ImageJ en este curso solo utilizan funciones básicas y, por lo tanto, se pueden realizar utilizando cualquiera de ImageJ, Fiji o ImageJ.JS. A veces en este libro me referiré explícitamente a Fiji, indicando que el comando relevante *sólo* está disponible en Fiji.

source: Remember to cite the software you use!
es: ¡Recuerda citar el software que utilizas!

source: A lot of open-source software is developed and supported by academics, who invest a huge amount of time into development and support. They need funding to continue that work[^fn_1], and paper citations to help get that funding.
es: Gran parte del software de código abierto es desarrollado y respaldado por académicos, que invierten una gran cantidad de tiempo en desarrollo y soporte. Necesitan financiación para continuar ese trabajo[^fn_1] y citas en papel para ayudar a conseguir esa financiación.

source: If you use software for research you plan to publish, please spend a few minutes searching for how the developers of the software want it to be cited.
es: Si utiliza software para una investigación que planea publicar, dedique unos minutos a buscar cómo los desarrolladores del software quieren que se cite.

source: For ImageJ & Fiji, see https://imagej.net/contribute/citing
es: Para ImageJ y Fiji, consulte https://imagej.net/contribute/citing

source: For other software, search for *citing [software name]*
es: Para otro software, busque *citando [nombre del software]*

source: The ImageJ Interface
es: La interfaz ImageJ

source: ImageJ's user interface is rather minimalistic. It's centered around a toolbar. Everything else (images, histograms, measurement tables, dialogs) appears within separate windows.
es: La interfaz de usuario de ImageJ es bastante minimalista. Está centrado alrededor de una barra de herramientas. Todo lo demás (imágenes, histogramas, tablas de medidas, cuadros de diálogo) aparece en ventanas separadas.

source: The main ImageJ user interface.
es: La interfaz de usuario principal de ImageJ.

source: But despite the simple appearance, ImageJ is powerful. The depth of the software is evident from its abundance of menus and submenus.
es: Pero a pesar de su apariencia simple, ImageJ es poderoso. La profundidad del software es evidente por su abundancia de menús y submenús.

source: Which leads to the **most important tip for using ImageJ**:
es: Lo que lleva al **consejo más importante para usar ImageJ**:

source: Don't memorize the menus -- search!
es: No memorices los menús: ¡busca!

source: ImageJ has a lot of options, buried in a lot of menus... and submenus... and sometimes sub-submenus.
es: ImageJ tiene muchas opciones, ocultas en muchos menús... y submenús... y, a veces, submenús.

source: Fortunately, there's no reason to memorize where they all are to be found. Rather, just remember one shortcut key: {kbd}`L`
es: Afortunadamente, no hay razón para memorizar dónde se encuentran todos ellos. Más bien, recuerde una tecla de acceso directo: {kbd}`L`

source: Pressing {kbd}`L` effectively brings up at **list** of all the commands from the menus, ready for each search.
es: Al presionar {kbd}`L`, aparece efectivamente una **lista** de todos los comandos de los menús, listos para cada búsqueda.

source: For ImageJ, you see the *Command Finder* window where you can begin to type the name of the command you want. You can then run it either by double-clicking on the entry, or by using the up or down arrow keys followed by {kbd}`Enter`.
es: Para ImageJ, verá la ventana *Command Finder* donde puede comenzar a escribir el nombre del comando que desea. Luego puede ejecutarlo haciendo doble clic en la entrada o usando las teclas de flecha hacia arriba o hacia abajo seguidas de {kbd}`Enter`.

source: The *Command Finder* dialog
es: El cuadro de diálogo *Buscador de comandos*

source: In Fiji, you might see the *Command Finder* or you can alternatively switch on a *search bar* by selecting it under {menuselection}`Edit --> Options --> Search Bar...`. The idea is the same. The search bar can also be activated using {kbd}`L` and used to find and run commands.
es: En Fiji, es posible que veas el *Buscador de comandos* o, alternativamente, puedes activar una *barra de búsqueda* seleccionándola en {menuselection}`Editar --> Opciones --> Barra de búsqueda ...`. La idea es la misma. La barra de búsqueda también se puede activar usando {kbd}`L` y usarse para buscar y ejecutar comandos.

source: {menuselection}`Edit --> Options --> Misc...` dialog
es: {menuselection}`Editar --> Opciones --> Varios...` cuadro de diálogo

source: Losing control
es: Perdiendo el control

source: In most software, shortcut keys often require pressing {kbd}`Ctrl` (on Windows, Linux) or {kbd}`⌘` (Mac). Therefore the shortcut to search for a command would be {kbd}`Ctrl+L` or {kbd}`⌘ + L`.
es: En la mayoría del software, las teclas de método abreviado a menudo requieren presionar {kbd}`Ctrl` (en Windows, Linux) o {kbd}`⌘` (Mac ). Por lo tanto, el atajo para buscar un comando sería {kbd}`Ctrl+L` o {kbd}`⌘ + L`.

source: This works in ImageJ, but isn't necessary. Under {menuselection}`Edit --> Options --> Misc...`, you can specify whether the {kbd}`Ctrl` or {kbd}`⌘` key is needed along with the letter for the shortcut.
es: Esto funciona en ImageJ, pero no es necesario. En {menuselection}`Editar --> Opciones --> Misc...`, puede especificar si {kbd}`Ctrl` o {kbd}Se necesita la tecla `⌘` junto con la letra del acceso directo.

source: By default, this option is turned off -- so pressing {kbd}`L` alone is enough. You may find this might make it too easy to accidentally run commands, in which case you should select the option to turn it on.
es: De forma predeterminada, esta opción está desactivada, por lo que presionar {kbd}`L` es suficiente. Es posible que esto haga que sea demasiado fácil ejecutar comandos accidentalmente, en cuyo caso debe seleccionar la opción para activarlo.

source: Opening images & viewing pixels
es: Abrir imágenes y ver píxeles

source: I am always taken aback when I see someone open an image in ImageJ through the menus, by choosing {menuselection}`File --> Open...`.
es: Siempre me sorprende cuando veo que alguien abre una imagen en ImageJ a través de los menús, eligiendo {menuselection}`Archivo --> Abrir...`.

source: Although this can work, it's unnecessarily slow and awkward. The more elegant way to open an image is to simply drag the image file onto ImageJ's toolbar.
es: Aunque esto puede funcionar, es innecesariamente lento e incómodo. La forma más elegante de abrir una imagen es simplemente arrastrar el archivo de imagen a la barra de herramientas de ImageJ.

source: As the cursor is then moved over the image, the value for the pixel under the cursor is displayed in ImageJ's status bar. Images can be navigated as follows:
es: A medida que el cursor se mueve sobre la imagen, el valor del píxel debajo del cursor se muestra en la barra de estado de ImageJ. Las imágenes se pueden navegar de la siguiente manera:

source: **Zoom in**
es: **Acercarse**

source: Select the <img src="../../../images/imagej/icons/zoom.png" /> tool, then **left-click** on the image, or
es: Seleccione la herramienta <img src="../../../images/imagej/icons/zoom.png" /> y luego haga **clic izquierdo** en la imagen, o

source: Press the {kbd}`+` key
es: Presione la tecla {kbd}`+`

source: **Zoom out**
es: **Disminuir el zoom**

source: Select the <img src="../../../images/imagej/icons/zoom.png" /> tool, then **right-click** on the image, or
es: Seleccione la herramienta <img src="../../../images/imagej/icons/zoom.png" /> y luego **haga clic derecho** en la imagen, o

source: Press the {kbd}`-` key
es: Presione la tecla {kbd}`-`

source: **Pan**
es: **Cacerola**

source: Select the <img src="../../../images/imagej/icons/hand.png" /> tool, then click and drag on the image, or
es: Seleccione la herramienta <img src="../../../images/imagej/icons/hand.png" />, luego haga clic y arrastre sobre la imagen, o

source: Press the {kbd}`spacebar`, then click and drag on the image
es: Presione la {kbd}`barra espaciadora`, luego haga clic y arrastre sobre la imagen.

source: When the image is larger than the visible region, a small (purple) overview appears in the top left to indicate which part can currently be seen.
es: Cuando la imagen es más grande que la región visible, aparece una pequeña descripción general (morada) en la parte superior izquierda para indicar qué parte se puede ver actualmente.

source: Practical
es: Práctico

source: The status bar also shows the x and y coordinates for the pixel under the cursor. However, to interpret these you need to know the *origin*, i.e. the location of the pixel at x=0, y=0.
es: La barra de estado también muestra las coordenadas xey del píxel debajo del cursor. Sin embargo, para interpretarlos es necesario conocer el *origen*, es decir, la ubicación del píxel en x=0, y=0.

source: Where is the origin of the image in ImageJ?
es: ¿Dónde está el origen de la imagen en ImageJ?

source: Top left corner
es: Esquina superior izquierda

source: Top right corner
es: Esquina superior derecha

source: Bottom left corner
es: Esquina izquierda inferior

source: Bottom right corner
es: Esquina inferior derecha

source: Image center
es: Centro de imagen

source: **Tip:** You should be able to answer this question by opening an image in ImageJ, and observing the coordinates in the toolbar as you move the cursor over the image.
es: **Consejo:** Debería poder responder esta pregunta abriendo una imagen en ImageJ y observando las coordenadas en la barra de herramientas mientras mueve el cursor sobre la imagen.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)
es: [![lanzamiento ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/practical-data/blob/main/images/happy_cell.tif)

source: Solution
es: Solución

source: The origin of the image is at the top left, i.e. the top left pixel is identified with the coordinate x=0, y=0.
es: El origen de la imagen está en la parte superior izquierda, es decir, el píxel superior izquierdo se identifica con la coordenada x=0, y=0.

source: Changing appearance
es: Cambiando de apariencia

source: Adjusting Brightness & Contrast
es: Ajustar el brillo y el contraste

source: *Brightness/Contrast* dialog
es: *Diálogo Brillo/Contraste*

source: The main command to change the brightness of an image is {menuselection}`Image --> Adjust --> Brightness/Contrast...`. Since you're likely to use it a lot, it is worth learning the shortcut: {kbd}`Shift+C`.
es: El comando principal para cambiar el brillo de una imagen es {menuselection}`Imagen --> Ajustar --> Brillo/Contraste...`. Dado que es probable que lo uses mucho, vale la pena aprender el atajo: {kbd}`Shift+C`.

source: The Brightness/Contrast dialog has four sliders: {guilabel}`Minimum`, {guilabel}`Maximum`, {guilabel}`Brightness` & {guilabel}`Contrast`. They are linked together: changing either of the first two also results in a change to the last two, and vice versa.
es: El cuadro de diálogo Brillo/Contraste tiene cuatro controles deslizantes: {guilabel}`Minimum`, {guilabel}`Maximum`, {guilabel}`Brillo` y {guilabel}`Contraste`. Están vinculados entre sí: cambiar cualquiera de los dos primeros también resulta en un cambio en los dos últimos, y viceversa.

source: Supposing you have a grayscale LUT, with colors ranging from black to white, you should see that
es: Suponiendo que tienes una LUT en escala de grises, con colores que van del negro al blanco, deberías ver que

source: All pixels with a value less than or equal to the {guilabel}`Minimum` will be shown as black
es: Todos los píxeles con un valor menor o igual al {guilabel}`Minimum` se mostrarán en negro.

source: All pixels with a value greater than or equal to the {guilabel}`Maximum` will be shown as white
es: Todos los píxeles con un valor mayor o igual al {guilabel}`Máximo` se mostrarán en blanco.

source: All other pixels with a value in between will be shown using a shade of gray
es: Todos los demás píxeles con un valor intermedio se mostrarán usando un tono de gris.

source: Use the minimum & maximum sliders
es: Utilice los controles deslizantes mínimo y máximo

source: Despite the name of the command implying {guilabel}`Brightness` and {guilabel}`Contrast` are the star perfomers, I would argue that the {guilabel}`Minimum` and {guilabel}`Maximum` sliders are far more intuitive.
es: A pesar de que el nombre del comando implica que {guilabel}`Brightness` y {guilabel}`Contrast` son los artistas estrella, yo diría que Los controles deslizantes {guilabel}`Mínimo` y {guilabel}`Máximo` son mucho más intuitivos.

source: I use {guilabel}`Minimum` and {guilabel}`Maximum` almost exclusively.
es: Utilizo {guilabel}`Minimum` y {guilabel}`Maximum` casi exclusivamente.

source: Does adjusting any of the sliders in the brightness & contrast dialog change the pixel values or only the LUT?
es: ¿Ajustar alguno de los controles deslizantes en el cuadro de diálogo de brillo y contraste cambia los valores de píxeles o solo el LUT?

source: What happens if you press {guilabel}`Apply`?
es: ¿Qué sucede si presionas {guilabel}`Aplicar`?
