Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/imagej.po
Languages: es

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open=https://github.com/bioimagebook/bioimagebook.github.io/blob/main/chapters/1-concepts/1-images_and_pixels/images/couple.png)
es: [![lanzamiento ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?open= https://github.com/bioimagebook/bioimagebook.github.io/blob/main/chapters/1-concepts/1-images_and_pixels/images/ Couple.png)

source: Adjusting the sliders changes the LUT -- and *not* the pixel values.
es: Ajustar los controles deslizantes cambia la LUT, y *no* los valores de píxeles.

source: That is, unless you press {guilabel}`Apply`. If you do press {guilabel}`Apply` then the pixel values are changed.
es: Es decir, a menos que presione {guilabel}`Aplicar`. Si presiona {guilabel}`Aplicar`, se cambian los valores de píxeles.

source: Recent versions of ImageJ give a warning when pressing {guilabel}`Apply`, but previous versions did not... which made it an extremely dangerous button for new users of the software. In most cases, the rule is:
es: Las versiones recientes de ImageJ dan una advertencia al presionar {guilabel}`Aplicar`, pero las versiones anteriores no... lo que lo convertía en un botón extremadamente peligroso para los nuevos usuarios del software. En la mayoría de los casos, la regla es:

source: **When adjusting the brightness & contrast in ImageJ, don't press {guilabel}`Apply`!**
es: **Al ajustar el brillo y el contraste en ImageJ, ¡no presione {guilabel}`Apply`!**

source: You shouldn't break this rule without a good reason!
es: ¡No deberías romper esta regla sin una buena razón!

source: Switching LUTs
es: Cambio de LUT

source: You can change the colors of the LUT by selecting an alternative option from the {menuselection}`Image --> Lookup tables -->` submenu.
es: Puede cambiar los colores de la LUT seleccionando una opción alternativa del submenú {menuselection}`Imagen --> Tablas de búsqueda -->`.

source: Use the Control Panel to frequently access the same menu
es: Utilice el Panel de control para acceder con frecuencia al mismo menú

source: If you want to explore LUTs quickly, use {menuselection}`Plugins --> Utilities --> Control Panel`. This opens a window that allows you to double-click on commands from any menu or submenu to apply that command quickly.
es: Si desea explorar las LUT rápidamente, utilice {menuselection}`Complementos --> Utilidades --> Panel de control`. Esto abre una ventana que le permite hacer doble clic en los comandos de cualquier menú o submenú para aplicar ese comando rápidamente.

source: Sometimes they also need a kind word or a compliment, because they are human. Supporting software can be time-consuming, hard and stressful -- and is usually something they do for free, in their limited spare time.
es: A veces también necesitan una palabra amable o un cumplido, porque son humanos. El software de soporte puede llevar mucho tiempo, ser difícil y estresante, y normalmente es algo que hacen de forma gratuita, en su limitado tiempo libre.
