Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/images_and_pixels.po
Languages: es, pt_br

source: Ultimately, this leads to the warning:
es: En última instancia, esto lleva a la advertencia:
pt_br: Em última análise, isso leva ao aviso:

source: Don't over-interpret pixel values!
es: ¡No sobreinterpretes los valores de los píxeles!
pt_br: Não interprete excessivamente os valores dos pixels!

source: Individual pixel values are rarely very meaningful in isolation: we're usually interested in *relative* differences between groups of pixels.
es: Los valores de píxeles individuales rara vez son muy significativos de forma aislada: normalmente nos interesan las diferencias *relativas* entre grupos de píxeles.
pt_br: Valores de pixels individuais raramente são muito significativos isoladamente: geralmente estamos interessados em diferenças *relativas* entre grupos de pixels.

source: As we shall see, this means that we often need to average values and normalize to something whenever we want to make measurements in an image. We can't usually untangle the influences well enough to infer anything with confidence from a single pixel value.
es: Como veremos, esto significa que a menudo necesitamos promediar valores y normalizarlos a algo cuando queremos realizar mediciones en una imagen. Por lo general, no podemos desenredar las influencias lo suficientemente bien como para inferir algo con confianza a partir del valor de un solo píxel.
pt_br: Como veremos, isso significa que muitas vezes precisamos calcular a média dos valores e normalizá-los para algo sempre que quisermos fazer medições em uma imagem. Geralmente não conseguimos desembaraçar as influências o suficiente para inferir algo com confiança a partir de um único valor de pixel.

source: But the limitations in what pixel values can tell us don't diminish their importance: on the contrary, pixel values remain our raw data and it's essential that we preserve them as faithfully as possible. That's a lot harder than you might expect. It requires knowing when and how pixel values might become changed whenever we are working with our images. This is so crucial that it will be the focus throughout the entire first part of this book.
es: Pero las limitaciones en lo que los valores de los píxeles pueden decirnos no disminuyen su importancia: por el contrario, los valores de los píxeles siguen siendo nuestros datos sin procesar y es esencial que los conservemos lo más fielmente posible. Eso es mucho más difícil de lo que cabría esperar. Requiere saber cuándo y cómo los valores de los píxeles pueden cambiar cada vez que trabajamos con nuestras imágenes. Esto es tan crucial que será el tema central durante toda la primera parte de este libro.
pt_br: Mas as limitações no que os valores dos pixels nos podem dizer não diminuem a sua importância: pelo contrário, os valores dos pixels continuam a ser os nossos dados brutos e é essencial que os preservemos tão fielmente quanto possível. Isso é muito mais difícil do que você imagina. Requer saber quando e como os valores dos pixels podem ser alterados sempre que estivermos trabalhando com nossas imagens. Isso é tão crucial que será o foco de toda a primeira parte deste livro.

source: Lookup tables
es: Tablas de búsqueda
pt_br: Tabelas de pesquisa

source: LUTs vs. Colormaps
es: LUT vs. mapas de colores
pt_br: LUTs vs. mapas de cores

source: **Lookup tables** are sometimes referred to as **colormaps**.
es: Las **tablas de búsqueda** a veces se denominan **mapas de colores**.
pt_br: **Tabelas de pesquisa** às vezes são chamadas de **mapas de cores**.

source: For our purposes, the terms are interchangeable -- you may see either depending upon which software you are using.
es: Para nuestros propósitos, los términos son intercambiables; es posible que vea cualquiera de ellos dependiendo del software que esté utilizando.
pt_br: Para nossos propósitos, os termos são intercambiáveis – você poderá ver qualquer um deles dependendo do software que estiver usando.

source: So images are really comprised of a lot of numbers -- the pixel values -- even though we normally visualize them as shapes and colors.
es: Así que las imágenes en realidad se componen de muchos números (los valores de los píxeles), aunque normalmente los visualizamos como formas y colores.
pt_br: Portanto, as imagens são compostas por muitos números - os valores dos pixels - embora normalmente as visualizemos como formas e cores.

source: It's time then to consider our second question: **How are pixel values converted for display?**
es: Entonces es hora de considerar nuestra segunda pregunta: **¿Cómo se convierten los valores de píxeles para su visualización?**
pt_br: Chegou a hora de considerar nossa segunda pergunta: **Como os valores de pixel são convertidos para exibição?**

source: The basic idea is simple: the software displaying the image uses a **lookup table (LUT)** that maps each pixel value to a color. When it comes to showing the image, each pixel is replaced by a little dot or square on screen that has the corresponding color.
es: La idea básica es simple: el software que muestra la imagen utiliza una **tabla de búsqueda (LUT)** que asigna cada valor de píxel a un color. A la hora de mostrar la imagen, cada píxel se sustituye por un puntito o cuadrado en pantalla que tiene el color correspondiente.
pt_br: A ideia básica é simples: o software que exibe a imagem usa uma **tabela de consulta (LUT)** que mapeia cada valor de pixel para uma cor. Na hora de mostrar a imagem, cada pixel é substituído por um pequeno ponto ou quadrado na tela que possui a cor correspondente.

source: LUTs therefore provide a way to **change the appearance of an image without changing its pixel values**.
es: Por lo tanto, las LUT proporcionan una manera de **cambiar la apariencia de una imagen sin cambiar sus valores de píxeles**.
pt_br: Portanto, as LUTs fornecem uma maneira de **alterar a aparência de uma imagem sem alterar seus valores de pixel**.

source: This is extremely useful in practice. Since images in biology often have rather low pixel values (formed from a small amount of detected light), we very often want to change their brightness for display.
es: Esto es extremadamente útil en la práctica. Dado que las imágenes en biología suelen tener valores de píxeles bastante bajos (formados a partir de una pequeña cantidad de luz detectada), muy a menudo queremos cambiar su brillo para su visualización.
pt_br: Isto é extremamente útil na prática. Como as imagens em biologia geralmente têm valores de pixel bastante baixos (formados a partir de uma pequena quantidade de luz detectada), muitas vezes queremos alterar seu brilho para exibição.

source: One way we *could* make an image brighter is to change the pixel values themselves -- multiply them by 2, for example. That would indeed usually make the image look brighter, but we risk making a terrible mess of our data if we permit ourselves to make such changes. As described above, we really don't want to modify our raw data unnecessarily.
es: Una forma en que *podríamos* hacer que una imagen sea más brillante es cambiar los valores de los píxeles mismos: multiplicarlos por 2, por ejemplo. De hecho, esto normalmente haría que la imagen se vea más brillante, pero corremos el riesgo de crear un desastre terrible con nuestros datos si nos permitimos realizar tales cambios. Como se describió anteriormente, realmente no queremos modificar innecesariamente nuestros datos sin procesar.
pt_br: Uma maneira de tornar uma imagem mais brilhante é alterar os próprios valores dos pixels - multiplicá-los por 2, por exemplo. Na verdade, isso geralmente faria com que a imagem parecesse mais clara, mas corremos o risco de causar uma bagunça terrível em nossos dados se nos permitirmos fazer tais alterações. Conforme descrito acima, realmente não queremos modificar nossos dados brutos desnecessariamente.

source: A **much** better way to change the brightness of an image is to change the LUT only.
es: Una manera **mucho** mejor de cambiar el brillo de una imagen es cambiar solo la LUT.
pt_br: Uma maneira **muito** melhor de alterar o brilho de uma imagem é alterar apenas o LUT.

source: The danger is that **not all software cares so much about preserving pixel values**. Someone wanting to enhance their holiday photos isn't likely to care about retaining the original pixel values for quantification later; rather, they just want the images to look as nice as possible.
es: El peligro es que **no todo el software se preocupa tanto por preservar los valores de los píxeles**. A alguien que quiera mejorar sus fotos de vacaciones probablemente no le importe conservar los valores de píxeles originales para cuantificarlos más adelante; más bien, sólo quieren que las imágenes se vean lo más bonitas posible.
pt_br: O perigo é que **nem todos os softwares se preocupam tanto em preservar os valores dos pixels**. Alguém que deseja aprimorar suas fotos de férias provavelmente não se importará em manter os valores originais dos pixels para quantificação posterior; em vez disso, eles apenas querem que as imagens tenham a melhor aparência possível.

source: For this reason, a lot of software designed for working with images really *will* rescale the pixel values when you do something as simple as adjusting the brightness. And so it is entirely possible to open an image, adjust the display slightly to see things more clearly, and in doing so irreparably damage the image -- losing the raw data required for later analysis.
es: Por esta razón, muchos programas diseñados para trabajar con imágenes realmente *cambiarán* la escala de los valores de píxeles cuando haces algo tan simple como ajustar el brillo. Y por eso es completamente posible abrir una imagen, ajustar ligeramente la visualización de la pantalla para ver las cosas con mayor claridad y, al hacerlo, dañar irreparablemente la imagen, perdiendo los datos sin procesar, necesarios para un análisis posterior.
pt_br: Por esse motivo, muitos softwares projetados para trabalhar com imagens realmente *redimensionarão* os valores dos pixels quando você fizer algo tão simples como ajustar o brilho. E assim é inteiramente possível abrir uma imagem, ajustar ligeiramente a exibição para ver as coisas com mais clareza e, ao fazê-lo, danificar irreparavelmente a imagem – perdendo os dados brutos necessários para análise posterior.

source: This is why you should **use scientific software for scientific image analysis** -- and not just any general imaging editing software you might find.
es: Es por eso que usted debe **usar software científico para el análisis de imágenes científicas**, y no cualquier software de edición de imágenes general que pueda encontrar.
pt_br: É por isso que você deve **usar software científico para análise científica de imagens** - e não qualquer software geral de edição de imagens que você possa encontrar.

source: But even when using scientific software, it's often possible to change pixel values whenever you'd really rather only be changing lookup tables. The next chapter will show how to check when this is happening.
es: Pero incluso cuando se utiliza software científico, a menudo es posible cambiar los valores de los píxeles cuando realmente se prefiere cambiar las tablas de búsqueda. El próximo capítulo mostrará cómo comprobar cuándo esto sucede.
pt_br: Mas mesmo ao usar software científico, muitas vezes é possível alterar os valores dos pixels sempre que você realmente preferir apenas alterar as tabelas de pesquisa. O próximo capítulo mostrará como verificar quando isso está acontecendo.
