Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/1-concepts/1-images_and_pixels/python.po
Languages: es

source: Python: Images & pixels
es: Python: Imágenes y píxeles

source: The goal of these sections is to provide an interactive illustration of image analysis concepts through the popular [Python](https://www.python.org) programming language.
es: El objetivo de estas secciones es ofrecer una ilustración interactiva de los conceptos del análisis de imágenes a través del popular lenguaje de programación [Python](https://www.python.org).

source: Feel free to skip this!
es: Siéntase libre de saltarse esto.

source: If you're more interested in concepts and/or ImageJ, I would recommend skipping the Python chapters at the beginning - you don't need them to follow the rest of the book.
es: Si le interesan más los conceptos y/o ImageJ, le recomendaría que se saltara los capítulos de Python del principio - no los necesita para comprender el resto del libro.

source: However, if you *are* interested, I hope these sections can help provide an alternative view of image analysis.
es: Sin embargo, si *le* interesa, espero que estas secciones puedan ayudar a ofrecerle una visión alternativa del análisis de imágenes.

source: Even if you've never coded before, working through the examples will hopefully give you both a deeper understanding of image processing and some useful programming skills.
es: Aunque nunca haya programado antes, los ejemplos le ayudarán a comprender mejor el procesamiento de imágenes y a adquirir algunos conocimientos útiles de programación.

source: This page will introduce reading and displaying images. Later Python chapters in the handbook will build on these foundations.
es: Esta página introducirá la lectura y visualización de imágenes. Los capítulos posteriores de Python en el manual se basarán en estos fundamentos.

source: Make it interactive!
es: Hágalo interactivo.

source: Before continuing, you should [make the notebook interactive](sec-live-notebooks) so that you can run the code yourself - and explore what happens if you make changes.
es: Antes de continuar, debería [hacer el cuaderno interactivo](sec-live-notebooks) para que pueda ejecutar el código usted mismo - y explorar qué ocurre si hace cambios.

source: Python overview
es: Descripción general de Python

source: If you want a quick introduction to Python, check out the [Python Primer](../../appendices/python/python.md) section.
es: Si quiere una introducción rápida a Python, consulte la sección [Python Primer](../../appendices/python/python.md).

source: For lots more, see Robert Haase's [Bio-image Analysis Notebooks](https://haesleinhuepf.github.io/BioImageAnalysisNotebooks/).
es: Para más información, consulte [Bio-image Analysis Notebooks] de Robert Haase (https://haesleinhuepf.github.io/BioImageAnalysisNotebooks/).

source: Read & show an image using Python <a name="show-image-in-python" />
es: Leer y mostrar una imagen con Python <a name="show-image-in-python" />

source: Let's begin by loading an image in Python, and then showing it using [matplotlib](https://matplotlib.org).
es: Empecemos cargando una imagen en Python, y mostrándola después utilizando [matplotlib](https://matplotlib.org).

source: Changing lookup tables
es: Modificación de las tablas de consulta (LUTs)

source: The key method here is `plt.imshow`. We can pass additional parameters to customize the display in many ways.
es: El método clave aquí es `plt.imshow`. Podemos introducir parámetros adicionales para personalizar la visualización de muchas maneras.

source: To see what is possible, I usually start to type the name and then press {kbd}`Shift+Tab` to prompt some documentation to appear.
es: Para ver qué es posible, suelo empezar a escribir el nombre y luego pulsar {kbd}`Shift+Tab` para que aparezca algo de documentación.

source: Alternatively, you can run either of the following lines
es: Alternativamente, puede ejecutar cualquiera de las siguientes líneas

source: to display some help text.
es: para mostrar un texto de ayuda.

source: This can sometimes reveal an overwhelming amount of information, and it can take a bit of time to figure out how to identify the key bits.
es: A veces, esto puede revelar una cantidad abrumadora de información, y puede llevar un poco de tiempo averiguar cómo identificar los elementos clave.

source: The important plotting options for our purposes are
es: Las opciones de trazado importantes para nuestros fines son

source: `cmap` to change the colormap (LUT)
es: `cmap` para cambiar el mapa de colores (LUT)

source: `vmin` to change the pixel value corresponding to the first color in the colormap
es: `vmin` para cambiar el valor del píxel correspondiente al primer color en el mapa de colores

source: `vmax` to change the pixel value corresponding to the last color in the colormap
es: `vmax` para cambiar el valor del píxel correspondiente al último color en el mapa de colores

source: The last two options control the brightness/contrast.
es: Las últimas dos opciones controlan el brillo/contraste.

source: Try running the following code cells to see the effect, and try out other changes.
es: Pruebe a ejecutar las siguientes líneas de código para ver el efecto, y pruebe otros cambios.

source: There are many more colormaps available in matplotlib -- for details, see https://matplotlib.org/stable/tutorials/colors/colormaps.html
es: Hay muchos más mapas de colores disponibles en matplotlib -- para más detalles, vea https://matplotlib.org/stable/tutorials/colors/colormaps.html.

source: As you can see, the image may look *very* different depending upon the colormap and min/max values used.
es: Como puede ver, la imagen puede tener un aspecto *muy* diferente según el mapa de colores y los valores mín./máx. utilizados.

source: However, it's crucial that *we haven't modified the original image data itself*.
es: Sin embargo, es crucial recalcar que *no hemos modificado los datos de la imagen original en sí*.

source: To check this, try showing the image as we did initially - to make sure it looks the same.
es: Para comprobarlo, pruebe a mostrar la imagen como lo hicimos inicialmente, para asegurarse de que se ve igual.

source: Further customizing image display
es: Personalizar aún más la visualización de imágenes

source: Lots more can be done to customize appearance.
es: Se puede hacer mucho más para personalizar la apariencia.

source: In order to standardize things throughout this book, I normally turn off the outer axis (numbers around the boundary), set an image title, and use a grayscale lookup table.
es: Para estandarizar las cosas a lo largo de este libro, normalmente desactivo el eje exterior (números alrededor del límite), establezco un título de imagen y utilizo una tabla de consulta (LUT) en escala de grises.

source: The code to do this is shown below.
es: El código para hacer esto se muestra a continuación.

source: Writing functions
es: Funciones de escritura

source: If you use the same customizations frequently, it helps to **define a function** that applies them. Then you don't need to copy and paste the same lines of code frequently; rather, you just call the function instead.
es: Si utiliza las mismas personalizaciones con frecuencia, resulta útil **definir una función** que las aplique. Así no tendrá que copiar y pegar con frecuencia las mismas líneas de código, sino que bastará con que llame a la función.

source: The function definition starts with `def`. It is followed by
es: La definición de una función empieza por `def`, a lo que le sigue

source: The function name
es: El nombre de la función

source: Parameters (within parentheses), sometimes with default values
es: Parámetros (entre paréntesis), a veces con valores predeterminados

source: A colon
es: Dos puntos (:)

source: The main code that implements the function - this needs to be indented (something Python is *very* fussy about)
es: El código principal que implementa la función - esto necesita tener una sangría (algo con lo que Python es *muy* quisquilloso)

source: Helper functions in this book
es: Funciones auxiliares de este libro

source: I've written several helper functions to standardize image display throughout this handbook. They aren't part of any wider Python library, but we can use them here to make our scripts shorter and focus on the more important concepts.
es: He escrito varias funciones de ayuda para estandarizar la visualización de imágenes a lo largo de este manual. No forman parte de alguna biblioteca más amplia de Python, pero podemos usarlas aquí para hacer nuestros scripts más cortos y centrarnos en los conceptos más importantes.

source: To use these helper functions, we need to import them once per Jupyter notebook. Then we can use the methods such as `load_image` and `show_image` (along with companions like `show_histogram`) to display images.
es: Para utilizar estas funciones de ayuda, tenemos que importarlas una vez por cada cuaderno Jupyter. A continuación, podemos utilizar los métodos como `load_image` y `show_image` (junto con elementos como `show_histogram`) para mostrar imágenes.
