Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/3-thresholding/imagej.po
Languages: es, pt_br

source: ROIs are not the only way to represent image objects: sometimes labeled images are more useful.
es: Los ROI no son la única forma de representar objetos de imagen: a veces son más útiles las imágenes etiquetadas.
pt_br: As ROIs não são a única maneira de representar objetos de imagem: às vezes, imagens rotuladas são mais úteis.

source: {menuselection}`Analyze --> Analyze Particles...` can generate labeled images by using the {guilabel}`Show: Count Masks` option. This will generate a new image in which each pixel has a unique integer value indicating the number of the object it is part of -- or zero if it is in the background. With a suitably colorful LUT (often {menuselection}`Image --> Lookup Tables --> Glasbey`), this can create a helpful and cheerful display of objects ({numref}`fig-blobs_binary_label`).
es: {menuselection}`Analizar --&gt; Analizar Partículas...` puede generar imágenes etiquetadas utilizando la opción {guilabel}`Mostrar: Count Masks`. Esto generará una nueva imagen en la que cada píxel tiene un valor entero único que indica el número del objeto del que forma parte -- o cero si está en el fondo. Con una LUT de color adecuado (a menudo {menuselection}`Image --&gt; Lookup Tables --&gt; Glasbey`), esto puede crear una visualización útil y alegre de los objetos ({numref}`fig-blobs_binary_label`).
pt_br: {menuselection}`Analyze --> Analyze Particles...` pode gerar imagens rotuladas usando {guilabel}`Show: Count Masks` opção. Isso irá gerar uma nova imagem na qual cada pixel possui um valor inteiro único indicando o número do objeto do qual faz parte - ou zero se estiver em segundo plano. Com uma LUT adequadamente colorida (geralmente {menuselection}`Image --> Lookup Tables --> Glasbey`), isso pode criar uma exibição útil e alegre de objetos ({numref}`fig-blobs_binary_label`).

source: Creating a labeled image with {menuselection}`Analyze --> Analyze Particles`.
es: Creación de una imagen etiquetada con {menuselection}`Analyze --&gt; Analyze Particles`.
pt_br: Criando uma imagem rotulada com {menuselection}`Analyze --> Analyze Particles`.

source: Practical
es: Práctico
pt_br: Prático

source: [Connectivity](sec_thresholds_connectivity) (4 or 8) is an important consideration when converting a binary image to objects, since it can have a major impact on the number and size of objects.
es: [Conectividad](sec_thresholds_connectivity) (4 u 8) es una consideración importante al convertir una imagen binaria en objetos, ya que puede tener un impacto importante en el número y tamaño de los objetos.
pt_br: [Conectividade](sec_thresholds_connectivity) (4 ou 8) é uma consideração importante ao converter uma imagem binária em objetos, pois pode ter um grande impacto no número e tamanho dos objetos.

source: Work out what kind of connectivity is used by
es: Averigüe qué tipo de conectividad utiliza
pt_br: Descubra que tipo de conectividade é usada por

source: {menuselection}`Analyze --> Analyze Particles...`
es: {menuselection}`Analizar --&gt; Analizar Partículas...`
pt_br: {menuselection}`Analisar --> Analisar Partículas...`

source: the *Wand tool* <img src="../../../images/imagej/icons/wand.png" />
es: la *herramienta Varita* <img src="../../../images/imagej/icons/wand.png" />
pt_br: a *ferramenta Varinha* <img src="../../../images/imagej/icons/wand.png" />

source: **Note:** You can investigate this by applying the commands/tools to a binary image that has some diagonally connected pixels. One way to do this is by thresholding a suitable image, another is to use the *Brush tool* <img src="../../../images/imagej/icons/brush.png" /> to draw your own pixels in the binary image.
es: **Nota:** Puede investigar esto aplicando los comandos/herramientas a una imagen binaria que tenga algunos píxeles conectados diagonalmente. Una forma de hacerlo es umbralizando una imagen adecuada, otra es utilizar la *herramienta Pincel* <img src="../../../images/imagej/icons/brush.png" /> para dibujar tus propios píxeles en la imagen binaria.
pt_br: **Nota:** Você pode investigar isso aplicando os comandos/ferramentas a uma imagem binária que possui alguns pixels conectados diagonalmente. Uma maneira de fazer isso é definir o limite de uma imagem adequada, outra é usar a *ferramenta Pincel* <img src="../../../images/imagej/icons/brush.png" /> para desenhar seus próprios pixels na imagem binária.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/)

source: launch ImageJ.JS
es: iniciar ImageJ.JS
pt_br: iniciar ImageJ.JS

source: Solution
es: Solución
pt_br: Solução

source: At the time of writing, {menuselection}`Analyze --> Analyze Particles...` uses 8-connectivity.
es: En el momento de escribir esto, {menuselection}`Analyze --&gt; Analyze Particles...` utiliza conectividad 8.
pt_br: No momento em que este artigo foi escrito, {menuselection}`Analyze --> Analyze Particles...` usa conectividade 8.

source: For the *Wand tool* the right answer will depend upon the setting you see if you double-click the tool. There are three options: 4-connectivity, 8-connectivity and 'legacy' (where 'legacy' seems to behave a bit like 8-connectivity).
es: En el caso de la herramienta *Varita*, la respuesta correcta dependerá de la configuración que vea si hace doble clic en la herramienta. Hay tres opciones: 4-conectividad, 8-conectividad y 'legacy' (donde 'legacy' parece comportarse un poco como 8-conectividad).
pt_br: Para a *ferramenta Varinha* a resposta certa dependerá da configuração que você vê ao clicar duas vezes na ferramenta. Existem três opções: conectividade 4, conectividade 8 e 'legado' (onde 'legado' parece se comportar um pouco como conectividade 8).

source: Local thresholding
es: Umbralización local
pt_br: Limite local

source: A few methods to perform local thresholding can be found under {menuselection}`Image --> Adjust --> Auto Local Threshold`. The dialog again provides the option to try all of them.
es: En {menuselection}`Imagen --&gt; Ajustar --&gt; Umbral local automático` encontrará algunos métodos para realizar el umbral local. El diálogo ofrece de nuevo la opción de probarlos todos.
pt_br: Alguns métodos para realizar limite local podem ser encontrados em {menuselection}`Image --> Adjust --> Auto Local Threshold`. A caixa de diálogo oferece novamente a opção de experimentar todos eles.

source: Using automated local filters is complicated by the fact that window sizes and parameters need to be tuned. What these mean in each case is described at https://imagej.net/Auto_Local_Threshold
es: El uso de filtros locales automatizados se complica por el hecho de que es necesario ajustar el tamaño de las ventanas y los parámetros. Lo que esto significa en cada caso se describe en https://imagej.net/Auto_Local_Threshold
pt_br: O uso de filtros locais automatizados é complicado pelo fato de que os tamanhos e parâmetros das janelas precisam ser ajustados. O que isso significa em cada caso está descrito em https://imagej.net/Auto_Local_Threshold

source: Currently, ImageJ's local thresholding also requires that the image is converted to 8-bit. This should be done with some caution, since it can involve surreptitiously incorporating the [brightness & contrast settings](sec_bit_depths_converting) into the thresholding.
es: Actualmente, el umbral local de ImageJ también requiere que la imagen se convierta a 8 bits. Esto debe hacerse con cierta precaución, ya que puede implicar incorporar subrepticiamente los [ajustes de brillo y contraste](sec_bit_depths_converting) en el umbralizado.
pt_br: Atualmente, o limite local do ImageJ também exige que a imagem seja convertida para 8 bits. Isso deve ser feito com cautela, pois pode envolver a incorporação clandestina das [configurações de brilho e contraste](sec_bit_profundidades_converting) no limiar.

source: For these reasons, I tend to avoid local thresholding.
es: Por estas razones, tiendo a evitar el umbral local.
pt_br: Por estas razões, tendo a evitar limiares locais.

source: Explore several automated methods of thresholding the different channels of {menuselection}`File --> Open samples --> HeLa Cells`, using both local and global automated thresholds, to draw your own conclusions about which methods you might prefer for different images.
es: Explore varios métodos automatizados de umbralización de los diferentes canales de {menuselection}`Archivo --&gt; Abrir muestras --&gt; Células HeLa`, utilizando umbrales automatizados tanto locales como globales, para sacar sus propias conclusiones sobre qué métodos podría preferir para diferentes imágenes.
pt_br: Explore vários métodos automatizados de limite dos diferentes canais de {menuselection}`File --> Open samples --> HeLa Cells`, usando limites automatizados locais e globais, para tirar suas próprias conclusões sobre quais métodos você pode preferir para imagens diferentes.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run= https://gist.github.com/petebankhead/a45e4eed3a90b6374ec7b272db090ec9)

source: Addendum: Practical issues
es: Anexo: Cuestiones prácticas
pt_br: Adendo: Questões práticas

source: We end this section with a brief discussion of a few non-obvious practical issues that impact thresholding, related to bit-depths and image types.
es: Terminamos esta sección con un breve análisis de algunas cuestiones prácticas no evidentes que afectan a la umbralización, relacionadas con la profundidad de bits y los tipos de imagen.
pt_br: Terminamos esta seção com uma breve discussão de algumas questões práticas não óbvias que impactam o limiar, relacionadas à profundidade de bits e aos tipos de imagem.

source: Using NaNs
es: Uso de NaNs
pt_br: Usando NaNs

source: The first issue appears when you click {guilabel}`Apply` in the {menuselection}`Image --> Adjust --> Threshold...` dialog box for a 32-bit image. This leads to a prompt asking whether to {guilabel}`Set Background Pixels to NaN`.
es: El primer problema aparece cuando se pulsa {guilabel}`Aplicar` en el cuadro de diálogo {menuselection}`Imagen --&gt; Ajustar --&gt; Umbral...` para una imagen de 32 bits. Aparece un mensaje preguntando si se desea {guilabel}`Set Background Pixels to NaN`.
pt_br: O primeiro problema aparece quando você clica em {guilabel}`Aplicar` em {menuselection}`Imagem --> Ajustar --> Limite. .` caixa de diálogo para uma imagem de 32 bits. Isso leva a um prompt perguntando se deve {guilabel}`Definir pixels de fundo como NaN`.

source: If this is chosen, a binary image is no longer created. Instead, thresholding results in an image in which the foreground pixels retain their original values, while background pixels are **_NaN_**, or **_Not A Number_**.
es: Si se elige esta opción, ya no se crea una imagen binaria. En su lugar, la umbralización da como resultado una imagen en la que los píxeles del primer plano conservan sus valores originales, mientras que los píxeles del fondo son **_NaN_**, o **_Not A Number_**.
pt_br: Se esta opção for escolhida, uma imagem binária não será mais criada. Em vez disso, o limite resulta em uma imagem na qual os pixels do primeiro plano mantêm seus valores originais, enquanto os pixels do fundo são **_NaN_** ou **_Not A Number_**.

source: *NaN* is a special value that can only be stored in floating point images, which ImageJ ignores when making measurements later. It is therefore used to mask out regions, while preserving meaningful pixel values elsewhere.
es: *NaN* es un valor especial que sólo puede almacenarse en imágenes de coma flotante, y que ImageJ ignora cuando realiza mediciones posteriormente. Por lo tanto, se utiliza para enmascarar regiones, conservando los valores de píxel significativos en otros lugares.
pt_br: *NaN* é um valor especial que só pode ser armazenado em imagens de ponto flutuante, que o ImageJ ignora ao fazer medições posteriormente. Portanto, é usado para mascarar regiões, preservando valores de pixel significativos em outros lugares.

source: This is an advanced option that is *potentially* useful, but can be a bit challenging to work with. You have to be extra cautious when using an image containing NaNs, since some commands might behave in surprising ways.
es: Esta es una opción avanzada que es *potencialmente* útil, pero puede ser un poco difícil trabajar con ella. Hay que tener mucho cuidado cuando se utiliza una imagen que contiene NaNs, ya que algunos comandos pueden comportarse de manera sorprendente.
pt_br: Esta é uma opção avançada que é *potencialmente* útil, mas pode ser um pouco desafiadora para trabalhar. Você deve ser extremamente cauteloso ao usar uma imagem contendo NaNs, pois alguns comandos podem se comportar de maneira surpreendente.

source: Create an image including NaN pixels, then measure some ROIs drawn on it. Are area measurements affected by whether NaNs are present or not?
es: Cree una imagen que incluya píxeles NaN y, a continuación, mida algunos ROI dibujados en ella. ¿Se ven afectadas las mediciones de área por la presencia o no de NaN?
pt_br: Crie uma imagem incluindo NaN pixels e meça alguns ROIs desenhados nela. As medições de área são afetadas pela presença ou não de NaNs?

source: They are! If you measure the area of an image containing NaNs, the result is less than if you measure the area of the same image converted to 8-bit -- since only the non-NaN parts are included. If you measure a region containing NaNs only, the area is 0.
es: Lo son. Si se mide el área de una imagen que contiene NaNs, el resultado es menor que si se mide el área de la misma imagen convertida a 8 bits, ya que sólo se incluyen las partes que no son NaNs. Si mide una región que sólo contiene NaNs, el área es 0.
pt_br: Eles são! Se você medir a área de uma imagem contendo NaNs, o resultado será menor do que se você medir a área da mesma imagem convertida para 8 bits - já que apenas as partes não-NaN serão incluídas. Se você medir uma região contendo apenas NaNs, a área será 0.

source: Question
es: Pregunta
pt_br: Pergunta

source: Through experiment or guesswork, what do you suppose happens to NaNs with a 32-bit image is converted to 8-bit or 16-bit?
es: Mediante experimentos o conjeturas, ¿qué crees que ocurre con los NaN cuando una imagen de 32 bits se convierte a 8 o 16 bits?
pt_br: Por meio de experimentos ou suposições, o que você acha que acontece com os NaNs quando uma imagem de 32 bits é convertida para 8 ou 16 bits?

source: Answer
es: Respuesta
pt_br: Responder

source: Since NaN is not an integer, it cannot be stored in an 8-bit or 16-bit unsigned integer image. Instead, all NaNs simply become zero.
es: Dado que NaN no es un entero, no puede almacenarse en una imagen de entero sin signo de 8 o 16 bits. En su lugar, todos los NaN simplemente se convierten en cero.
pt_br: Como NaN não é um número inteiro, ele não pode ser armazenado em uma imagem inteira sem sinal de 8 ou 16 bits. Em vez disso, todos os NaNs simplesmente se tornam zero.

source: Histogram binning
es: Histograma
pt_br: Compartimentação do histograma

source: The second way in which bit-depths and types matter is that histograms of images > 8-bit involve _binning_ the data. For example, with a 32-bit image it would probably not make sense to create a histogram that has separate counts for all possible pixel values: in addition to counts for pixels with exact values 1 and 2, we would have thousands of counts for pixels with fractions in between and most of these counts would be 0.
es: La segunda forma en la que las profundidades de bits y los tipos importan es que los histogramas de imágenes &gt; 8 bits implican un _binning_ de los datos. Por ejemplo, con una imagen de 32 bits probablemente no tendría sentido crear un histograma que tuviera recuentos separados para todos los valores de píxel posibles: además de recuentos para píxeles con valores exactos 1 y 2, tendríamos miles de recuentos para píxeles con fracciones intermedias y la mayoría de estos recuentos serían 0.
pt_br: A segunda maneira pela qual a profundidade e os tipos de bits são importantes é que os histogramas de imagens> 8 bits envolvem _classificação_ dos dados. Por exemplo, com uma imagem de 32 bits provavelmente não faria sentido criar um histograma que tivesse contagens separadas para todos os valores de pixels possíveis: além de contagens de pixels com valores exatos 1 e 2, teríamos milhares de contagens de pixels com frações intermediárias e a maioria dessas contagens seria 0.

source: Instead, the histogram is generated by dividing the total data range (maximum – minimum pixel values) into 256 separate _bins_ with equal widths, and counting how many pixels have values falling into the range of each bin. It's therefore like a subtle conversion to 8-bit precision for the threshold calculation, but without actually changing the original data. The same type of conversion is used for 16-bit images -- _unless_ you use the {menuselection}`Image --> Adjust --> Auto Threshold` command, which can use a full 16-bit histogram with 65536 bins.
es: En su lugar, el histograma se genera dividiendo el rango total de datos (valores de píxel máximos - mínimos) en 256 _bins_ separados con anchuras iguales, y contando cuántos píxeles tienen valores que caen dentro del rango de cada bin. Es, por tanto, como una sutil conversión a precisión de 8 bits para el cálculo del umbral, pero sin cambiar realmente los datos originales. El mismo tipo de conversión se usa para imágenes de 16 bits -- _a menos_ que use el comando {menuselection}`Image --&gt; Adjust --&gt; Auto Threshold`, que puede usar un histograma completo de 16 bits con 65536 bins.
pt_br: Em vez disso, o histograma é gerado dividindo o intervalo total de dados (valores máximos - mínimos de pixel) em 256 _bins_ separados com larguras iguais e contando quantos pixels têm valores dentro do intervalo de cada bin. É, portanto, como uma conversão sutil para precisão de 8 bits para o cálculo do limite, mas sem realmente alterar os dados originais. O mesmo tipo de conversão é usado para imagens de 16 bits -- _a menos_ que você use o comando {menuselection}`Image --> Adjust --> Auto Threshold`, que pode usar um comando completo Histograma de 16 bits com 65.536 compartimentos.

source: This is where the {guilabel}`Don't reset range` option in ImageJ's thresholding dialog becomes relevant for 16-bit or 32-bit images, when used in combination with the {guilabel}`Auto` button.
es: Aquí es donde la opción {guilabel}`Don't reset range` del diálogo de umbralización de ImageJ se vuelve relevante para imágenes de 16 o 32 bits, cuando se utiliza en combinación con el botón {guilabel}`Auto`.
pt_br: É aqui que a opção {guilabel}`Não redefinir intervalo` na caixa de diálogo de limite do ImageJ se torna relevante para imagens de 16 ou 32 bits, quando usada em combinação com a {guilabel}Botão `Auto`.

source: If {guilabel}`Don't reset range` **is selected**, then the binning uses the current minimum and maximum values in the brightness/contrast dialog
es: Si {guilabel}`Don't reset range` **está seleccionado**, el binning utiliza los valores mínimo y máximo actuales en el diálogo de brillo/contraste.
pt_br: Se {guilabel}`Não redefinir intervalo` **estiver selecionado**, então o binning usa os valores mínimo e máximo atuais na caixa de diálogo brilho/contraste

source: If {guilabel}`Don't reset range` **is *not* selected**, then the binning *resets* the minimum and maximum values in the brightness/contrast dialog before using them
es: Si {guilabel}`Don't reset range` **está *no* seleccionado**, entonces el binning *restablece* los valores mínimo y máximo en el diálogo de brillo/contraste antes de usarlos.
pt_br: Se {guilabel}`Não redefinir intervalo` **não* estiver selecionado**, então o binning *redefine* os valores mínimo e máximo na caixa de diálogo brilho/contraste antes de usar eles

source: Personally, I find this confusing; I don't like the brighness/contrast impacting thresholds, and my poor brain even struggles to process the negative in the {guilabel}`Don't reset range` to get an intuitive feeling for what effect the option will really have. And what makes things worse is that ImageJ's behavior in this regard has changed across versions, so there's a chance that any specific advice I give here won't match the version you're using anyway.
es: Personalmente, lo encuentro confuso; no me gusta que el brillo/contraste afecte a los umbrales, y a mi pobre cerebro incluso le cuesta procesar el negativo en el {guilabel}`Don't reset range` para tener una sensación intuitiva de qué efecto tendrá realmente la opción. Y lo que empeora las cosas es que el comportamiento de ImageJ en este sentido ha cambiado a través de las versiones, por lo que hay una posibilidad de que cualquier consejo específico que doy aquí no coincidirá con la versión que está utilizando de todos modos.
pt_br: Pessoalmente, acho isso confuso; Não gosto dos limites que afetam o brilho/contraste, e meu pobre cérebro ainda se esforça para processar o negativo no {guilabel}`Não redefinir intervalo` para ter uma noção intuitiva de qual efeito a opção realmente terá. E o que piora as coisas é que o comportamento do ImageJ nesse aspecto mudou entre as versões, então há uma chance de que qualquer conselho específico que eu der aqui não corresponda à versão que você está usando.

source: I know I'm not alone in being confused, since this has been the subject of a [long discussion on the image.sc forum](https://forum.image.sc/t/auto-threshold-calculation-and-bright-and-contrast-auto-adjust-issue/19301). So the main message is: be aware that binning happens, and keep on the lookout for any unexpected effects that the brightness/contrast sliders might sneakily have on thresholding.
es: Sé que no soy el único que está confundido, ya que esto ha sido objeto de una [larga discusión en el foro image.sc](https://forum.image.sc/t/auto-threshold-calculation-and-bright-and-contrast-auto-adjust-issue/19301). Así que el mensaje principal es: sé consciente de que el binning ocurre, y mantente alerta ante cualquier efecto inesperado que los deslizadores de brillo/contraste puedan tener a escondidas sobre el umbral.
pt_br: Sei que não estou sozinho nessa confusão, já que isso tem sido objeto de uma [longa discussão no fórum image.sc](https://forum.image.sc/t/auto-threshold-calculation-and- problema de ajuste automático de brilho e contraste/19301). Portanto, a mensagem principal é: esteja ciente de que o binning acontece e fique atento a quaisquer efeitos inesperados que os controles deslizantes de brilho/contraste possam ter sorrateiramente no limite.
