Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/3-thresholding/imagej.po
Languages: es, pt_br

source: ImageJ: Thresholding
es: ImageJ: Umbralización
pt_br: ImageJ: Limiar

source: Introduction
es: Introducción
pt_br: Introdução

source: Here, we will explore some ImageJ's methods to apply thresholds to images, generating binary images, labeled images and ROIs. We will also confront some of the associated complications.
es: Aquí exploraremos algunos métodos de ImageJ para aplicar umbrales a las imágenes, generando imágenes binarias, imágenes etiquetadas y ROIs. También nos enfrentaremos a algunas de las complicaciones asociadas.
pt_br: Aqui, exploraremos alguns métodos do ImageJ para aplicar limites a imagens, gerando imagens binárias, imagens rotuladas e ROIs. Também enfrentaremos algumas das complicações associadas.

source: Global thresholding
es: Umbral global
pt_br: Limite global

source: The main thresholding command in ImageJ is {menuselection}`Image --> Adjust --> Threshold...`, with the shortcut {kbd}`Shift+T`.
es: El comando principal de umbralización en ImageJ es {menuselection}`Image --&gt; Adjust --&gt; Threshold...`, con el atajo {kbd}`Shift+T`.
pt_br: O principal comando de limite no ImageJ é {menuselection}`Image --> Adjust --> Threshold...`, com o atalho {kbd}`Shift+T`.

source: This opens a *Threshold* dialog that allows you to identify pixels above a threshold, below a threshold, or falling between two thresholds. These options are controlled using a combination of the threshold sliders and the {guilabel}`Dark background` checkbox. There is also a drop-down menu allowing you to select from a list of automated thresholding methods.
es: Esto abre un diálogo *Umbral* que le permite identificar píxeles por encima de un umbral, por debajo de un umbral o entre dos umbrales. Estas opciones se controlan mediante una combinación de los deslizadores de umbral y la casilla de verificación {guilabel}`Fondo oscuro`. También hay un menú desplegable que le permite seleccionar de una lista de métodos de umbralización automatizados.
pt_br: Isso abre uma caixa de diálogo *Limite* que permite identificar pixels acima de um limite, abaixo de um limite ou entre dois limites. Essas opções são controladas usando uma combinação dos controles deslizantes de limite e a caixa de seleção {guilabel}`Fundo escuro`. Há também um menu suspenso que permite selecionar em uma lista de métodos automatizados de limite.

source: During preview, the pixels that are considered foreground are shown in red by default (it's possible to change this, but I never do). After choosing suitable thresholds, pressing {guilabel}`Apply` produces a binary image. This replaces the original, so it may be wise to duplicate the image first.
es: Durante la previsualización, los píxeles que se consideran en primer plano se muestran en rojo por defecto (es posible cambiarlo, pero yo nunca lo hago). Tras elegir los umbrales adecuados, pulsar {guilabel}`Apply` produce una imagen binaria. Ésta sustituye a la original, por lo que puede ser conveniente duplicar primero la imagen.
pt_br: Durante a visualização, os pixels considerados em primeiro plano são mostrados em vermelho por padrão (é possível alterar isso, mas nunca faço isso). Depois de escolher os limites adequados, pressionar {guilabel}`Apply` produz uma imagem binária. Isso substitui o original, portanto, pode ser aconselhável duplicar a imagem primeiro.

source: Binary images in ImageJ
es: Imágenes binarias en ImageJ
pt_br: Imagens binárias em ImageJ

source: Although only one 1 bit is really needed for each pixel in a binary image, the implementation in ImageJ currently uses 8 bits -- and so the actual pixel values allowed are 0 and 255. To complicate matters, ImageJ also permits _either_ of these to represent the foreground, with the choice hidden away under {menuselection}`Process --> Binary --> Options...`, and 0 taken to be 'black' and 255 'white'. Personally, I prefer for white to represent the foreground (i.e. the interesting things we have detected), and so I will assume that the {guilabel}`Black background` option has been checked.
es: Aunque en realidad sólo se necesita un bit para cada píxel en una imagen binaria, la implementación en ImageJ utiliza actualmente 8 bits, por lo que los valores reales de píxel permitidos son 0 y 255. Para complicar las cosas, ImageJ también permite _cualquiera_ de estos valores para representar el primer plano. Para complicar las cosas, ImageJ también permite _cualquiera_ de estos valores para representar el primer plano, con la elección oculta en {menuselection}`Process --&gt; Binary --&gt; Options...`, y el 0 se toma como 'negro' y el 255 como 'blanco'. Personalmente, prefiero que el blanco represente el primer plano (es decir, las cosas interesantes que hemos detectado), por lo que asumiré que la opción {guilabel}`Black background` ha sido marcada.
pt_br: Embora apenas um bit seja realmente necessário para cada pixel em uma imagem binária, a implementação em ImageJ atualmente usa 8 bits - e portanto os valores reais de pixel permitidos são 0 e 255. Para complicar as coisas, ImageJ também permite que _qualquer_ um deles represente em primeiro plano, com a escolha escondida em {menuselection}`Processo --> Binário --> Opções...`, e 0 considerado 'preto' e 255 'branco' . Pessoalmente, prefiro que o branco represente o primeiro plano (ou seja, as coisas interessantes que detectamos), então assumirei que a opção {guilabel}`Fundo preto` foi marcada.

source: Nevertheless, you should be aware that this convention is not adopted universally. Furthermore, if you choose {guilabel}`Invert LUT` then the colors are flipped anyway – so yet more confusion arises. Therefore if you find that any processing of binary images gives odd results, be sure to check the binary options and LUT status.
es: Sin embargo, debe tener en cuenta que esta convención no se adopta universalmente. Además, si elige {guilabel}`Invert LUT` entonces los colores se invierten de todos modos - por lo que surge aún más confusión. Por lo tanto, si encuentra que cualquier procesamiento de imágenes binarias da resultados extraños, asegúrese de comprobar las opciones binarias y el estado de la LUT.
pt_br: No entanto, você deve estar ciente de que esta convenção não é adotada universalmente. Além disso, se você escolher {guilabel}`Invert LUT` então as cores serão invertidas de qualquer maneira – então ainda mais confusão surge. Portanto, se você achar que qualquer processamento de imagens binárias fornece resultados estranhos, verifique as opções binárias e o status do LUT.

source: The *Threshold* dialog is good for interactively exploring different automated thresholding methods, but it can be hard to systematically compare them. {menuselection}`Image --> Adjust --> Auto Threshold...` helps with this, by providing an option to try *all* of the methods.
es: El diálogo *Umbral* es bueno para explorar interactivamente diferentes métodos de umbralización automática, pero puede ser difícil compararlos sistemáticamente. {menuselection} Imagen --&gt; Ajustar --&gt; Umbral automático... ayuda con esto, proporcionando una opción para probar *todos* los métodos.
pt_br: A caixa de diálogo *Limite* é boa para explorar interativamente diferentes métodos automatizados de limite, mas pode ser difícil compará-los sistematicamente. {menuselection}`Image --> Adjust --> Auto Threshold...` ajuda com isso, fornecendo uma opção para tentar *todos* os métodos.

source: Applying this to ImageJ's famous *blobs.gif* reveals that not all methods work equally well:
es: Si aplicamos esto al famoso *blobs.gif* de ImageJ, veremos que no todos los métodos funcionan igual de bien:
pt_br: Aplicar isso ao famoso *blobs.gif* do ImageJ revela que nem todos os métodos funcionam igualmente bem:

source: Automated threshold methods
es: Métodos de umbral automatizados
pt_br: Métodos de limite automatizados

source: The various automated thresholds are described at https://imagej.net/Auto_Threshold, often with references to the original published papers upon which they are based.
es: Los distintos umbrales automatizados se describen en https://imagej.net/Auto_Threshold, a menudo con referencias a los artículos originales publicados en los que se basan.
pt_br: Os vários limites automatizados são descritos em https://imagej.net/Auto_Threshold, muitas vezes com referências aos artigos originais publicados nos quais se baseiam.

source: Creating objects
es: Creación de objetos
pt_br: Criando objetos

source: Once we have a binary image, the next step is to identify objects for further exploration.
es: Una vez que tenemos una imagen binaria, el siguiente paso es identificar los objetos para seguir explorándolos.
pt_br: Assim que tivermos uma imagem binária, o próximo passo é identificar objetos para exploração posterior.

source: Generating & measuring ROIs
es: Generar y medir el ROI
pt_br: Gerando e medindo ROIs

source: ROIs are a good way to represent objects in ImageJ, because they are easy to measure. In 2D, there are several options to generate ROIs from a thresholded image, each with slightly different applications:
es: Los ROIs son una buena forma de representar objetos en ImageJ, porque son fáciles de medir. En 2D, hay varias opciones para generar ROIs a partir de una imagen umbralizada, cada una con aplicaciones ligeramente diferentes:
pt_br: Os ROIs são uma boa maneira de representar objetos no ImageJ, porque são fáceis de medir. Em 2D, existem diversas opções para gerar ROIs a partir de uma imagem com limite, cada uma com aplicações ligeiramente diferentes:

source: Click on an object with the *Wand tool* <img src="../../../images/imagej/icons/wand.png" /> -- this is good for interactively choosing one connected region.
es: Haga clic en un objeto con la *Herramienta Varita* <img src="../../../images/imagej/icons/wand.png" /> -- esto es bueno para elegir interactivamente una región conectada.
pt_br: Clique em um objeto com a *ferramenta Varinha* <img src="../../../images/imagej/icons/wand.png" /> - isso é bom para escolher interativamente uma região conectada.

source: {menuselection}`Edit --> Selection --> Create Selection` -- this makes a single ROI containing all the foreground pixels. Disconnected regions can be separated by adding the ROI to the *ROI Manager* and choosing {guilabel}`More >> Split`.
es: {menuselection}`Edit --&gt; Selection --&gt; Create Selection` -- esto crea un único ROI que contiene todos los píxeles del primer plano. Las regiones desconectadas pueden separarse añadiendo el ROI al *ROI Manager* y eligiendo {guilabel}`More &gt;&gt; Split`.
pt_br: {menuselection}`Editar --> Seleção --> Criar Seleção` - isso cria um único ROI contendo todos os pixels do primeiro plano. As regiões desconectadas podem ser separadas adicionando o ROI ao *ROI Manager* e escolhendo {guilabel}`More >> Split`.

source: {menuselection}`Analyze --> Analyze Particles...` -- this detects and measures all the foreground regions as individual objects, optionally filtering out objects based on shape or area.
es: {menuselection}`Analyze --&gt; Analyze Particles...` -- esto detecta y mide todas las regiones en primer plano como objetos individuales, opcionalmente filtrando objetos basados en forma o área.
pt_br: {menuselection}`Analyze --> Analyze Particles...` -- detecta e mede todas as regiões de primeiro plano como objetos individuais, opcionalmente filtrando objetos com base na forma ou área.

source: Creating ROIs without applying a threshold
es: Crear ROI sin aplicar un umbral
pt_br: Criação de ROIs sem aplicar um limite

source: The *Wand tool* <img src="../../../images/imagej/icons/wand.png" />, {menuselection}`Edit --> Selection --> Create Selection` & {menuselection}`Analyze --> Analyze Particles...` can also be used when a threshold is being previewed on an image, but it has not yet been converted to binary. Therefore you may not need to press {guilabel}`Apply` in the *Threshold* dialog at all.
es: La herramienta *Wand* <img src="../../../images/imagej/icons/wand.png" />, {menuselection}`Edit --&gt; Selection --&gt; Create Selection` &amp; {menuselection}`Analyze --&gt; Analyze Particles...` también puede usarse cuando se está previsualizando un umbral en una imagen, pero todavía no se ha convertido a binario. Por lo tanto, puede que no sea necesario pulsar {guilabel}`Aplicar` en el diálogo *Umbral*.
pt_br: A *ferramenta Varinha* <img src="../../../images/imagej/icons/wand.png" />, {menuselection}`Editar --> Seleção --> Criar Seleção` e {menuselection}`Analyze --> Analyze Particles...` também pode ser usado quando um limite está sendo visualizado em uma imagem, mas ainda não foi convertido para binário. Portanto, talvez você não precise pressionar {guilabel}`Apply` na caixa de diálogo *Threshold*.

source: In fact, because it's not 100% clear whether black or white pixels represent the foreground in an ImageJ binary image, I tend to set a threshold even on an image that *is* already binary. That way I can visualize what any of these commands will treat as foreground: with the default thresholding display, the foreground is highlighted in red.
es: De hecho, como no está 100% claro si los píxeles negros o blancos representan el primer plano en una imagen binaria de ImageJ, tiendo a establecer un umbral incluso en una imagen que *ya* es binaria. De ese modo puedo visualizar lo que cualquiera de estos comandos tratará como primer plano: con la visualización de umbral por defecto, el primer plano aparece resaltado en rojo.
pt_br: Na verdade, como não está 100% claro se os pixels pretos ou brancos representam o primeiro plano em uma imagem binária ImageJ, tendo a definir um limite mesmo em uma imagem que *já é* binária. Dessa forma posso visualizar o que qualquer um desses comandos tratará como primeiro plano: com a exibição de limite padrão, o primeiro plano é destacado em vermelho.

source: I like the fact that {menuselection}`Edit --> Selection --> Create Selection` provides a very quick way to convert a thresholded region to a single ROI. I most often use it in combination with {menuselection}`Edit --> Selection --> Restore Selection` to visualize what has been detected on top of another image. I might not necessarily *use* the single ROI for measurements in the end, but it can be very good for orientation.
es: Me gusta el hecho de que {menuselection}`Edit --&gt; Selection --&gt; Create Selection` proporciona una forma muy rápida de convertir una región umbralizada en una única ROI. A menudo lo uso en combinación con {menuselection}`Edit --&gt; Selection --&gt; Restore Selection` para visualizar lo que se ha detectado encima de otra imagen. Puede que al final no necesariamente *utilice* el ROI único para mediciones, pero puede ser muy bueno para la orientación.
pt_br: Gosto do fato de que {menuselection}`Editar --> Seleção --> Criar Seleção` fornece uma maneira muito rápida de converter uma região limitada em um único ROI. Eu geralmente o uso em combinação com {menuselection}`Edit --> Selection --> Restore Selection` para visualizar o que foi detectado no topo de outra imagem. Talvez eu não *use* necessariamente o ROI único para medições no final, mas pode ser muito bom para orientação.

source: When you want to measure multiple objects quickly, {menuselection}`Analyze --> Analyze Particles...` is arguably the most automated and versatile option. Its various options also make it possible to ignore regions that are particularly small or large, straight or round (using a {guilabel}`Circularity` metric). It can output summary results and add ROIs for each region to the *ROI Manager*.
es: Cuando desee medir varios objetos rápidamente, {menuselection}`Analyze --&gt; Analyze Particles...` es posiblemente la opción más automatizada y versátil. Sus varias opciones también hacen posible ignorar regiones que son particularmente pequeñas o grandes, rectas o redondas (usando una métrica de `Circularidad` en {guilabel}). Puede producir resultados resumidos y añadir ROIs para cada región al *ROI Manager*.
pt_br: Quando você deseja medir vários objetos rapidamente, {menuselection}`Analyze --> Analyze Particles...` é sem dúvida a opção mais automatizada e versátil. Suas diversas opções também permitem ignorar regiões particularmente pequenas ou grandes, retas ou redondas (usando uma métrica {guilabel}`Circularidade`). Ele pode gerar resultados resumidos e adicionar ROIs para cada região ao *ROI Manager*.

source: Redirecting measurements
es: Reorientación de las mediciones
pt_br: Redirecionando medições

source: Although binary images can show the shapes of things to be measured, pixel intensity measurements made on a binary image are not very helpful. You could use the above techniques to make ROIs from binary images, then apply those to the original image to get meaningful measurements.
es: Aunque las imágenes binarias pueden mostrar las formas de las cosas que se van a medir, las mediciones de intensidad de píxeles realizadas en una imagen binaria no son muy útiles. Puede utilizar las técnicas anteriores para crear ROI a partir de imágenes binarias y, a continuación, aplicarlas a la imagen original para obtener mediciones significativas.
pt_br: Embora as imagens binárias possam mostrar as formas das coisas a serem medidas, as medições de intensidade de pixel feitas em uma imagem binária não são muito úteis. Você poderia usar as técnicas acima para criar ROIs a partir de imagens binárias e, em seguida, aplicá-las à imagem original para obter medições significativas.

source: It's possible to do this by changing the {guilabel}`Redirect to:` option under {menuselection}`Analyze --> Set Measurements...`, which redirects measurements to be made on a specific image. Setting a redirection image before running {menuselection}`Analyze --> Analyze Particles...` means that the ROI 'particles' can be detected on one image and measured on a different image
es: Es posible hacer esto cambiando la opción {guilabel}`Redirect to:` en {menuselection}`Analyze --&gt; Set Measurements...`, que redirige las mediciones para que se realicen en una imagen específica. Establecer una imagen de redirección antes de ejecutar {menuselection}`Analyze --&gt; Analyze Particles...` significa que las 'partículas' ROI pueden ser detectadas en una imagen y medidas en una imagen diferente.
pt_br: É possível fazer isso alterando a opção {guilabel}`Redirecionar para:` em {menuselection}`Analisar --> Definir medidas.. .`, que redireciona as medições a serem feitas em uma imagem específica. Definir uma imagem de redirecionamento antes de executar {menuselection}`Analyze --> Analyze Particles...` significa que as 'partículas' de ROI podem ser detectadas em uma imagem e medidas em uma imagem diferente

source: I don't usually recommend this, since I imagine I might forget to reset the {guilabel}`Redirect to:` option when I am done. I'd rather add my ROIs to the *ROI Manager* and transfer them that way.
es: No suelo recomendar esto, ya que imagino que podría olvidarme de restablecer la opción {guilabel}`Redirect to:` cuando termine. Prefiero añadir mis ROIs al *ROI Manager* y transferirlos de esa manera.
pt_br: Normalmente não recomendo isso, pois imagino que posso esquecer de redefinir a opção {guilabel}`Redirecionar para:` quando terminar. Prefiro adicionar meus ROIs ao *ROI Manager* e transferi-los dessa forma.

source: Caution with holey ROIs
es: Precaución con los ROI
pt_br: Cuidado com ROIs furados

source: Historically, there has been a problem with my preferred approach to use the *ROI Manager* output from {menuselection}`Analyze --> Analyze Particles...`.
es: Históricamente, ha habido un problema con mi enfoque preferido de utilizar la salida del *ROI Manager* de {menuselection}`Analyze --&gt; Analyze Particles...`.
pt_br: Historicamente, houve um problema com minha abordagem preferida para usar a saída do *ROI Manager* de {menuselection}`Analyze --> Analyze Particles...`.

source: It seems that {menuselection}`Analyze Particles...` handles holes correctly when making measurements by itself, but by default it would generate ROIs that lacked holes. This meant that if you would measure the ROIs later you could get different results, because the ROIs included extra pixels that were actually excluded (as holes) in the thresholded image.
es: Parece que {menuselection}`Analyze Particles...` maneja los agujeros correctamente cuando hace mediciones por sí mismo, pero por defecto generaría ROIs que carecían de agujeros. Esto significaba que si medías los ROIs más tarde podías obtener resultados diferentes, porque los ROIs incluían píxeles extra que en realidad estaban excluidos (como agujeros) en la imagen umbralizada.
pt_br: Parece que {menuselection}`Analyze Particles...` lida com furos corretamente ao fazer medições por si só, mas por padrão geraria ROIs sem furos. Isso significava que se você medisse os ROIs posteriormente, poderia obter resultados diferentes, porque os ROIs incluíam pixels extras que foram realmente excluídos (como buracos) na imagem com limite.

source: Different results when using {menuselection}`Analyze --> Analyze Particles...` directly, and then subsequently measuring the ROI that it generated. The image is binary, so the mean value should be 255 if only the above-threshold pixels are measured.
es: Diferentes resultados al utilizar {menuselection}`Analyze --&gt; Analyze Particles...` directamente, y posteriormente medir el ROI que generó. La imagen es binaria, por lo que el valor medio debería ser 255 si sólo se miden los píxeles por encima del umbral.
pt_br: Resultados diferentes ao usar {menuselection}`Analyze --> Analyze Particles...` diretamente e, posteriormente, medir o ROI gerado. A imagem é binária, portanto o valor médio deverá ser 255 se apenas os pixels acima do limite forem medidos.

source: **However**, there is a solution -- which I only learned when writing about it here. Since ImageJ v1.53g, there is a {guilabel}`Composite ROIs` checkbox when using {menuselection}`Analyze Particles...`. If this is turned **on**, then ROIs with holes are generated as expected.
es: **Sin embargo**, hay una solución -- que sólo aprendí al escribir sobre ello aquí. Desde ImageJ v1.53g, hay una casilla {guilabel}`Composite ROIs` cuando se usa {menuselection}`Analyze Particles...`. Si esta casilla está **on**, entonces los ROIs con agujeros se generan como se espera.
pt_br: **No entanto**, existe uma solução – que só aprendi ao escrever sobre ela aqui. Desde o ImageJ v1.53g, há uma caixa de seleção {guilabel}`ROIs compostos` ao usar {menuselection}`Analisar partículas...`. Se estiver ativado **ativado**, as ROIs com lacunas serão geradas conforme o esperado.

source: Fixing the problem with holey regions by using {guilabel}`Composite ROIs`.
es: Solución del problema de las regiones holey mediante el uso de {guilabel}`Composite ROIs`.
pt_br: Corrigindo o problema com regiões furadas usando {guilabel}`ROIs compostos`.

source: This demonstrates the need to be cautious with any image analysis software, and to check out the various options associated with even common commands. They aren't *always* doing what you might expect.
es: Esto demuestra la necesidad de ser cauteloso con cualquier software de análisis de imágenes, y de comprobar las diversas opciones asociadas incluso con comandos comunes. No *siempre* hacen lo que cabría esperar.
pt_br: Isso demonstra a necessidade de ser cauteloso com qualquer software de análise de imagem e de verificar as diversas opções associadas até mesmo aos comandos mais comuns. Eles nem sempre estão fazendo o que você espera.

source: Generating labeled images
es: Generación de imágenes etiquetadas
pt_br: Gerando imagens rotuladas
