Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/3-thresholding/imagej.po
Languages: es, pt_br

source: Explore setting thresholds with and without {guilabel}`Don't reset range` selected for the image {menuselection}`File --> Open Samples --> M51 Galaxy (16-bits)`, and pressing the {guilabel}`Auto` button to determine a threshold.
es: Explore estableciendo umbrales con y sin {guilabel}`Don't reset range` seleccionado para la imagen {menuselection}`File --&gt; Open Samples --&gt; Galaxy (16-bits)`, y pulsando el botón {guilabel}`Auto` para determinar un umbral.
pt_br: Explore a configuração de limites com e sem {guilabel}`Não redefinir intervalo` selecionado para a imagem {menuselection}`Arquivo --> Abrir amostras --> M51 Galaxy (16 bits)` e pressionando o botão {guilabel}`Auto` para determinar um limite.

source: Keep {menuselection}`Image --> Adjust --> Brightness/Contrast...` open as you explore, so you can make adjustments before calculating the thresholds.
es: Mantenga {menuselection}`Image --&gt; Adjust --&gt; Brightness/Contrast...` abierto mientras explora, para poder hacer ajustes antes de calcular los umbrales.
pt_br: Mantenha {menuselection}`Image --> Adjust --> Brightness/Contrast...` aberto enquanto você explora, para que você possa fazer ajustes antes de calcular os limites.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/c5d2075777c458c70c69a1f2c8b37391)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run=https://gist.github.com/petebankhead/c5d2075777c458c70c69a1f2c8b37391)
pt_br: [![iniciar ImageJ.JS](https://ij.imjoy.io/assets/badge/open-in-imagej-js-badge.svg)](https://ij.imjoy.io/?run= https://gist.github.com/petebankhead/c5d2075777c458c70c69a1f2c8b37391)

source: This image shows a potential use of the {guilabel}`Don't reset range` option -- used cautiously.
es: Esta imagen muestra un uso potencial de la opción `Don't reset range` de {guilabel}, utilizada con precaución.
pt_br: Esta imagem mostra um uso potencial da opção {guilabel}`Não redefinir intervalo` - usada com cautela.

source: Thresholding a 16-bit image with and without 'Don't reset range' selected.
es: Umbralización de una imagen de 16 bits con y sin la opción "No restablecer rango" seleccionada.
pt_br: Limiar uma imagem de 16 bits com e sem 'Não redefinir intervalo' selecionado.

source: What are the implications of using a 256-bin histogram for thresholding a 32-bit image?
es: ¿Qué implicaciones tiene utilizar un histograma de 256 bits para umbralizar una imagen de 32 bits?
pt_br: Quais são as implicações do uso de um histograma de 256 bin para definir o limite de uma imagem de 32 bits?

source: In particular, how might any outlier pixels affect the accuracy with which you can define a threshold -- automatically or manually?
es: En concreto, ¿cómo pueden afectar los píxeles atípicos a la precisión con la que se puede definir un umbral, de forma automática o manual?
pt_br: Em particular, como os pixels discrepantes podem afetar a precisão com a qual você pode definir um limite – automática ou manualmente?

source: To explore this, you can use the extreme example of *cell_outlier.tif* along with the {menuselection}`Image --> Adjust --> Threshold...` command.
es: Para explorar esto, puede utilizar el ejemplo extremo de *cell_outlier.tif* junto con el comando {menuselection}`Image --&gt; Adjust --&gt; Threshold...`.
pt_br: Para explorar isso, você pode usar o exemplo extremo de *cell_outlier.tif* junto com o comando {menuselection}`Image --> Adjust --> Threshold...`.

source: How could you (manually) reduce the impact of any problems you find?
es: ¿Cómo podría reducir (manualmente) el impacto de los problemas que encuentre?
pt_br: Como você poderia (manualmente) reduzir o impacto de quaisquer problemas encontrados?

source: **Note:** {menuselection}`Analyze --> Histogram` lets you investigate the image histogram with different numbers of bins -- but any changes you make here will not be reflected in the histogram actually used for thresholding.
es: **Nota:** {menuselection}`Analyze --&gt; Histogram` le permite investigar el histograma de la imagen con diferentes números de bins -- pero cualquier cambio que haga aquí no se reflejará en el histograma utilizado realmente para la umbralización.
pt_br: **Observação:** {menuselection}`Analyze --> Histogram` permite investigar o histograma da imagem com diferentes números de compartimentos - mas quaisquer alterações feitas aqui não serão refletidas o histograma realmente usado para limiarização.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/cell_outlier.tif)
es: [![lanzar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https://github.com/bioimagebook/practical-data/blob/main/images/cell_outlier.tif)
pt_br: [![lançar ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?open=https:/ /github.com/bioimagebook/practical-data/blob/main/images/cell_outlier.tif)

source: First, a positive implication of using a 256-bit histogram for thresholding is that it can be fast: more bins add to the computations involved. Also, creating too many bins has the result of making most of them zero -- potentially causing some automated threshold-determination algorithms to fail.
es: En primer lugar, una implicación positiva del uso de un histograma de 256 bits para el umbral es que puede ser rápido: más bins aumentan los cálculos implicados. Además, si se crean demasiados bins, la mayoría de ellos se convierten en cero, lo que puede hacer que fallen algunos algoritmos automatizados de determinación de umbrales.
pt_br: Primeiro, uma implicação positiva do uso de um histograma de 256 bits para limiarização é que ele pode ser rápido: mais compartimentos são adicionados aos cálculos envolvidos. Além disso, a criação de muitos compartimentos tem o resultado de tornar a maioria deles zero – potencialmente causando falha em alguns algoritmos automatizados de determinação de limite.

source: A negative implication is that using 256 bins means that only 256 different thresholds are possible: that is, if your image range is 0–25500, then the thresholds you could get are 0, 100, 200, ... 25500. If the optimal threshold is really 150, this will not be found. But usually if your range of pixel values is this large, you do not need a very fine-grained threshold for acceptable results anyway.
es: Una implicación negativa es que el uso de 256 bins significa que sólo 256 umbrales diferentes son posibles: es decir, si su rango de imagen es 0-25500, entonces los umbrales que podría obtener son 0, 100, 200, .... 25500. Si el umbral óptimo es realmente 150, no se encontrará. Pero normalmente, si su rango de valores de píxeles es tan grande, no necesita un umbral muy fino para obtener resultados aceptables de todos modos.
pt_br: Uma implicação negativa é que usar 256 compartimentos significa que apenas 256 limites diferentes são possíveis: isto é, se o intervalo da sua imagem for de 0 a 25.500, então os limites que você pode obter são 0, 100, 200, ... 25.500. limite for realmente 150, isso não será encontrado. Mas normalmente, se o seu intervalo de valores de pixel for tão grande, você não precisará de um limite muito refinado para obter resultados aceitáveis.

source: This changes if you have outliers. A single extreme pixel -- which might occur when a pixel in a CCD camera is somehow 'broken' -- can cause most other pixels in the image to be squeezed into only a few bins. Then the histogram resolution might really be too small for reasonable thresholding.
es: Esto cambia si hay valores atípicos. Un único píxel extremo, que puede producirse cuando un píxel de una cámara CCD se "rompe" de algún modo, puede hacer que la mayoría de los demás píxeles de la imagen se compriman en sólo unos pocos bines. Entonces, la resolución del histograma puede ser demasiado pequeña para un umbral razonable.
pt_br: Isso muda se você tiver valores discrepantes. Um único pixel extremo - que pode ocorrer quando um pixel em uma câmera CCD está de alguma forma 'quebrado' - pode fazer com que a maioria dos outros pixels da imagem sejam espremidos em apenas alguns compartimentos. Então a resolução do histograma pode realmente ser muito pequena para um limite razoável.

source: It's a sufficiently obscure problem that hopefully it won't bother you. However, if you do experience the issue then two possible ways to overcome it are:
es: Es un problema lo suficientemente oscuro como para que, con suerte, no te moleste. Sin embargo, si experimentas el problema, hay dos formas posibles de solucionarlo:
pt_br: É um problema suficientemente obscuro que esperamos que não o incomode. No entanto, se você enfrentar o problema, duas maneiras possíveis de superá-lo são:

source: Adjust the brightness/contrast sliders and ensure that {guilabel}`Don't reset range` **is** selected. This is the benefit of the option existing.
es: Ajuste los controles deslizantes de brillo/contraste y asegúrese de que {guilabel}`Don't reset range` **está** seleccionado. Este es el beneficio de la opción existente.
pt_br: Ajuste os controles deslizantes de brilho/contraste e verifique se {guilabel}`Não redefinir intervalo` **está** selecionado. Este é o benefício da opção existente.

source: Convert the image to 8-bit manually yourself. This allows you to effectively choose the range of the histogram bins (using {menuselection}`Brightness/Contrast...`; see {ref}`Types & bit-depths<sec_bit_depths_converting>`) Since the threshold is made using 256 bins, you are not really losing any information that was not going to be lost anyway.
es: Convierta usted mismo manualmente la imagen a 8 bits. Esto le permite elegir efectivamente el rango de los bins del histograma (usando {menuselection}`Brightness/Contrast...`; vea {ref}`Types &amp; bit-depths<sec_bit_depths_converting>`) Como el umbral se hace usando 256 bins, realmente no está perdiendo ninguna información que no se iba a perder de todos modos.
pt_br: Converta você mesmo a imagem para 8 bits manualmente. Isso permite que você escolha efetivamente o intervalo dos compartimentos do histograma (usando {menuselection}`Brilho/Contraste...`; consulte {ref} `Tipos e profundidades de bits<sec_bit_depths_converting>`) Como o limite é feito usando 256 compartimentos, você não está realmente perdendo nenhuma informação que não seria perdida de qualquer maneira.
