Repository: bioimage-book/bioimage-book.github.io
Catalog: locale/*/LC_MESSAGES/chapters/2-processing/6-transforms/imagej.po
Languages: de

source: ImageJ: Image transforms
de: ImageJ: Bildtransformationen

source: Introduction
de: Einführung

source: ImageJ has excellent 2D distance and watershed transforms... although not necessarily everything about them is quite what you might expect.
de: ImageJ verfügt über ausgezeichnete 2D-Abstands- und Wasserscheibentransformationen... obwohl nicht unbedingt alles daran so ist, wie man es vielleicht erwartet.

source: Distance transform
de: Abstandstransformation

source: A 2D distance transform can be calculated in ImageJ using the {menuselection}`Process --> Binary --> Distance Map` command.
de: Eine 2D-Abstandstransformation kann in ImageJ mit dem Befehl {menuselection}`Process --&gt; Binary --&gt; Distance Map` berechnet werden.

source: A non-obvious feature of this is that the type of output given is determined by the {guilabel}`EDM output` option tucked away under {menuselection}`Process --> Binary --> Options...` (where EDM stands for 'Euclidean Distance Map'). This makes a difference, because the distance between two diagonal pixels is considered $\sqrt{2} \approx 1.414$ (by Pythagoras' theorem) -- which means that a 32-bit output can give more exact straight-line distances without rounding.
de: Ein nicht offensichtliches Merkmal ist, dass die Art der Ausgabe durch die {guilabel}`EDM-Ausgabe`-Option bestimmt wird, die unter {menuselection}`Process --&gt; Binary --&gt; Options...` versteckt ist (wobei EDM für 'Euclidean Distance Map' steht). Das macht einen Unterschied, weil der Abstand zwischen zwei diagonalen Pixeln als $\sqrt{2} \ca. 1,414$ (durch den Satz des Pythagoras) betrachtet wird -- was bedeutet, dass eine 32-Bit-Ausgabe genauere geradlinige Abstände ohne Rundung liefern kann.

source: Outputs from several distance transform-related commands in ImageJ.
de: Ausgaben von verschiedenen Befehlen zur Abstandstransformation in ImageJ.

source: Ultimate points
de: Ultimative Punkte

source: {menuselection}`Process --> Binary --> Ultimate Points` is a related command. It uses the distance transform to identify the last points that would be removed if the objects would be eroded until they disappear. In other words, it identifies centers. But these are not simply single center points for each object; rather, they are maximum points in the distance map, and therefore the pixels furthest away from the boundary.
de: {menuselection}Process --&gt; Binary --&gt; Ultimate Points" ist ein verwandter Befehl. Er verwendet die Distanztransformation, um die letzten Punkte zu identifizieren, die entfernt werden würden, wenn die Objekte bis zu ihrem Verschwinden abgetragen würden. Mit anderen Worten, es werden Zentren identifiziert. Dabei handelt es sich jedoch nicht einfach um einzelne Mittelpunktspunkte für jedes Objekt, sondern um die Maximalpunkte in der Entfernungskarte und damit um die am weitesten von der Grenze entfernten Pixel.

source: This means that if a structure has several 'bulges', then an ultimate point exists _at the center of each of them_. If segmentation has resulted in structures being merged together, then each distinct bulge could actually correspond to something interesting -- and the number of bulges actually means more than the number of separated objects in the binary image.
de: Das heißt, wenn eine Struktur mehrere "Ausbuchtungen" hat, dann gibt es einen Endpunkt _im Zentrum jeder dieser Ausbuchtungen_. Wenn die Segmentierung dazu geführt hat, dass Strukturen miteinander verschmolzen wurden, dann könnte jede einzelne Ausbuchtung tatsächlich etwas Interessantem entsprechen - und die Anzahl der Ausbuchtungen bedeutet tatsächlich mehr als die Anzahl der getrennten Objekte im Binärbild.

source: Although conceptually straightforward, and easy to use in ImageJ, implementing 'Ultimate points' in other software can be tricky. Here, I've tried to replicate it in Python. The results aren't necessarily identical to ImageJ's implementation, but should be pretty close.
de: Obwohl das Konzept einfach ist und sich in ImageJ leicht anwenden lässt, kann die Implementierung von "Ultimate Points" in anderer Software schwierig sein. Hier habe ich versucht, es in Python zu replizieren. Die Ergebnisse sind nicht unbedingt identisch mit der ImageJ-Implementierung, sollten aber ziemlich nahe dran sein.

source: Select to {guilabel}`Show code cell contents` above to see how it works.
de: Wählen Sie {guilabel}`Codezelleninhalte anzeigen`, um zu sehen, wie es funktioniert.

source: Computing the ultimate points from a binary image can be an effective step towards counting the objects in the image -- even if these have been merged. It works best when the true objects are round in shape.
de: Die Berechnung der Endpunkte aus einem Binärbild kann ein effektiver Schritt zur Zählung der Objekte im Bild sein - selbst wenn diese zusammengefügt wurden. Es funktioniert am besten, wenn die echten Objekte eine runde Form haben.

source: Watershed (after distance transform)
de: Wassereinzugsgebiet (nach Entfernungstransformation)

source: As the name suggests, ImageJ's {menuselection}`Process --> Binary --> Watershed` command applies a watershed transform.
de: Wie der Name schon sagt, wendet der ImageJ-Befehl {menuselection}`Process --&gt; Binary --&gt; Watershed` eine Wasserscheidentransformation an.

source: However, as the name conceals, the watershed transform is always applied to a distance map -- which is calculated automatically in the background.
de: Wie der Name jedoch verrät, wird die Wasserscheidentransformation immer auf eine Entfernungskarte angewendet, die im Hintergrund automatisch berechnet wird.

source: The clue to this is only that it appears in a {menuselection}`Process --> Binary` submenu, and therefore requires a binary image as input; a 'regular' watershed transform isn't normally applied to a binary image.
de: Der Hinweis darauf ist nur, dass es in einem Untermenü {menuselection}"Processing --&gt; Binary" erscheint und daher ein binäres Bild als Eingabe benötigt; eine "normale" Wasserscheidentransformation wird normalerweise nicht auf ein binäres Bild angewendet.

source: Effectively, the seeds of the watershed transform are the 'ultimate points' described above. The effect of the command is therefore to split 'roundish' objects.
de: Der Ausgangspunkt der Wasserscheidentransformation sind die oben beschriebenen "Endpunkte". Die Wirkung des Befehls besteht also darin, "rundliche" Objekte zu teilen.

source: Watching the distance transform
de: Beobachten, wie sich die Ferne verwandelt

source: If you click the {guilabel}`Dev` toolbar button and select {menuselection}`Debug Mode` from the drop-down menu, then running {menuselection}`Process --> Binary --> Watershed` will generate an image stack that visualizes how the seeds expanded during the watershed processing.
de: Wenn Sie auf die Schaltfläche {guilabel}`Dev` in der Symbolleiste klicken und {menuselection}`Debug Mode` aus dem Dropdown-Menü auswählen, wird durch die Ausführung von {menuselection}`Process --&gt; Binary --&gt; Watershed` ein Bildstapel erzeugt, der die Ausdehnung der Seeds während der Watershed-Verarbeitung visualisiert.

source: {menuselection}`Process --> Binary --> Voronoi` is another distance-and-watershed-based command for binary images.
de: {menuselection}Process --&gt; Binary --&gt; Voronoi" ist ein weiterer auf Distanz und Wasserscheide basierender Befehl für Binärbilder.

source: It will partition the image into different regions so that the separation lines have an equal distance to the nearest foreground objects.
de: Es teilt das Bild in verschiedene Regionen auf, so dass die Trennlinien den gleichen Abstand zu den nächstgelegenen Vordergrundobjekten haben.

source: Question
de: Frage

source: Imagine you have created a binary image containing detected cells, but you are only interested in the region inside the cell that is close to the membrane, i.e. within 5 pixels of the edge of each detected object. Any pixels outside the objects or closer to their centers do not matter.
de: Stellen Sie sich vor, Sie haben ein binäres Bild erstellt, das erkannte Zellen enthält, aber Sie interessieren sich nur für den Bereich innerhalb der Zelle, der nahe an der Membran liegt, d. h. innerhalb von 5 Pixeln vom Rand jedes erkannten Objekts. Alle Pixel, die außerhalb der Objekte oder näher an deren Zentrum liegen, spielen keine Rolle.

source: How would you go about finding these regions using ImageJ and the distance transform?
de: Wie würden Sie diese Regionen mit ImageJ und der Distanztransformation finden?

source: **Note:** There other ways to do this using techniques we've discussed, although these don't necessarily give identical results.
de: **Hinweis:** Es gibt auch andere Möglichkeiten, dies mit den von uns besprochenen Techniken zu tun, die jedoch nicht unbedingt zu den gleichen Ergebnissen führen.

source: Answer
de: Antwort

source: This is the approach I was thinking of:
de: Dies ist der Ansatz, an den ich gedacht habe:

source: Run {menuselection}`Edit --> Invert`
de: {menuselection}`Bearbeiten --&gt; Invertieren` ausführen

source: Run {menuselection}`Process --> Binary --> Distance Map`
de: Run {menuselection}`Process --&gt; Binary --&gt; Distance Map`

source: Run {menuselection}`Image --> Adjust --> Threshold...`
de: Ausführen {menuselection}`Bild --&gt; Anpassen --&gt; Schwellenwert...`

source: Choose {guilabel}`Set` and enter *Lower Threshold Level: 1* and *Higher Threshold Level: 5*.
de: Wählen Sie {guilabel}`Einstellen` und geben Sie *Untere Schwellenwertstufe: 1* und *Höhere Schwellenwertstufe: 5* ein.

source: There are more possible ways, such as applying a maximum filter and subtracting the original binary image -- but I think the distance transform is more elegant. The distance transform is also likely to be much faster for large distances, and more precise (assuming you use a 32-bit output).
de: Es gibt noch weitere Möglichkeiten, z. B. die Anwendung eines Maximumfilters und die Subtraktion des ursprünglichen Binärbildes, aber ich halte die Abstandstransformation für eleganter. Die Abstandstransformation ist bei großen Entfernungen wahrscheinlich auch viel schneller und präziser (vorausgesetzt, Sie verwenden eine 32-Bit-Ausgabe).

source: Watershed transform
de: Wassereinzugsgebiet transformieren

source: So if ImageJ has a watershed transform, but it's not the command called {menuselection}`Watershed`, then where is it?
de: Wenn ImageJ also eine Wasserscheiden-Transformation hat, aber nicht den Befehl {menuselection}`Watershed`, wo ist er dann?

source: The answer is that it's hidden in the phenomenally useful {menuselection}`Process --> Find maxima` command.
de: Die Antwort ist, dass sie in dem phänomenal nützlichen Befehl {menuselection}`Prozess --&gt; Maxima finden` versteckt ist.

source: I say 'hidden', because you specifically have to choose the output {guilabel}`Segmented Particles` to use it. And you'll need to flip your expectations: unlike most watershed transforms, it will start at the *intensity peaks* of the image (i.e. the maxima) and expand outwards, rather than starting at minima.
de: Ich sage "versteckt", weil Sie speziell die Ausgabe {guilabel}"Segmentierte Partikel" wählen müssen, um sie zu verwenden. Und Sie müssen Ihre Erwartungen umkehren: Im Gegensatz zu den meisten Wasserscheide-Transformationen beginnt sie an den *Intensitätsspitzen* des Bildes (d. h. den Maxima) und dehnt sich nach außen aus, anstatt an den Minima anzusetzen.

source: But don't let those things discourage you: I highly recommend exploring the various options of {menuselection}`Process --> Find maxima` to see what all it can do. Depending upon which options are selected, this includes finding structures using a global threshold, a local threshold, generating point ROIs and generating binary regions.
de: Aber lassen Sie sich von diesen Dingen nicht entmutigen: Ich empfehle dringend, die verschiedenen Optionen von {menuselection}`Process --&gt; Find maxima` zu erkunden, um zu sehen, was alles möglich ist. Je nachdem, welche Optionen ausgewählt sind, werden Strukturen mit einem globalen Schwellenwert, einem lokalen Schwellenwert, Punkt-ROIs und binäre Regionen gefunden.

source: Check out MorphoLibJ
de: MorphoLibJ ausprobieren

source: Echoing my recommendation at the end of the last chapter, you should check out **MorphoLibJ** if you would like more transform options -- particularly when it comes to watersheds of various kinds.
de: Wie ich bereits am Ende des letzten Kapitels empfohlen habe, sollten Sie sich **MorphoLibJ** ansehen, wenn Sie mehr Transformationsmöglichkeiten wünschen - insbesondere wenn es um Wasserscheiden verschiedener Art geht.

source: See https://imagej.net/plugins/morpholibj for more details.
de: Siehe https://imagej.net/plugins/morpholibj für weitere Einzelheiten.
