Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/6-files/files.po
Languages: es, pt_br

source: Default Caption
es: Leyenda predeterminada
pt_br: Legenda padrão

source: Files & file formats
es: Archivos y formatos de archivo
pt_br: Arquivos e formatos de arquivo

source: Chapter outline
es: Outline del capítulo
pt_br: Esboço do capítulo

source: Image files consist of **pixel values** and **metadata**
es: Los archivos de imagen constan de **valores de píxeles** y **metadatos**
pt_br: Os arquivos de imagem consistem em **valores de pixel** e **metadados**

source: Some file formats are suitable for **data to analyze**, others for **data only to display**
es: Algunos formatos de archivo son adecuados para **datos para analizar**, otros para **datos solo para mostrar**
pt_br: Alguns formatos de arquivo são adequados para **dados para análise**, outros para **apenas dados para exibição**

source: Metadata essential for analysis can be lost by saving in a **non-scientific file format**
es: Los metadatos esenciales para el análisis se pueden perder al guardarlos en un **formato de archivo no científico**
pt_br: Metadados essenciais para análise podem ser perdidos ao serem salvos em um **formato de arquivo não científico**

source: **Compression** can be either **lossless** or **lossy** -- with different results
es: **La compresión** puede ser **sin pérdidas** o **con pérdidas**, con resultados diferentes
pt_br: **A compactação** pode ser **sem perdas** ou **com perdas** - com resultados diferentes

source: Original pixel values can be lost through **lossy compression**, **conversion to RGB**, or by **removing dimensions**
es: Los valores de píxeles originales se pueden perder mediante la **compresión con pérdida**, la **conversión a RGB** o la **eliminación de dimensiones**
pt_br: Os valores de pixel originais podem ser perdidos por meio de **compressão com perdas**, **conversão para RGB** ou **remoção de dimensões**

source: Introduction
es: Introducción
pt_br: Introdução

source: One of the surest ways to lose information when working with images is by making bad file format choices.
es: Una de las formas más seguras de perder información al trabajar con imágenes es elegir mal el formato de archivo.
pt_br: Uma das maneiras mais seguras de perder informações ao trabalhar com imagens é fazer escolhas erradas de formato de arquivo.

source: There is a vast array of file formats used to store images -- but not all formats support all the bit-depths, types and dimensions needed for scientific imaging. Some formats tend to lose metadata, and some compromise pixel values through compression.
es: Existe una amplia gama de formatos de archivos que se utilizan para almacenar imágenes, pero no todos los formatos admiten todas las profundidades de bits, tipos y dimensiones necesarios para las imágenes científicas. Algunos formatos tienden a perder metadatos y otros comprometen los valores de píxeles mediante la compresión.
pt_br: Há uma vasta gama de formatos de arquivo usados para armazenar imagens – mas nem todos os formatos suportam todas as profundidades de bits, tipos e dimensões necessárias para imagens científicas. Alguns formatos tendem a perder metadados e alguns comprometem os valores de pixel por meio da compactação.

source: To avoid getting bogged down in file format intricacies, I want to give you the main messages of this chapter up-front:
es: Para evitar estancarse en las complejidades del formato de archivo, quiero darte los mensajes principales de este capítulo desde el principio:
pt_br: Para evitar ficar atolado em complexidades de formato de arquivo, quero apresentar antecipadamente as principais mensagens deste capítulo:

source: Working with image formats
es: Trabajar con formatos de imagen
pt_br: Trabalhando com formatos de imagem

source: Always keep your original image files, in their original format
es: Manten siempre tus archivos de imagen originales, en su formato original.
pt_br: Mantenha sempre seus arquivos de imagem originais, em seu formato original

source: During analysis:
es: Durante el análisis:
pt_br: Durante a análise:

source: Use software designed for scientific data (i.e. not a general photo editor)
es: Utiliza software diseñado para datos científicos (es decir, no un editor general de fotografías)
pt_br: Use software desenvolvido para dados científicos (ou seja, não um editor de fotos geral)

source: If you need to save images, use the default file format for the software (e.g. TIFF for ImageJ)
es: Si necesitas guardar imágenes, utiliza el formato de archivo predeterminado para el software (por ejemplo, TIFF para ImageJ)
pt_br: Se precisar salvar imagens, use o formato de arquivo padrão do software (por exemplo, TIFF para ImageJ)

source: **Check everything!** Make sure you can reopen the image after saving, and any pixel values, pixel size information and dimensions are retained exactly.
es: **¡Comprueba todo!** Asegúrate de poder volver a abrir la imagen después de guardarla y de que los valores de píxel, la información sobre el tamaño de píxel y las dimensiones se conserven exactamente.
pt_br: **Verifique tudo!** Certifique-se de reabrir a imagem após salvá-la e de que quaisquer valores de pixel, informações de tamanho de pixel e dimensões sejam retidos com exatidão.

source: Use general-purpose file formats (e.g. PNG, JPEG) for figures, presentations or websites -- but not later analysis
es: Utiliza formatos de archivo de uso general (por ejemplo, PNG, JPEG) para figuras, presentaciones o sitios web, pero no para análisis posteriores.
pt_br: Use formatos de arquivo de uso geral (por exemplo, PNG, JPEG) para figuras, apresentações ou sites - mas não para análises posteriores

source: Use TIFF cautiously, because it can be used both as a scientific format suitable for analysis and a general-purpose format suitable only for display
es: Utiliza TIFF con precaución, ya que se puede utilizar tanto como formato científico adecuado para análisis, como formato de uso general adecuado sólo para visualización.
pt_br: Use o TIFF com cautela, pois ele pode ser usado tanto como formato científico adequado para análise quanto como formato de uso geral adequado apenas para exibição

source: OME-TIFF is often a better alternative to TIFF, since it standardizes how the metadata is stored
es: OME-TIFF suele ser una mejor alternativa a TIFF, ya que estandariza la forma en que se almacenan los metadatos.
pt_br: OME-TIFF costuma ser uma alternativa melhor ao TIFF, pois padroniza como os metadados são armazenados

source: To help put this into practice, {numref}`table-file_formats` lists some of the most important image formats you need to know about when saving images yourself.
es: Para ayudar a poner esto en práctica, {numref}`table-file_formats` enumera algunos de los formatos de imagen más importantes que necesitas conocer al guardar imágenes tu mismo.
pt_br: Para ajudar a colocar isso em prática, {numref}`table-file_formats` lista alguns dos formatos de imagem mais importantes que você precisa conhecer ao salvar imagens por conta própria.

source: Some of the most useful file formats for bioimage analysis & display
es: Algunos de los formatos de archivo más útiles para el análisis y visualización de bioimágenes
pt_br: Alguns dos formatos de arquivo mais úteis para análise e exibição de bioimagem

source: Format
es: Formato
pt_br: Formatar

source: Extensions
es: Extensiones
pt_br: Extensões

source: Main use
es: Uso principal
pt_br: Uso principal

source: Compression
es: Compresión
pt_br: Compressão

source: Comment
es: Comentario
pt_br: Comente

source: Analysis, display (print)
es: Análisis, visualización (impresión)
pt_br: Análise, exibição (impressão)

source: None, lossless, lossy
es: Ninguno, sin pérdidas, con pérdidas
pt_br: Nenhum, sem perdas, com perdas

source: Very general image format
es: Formato de imagen muy general.
pt_br: Formato de imagem muito geral

source: Analysis, Display (print)
es: Análisis, visualización (imprimir)
pt_br: Análise, exibição (impressão)

source: TIFF, with standardized metadata for microscopy
es: TIFF, con metadatos estandarizados para microscopía
pt_br: TIFF, com metadados padronizados para microscopia

source: Zarr
pt_br: Zar

source: Analysis
es: Análisis
pt_br: Análise

source: Emerging format, great for big datasets -- but limited support currently
es: Formato emergente, ideal para grandes sets de datos, pero por el momento tiene soporte limitado
pt_br: Formato emergente, ótimo para grandes conjuntos de dados, mas com suporte limitado atualmente

source: Display (web, print)
es: Visualización (web, impresión)
pt_br: Exibição (web, impressão)

source: Lossless
es: Sin pérdidas
pt_br: Sem perdas

source: Small(ish) file sizes without compression artefacts
es: Tamaños de archivos pequeños (más o menos) sin artefactos de compresión
pt_br: Tamanhos de arquivo pequenos (ish) sem artefatos de compactação

source: Display (web)
es: Pantalla (web)
pt_br: Exibição (web)

source: Lossy (usually)
es: Con pérdida (normalmente)
pt_br: Com perdas (geralmente)

source: Small file sizes, but visible artefacts
es: Tamaños de archivo pequeños, pero artefactos visibles
pt_br: Tamanhos de arquivo pequenos, mas artefatos visíveis

source: The rest of this chapter explains the key ideas. Despite already having the conclusions, I hope you might persist with reading the rest anyway. Understanding more about file formats can help enormously when it comes to choosing how to save images for different purposes, and diagnosing problems when the wrong formats have been used.
es: El resto de este capítulo explica las ideas clave. A pesar de tener ya las conclusiones, espero que persistas en leer el resto de todos modos. Comprender más sobre los formatos de archivos puede ser de gran ayuda a la hora de elegir cómo guardar imágenes para diferentes propósitos y diagnosticar problemas cuando se han utilizado formatos incorrectos.
pt_br: O restante deste capítulo explica as ideias principais. Apesar de já ter as conclusões, espero que você continue lendo o resto de qualquer maneira. Entender mais sobre formatos de arquivo pode ajudar enormemente na hora de escolher como salvar imagens para diferentes finalidades e diagnosticar problemas quando formatos errados forem usados.

source: Image file contents
es: Contenido del archivo de imagen
pt_br: Conteúdo do arquivo de imagem

source: An image file stored on computer contains two main things:
es: Un archivo de imagen almacenado en la computadora contiene dos elementos principales:
pt_br: Um arquivo de imagem armazenado no computador contém duas coisas principais:

source: **Pixel values** -- the 'raw numbers' of the image
es: **Valores de píxeles**: los 'números brutos' de la imagen
pt_br: **Valores de pixel** – os 'números brutos' da imagem

source: **Metadata** -- additional information, such as dimensions, image type, bit-depth, pixel sizes and microscope settings ('data about data')
es: **Metadatos**: información adicional, como dimensiones, tipo de imagen, profundidad de bits, tamaños de píxeles y configuración del microscopio ("datos sobre datos")
pt_br: **Metadados**: informações adicionais, como dimensões, tipo de imagem, profundidade de bits, tamanhos de pixels e configurações do microscópio ('dados sobre dados')

source: The pixel values are clearly important. But some pieces of the metadata are essential for the image data to be interpretable at all. And if metadata such as the pixel size is incorrect or missing, measurements can also be wrong. Therefore files must be saved in formats that preserve both the pixel values and metadata accurately if they are to be suitable for analysis later.
es: Los valores de los píxeles son claramente importantes. Pero algunas partes de los metadatos son esenciales para que los datos de la imagen sean interpretables. Y si faltan metadatos como el tamaño de píxel o son incorrectos, las mediciones también pueden ser incorrectas. Por lo tanto, los archivos deben guardarse en formatos que preserven con precisión tanto los valores de píxeles como los metadatos para que sean adecuados para un análisis posterior.
pt_br: Os valores dos pixels são claramente importantes. Mas algumas partes dos metadados são essenciais para que os dados da imagem sejam interpretáveis. E se os metadados, como o tamanho do pixel, estiverem incorretos ou ausentes, as medições também poderão estar erradas. Portanto, os arquivos devem ser salvos em formatos que preservem os valores de pixel e os metadados com precisão, para que possam ser adequados para análise posterior.

source: Pixel values & compression
es: Valores de píxeles y compresión
pt_br: Valores e compactação de pixels

source: Pixel values are represented using bytes. As described in {ref}`chap_bit_depths`, an 8-bit image uses 1 byte per pixel, a 16-bit image uses 2 bytes per pixel and a 32-bit image uses 4 bytes per pixel.
es: Los valores de píxeles se representan mediante bytes. Como se describe en {ref}`chap_bit_depths`, una imagen de 8 bits usa 1 byte por píxel, una imagen de 16 bits usa 2 bytes por píxel y una imagen de 32 bits usa 4 bytes por píxel.
pt_br: Os valores de pixel são representados usando bytes. Conforme descrito em {ref}`chap_bit_profundidades`, uma imagem de 8 bits usa 1 byte por pixel, uma imagem de 16 bits usa 2 bytes por pixel e uma imagem de 32 bits usa 4 bytes por pixel.

source: However, the way these bytes are stored in the image file can depending upon whether compression is used. There are three main options:
es: Sin embargo, la forma en que se almacenan estos bytes en el archivo de imagen puede depender de si se utiliza compresión. Hay tres opciones principales:
pt_br: No entanto, a maneira como esses bytes são armazenados no arquivo de imagem pode depender de a compactação ser usada. Existem três opções principais:

source: **No compression**. The bytes representing the pixels are stored directly in the file. This means that the pixel values are preserved exactly, but the file can be quite large.
es: **Sin compresión**. Los bytes que representan los píxeles se almacenan directamente en el archivo. Esto significa que los valores de los píxeles se conservan exactamente, pero el archivo puede ser bastante grande.
pt_br: **Sem compressão**. Os bytes que representam os pixels são armazenados diretamente no arquivo. Isso significa que os valores dos pixels são preservados com exatidão, mas o arquivo pode ser bem grande.

source: *Examples: TIFF (Uncompressed), ICS/IDS*
es: *Ejemplos: TIFF (sin comprimir), ICS/IDS*
pt_br: *Exemplos: TIFF (descompactado), ICS/IDS*

source: **Lossless compression**. The bytes representing the pixels are stored using a compression algorithm that (usually) results in less storage space being required, while making it possible to reconstruct the original values exactly by decompression. Compared to uncompressed data, the file size using lossless compression is generally smaller but reading or writing the file takes longer.
es: **Compresión sin perdidas**. Los bytes que representan los píxeles se almacenan mediante un algoritmo de compresión que (normalmente) hace que se requiera menos espacio de almacenamiento, al tiempo que permite reconstruir los valores originales exactamente mediante descompresión. En comparación con los datos sin comprimir, el tamaño del archivo que utiliza la compresión sin pérdidas es generalmente más pequeño, pero leer o escribir el archivo lleva más tiempo.
pt_br: **Compressão sem perdas**. Os bytes que representam os pixels são armazenados usando um algoritmo de compressão que (normalmente) resulta na necessidade de menos espaço de armazenamento, ao mesmo tempo que torna possível reconstruir os valores originais exatamente por descompressão. Em comparação com dados não compactados, o tamanho do arquivo usando compactação sem perdas é geralmente menor, mas a leitura ou gravação do arquivo demora mais.

source: *Examples: TIFF (LZW compressed), PNG, BMP, JPEG2000 (lossless)*
es: *Ejemplos: TIFF (comprimido LZW), PNG, BMP, JPEG2000 (sin pérdidas)*
pt_br: *Exemplos: TIFF (compactado LZW), PNG, BMP, JPEG2000 (sem perdas)*

source: **Lossy compression**. The bytes representing the pixels are stored using a compression algorithm that does *not* have to be able to reconstruct the original values exactly. This can result in dramatically smaller file sizes, but at a loss of information in the image -- and often visual artefacts.
es: **Compresión con pérdida**. Los bytes que representan los píxeles se almacenan utilizando un algoritmo de compresión que *no* tiene que poder reconstruir los valores originales exactamente. Esto puede dar como resultado archivos de tamaño dramáticamente más pequeños, pero con una pérdida de información en la imagen y, a menudo, artefactos visuales.
pt_br: **Compressão com perda**. Os bytes que representam os pixels são armazenados usando um algoritmo de compressão que *não* precisa ser capaz de reconstruir exatamente os valores originais. Isso pode resultar em tamanhos de arquivo drasticamente menores, mas com perda de informações na imagem – e muitas vezes de artefatos visuais.

source: *Examples: TIFF (JPEG compressed), JPEG, GIF, JPEG2000 (lossy)*
es: *Ejemplos: TIFF (JPEG comprimido), JPEG, GIF, JPEG2000 (con pérdida)*
pt_br: *Exemplos: TIFF (JPEG compactado), JPEG, GIF, JPEG2000 (com perdas)*

source: Probably the most famous file format that uses lossy compression is JPEG.
es: Probablemente el formato de archivo más famoso que utiliza compresión con pérdida es JPEG.
pt_br: Provavelmente o formato de arquivo mais famoso que usa compactação com perdas é o JPEG.

source: The basic idea of JPEG compression is that an image is split into 8x8 pixel blocks, and an approximation of the original values is stored rather than the exact values themselves. Technically, this approximation involves the 'discrete cosine transform'; for our purposes, it's enough to know that JPEG artefacts tend to look 8x8 pixel squares, each containing wavy patterns, which are most evident when zooming in and/or cranking up the brightness and contrast to an extreme level ({numref}`fig-files_lossy`).
es: La idea básica de la compresión JPEG es que una imagen se divide en bloques de 8x8 píxeles y se almacena una aproximación de los valores originales en lugar de los valores exactos en sí. Técnicamente, esta aproximación implica la 'transformación de coseno discreto'; Para nuestros propósitos, es suficiente saber que los artefactos JPEG tienden a parecer cuadrados de 8x8 píxeles, cada uno de los cuales contiene patrones ondulados, que son más evidentes al acercar y/o aumentar el brillo y el contraste a un nivel extremo ({numref}`fig-files_lossy`).
pt_br: A ideia básica da compactação JPEG é que uma imagem seja dividida em blocos de 8x8 pixels e uma aproximação dos valores originais seja armazenada em vez dos próprios valores exatos. Tecnicamente, esta aproximação envolve a 'transformada discreta de cosseno'; para nossos propósitos, é suficiente saber que os artefatos JPEG tendem a parecer quadrados de 8x8 pixels, cada um contendo padrões ondulados, que são mais evidentes ao aumentar o zoom e/ou aumentar o brilho e o contraste a um nível extremo ({numref}`fig-files_lossy`).

source: Examples of images saved with (A) no compression, (B) lossless compression, and (C) lossy JPEG compression. The pixel values of (A) and (B) are identical. Image (C) looks similar, but zooming in on a detailed region reveals characteristic JPEG artefacts.
es: Ejemplos de imágenes guardadas con (A) sin compresión, (B) compresión sin pérdida y (C) compresión JPEG con pérdida. Los valores de píxeles de (A) y (B) son idénticos. La imagen (C) es similar, pero al hacer zoom en una región detallada se revelan artefactos JPEG característicos.
pt_br: Exemplos de imagens salvas com (A) sem compactação, (B) compactação sem perdas e (C) compactação JPEG com perdas. Os valores de pixel de (A) e (B) são idênticos. A imagem (C) parece semelhante, mas ampliar uma região detalhada revela artefatos JPEG característicos.

source: Compression quality
es: Calidad de compresión
pt_br: Qualidade de compressão

source: Lossy compression can often be varied with a 'compression quality' setting. For a JPEG with a high quality setting, the 8x8 artefacts are likely to be much less obvious than they appear in {numref}`fig-files_lossy` -- although the pixel values are still modified. Therefore it's a good idea to also use {ref}`statistics & histograms <chap_histograms>` to check for pixel changes.
es: La compresión con pérdida a menudo se puede variar con una configuración de "calidad de compresión". Para un JPEG con una configuración de alta calidad, es probable que los artefactos de 8x8 sean mucho menos obvios de lo que aparecen en {numref}`fig-files_lossy`, aunque los valores de píxeles aún están modificados. . Por lo tanto, es una buena idea utilizar también {ref}`statistics & histograms <chap_histograms>` para verificar cambios de píxeles.
pt_br: A compactação com perdas geralmente pode ser variada com uma configuração de “qualidade de compactação”. Para um JPEG com configuração de alta qualidade, os artefatos 8x8 provavelmente serão muito menos óbvios do que aparecem em {numref}`fig-files_lossy` -- embora os valores de pixel ainda sejam modificados . Portanto, é uma boa ideia usar também {ref}`estatísticas e histogramas <chap_histograms>` para verificar alterações de pixels.

source: Based upon the importance of preserving pixel values, the easy rule is that:
es: Teniendo en cuenta la importancia de preservar los valores de los píxeles, la regla sencilla es la siguiente:
pt_br: Com base na importância de preservar os valores dos pixels, a regra fácil é que:

source: **Lossy compression is bad for analysis!**
es: **¡La compresión con pérdida es mala para el análisis!**
pt_br: **A compactação com perdas é ruim para análise!**

source: If in doubt, don't use lossy compression when working with scientific images.
es: En caso de duda, no utilices compresión con pérdida cuando trabajes con imágenes científicas.
pt_br: Em caso de dúvida, não use compactação com perdas ao trabalhar com imagens científicas.

source: The choice between 'no compression' and 'lossless compression' is a matter of preference, depending upon whether it's more important to you to save disk space or to open images quickly. Compatibility is also a consideration if you want to open the images in different software: not all compression types are supported by all software. So best check this before saving a lot of images in a format you might not be able to read elsewhere.
es: La elección entre "sin compresión" y "compresión sin pérdidas" es una cuestión de preferencia, dependiendo de si es más importante para ti ahorrar espacio en el disco o abrir las imágenes rápidamente. La compatibilidad también es una consideración si deseas abrir las imágenes en diferentes programas: no todos los tipos de compresión son compatibles con todos los programas. Así que es mejor comprobar esto antes de guardar muchas imágenes en un formato que quizás no puedas leer en ningún otro lugar.
pt_br: A escolha entre 'sem compactação' e 'compactação sem perdas' é uma questão de preferência, dependendo se é mais importante para você economizar espaço em disco ou abrir imagens rapidamente. A compatibilidade também é levada em consideração se você deseja abrir as imagens em software diferente: nem todos os tipos de compactação são suportados por todos os softwares. Portanto, é melhor verificar isso antes de salvar muitas imagens em um formato que você talvez não consiga ler em outro lugar.

source: How do I know if a file has been compressed?
es: ¿Cómo sé si un archivo ha sido comprimido?
pt_br: Como posso saber se um arquivo foi compactado?
