Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/6-files/files.po
Languages: es, pt_br

source: Schematic diagram of a pyramidal image. The image itself (left) is broken into chunks and stored at multiple resolutions. The chunks needed to display the current field of view (top right) are highlighted in yellow. The original whole slide image here is from the [CAMELYON](https://camelyon16.grand-challenge.org) grand challenge.
es: Diagrama esquemático de una imagen piramidal. La imagen en sí (izquierda) se divide en partes y se almacena en múltiples resoluciones. Los fragmentos necesarios para mostrar el campo de visión actual (arriba a la derecha) están resaltados en amarillo. La imagen de diapositiva completa original aquí es del gran desafío [CAMELYON](https://camelyon16.grand-challenge.org).
pt_br: Diagrama esquemático de uma imagem piramidal. A própria imagem (esquerda) é dividida em pedaços e armazenada em múltiplas resoluções. Os pedaços necessários para exibir o campo de visão atual (canto superior direito) são destacados em amarelo. A imagem original do slide aqui é do grande desafio [CAMELYON](https://camelyon16.grand-challenge.org).

source: Software designed to handle pyramidal images can then dip into the image file and read **only the part of the image that is needed at the time**. This is often only a tiny proportion of the entire dataset.
es: El software diseñado para manejar imágenes piramidales puede luego sumergirse en el archivo de imagen y leer **sólo la parte de la imagen que se necesita en ese momento**. A menudo, esto es sólo una pequeña proporción de todo el conjunto de datos.
pt_br: O software projetado para lidar com imagens piramidais pode então mergulhar no arquivo de imagem e ler **apenas a parte da imagem necessária no momento**. Muitas vezes, isso representa apenas uma pequena proporção de todo o conjunto de dados.

source: Pyramidal images are especially common for pathology, although they are starting to be used more for other applications. [QuPath](https://qupath.github.io) is open source software that is designed specifically to handle pyramidal images efficiently (and happens to also be the software that I wrote and maintain, because I wasn't able to do the analysis with other open source tools at the time). Although QuPath can do a lot of things on its own, it can also be used [with ImageJ](https://qupath.readthedocs.io/en/stable/docs/advanced/imagej.html).
es: Las imágenes piramidales son especialmente habituales en patología, aunque empiezan a utilizarse más para otras aplicaciones. [QuPath](https://qupath.github.io) es un software de código abierto diseñado específicamente para manejar imágenes piramidales de manera eficiente (y resulta que también es el software que escribí y mantuve, porque no pude hacer el análisis con otras herramientas de código abierto en ese momento). Aunque QuPath puede hacer muchas cosas por sí solo, también se puede utilizar [con ImageJ](https://qupath.readthedocs.io/en/stable/docs/advanced/imagej.html).
pt_br: Imagens piramidais são especialmente comuns em patologia, embora estejam começando a ser mais utilizadas para outras aplicações. [QuPath](https://qupath.github.io) é um software de código aberto projetado especificamente para lidar com imagens piramidais de forma eficiente (e também é o software que escrevi e mantenho, porque não fui capaz de fazer o análise com outras ferramentas de código aberto da época). Embora o QuPath possa fazer muitas coisas sozinho, ele também pode ser usado [com ImageJ](https://qupath.readthedocs.io/en/stable/docs/advanced/imagej.html).
