Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/6-files/files.po
Languages: es, pt_br

source: An easy way to identify if an image has been lossily compressed is to look at the file extension, and check if it matches a format that uses lossy compression (e.g. *.jpeg*). Easy, but not *always* successful.
es: Una manera fácil de identificar si una imagen se ha comprimido con pérdida es mirar la extensión del archivo y verificar si coincide con un formato que utiliza compresión con pérdida (por ejemplo, *.jpeg*). Fácil, pero no *siempre* exitoso.
pt_br: Uma maneira fácil de identificar se uma imagem foi compactada com perdas é observar a extensão do arquivo e verificar se ela corresponde a um formato que usa compactação com perdas (por exemplo, *.jpeg*). Fácil, mas nem sempre bem-sucedido.

source: One reason is that some file formats support both lossless and lossy compression. For example, both JPEG and JPEG2000 (*not* the same thing!) are generally used with lossy compression but they both *could* be used for lossless compression as well. Unless you've proof to the contrary, if you see a file with extension *.jpg*, *.jpeg*, *.jp2* then it's best to assume lossy compression has been used.
es: Una razón es que algunos formatos de archivo admiten compresión con y sin pérdida. Por ejemplo, tanto JPEG como JPEG2000 (*¡no* es lo mismo!) generalmente se usan con compresión con pérdida, pero ambos *podrían* usarse también para compresión sin pérdida. A menos que tengas pruebas de lo contrario, si ves un archivo con extensión *.jpg*, *.jpeg*, *.jp2*, entonces es mejor asumir que se ha utilizado compresión con pérdida.
pt_br: Um dos motivos é que alguns formatos de arquivo suportam compactação sem perdas e com perdas. Por exemplo, tanto JPEG quanto JPEG2000 (*não* a mesma coisa!) são geralmente usados com compactação com perdas, mas ambos *poderiam* ser usados para compactação sem perdas também. A menos que você tenha prova do contrário, se você vir um arquivo com extensão *.jpg*, *.jpeg*, *.jp2*, então é melhor presumir que a compactação com perdas foi usada.

source: TIFF images are particularly tricky. A TIFF image could contain uncompressed data, or data compressed using a variety of different methods -- both lossless and lossy, including JPEG. To determine if a TIFF image has used lossy compression, more detective work may be needed (e.g. zooming in and hunting for artefacts, comparing pixel statistics with the original data file, or using software to check for metadata).
es: Las imágenes TIFF son particularmente complicadas. Una imagen TIFF podría contener datos sin comprimir o datos comprimidos utilizando una variedad de métodos diferentes, tanto sin pérdida como con pérdida, incluyendo JPEG. Para determinar si una imagen TIFF ha utilizado compresión con pérdida, es posible que se necesite más trabajo de detective (por ejemplo, hacer zoom y buscar artefactos, comparar estadísticas de píxeles con el archivo de datos original o usar software para verificar metadatos).
pt_br: Imagens TIFF são particularmente complicadas. Uma imagem TIFF pode conter dados não compactados ou compactados usando uma variedade de métodos diferentes - sem perdas e com perdas, incluindo JPEG. Para determinar se uma imagem TIFF usou compactação com perdas, pode ser necessário mais trabalho de detetive (por exemplo, ampliar e procurar artefatos, comparar estatísticas de pixel com o arquivo de dados original ou usar software para verificar metadados).

source: Question
es: Pregunta
pt_br: Pergunta

source: It takes approximately 1 MB to store (1,000,000 bytes) an 8-bit uncompressed image with 1,000,000 pixels.
es: Se necesitan aproximadamente 1 MB para almacenar (1.000.000 bytes) una imagen sin comprimir de 8 bits con 1.000.000 de píxeles.
pt_br: É necessário aproximadamente 1 MB para armazenar (1.000.000 bytes) uma imagem não compactada de 8 bits com 1.000.000 pixels.

source: How much memory does it take to store a 16-bit image with the same number of pixels?
es: ¿Cuánta memoria se necesita para almacenar una imagen de 16 bits con la misma cantidad de píxeles?
pt_br: Quanta memória é necessária para armazenar uma imagem de 16 bits com o mesmo número de pixels?

source: *You can ignore the tiny bit of extra space needed to store any associated metadata.*
es: *Puedes ignorar el poco espacio adicional necesario para almacenar los metadatos asociados.*
pt_br: *Você pode ignorar o pouquinho de espaço extra necessário para armazenar quaisquer metadados associados.*

source: Answer
es: Respuesta
pt_br: Responder

source: 8 bits corresponds to 1 byte, so 16 bits correspond to 2 bytes. We multiply the number of bytes per pixel by the number of pixels to get the minimum size required to store the uncompressed image.
es: 8 bits corresponden a 1 byte, por lo que 16 bits corresponden a 2 bytes. Multiplicamos la cantidad de bytes por píxel por la cantidad de píxeles para obtener el tamaño mínimo requerido para almacenar la imagen sin comprimir.
pt_br: 8 bits correspondem a 1 byte, então 16 bits correspondem a 2 bytes. Multiplicamos o número de bytes por pixel pelo número de pixels para obter o tamanho mínimo necessário para armazenar a imagem não compactada.

source: Suppose you have an original image in TIFF format (no compression). First, you save it as JPEG (lossy compression) to reduce the file size, then close it and throw away the TIFF.
es: Supongamos que tienes una imagen original en formato TIFF (sin compresión). Primero, lo guardas como JPEG (compresión con pérdida) para reducir el tamaño del archivo, luego lo cierras y desechas el TIFF.
pt_br: Suponha que você tenha uma imagem original no formato TIFF (sem compactação). Primeiro, salve-o como JPEG (compactação com perdas) para reduzir o tamanho do arquivo, depois feche-o e jogue fora o TIFF.

source: Upon hearing JPEG is bad, you reopen the image and save it as TIFF once more (no compression), throwing away the JPEG. How does your final TIFF image look, and what is its file size?
es: Al escuchar que JPEG es malo, vuelves a abrir la imagen y la guardas como TIFF una vez más (sin compresión), desechando el JPEG. ¿Cómo se ve tu imagen TIFF final y cuál es tu tamaño de archivo?
pt_br: Ao ouvir que o JPEG está ruim, você reabre a imagem e salva-a como TIFF mais uma vez (sem compactação), jogando fora o JPEG. Qual é a aparência da sua imagem TIFF final e qual é o tamanho do arquivo?

source: The final image will look exactly like the JPEG version, *but with the same file size as the original TIFF!* As such, it has 'the worst of both worlds'.
es: La imagen final se verá exactamente igual a la versión JPEG, *¡pero con el mismo tamaño de archivo que el TIFF original!* Como tal, tiene "lo peor de ambos mundos".
pt_br: A imagem final será exatamente igual à versão JPEG, *mas com o mesmo tamanho de arquivo do TIFF original!* Como tal, tem 'o pior dos dois mundos'.

source: Core metadata
es: Metadatos centrales
pt_br: Metadados principais

source: Pixel values are represented as a [stream of bits: ones and zeros](chap_bit_depths). A few core pieces of metadata *must* be stored alongside these bits to interpret them as an image, such as the dimensions, bit-depth and type. If this information is missing -- or wrong -- then the image usually either cannot be read, or looks strange in some way ({numref}`fig-files_core_metadata`).
es: Los valores de píxeles se representan como un [flujo de bits: unos y ceros] (chap_bit_depths). Algunas piezas centrales de metadatos *deben* almacenarse junto con estos bits para interpretarlos como una imagen, como las dimensiones, la profundidad de bits y el tipo. Si esta información falta, o es incorrecta, entonces la imagen generalmente no se puede leer o se ve extraña de alguna manera ({numref}`fig-files_core_metadata`).
pt_br: Os valores de pixel são representados como um [fluxo de bits: uns e zeros](chap_bit_profundidades). Algumas partes principais dos metadados *devem* ser armazenadas junto com esses bits para interpretá-los como uma imagem, como dimensões, profundidade de bits e tipo. Se esta informação estiver faltando - ou errada - então a imagem geralmente não pode ser lida ou parece estranha de alguma forma ({numref}`fig-files_core_metadata`).

source: Some examples of core metadata being read correctly or incorrectly.
es: Algunos ejemplos de metadatos principales leídos correcta o incorrectamente.
pt_br: Alguns exemplos de metadados principais sendo lidos correta ou incorretamente.

source: *Most* of the time, we don't need to care about this because all image file formats store this core information, and software used to open the image *usually* interprets this correctly.
es: *La mayoría* de las veces, no necesitamos preocuparnos por esto porque todos los formatos de archivos de imagen almacenan esta información básica y el software utilizado para abrir la imagen *normalmente* la interpreta correctamente.
pt_br: *Na maioria* das vezes, não precisamos nos preocupar com isso porque todos os formatos de arquivo de imagem armazenam essas informações essenciais, e o software usado para abrir a imagem *normalmente* interpreta isso corretamente.

source: But it isn't unheard of for some fancy new format to store the core metadata in a way that cannot be properly read and interpreted by other software. If you try to open your images and find they look very odd, you should be aware that there might be a metadata problem -- and you might need to contact the developer of the software to figure out what has gone wrong.
es: Pero no es extraño que algún formato nuevo y elegante almacene los metadatos centrales de una manera que no pueda ser leída e interpretada adecuadamente por otro software. Si intentas abrir tus imágenes y descubres que se ven muy extrañas, debes tener en cuenta que podría haber un problema de metadatos y que podrías necesitar comunicarte con el diseñador del software para descubrir qué salió mal.
pt_br: Mas não é incomum que algum novo formato sofisticado armazene os metadados principais de uma forma que não possa ser lida e interpretada adequadamente por outro software. Se você tentar abrir suas imagens e achar que elas parecem muito estranhas, você deve estar ciente de que pode haver um problema de metadados – e pode ser necessário entrar em contato com o desenvolvedor do software para descobrir o que deu errado.

source: More commonly, the choice of file format impacts what type of image can be stored. For example, PNG or JPEG images are limited to 2D integer data, optionally with 1, 3 or 4 channels; they do not support (for example) 32-bit floating point images, z-stacks or time series. Saving a 5D floating point image as a JPEG or PNG therefore inherently involves converting the image type and discarding information.
es: Más comúnmente, la elección del formato de archivo afecta el tipo de imagen que se puede almacenar. Por ejemplo, las imágenes PNG o JPEG se limitan a datos enteros 2D, opcionalmente con 1, 3 o 4 canales; no admiten (por ejemplo) imágenes de punto flotante de 32 bits, pilas z o series temporales. Por lo tanto, guardar una imagen de punto flotante 5D como JPEG o PNG implica inherentemente convertir el tipo de imagen y descartar información.
pt_br: Mais comumente, a escolha do formato do arquivo afeta o tipo de imagem que pode ser armazenada. Por exemplo, imagens PNG ou JPEG são limitadas a dados inteiros 2D, opcionalmente com 1, 3 ou 4 canais; eles não suportam (por exemplo) imagens de ponto flutuante de 32 bits, pilhas z ou séries temporais. Salvar uma imagem de ponto flutuante 5D como JPEG ou PNG envolve inerentemente a conversão do tipo de imagem e o descarte de informações.

source: Additional metadata
es: Metadatos adicionales
pt_br: Metadados adicionais

source: The most important piece of 'non-core' metadata is the {ref}`pixel size <chap_pixel_size>`. Unlike core metadata, it is *not* necessary for a file format to preserve the pixel size for an image to be opened and appear 'correct'.
es: La pieza más importante de metadatos 'no básicos' es el {ref}`tamaño de píxel <chap_pixel_size>`. A diferencia de los metadatos principales, *no* es necesario que un formato de archivo conserve el tamaño de píxel para que una imagen se abra y parezca "correcta".
pt_br: A parte mais importante dos metadados 'não essenciais' é o {ref}`tamanho do pixel <chap_pixel_size>`. Ao contrário dos metadados principais, *não* é necessário que um formato de arquivo preserve o tamanho do pixel para que uma imagem seja aberta e pareça “correta”.

source: This is a problem because if the pixel size is incorrect or missing, it remains possible to make length, area or volume measurements within an image -- but these measurements are likely to be wrong.
es: Esto es un problema porque si el tamaño de píxel es incorrecto o falta, sigue siendo posible realizar mediciones de longitud, área o volumen dentro de una imagen, pero es probable que estas mediciones sean incorrectas.
pt_br: Isto é um problema porque se o tamanho do pixel estiver incorreto ou ausente, ainda é possível fazer medições de comprimento, área ou volume dentro de uma imagem – mas essas medições provavelmente estarão erradas.

source: In microscopy, the pixel size is typically represented as a value in µm/pixel. Saving in some file formats (e.g. JPEG and PNG) tends to lose pixel size information. Others (e.g. TIFF) *might* preserve the pixel size, *might* lose it, or *might* convert it to something else entirely.
es: En microscopía, el tamaño de píxel normalmente se representa como un valor en µm/píxel. Al guardar en algunos formatos de archivo (por ejemplo, JPEG y PNG) se tiende a perder información sobre el tamaño de los píxeles. Otros (por ejemplo, TIFF) *podrían* conservar el tamaño de píxel, *podrían* perderlo o *podrían* convertirlo en algo completamente distinto.
pt_br: Na microscopia, o tamanho do pixel é normalmente representado como um valor em µm/pixel. Salvar em alguns formatos de arquivo (por exemplo, JPEG e PNG) tende a perder informações sobre o tamanho dos pixels. Outros (por exemplo, TIFF) *podem* preservar o tamanho do pixel, *podem* perdê-lo ou *podem* convertê-lo em algo totalmente diferente.

source: This should sound odd, scary and outrageous. Losing pixel size information is one thing, but why would any sneaky software just change the value to something else??!?
es: Esto debería sonar extraño, aterrador e indignante. Perder información sobre el tamaño de los píxeles es una cosa, pero ¿¡¿por qué un software astuto simplemente cambiaría el valor a otra cosa??!?
pt_br: Isto deve soar estranho, assustador e ultrajante. Perder informações sobre o tamanho do pixel é uma coisa, mas por que qualquer software sorrateiro simplesmente mudaria o valor para outra coisa??!?

source: To explain this, we need to remember that most images aren't intended for analysis. Most are intended only for display. And, for display, size can have a different meaning.
es: Para explicar esto, debemos recordar que la mayoría de las imágenes no están destinadas al análisis. La mayoría están destinadas únicamente a la exhibición. Y, a efectos de visualización, el tamaño puede tener un significado diferente.
pt_br: Para explicar isso, precisamos lembrar que a maioria das imagens não se destina à análise. A maioria destina-se apenas para exibição. E, para exibição, o tamanho pode ter um significado diferente.

source: Many researchers already encounter this when it comes to publishing papers. Journals often require that figures are submitted at a sufficiently high resolution for printing, with the resolution defined in terms of **dots per inch (*dpi*)**. For example, an image might be requested that is at least 300 dpi; if it should be printed at a size of 2 x 2 inches, then it should be at least 600 x 600 pixels.
es: Muchos investigadores ya se encuentran con esto cuando tratan de publicar artículos. Las revistas a menudo exigen que las figuras se envíen con una resolución suficientemente alta para su impresión, con la resolución definida en términos de **puntos por pulgada (*dpi*)**. Por ejemplo, se podría solicitar una imagen de al menos 300 ppp. Si debe imprimirse en un tamaño de 2 x 2 pulgadas, entonces debe tener al menos 600 x 600 píxeles.
pt_br: Muitos pesquisadores já se deparam com isso quando se trata de publicar artigos. Os periódicos geralmente exigem que as figuras sejam enviadas em resolução suficientemente alta para impressão, com a resolução definida em termos de **pontos por polegada (*dpi*)**. Por exemplo, pode ser solicitada uma imagem com pelo menos 300 dpi; se for impresso no tamanho de 2 x 2 polegadas, deverá ter pelo menos 600 x 600 pixels.

source: For an image with a dpi of 300, one *could* argue that a single pixel has a size of 1/300 inches. In this case, size is related to display. It doesn't matter what the image depicts -- it could be a cell, a person, a building, a galaxy -- or tell us anything about its scale. In this case, the pixel size is only telling us how the image ought to be displayed.
es: Para una imagen con una resolución de 300 ppp, se *podría* argumentar que un solo píxel tiene un tamaño de 1/300 pulgadas. En este caso, el tamaño está relacionado con la visualización. No importa lo que represente la imagen (podría ser una célula, una persona, un edificio, una galaxia) ni nos dice nada sobre su escala. En este caso, el tamaño de píxel sólo nos dice cómo se debe mostrar la imagen.
pt_br: Para uma imagem com dpi de 300, *poderia* argumentar que um único pixel tem um tamanho de 1/300 polegadas. Neste caso, o tamanho está relacionado à exibição. Não importa o que a imagem representa – pode ser uma célula, uma pessoa, um edifício, uma galáxia – ou nos diz algo sobre a sua escala. Neste caso, o tamanho do pixel apenas nos diz como a imagem deve ser exibida.

source: When it comes to TIFF images, the pixel size for science or the pixel size for display (i.e. dpi) might be stored *in exactly the same part of the file*. Therefore what this value actually means depends entirely upon which software wrote the image, and whether it was more concerned with analysis or display.
es: Cuando se trata de imágenes TIFF, el tamaño de píxel para ciencia o el tamaño de píxel para visualización (es decir, ppp) pueden almacenarse *exactamente en la misma parte del archivo*. Por lo tanto, lo que realmente significa este valor depende completamente de qué software escribió la imagen y si estaba más relacionado con el análisis o la visualización.
pt_br: Quando se trata de imagens TIFF, o tamanho do pixel para ciência ou o tamanho do pixel para exibição (ou seja, dpi) pode ser armazenado *exatamente na mesma parte do arquivo*. Portanto, o que esse valor realmente significa depende inteiramente de qual software escreveu a imagem e se ele estava mais preocupado com a análise ou com a exibição.

source: For that reason:
es: Por esta razón:
pt_br: Por essa razão:

source: **Always sanity-check pixel size values!**
es: **¡Siempre verifica los valores de tamaño de píxel!**
pt_br: **Sempre verifique a integridade dos valores de tamanho de pixel!**

source: How to do that will depend upon which software you are using: each may display pixel size information in a different place. But one universal rule is to use whatever knowledge you have about whatever is in your images.
es: La forma de hacerlo dependerá del software que estés utilizando: cada uno puede mostrar información sobre el tamaño de los píxeles en un lugar diferente. Pero una regla universal es utilizar todo el conocimiento que tengas sobre lo que esté en tus imágenes.
pt_br: Como fazer isso dependerá de qual software você está usando: cada um pode exibir informações de tamanho de pixel em um local diferente. Mas uma regra universal é usar todo o conhecimento que você tiver sobre o que quer que esteja em suas imagens.

source: For example, suppose you have an image of cells. A quick internet search can reveal a typical diameter of a nucleus (perhaps 5-20&nbsp;µm). Therefore you could spend a few minutes measuring some nucleus diameters to see if they are close to this value. If so, it does not prove the pixel size is correct but it does give some added confidence; if the value is far from what is expected, then it is a warning that the pixel size is wrong.
es: Por ejemplo, supongamos que tienes una imagen de células. Una búsqueda rápida en Internet puede revelar el diámetro típico de un núcleo (quizás 5-20&nbsp;μm). Por lo tanto, podrías dedicar unos minutos a medir algunos diámetros de núcleos para ver si están cerca de este valor. Si es así, no prueba que el tamaño de píxel sea correcto, pero sí da cierta confianza adicional; si el valor está lejos de lo esperado, entonces es una advertencia de que el tamaño de píxel es incorrecto.
pt_br: Por exemplo, suponha que você tenha uma imagem de células. Uma rápida pesquisa na Internet pode revelar o diâmetro típico de um núcleo (talvez 5-20&nbsp;µm). Portanto, você poderia passar alguns minutos medindo alguns diâmetros de núcleos para ver se eles estão próximos desse valor. Nesse caso, isso não prova que o tamanho do pixel esteja correto, mas dá alguma confiança adicional; se o valor estiver longe do esperado, é um aviso de que o tamanho do pixel está errado.

source: Choosing file formats
es: Elegir formatos de archivo
pt_br: Escolhendo formatos de arquivo

source: The right choice of file format depends upon when you are saving the image, and what you will want to do with it. Three main scenarios are described below.
es: La elección correcta del formato de archivo depende de cuándo guardes la imagen y de lo que desees hacer con ella. A continuación se describen tres escenarios principales.
pt_br: A escolha certa do formato de arquivo depende de quando você salva a imagem e do que deseja fazer com ela. Três cenários principais são descritos abaixo.

source: During acquisition
es: Durante la adquisición
pt_br: Durante a aquisição

source: Examples formats for specific microscopes include *.lif* (Leica), *.czi* (Zeiss), *.nd2* (Nikon), *.vsi* (Olympus)... with many more.
es: Ejemplos de formatos para microscopios específicos incluyen *.lif* (Leica), *.czi* (Zeiss), *.nd2* (Nikon), *.vsi* (Olympus)... y muchos más.
pt_br: Exemplos de formatos para microscópios específicos incluem *.lif* (Leica), *.czi* (Zeiss), *.nd2* (Nikon), *.vsi* (Olympus)... com muitos mais.

source: The general rule is to
es: La regla general es
pt_br: A regra geral é

source: Saving images during acquisition
es: Guardar imágenes durante la adquisición
pt_br: Salvando imagens durante a aquisição

source: Use the default file format for your microscope and acquisition software
es: Utiliza el formato de archivo predeterminado para tu microscopio y software de adquisición.
pt_br: Use o formato de arquivo padrão para seu microscópio e software de aquisição
