Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/6-files/files.po
Languages: es, pt_br

source: The rationale is that the manufacturer's format ought to preserve all the information and metadata. Often, the acquisition software supports saving the data in some other way -- but that can be risky. There's a strong chance that at least some metadata could be lost. Sometimes, the alternative export might do even worse things -- such as convert the data to RGB.
es: La razón es que el formato del fabricante debe preservar toda la información y los metadatos. A menudo, el software de adquisición permite guardar los datos de alguna otra manera, pero eso puede ser arriesgado. Existe una gran posibilidad de que se pierdan al menos algunos metadatos. A veces, la exportación alternativa puede hacer cosas aún peores, como convertir los datos a RGB.
pt_br: A justificativa é que o formato do fabricante deve preservar todas as informações e metadados. Muitas vezes, o software de aquisição permite salvar os dados de alguma outra forma – mas isso pode ser arriscado. Há uma grande chance de que pelo menos alguns metadados sejam perdidos. Às vezes, a exportação alternativa pode fazer coisas ainda piores – como converter os dados para RGB.

source: The disadvantage of this is that microscopy formats are usually uncommon in the rest of the world, which means your images might be hard to open in other software.
es: La desventaja de esto es que los formatos de microscopía suelen ser poco comunes en el resto del mundo, lo que significa que tus imágenes pueden ser difíciles de abrir en otro software.
pt_br: A desvantagem disso é que os formatos de microscopia geralmente são incomuns no resto do mundo, o que significa que pode ser difícil abrir suas imagens em outro software.

source: **Fortunately, there is a magnificent open-source project to help with this: [**Bio-Formats**](https://www.openmicroscopy.org/bio-formats/).**
es: **Afortunadamente, existe un magnífico proyecto de código abierto para ayudar con esto: [**Bio-Formats**](https://www.openmicroscopy.org/bio-formats/).**
pt_br: **Felizmente, existe um magnífico projeto de código aberto para ajudar com isso: [**Bio-Formats**](https://www.openmicroscopy.org/bio-formats/).**

source: Bio-Formats enables a [wide range of different formats](https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) to be read by many different software applications. It's already available within Fiji and QuPath by default, or can be installed as a plugin for ImageJ. Although it's written in Java, Bio-Formats can also be used within some Python applications.
es: Bio-Formats permite leer una [amplia gama de formatos diferentes](https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) mediante muchas aplicaciones de software diferentes. Ya está disponible en Fiji y QuPath de forma predeterminada, o se puede instalar como complemento para ImageJ. Aunque está escrito en Java, los bioformatos también se pueden utilizar en algunas aplicaciones de Python.
pt_br: Bio-Formats permite que uma [ampla variedade de formatos diferentes](https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) seja lida por muitos aplicativos de software diferentes. Já está disponível em Fiji e QuPath por padrão ou pode ser instalado como um plugin para ImageJ. Embora seja escrito em Java, os Bioformatos também podem ser usados em alguns aplicativos Python.

source: *If* you are unlucky enough that the native format for your microscope isn't supported by Bio-Formats, you might need to export it in a different format for use elsewhere. But if you do this, it's best to retain a copy of the original data anyway -- so you can always refer to it using the original acquisition software to check what (if anything) might have been lost in the export.
es: *Si* tienes la mala suerte de que Bio-Formats no admita el formato nativo de tu microscopio, es posible que debas exportarlo en un formato diferente para usarlo en otro lugar. Pero si haces esto, es mejor conservar una copia de los datos originales de todos modos, de modo que siempre puedas consultarlos utilizando el software de adquisición original para comprobar qué (si es que se ha perdido algo) se pudo haber perdido en la exportación.
pt_br: *Se* você tiver o azar de o formato nativo do seu microscópio não ser compatível com Bio-Formats, talvez seja necessário exportá-lo em um formato diferente para uso em outro lugar. Mas se você fizer isso, é melhor manter uma cópia dos dados originais de qualquer maneira - para que você possa sempre consultá-los usando o software de aquisição original para verificar o que (se houver) pode ter sido perdido na exportação.

source: During analysis
es: Durante el análisis
pt_br: Durante a análise

source: If you want to save an image during analysis, the rule is
es: Si deseas guardar una imagen durante el análisis, la regla es
pt_br: Se você quiser salvar uma imagem durante a análise, a regra é

source: Saving images during analysis
es: Guardar imágenes durante el análisis
pt_br: Salvando imagens durante a análise

source: Use the default file format for the analysis software you're using -- or OME-TIFF
es: Utiliza el formato de archivo predeterminado para el software de análisis que estés utilizando, o OME-TIFF
pt_br: Use o formato de arquivo padrão do software de análise que você está usando – ou OME-TIFF

source: Like the rule for acquisition, the idea is that this will generally preserve as much metadata as possible.
es: Al igual que la regla de adquisición, la idea es que esto generalmente preserve tantos metadatos como sea posible.
pt_br: Assim como a regra para aquisição, a ideia é que geralmente preserve o máximo possível de metadados.

source: For ImageJ, the default format is an uncompressed TIFF image. This supports 8-bit, 16-bit and 32-bit images with up to 5 dimensions, squeezing the key metadata required by ImageJ (e.g. pixel size) into one of the TIFF fields. All of this information should then be available if you open the image again in ImageJ or Fiji -- although it is not *necessarily* preserved if you open the TIFF in other software, which may not know how to interpret ImageJ's metadata. So if this is important to you, you'll need to check.
es: Para ImageJ, el formato predeterminado es una imagen TIFF sin comprimir. Esto admite imágenes de 8, 16 y 32 bits con hasta 5 dimensiones, comprimiendo los metadatos clave requeridos por ImageJ (por ejemplo, tamaño de píxel) en uno de los campos TIFF. Toda esta información debería estar disponible si abres la imagen nuevamente en ImageJ o Fiji, aunque no *necesariamente* se conserva si abres el TIFF en otro software, que puede no saber cómo interpretar los metadatos de ImageJ. Entonces, si esto es importante para ti, deberás comprobarlo.
pt_br: Para ImageJ, o formato padrão é uma imagem TIFF descompactada. Isso suporta imagens de 8, 16 e 32 bits com até 5 dimensões, comprimindo os principais metadados exigidos pelo ImageJ (por exemplo, tamanho do pixel) em um dos campos TIFF. Todas essas informações deverão estar disponíveis se você abrir a imagem novamente no ImageJ ou Fiji - embora não sejam *necessariamente* preservadas se você abrir o TIFF em outro software, que pode não saber como interpretar os metadados do ImageJ. Então, se isso é importante para você, você precisa verificar.

source: *However*, this might not be the best choice if you want to continue working with your image in different software. In that case, it might take some exploration to see which formats enable metadata to be saved in a way that your preferred software applications recognize.
es: *Sin embargo*, esta podría no ser la mejor opción si deseas continuar trabajando con tu imagen en un software diferente. En ese caso, puede ser necesario explorar un poco para ver qué formatos permiten guardar metadatos de una manera que tus aplicaciones de software preferidas los reconozcan.
pt_br: *No entanto*, esta pode não ser a melhor escolha se você quiser continuar trabalhando com sua imagem em software diferente. Nesse caso, pode ser necessária alguma exploração para ver quais formatos permitem que os metadados sejam salvos de uma forma que seus aplicativos de software preferidos reconheçam.

source: If you're using software that incorporates Bio-Formats, the best option is likely to be OME-TIFF. Bio-Formats can read and write OME-TIFF images, which has a very well-defined standard for storing metadata (developed by the group behind Bio-Formats itself). This opens up more possibilities, such as writing TIFFs that include either lossless or lossy compression. OME-TIFF can also contain a lot more metadata than an ImageJ TIFF can, including things like stage position, laser power etc.
es: Si estás utilizando software que incorpora bioformatos, la mejor opción probablemente sea OME-TIFF. Bio-Formats puede leer y escribir imágenes OME-TIFF, que tiene un estándar muy bien definido para almacenar metadatos (desarrollado por el grupo detrás de Bio-Formats). Esto abre más posibilidades, como escribir archivos TIFF que incluyan compresión sin pérdidas o con pérdidas. OME-TIFF también puede contener muchos más metadatos que un ImageJ TIFF, incluidos elementos como la posición de la platina del microscopio, la potencia del láser, etc.
pt_br: Se você estiver usando software que incorpora Bioformatos, a melhor opção provavelmente será OME-TIFF. O Bio-Formats pode ler e gravar imagens OME-TIFF, que possui um padrão muito bem definido para armazenamento de metadados (desenvolvido pelo próprio grupo por trás do Bio-Formats). Isso abre mais possibilidades, como escrever TIFFs que incluem compactação sem perdas ou com perdas. OME-TIFF também pode conter muito mais metadados do que um ImageJ TIFF, incluindo coisas como posição do palco, potência do laser, etc.

source: For display
es: Para mostrar
pt_br: Para exibição

source: When it comes to displaying images, we usually only need a format that can support RGB images. Since we won't use the image for further analysis, we don't need to preserve the pixel size and don't *necessarily* have to avoid compression artefacts. My personal preferred formats for different scenarios are:
es: Cuando se trata de mostrar imágenes, normalmente solo necesitamos un formato que admita imágenes RGB. Dado que no usaremos la imagen para análisis posteriores, no necesitamos preservar el tamaño de píxel y no *necesariamente* tenemos que evitar artefactos de compresión. Mis formatos preferidos personales para diferentes escenarios son:
pt_br: Quando se trata de exibir imagens, geralmente precisamos apenas de um formato que suporte imagens RGB. Como não usaremos a imagem para análise posterior, não precisamos preservar o tamanho do pixel e não precisamos *necessariamente* evitar artefatos de compressão. Meus formatos pessoais preferidos para diferentes cenários são:

source: **Journal figure: TIFF.** <br /> Often the journal requests this anyway. Even if I'm not convinced it always makes sense.
es: **Figura de la revista: TIFF.** <br /> A menudo, la revista solicita esto de todos modos. Aunque no esté convencido, siempre tiene sentido.
pt_br: **Figura do diário: TIFF.** <br /> Muitas vezes o diário solicita isso de qualquer maneira. Mesmo que eu não esteja convencido, sempre faz sentido.

source: **Presentation: PNG.** <br /> File size is not usually a problem, and PNG provides some compression without introducing artefacts.
es: **Presentación: PNG.** <br /> El tamaño del archivo no suele ser un problema y PNG proporciona algo de compresión sin introducir artefactos.
pt_br: **Apresentação: PNG.** <br /> O tamanho do arquivo geralmente não é um problema e o PNG fornece alguma compactação sem introduzir artefatos.

source: **Website: JPEG or PNG**, <br />JPEG (usually) because smaller file sizes mean the website can load quicker (and eat less data). But PNG for images that contain few colors, including most 'artificial' images such as drawings, dialog boxes or logos. JPEG artifacts can look especially ugly in such cases, while PNG can compress them very well.
es: **Sitio web: JPEG o PNG**, <br />JPEG (generalmente) porque los tamaños de archivo más pequeños significan que el sitio web puede cargarse más rápido (y consumir menos datos). Pero se recomienda PNG para imágenes que contienen pocos colores, incluyendo la mayoría de las imágenes "artificiales", como dibujos, cuadros de diálogo o logotipos. Los artefactos JPEG pueden verse especialmente feos en tales casos, mientras que PNG puede comprimirlos muy bien.
pt_br: **Site: JPEG ou PNG**, <br />JPEG (normalmente) porque tamanhos de arquivo menores significam que o site pode carregar mais rápido (e consumir menos dados). Mas PNG para imagens que contêm poucas cores, incluindo a maioria das imagens “artificiais”, como desenhos, caixas de diálogo ou logotipos. Os artefatos JPEG podem parecer especialmente feios nesses casos, enquanto o PNG pode compactá-los muito bem.

source: Creating figures for publication
es: Creando figuras para publicación.
pt_br: Criação de figuras para publicação

source: Preparing figures for publication can be a bewildering process. To begin with, it's necessary to make another distinction between image types, one of which has not been discussed here so far:
es: Preparar figuras para su publicación puede ser un proceso desconcertante. Para empezar, es necesario hacer otra distinción entre tipos de imágenes, una de las cuales no se ha comentado aquí hasta ahora:
pt_br: Preparar números para publicação pode ser um processo desconcertante. Para começar, é necessário fazer outra distinção entre tipos de imagens, uma das quais não foi discutida aqui até agora:

source: **Bitmaps**. These are composed of individual pixels: e.g. photographs, or all the microscopy images we are concerned with here.
es: **Mapas de bits**. Estos se componen de píxeles individuales: p.e. fotografías, o todas las imágenes de microscopía que nos conciernen aquí.
pt_br: **Bitmaps**. Eles são compostos de pixels individuais: por ex. fotografias, ou todas as imagens microscópicas que nos interessam aqui.

source: **Vector images**. These are composed of lines, curves, shapes or text. The instructions needed to draw the image (i.e. coordinates, equations, fonts) are stored rather than pixels, and then the image is recreated from these instructions when necessary.
es: **Imágenes vectoriales**. Estos se componen de líneas, curvas, formas o texto. Las instrucciones necesarias para dibujar la imagen (es decir, coordenadas, ecuaciones, fuentes) se almacenan en lugar de píxeles, y luego la imagen se recrea a partir de estas instrucciones cuando es necesario.
pt_br: **Imagens vetoriais**. Eles são compostos por linhas, curvas, formas ou texto. As instruções necessárias para desenhar a imagem (ou seja, coordenadas, equações, fontes) são armazenadas em vez de pixels, e então a imagem é recriada a partir dessas instruções quando necessário.

source: Every other part of this handbook concentrates on bitmap images. Vector images are quite different.
es: El resto de partes de este manual se concentra en imágenes de mapa de bits. Las imágenes vectoriales son bastante diferentes.
pt_br: Todas as outras partes deste manual concentram-se em imagens bitmap. As imagens vetoriais são bem diferentes.

source: If you scale a 2D bitmap image by doubling its width and height, then it will contain four times as many pixels. Guesses need to be made about how to fill in the extra information properly (which is the problem of **interpolation**), and the result generally looks less sharp than the original. But if you double the size of a vector image, it's just a matter of updating the maths needed to draw the image accordingly, and the result looks just as sharp as the original.
es: Si escalas una imagen de mapa de bits 2D duplicando su ancho y alto, esta contendrá cuatro veces más píxeles. Es necesario hacer conjeturas sobre cómo completar correctamente la información adicional (que es el problema de **interpolación**), y el resultado generalmente parece menos nítido que el original. Pero si duplicas el tamaño de una imagen vectorial, solo es cuestión de actualizar las matemáticas necesarias para dibujar la imagen adecuadamente, y el resultado se verá tan nítido como el original.
pt_br: Se você dimensionar uma imagem bitmap 2D dobrando sua largura e altura, ela conterá quatro vezes mais pixels. É necessário fazer suposições sobre como preencher corretamente as informações extras (que é o problema da **interpolação**), e o resultado geralmente parece menos nítido que o original. Mas se você dobrar o tamanho de uma imagem vetorial, será apenas uma questão de atualizar a matemática necessária para desenhar a imagem adequadamente, e o resultado parecerá tão nítido quanto o original.

source: Vector images are therefore best for things like diagrams, histograms, plots and charts, because they can be resized freely and still look good. Also, they often have tiny file sizes because only a few instructions to redraw the image need to be kept, whereas a huge number of pixels might be required to store sufficiently nice, sharp text in a bitmap. But bitmaps are needed for images formed from detecting light, which cannot be reduced to a few simple equations and instructions.
es: Por lo tanto, las imágenes vectoriales son mejores para cosas como diagramas, histogramas, gráficos y figuras, porque se puede cambiar su tamaño libremente y seguir teniendo buen aspecto. Además, a menudo tienen tamaños de archivo pequeños porque sólo es necesario conservar unas pocas instrucciones para volver a dibujar la imagen, mientras que es posible que se requiera una gran cantidad de píxeles para almacenar un texto suficientemente bonito y nítido en un mapa de bits. Pero los mapas de bits son necesarios para las imágenes formadas a partir de la detección de luz, que no pueden reducirse a unas pocas ecuaciones e instrucciones simples.
pt_br: As imagens vetoriais são, portanto, melhores para diagramas, histogramas, gráficos e gráficos, porque podem ser redimensionadas livremente e ainda assim ter uma boa aparência. Além disso, eles geralmente têm tamanhos de arquivo minúsculos porque apenas algumas instruções para redesenhar a imagem precisam ser mantidas, enquanto um grande número de pixels pode ser necessário para armazenar texto suficientemente bonito e nítido em um bitmap. Mas os bitmaps são necessários para imagens formadas a partir da detecção de luz, que não podem ser reduzidas a algumas equações e instruções simples.

source: Finally, some versatile file formats, such as PDF or EPS, can store both kinds of image: perhaps a bitmap with some text annotations on top. If you are including text or diagrams, these formats are generally best. But if you only have bitmaps without annotations of any kind, then TIFF is probably the most common file format for creating figures.
es: Finalmente, algunos formatos de archivo versátiles, como PDF o EPS, pueden almacenar ambos tipos de imágenes: tal vez un mapa de bits con algunas anotaciones de texto encima. Si incluyes texto o diagramas, estos formatos suelen ser los mejores. Pero si sólo tienes mapas de bits sin anotaciones de ningún tipo, entonces TIFF es probablemente el formato de archivo más común para crear figuras.
pt_br: Finalmente, alguns formatos de arquivo versáteis, como PDF ou EPS, podem armazenar ambos os tipos de imagem: talvez um bitmap com algumas anotações de texto no topo. Se você estiver incluindo texto ou diagramas, esses formatos geralmente são os melhores. Mas se você tiver apenas bitmaps sem anotações de qualquer tipo, então o TIFF é provavelmente o formato de arquivo mais comum para a criação de figuras.

source: When viewed from afar, it may be difficult to know whether an image is a vector or a bitmap (A) because they can sometimes look identical (although a photograph or micrograph will always be a bitmap). However, when enlarged a vector image will remain sharp (B), whereas a bitmap will not (C).
es: Cuando se ve desde lejos, puede resultar difícil saber si una imagen es un vector o un mapa de bits (A) porque a veces pueden parecer idénticas (aunque una fotografía o una micrografía siempre será un mapa de bits). Sin embargo, cuando se amplía, una imagen vectorial permanecerá nítida (B), mientras que un mapa de bits no (C).
pt_br: Quando vista de longe, pode ser difícil saber se uma imagem é um vetor ou um bitmap (A) porque às vezes podem parecer idênticos (embora uma fotografia ou micrografia sempre seja um bitmap). No entanto, quando ampliada, uma imagem vetorial permanecerá nítida (B), enquanto um bitmap não (C).

source: Pyramidal images
es: Imágenes piramidales
pt_br: Imagens piramidais

source: Finally, we end with a few words on **pyramidal images**: a type of image that is becoming increasingly common.
es: Finalmente, terminamos con unas palabras sobre las **imágenes piramidales**: un tipo de imágenes cada vez más comunes.
pt_br: Por fim, encerramos com algumas palavras sobre **imagens piramidais**: um tipo de imagem que está se tornando cada vez mais comum.

source: Modern bioimages can be *huge*. It's not uncommon for a single image to contain many gigabytes of pixel data, making it infeasible to open the full image in one go.
es: Las bioimágenes modernas pueden ser *enormes*. No es raro que una sola imagen contenga muchos gigabytes de datos de píxeles, lo que hace que sea imposible abrir la imagen completa de una sola vez.
pt_br: As bioimagens modernas podem ser *enormes*. Não é incomum que uma única imagem contenha muitos gigabytes de dados de pixel, tornando inviável abrir a imagem completa de uma só vez.

source: However, for visualization or analysis we often don't *need* all the pixels at once. For example, when viewing an image we only really need to access the pixels that are visible on screen at any moment -- at the magnification at which they are being viewed.
es: Sin embargo, para visualización o análisis a menudo no *necesitamos* todos los píxeles a la vez. Por ejemplo, cuando vemos una imagen, sólo necesitamos acceder a los píxeles que están visibles en la pantalla en cualquier momento, con el aumento con el que se están viendo.
pt_br: No entanto, para visualização ou análise muitas vezes não *precisamos* de todos os pixels de uma vez. Por exemplo, ao visualizar uma imagem, só precisamos realmente acessar os pixels que estão visíveis na tela a qualquer momento – na ampliação em que estão sendo visualizados.

source: Pyramidal image files help overcome this by using two tricks:
es: Los archivos de imágenes piramidales ayudan a superar esto mediante dos trucos:
pt_br: Arquivos de imagem piramidais ajudam a superar isso usando dois truques:

source: They store the image as separate chunks (often called 'tiles', if they are 2D)
es: Almacenan la imagen como fragmentos separados (a menudo llamados "mosaicos", si son 2D)
pt_br: Eles armazenam a imagem como pedaços separados (geralmente chamados de 'blocos', se forem 2D)

source: They store the same image at different resolutions in the same file
es: Almacenan la misma imagen en diferentes resoluciones en el mismo archivo
pt_br: Eles armazenam a mesma imagem em resoluções diferentes no mesmo arquivo
