Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/6-files/imagej.po
Languages: de, es

source: Sometimes you might get slightly unlucky: an image fails to open, even though it *could* be opened.
de: Manchmal haben Sie etwas Pech: Ein Bild lässt sich nicht öffnen, obwohl es *geöffnet werden könnte*.
es: A veces puedes tener un poco de mala suerte: una imagen no se abre, aunque *podría* abrirse.

source: This can happen whenever ImageJ optimistically *thinks* it can open a file, gives it a shot, but fails with a error-emitting whimper. Pride presumably wounded, ImageJ never passes the file to Bio-Formats to try. If this happens, then you can call on {menuselection}`Plugins --> Bio-Formats --> Bio-Formats Importer` to force the import to use Bio-Formats, in the hope it will have more success. I've had to do this on rare occasions with troublesome TIFFs.
de: Dies kann immer dann passieren, wenn ImageJ optimistisch *denkt*, dass es eine Datei öffnen kann, es versucht, aber mit einer Fehlermeldung scheitert, die ein Wimmern von sich gibt. Vermutlich ist der Stolz verletzt und ImageJ übergibt die Datei nie an Bio-Formats, um es zu versuchen. Wenn das passiert, können Sie auf {menuselection}`Plugins --&gt; Bio-Formats --&gt; Bio-Formats Importer` aufrufen, um den Import zu zwingen, Bio-Formats zu verwenden, in der Hoffnung, dass er mehr Erfolg hat. Ich habe dies in seltenen Fällen bei problematischen TIFFs tun müssen.
es: Esto puede ocurrir cuando ImageJ *piensa* con optimismo que puede abrir un archivo, lo intenta, pero falla con un quejido de error. Orgullo presumiblemente herido, ImageJ nunca pasa el archivo a Bio-Formats para que lo intente. Si esto ocurre, puedes llamar a {menuselection}`Plugins --&gt; Bio-Formats --&gt; Bio-Formats Importer` para forzar la importación a usar Bio-Formats, con la esperanza de que tenga más éxito. He tenido que hacer esto en raras ocasiones con TIFFs problemáticos.

source: At other times, you might be more unlucky: an image fails to open, and no amount of effort will get ImageJ to open it.
de: In anderen Fällen haben Sie vielleicht mehr Pech: Ein Bild lässt sich nicht öffnen, und ImageJ lässt sich auch mit noch so viel Mühe nicht dazu bringen, es zu öffnen.
es: En otras ocasiones, puede que tenga más mala suerte: una imagen no se abre, y ningún esfuerzo conseguirá que ImageJ la abra.

source: This could be because the file format itself is unsupported, or the image is corrupt. Assuming you have Bio-Formats installed, checking the [list of supported formats](https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) is a good start for finding out if it even *should* work. If so, you could ask about it on the [Scientific Community Forum](https://forum.image.sc) -- you'll probably need to share the image though for anyone else to be able to investigate the problem.
de: Dies könnte daran liegen, dass das Dateiformat selbst nicht unterstützt wird oder das Bild beschädigt ist. In der Annahme, dass Sie Bio-Formate installiert haben, ist die [Liste der unterstützten Formate] (https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) ein guter Anfang, um herauszufinden, ob es überhaupt funktionieren *sollte*. Wenn ja, können Sie im [Scientific Community Forum](https://forum.image.sc) nachfragen - Sie müssen allerdings wahrscheinlich das Bild weitergeben, damit jemand anderes das Problem untersuchen kann.
es: Esto puede deberse a que el propio formato de archivo no es compatible, o a que la imagen está corrupta. Asumiendo que tienes Bio-Formats instalado, comprobar la [lista de formatos soportados](https://docs.openmicroscopy.org/bio-formats/latest/supported-formats.html) es un buen comienzo para averiguar si incluso *debería* funcionar. Si es así, puedes preguntar en el [Foro de la Comunidad Científica](https://forum.image.sc) -- aunque probablemente necesitarás compartir la imagen para que alguien más pueda investigar el problema.

source: However, before doing that you should consider whether you have a whole slide image -- or other large pyramidal image -- that just has too many pixels for ImageJ to open. In that case, you might see a rather cryptic error like the one below:
de: Bevor Sie das tun, sollten Sie jedoch überlegen, ob Sie ein ganzes Dia-Bild - oder ein anderes großes pyramidenförmiges Bild - haben, das einfach zu viele Pixel hat, als dass ImageJ es öffnen könnte. In diesem Fall könnten Sie eine eher kryptische Fehlermeldung wie die folgende erhalten:
es: Sin embargo, antes de hacerlo debería considerar si tiene una imagen de diapositiva completa -- u otra imagen piramidal grande -- que simplemente tiene demasiados píxeles para que ImageJ la abra. En ese caso, es posible que aparezca un error bastante críptico como el que se muestra a continuación:

source: Although by no means obvious, this indicates that the image is too large. If this happens, you might want to try [QuPath](sec_files_pyramidal) instead.
de: Obwohl dies keineswegs offensichtlich ist, deutet es darauf hin, dass das Bild zu groß ist. In diesem Fall sollten Sie es stattdessen mit [QuPath](sec_files_pyramidal) versuchen.
es: Aunque no es en absoluto obvio, esto indica que la imagen es demasiado grande. Si esto ocurre, es posible que desee probar [QuPath](sec_files_pyramidal) en su lugar.

source: Practical
de: Praktisch
es: Práctico

source: To get a feel for the importance of metadata, you can try opening an image in which it is completely absent. This is quite tricky, and requires some detective work (or some luck).
de: Um ein Gefühl für die Bedeutung von Metadaten zu bekommen, können Sie versuchen, ein Bild zu öffnen, in dem diese Daten nicht vorhanden sind. Das ist ziemlich knifflig und erfordert etwas Detektivarbeit (oder etwas Glück).
es: Para hacerse una idea de la importancia de los metadatos, puede intentar abrir una imagen en la que no aparezcan. Esto es bastante complicado y requiere algo de trabajo detectivesco (o algo de suerte).

source: Try to open the file *Besenfreunde.ids* using Fiji -- it depicts an odd, and as yet unexplained, scene that I passed on my way to work soon after arriving in Heidelberg. This file __only__ contains pixel values, and no metadata. It can still be read using the {menuselection}`File --> Import --> Raw...` command, but to do so you will need to figure out the necessary metadata and input the appropriate values.
de: Versuchen Sie, die Datei *Besenfreunde.ids* mit Fiji zu öffnen - sie zeigt eine merkwürdige, noch unerklärliche Szene, an der ich kurz nach meiner Ankunft in Heidelberg auf dem Weg zur Arbeit vorbeikam. Diese Datei enthält __nur__ Pixelwerte, aber keine Metadaten. Sie kann trotzdem mit dem Befehl {menuselection}`Datei --&gt; Import --&gt; Raw...` gelesen werden, aber dazu müssen Sie die notwendigen Metadaten herausfinden und die entsprechenden Werte eingeben.
es: Intenta abrir el archivo *Besenfreunde.ids* usando Fiji -- representa una escena extraña, y todavía inexplicable, que pasé de camino al trabajo poco después de llegar a Heidelberg. Este archivo __sólo__ contiene valores de píxeles y ningún metadato. Todavía se puede leer usando el comando {menuselection}`File --&gt; Import --&gt; Raw...`, pero para ello tendrás que averiguar los metadatos necesarios e introducir los valores apropiados.

source: The following points may help:
de: Die folgenden Punkte können dabei helfen:
es: Los siguientes puntos pueden ser de ayuda:

source: The file contains only a single image, and a single channel.
de: Die Datei enthält nur ein einziges Bild und einen einzigen Kanal.
es: El archivo contiene una sola imagen y un solo canal.

source: The dimensions (width and height) of the image are each a multiple of 100 pixels.
de: Die Abmessungen (Breite und Höhe) des Bildes sind jeweils ein Vielfaches von 100 Pixeln.
es: Las dimensiones (anchura y altura) de la imagen son cada una múltiplo de 100 píxeles.

source: The data is in 8, 16 or 32-bit format (signed or unsigned).
de: Die Daten sind im 8-, 16- oder 32-Bit-Format (mit oder ohne Vorzeichen).
es: Los datos están en formato de 8, 16 o 32 bits (con o sin signo).

source: There are no offsets or gaps included.
de: Es sind keine Versatzstücke oder Lücken enthalten.
es: No se incluyen compensaciones ni huecos.

source: The total size of the file is 400 000 bytes.
de: Die Gesamtgröße der Datei beträgt 400 000 Byte.
es: El tamaño total del fichero es de 400 000 bytes.

source: __Note:__ The option {guilabel}`Little-endian byte order` relates to whether the bytes of 16 or 32-bit images are arranged from the least-to-most significant, or most-to-least significant. Some types of computer prefer one order, some prefer another, so this is something else the metadata should contain. The difference is similar to how a perfectly respectable number like __twenty-three__ is (quite ludicrously, in my view) spoken as __three-and-twenty__ in German.
de: Hinweis:__ Die Option {guilabel}`Little-endian byte order` bezieht sich darauf, ob die Bytes von 16- oder 32-Bit-Bildern von der niedrigsten zur höchsten oder von der höchsten zur niedrigsten Wertigkeit angeordnet werden. Einige Computertypen bevorzugen die eine Reihenfolge, andere eine andere, so dass dies etwas anderes ist, was die Metadaten enthalten sollten. Der Unterschied ist vergleichbar damit, dass eine völlig respektable Zahl wie __dreiundzwanzig__ im Deutschen (meiner Meinung nach ziemlich lächerlich) als __drei-und-zwanzig__ gesprochen wird.
es: Nota: La opción {guilabel}`Little-endian byte order` se refiere a si los bytes de las imágenes de 16 o 32 bits se ordenan de menor a mayor significación, o de mayor a menor significación. Algunos tipos de ordenador prefieren un orden, otros prefieren otro, así que esto es algo más que deben contener los metadatos. La diferencia es similar a la forma en que un número perfectamente respetable como __twenty-three__ (en mi opinión, bastante ridícula) se pronuncia como __three-and-twenty__ en alemán.

source: Solution
de: Lösung
es: Solución

source: The file size gives you the $$ \textrm{File size (in bytes)} = \frac{\textrm{width} \times \textrm{height} \times \textrm{bit-depth}}{8} $$ where the division by 8 converts the total number of bits to bytes (since 8 bits make 1 byte). This can be used to make reasonable starting estimates for the width, height and bit-depth, but figuring out which are correct likely still requires some trial-and-error. In the end, the settings you need are:
de: Die Dateigröße ergibt sich aus $$ \textrm{Dateigröße (in Bytes)} = \frac{\textrm{width} \times \textrm{height} \times \textrm{bit-depth}}{8} $$, wobei die Division durch 8 die Gesamtzahl der Bits in Bytes umrechnet (da 8 Bits 1 Byte ergeben). Auf diese Weise lassen sich vernünftige Anfangsschätzungen für Breite, Höhe und Bittiefe vornehmen, aber um herauszufinden, welche Werte richtig sind, muss man wahrscheinlich immer noch ein wenig herumprobieren. Letztendlich benötigen Sie die folgenden Einstellungen:
es: El tamaño del archivo le da el $$ \textrm{Tamaño del archivo (en bytes)} = \frac{\textrm{ancho} \times \textrm{alto} \por \textrm{altura} \veces profundidad de bits} {8} $$ donde la división por 8 convierte el número total de bits en bytes (ya que 8 bits forman 1 byte). Esto se puede utilizar para hacer estimaciones iniciales razonables para la anchura, la altura y la profundidad de bits, pero averiguar cuáles son los correctos probablemente todavía requiere un poco de ensayo y error. Al final, los ajustes que necesitas son:

source: Image type: 16-bit unsigned
de: Bildtyp: 16-Bit ohne Vorzeichen
es: Tipo de imagen: 16 bits sin signo

source: Width: 500 pixels
de: Breite: 500 Pixel
es: Anchura: 500 píxeles

source: Height: 400 pixels
de: Höhe: 400 Pixel
es: Altura: 400 píxeles

source: Little-endian byte order: False
de: Little-Endian-Byte-Reihenfolge: Falsch
es: Orden de bytes little-endian: Falso

source: Using these values in the import should result in a reasonable image.
de: Die Verwendung dieser Werte beim Import sollte zu einem vernünftigen Bild führen.
es: El uso de estos valores en la importación debería dar como resultado una imagen razonable.

source: Now make sure never to lose your metadata, and you do not need to solve such puzzles often in real life. (Also, any explanations for what exactly was going on in that scene would be welcome.)
de: Achten Sie nun darauf, dass Sie Ihre Metadaten nicht verlieren, und Sie müssen solche Rätsel im wirklichen Leben nicht oft lösen. (Außerdem wären Erklärungen dazu, was genau in dieser Szene vor sich ging, willkommen).
es: Ahora asegúrate de no perder nunca los metadatos, y de no tener que resolver este tipo de rompecabezas a menudo en la vida real. (Además, cualquier explicación sobre qué pasaba exactamente en esa escena sería bienvenida).
