Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/6-files/imagej.po
Languages: de, es

source: ImageJ: Files & file formats
de: ImageJ: Dateien und Dateiformate
es: ImageJ: Archivos y formatos de archivo

source: Introduction
de: Einführung
es: Introducción

source: On its own, ImageJ can read and write a range of common -- and a few not-so-common -- file formats. With Bio-Formats, it can handle a lot more.
de: Alleine kann ImageJ eine Reihe von gängigen - und einige weniger gängige - Dateiformate lesen und schreiben. Mit Bio-Formats kann es viel mehr verarbeiten.
es: Por sí solo, ImageJ puede leer y escribir una serie de formatos de archivo comunes (y algunos no tan comunes). Con Bio-Formats, puede manejar muchos más.

source: This section describes some of the most useful file formats for bioimage analysis and how to work with them effectively in ImageJ, along with a few tricks that may help if files are causing you trouble.
de: In diesem Abschnitt werden einige der nützlichsten Dateiformate für die Bioimage-Analyse beschrieben und es wird erläutert, wie man in ImageJ effektiv mit ihnen arbeiten kann. Außerdem werden einige Tricks beschrieben, die Ihnen helfen können, wenn die Dateien Probleme bereiten.
es: Esta sección describe algunos de los formatos de archivo más útiles para el análisis de bioimágenes y cómo trabajar con ellos eficazmente en ImageJ, junto con algunos trucos que pueden ayudarle si los archivos le causan problemas.

source: File formats in ImageJ (only)
de: Dateiformate in ImageJ (nur)
es: Formatos de archivo en ImageJ (sólo)

source: Opening images
de: Bilder zur Eröffnung
es: Imágenes de apertura

source: As described in {ref}`chap_imagej_pixels`, the general approach to open an image is to drag the file on top of the ImageJ toolbar and hope for the best. Assuming ImageJ supports the file format, then it will usually just work.
de: Wie in {ref}`chap_imagej_pixels` beschrieben, besteht der allgemeine Ansatz zum Öffnen eines Bildes darin, die Datei auf die ImageJ-Symbolleiste zu ziehen und das Beste zu hoffen. Vorausgesetzt, ImageJ unterstützt das Dateiformat, dann wird es normalerweise funktionieren.
es: Como se describe en {ref}`chap_imagej_pixels`, el método general para abrir una imagen consiste en arrastrar el archivo hasta la barra de herramientas de ImageJ y esperar lo mejor. Suponiendo que ImageJ soporte el formato de archivo, normalmente funcionará.

source: One occasion when that might *seem* insufficient is whenever you have a large number of image files in the same folder, which really are different slices or time points of the same image. It's possible to drag all these onto ImageJ's toolbar at once, but they are likely to open as separate images. The trick is to drag the folder containing all the images onto the toolbar instead: you should then be invited to open the images together in a single image stack.
de: Eine Gelegenheit, bei der Ihnen das unzureichend erscheinen könnte, ist, wenn Sie eine große Anzahl von Bilddateien im selben Ordner haben, bei denen es sich in Wirklichkeit um verschiedene Ausschnitte oder Zeitpunkte desselben Bildes handelt. Es ist zwar möglich, alle diese Bilder gleichzeitig auf die ImageJ-Symbolleiste zu ziehen, aber sie werden wahrscheinlich als separate Bilder geöffnet. Der Trick besteht darin, stattdessen den Ordner, der alle Bilder enthält, auf die Symbolleiste zu ziehen: Sie sollten dann eingeladen werden, die Bilder zusammen in einem einzigen Bildstapel zu öffnen.
es: Una ocasión en la que eso puede *parecer* insuficiente es cuando tienes un gran número de archivos de imagen en la misma carpeta, que en realidad son diferentes cortes o puntos temporales de la misma imagen. Es posible arrastrarlos todos a la barra de herramientas de ImageJ a la vez, pero es probable que se abran como imágenes separadas. El truco consiste en arrastrar la carpeta que contiene todas las imágenes a la barra de herramientas: entonces se le invitará a abrir las imágenes juntas en una sola pila de imágenes.

source: This assumes that *all* the images in the folder should be opened. If you need more control, then {menuselection}`File --> Import --> Image Sequence...` can help. This gives a more extensive dialog, where (among other things) you can specify a filter, i.e. some text that should be present within the filenames of images to include.
de: Dabei wird davon ausgegangen, dass *alle* Bilder im Ordner geöffnet werden sollen. Wenn Sie mehr Kontrolle benötigen, dann kann {menuselection}`Datei --&gt; Import --&gt; Bildsequenz...` helfen. Dies bietet einen umfangreicheren Dialog, in dem Sie (unter anderem) einen Filter angeben können, d.h. einen Text, der in den Dateinamen der einzuschließenden Bilder enthalten sein soll.
es: Esto supone que *todas* las imágenes de la carpeta deben abrirse. Si necesita más control, entonces {menuselection}`Archivo --&gt; Importar --&gt; Secuencia de imágenes...` puede ayudarle. Esto da un diálogo más extenso, donde (entre otras cosas) se puede especificar un filtro, es decir, algún texto que debe estar presente dentro de los nombres de archivo de las imágenes a incluir.

source: Virtual stacks for large images
de: Virtuelle Stapel für große Bilder
es: Pilas virtuales para imágenes grandes

source: Both the dialogs shown above to import multiple images give an intriguing {guilabel}`Use Virtual Stack` option. This causes ImageJ to *only* open the slice of the image stack that is currently being viewed. This can dramatically cut down memory requirements for large stacks, and make opening much faster.
de: Beide oben gezeigten Dialoge zum Importieren mehrerer Bilder bieten die faszinierende Option {guilabel}`Use Virtual Stack`. Diese veranlasst ImageJ, *nur* den Teil des Bildstapels zu öffnen, der gerade betrachtet wird. Dies kann den Speicherbedarf für große Stapel drastisch reduzieren und das Öffnen erheblich beschleunigen.
es: Ambos diálogos mostrados arriba para importar múltiples imágenes dan una intrigante opción {guilabel}`Use Virtual Stack`. Esto hace que ImageJ *sólo* abra la parte de la pila de imágenes que se está viendo en ese momento. Esto puede reducir drásticamente los requisitos de memoria para pilas grandes, y hacer que la apertura sea mucho más rápida.

source: The disadvantage of using a virtual stack is that it can make processing behave a bit oddly: seemingly 'forgetting' when a slice has been processed, or requesting that the full image is read into memory with prompts like the one below.
de: Der Nachteil der Verwendung eines virtuellen Stapels ist, dass sich die Verarbeitung etwas seltsam verhalten kann: Es scheint, als würde "vergessen", wann ein Slice verarbeitet wurde, oder es wird verlangt, dass das gesamte Bild in den Speicher eingelesen wird, mit Aufforderungen wie der folgenden.
es: La desventaja de usar una pila virtual es que puede hacer que el procesamiento se comporte de forma un poco extraña: aparentemente 'olvidando' cuándo se ha procesado un slice, o solicitando que se lea la imagen completa en memoria con avisos como el de abajo.

source: Still, virtual stacks are very handy if you want to peak into a large image without opening it all. If you don't mind its limitations, you can also open an ImageJ TIFF as a virtual stack using {menuselection}`File --> Import --> TIFF Virtual Stack...`.
de: Dennoch sind virtuelle Stapel sehr praktisch, wenn Sie einen Blick auf ein großes Bild werfen wollen, ohne es komplett zu öffnen. Wenn Ihnen die Einschränkungen nichts ausmachen, können Sie auch ein ImageJ TIFF als virtuellen Stapel öffnen, indem Sie {menuselection}`Datei --&gt; Import --&gt; TIFF Virtual Stack...` verwenden.
es: Aún así, las pilas virtuales son muy útiles si quieres echar un vistazo a una imagen grande sin abrirla entera. Si no te importan sus limitaciones, también puedes abrir un TIFF de ImageJ como pila virtual usando {menuselection}`Archivo --&gt; Importar --&gt; Pila virtual TIFF...`.

source: Saving images for analysis
de: Speichern von Bildern zur Analyse
es: Guardar imágenes para su análisis

source: To save an image, {menuselection}`File --> Save As --> Tiff...` *might* be all you ever need. This is ImageJ's default format, and so preserves all the important information that it requires -- including the pixel size. It even includes any [active ROIs and overlays](chap_rois).
de: Um ein Bild zu speichern, ist {menuselection}`Datei --&gt; Speichern unter --&gt; Tiff...` *möglicherweise* alles, was Sie jemals brauchen. Dies ist das Standardformat von ImageJ, und so bleiben alle wichtigen Informationen erhalten, die es benötigt - einschließlich der Pixelgröße. Es enthält sogar alle [aktiven ROIs und Overlays](chap_rois).
es: Para guardar una imagen, {menuselection}`Archivo --&gt; Guardar como --&gt; Tiff...` *puede* ser todo lo que necesites. Este es el formato por defecto de ImageJ, y conserva toda la información importante que requiere - incluyendo el tamaño de píxel. Incluso incluye cualquier [activo ROIs y superposiciones](chap_rois).

source: The main disadvantage with saving an ImageJ TIFF is that it's uncompressed, and so the file size can quickly become quite large. One way to mitigate this is to choose {menuselection}`File --> Save As --> ZIP...`.
de: Der größte Nachteil beim Speichern eines ImageJ TIFF ist, dass es unkomprimiert ist und die Dateigröße daher schnell sehr groß werden kann. Eine Möglichkeit, dies zu vermeiden, ist die Auswahl von {menuselection}`Datei --&gt; Speichern unter --&gt; ZIP...`.
es: La principal desventaja de guardar un TIFF de ImageJ es que no está comprimido, por lo que el tamaño del archivo puede aumentar rápidamente. Una forma de mitigarlo es elegir {menuselection}`Archivo --&gt; Guardar como --&gt; ZIP...`.

source: Rather than being an entirely different format, a ZIP file saved by ImageJ is really just a TIFF that has been zipped up into a smaller file using lossless compression. You can probably unzip the file using the tools of your operating system to reveal the TIFF inside -- but you don't have to, because ImageJ can open the zip file directly.
de: Bei einer von ImageJ gespeicherten ZIP-Datei handelt es sich nicht um ein völlig anderes Format, sondern um ein TIFF, das durch verlustfreie Komprimierung in eine kleinere Datei gepackt wurde. Sie können die Datei wahrscheinlich mit den Werkzeugen Ihres Betriebssystems entpacken, um das darin enthaltene TIFF freizulegen - aber das müssen Sie nicht, denn ImageJ kann die ZIP-Datei direkt öffnen.
es: En lugar de ser un formato completamente diferente, un archivo ZIP guardado por ImageJ es en realidad un TIFF que ha sido comprimido en un archivo más pequeño utilizando compresión sin pérdida. Probablemente puedas descomprimir el archivo con las herramientas de tu sistema operativo para ver el TIFF que contiene, pero no es necesario, porque ImageJ puede abrir el archivo zip directamente.

source: ImageJ's zip files are therefore good for archiving: they preserve all the same information as an ImageJ TIFF, but in a smaller file size. The cost is that reading and writing zip files can take quite a lot more time.
de: Die Zip-Dateien von ImageJ eignen sich daher gut für die Archivierung: Sie bewahren die gleichen Informationen wie ein ImageJ-TIFF, haben aber eine geringere Dateigröße. Der Preis dafür ist, dass das Lesen und Schreiben von Zip-Dateien sehr viel mehr Zeit in Anspruch nehmen kann.
es: Los archivos zip de ImageJ son, por tanto, buenos para archivar: conservan toda la misma información que un TIFF de ImageJ, pero en un archivo de menor tamaño. El coste es que leer y escribir archivos zip puede llevar bastante más tiempo.

source: Apart from TIFF and ZIP, none of ImageJ's other supported file formats are really to be recommended for analysis. Depending upon the original image, most will result in some kind of loss: for example through converting to RGB, discarding ROIs or dimensions, or applying some pixel-changing lossy compression.
de: Abgesehen von TIFF und ZIP ist keines der anderen von ImageJ unterstützten Dateiformate für die Analyse wirklich zu empfehlen. Je nach Originalbild führen die meisten zu irgendeiner Art von Verlust: zum Beispiel durch Konvertierung in RGB, Verwerfen von ROIs oder Dimensionen oder Anwendung einer pixelverändernden verlustbehafteten Kompression.
es: Aparte de TIFF y ZIP, ninguno de los otros formatos de archivo compatibles con ImageJ son realmente recomendables para el análisis. Dependiendo de la imagen original, la mayoría sufrirá algún tipo de pérdida: por ejemplo, al convertirla a RGB, al descartar los ROI o las dimensiones, o al aplicar algún tipo de compresión con pérdida que cambie los píxeles.

source: Saving images for display
de: Speichern von Bildern für die Anzeige
es: Guardar imágenes para su visualización

source: When it comes to saving an image to display, data loss may be tolerable -- or even necessary. We care about appearance and compatibility, not exact pixel values.
de: Wenn es darum geht, ein Bild für die Anzeige zu speichern, kann ein Datenverlust tolerierbar - oder sogar notwendig - sein. Uns geht es um das Aussehen und die Kompatibilität, nicht um exakte Pixelwerte.
es: Cuando se trata de guardar una imagen para mostrarla, la pérdida de datos puede ser tolerable, o incluso necesaria. Nos importa la apariencia y la compatibilidad, no los valores exactos de los píxeles.

source: ImageJ TIFF can also be used to save an image for display, but the large file sizes can be a problem. If you want to do it anyway, then it is often best to [convert the image to RGB first](sec_imagej_flatten).
de: ImageJ TIFF kann auch verwendet werden, um ein Bild zur Anzeige zu speichern, aber die großen Dateigrößen können ein Problem darstellen. Wenn Sie es trotzdem tun wollen, ist es oft am besten, [das Bild zuerst in RGB zu konvertieren](sec_imagej_flatten).
es: ImageJ TIFF también se puede utilizar para guardar una imagen para su visualización, pero el gran tamaño de los archivos puede ser un problema. Si desea hacerlo de todos modos, a menudo es mejor [convertir la imagen a RGB primero](sec_imagej_flatten).

source: Alternatively, I regularly use {menuselection}`File --> Save As... --> PNG...` as my preferred option to save RGB images for display using lossless compression.
de: Alternativ verwende ich regelmäßig {menuselection}`Datei --&gt; Speichern unter... --&gt; PNG...` als meine bevorzugte Option, um RGB-Bilder für die Anzeige mit verlustfreier Komprimierung zu speichern.
es: Como alternativa, suelo utilizar {menuselection}`Archivo --&gt; Guardar como... --&gt; PNG...` como opción preferida para guardar imágenes RGB para su visualización utilizando una compresión sin pérdidas.

source: If file size is still an issue, and artefacts are acceptable, then {menuselection}`File --> Save As... --> Jpeg...` can be used instead. The quality of the JPEG can be adjusted via {menuselection}`Edit --> Options --> Input/Output...`: increasing the JPEG quality will give (slightly) larger files, but less obvious artefacts.
de: Wenn die Dateigröße immer noch ein Problem ist und Artefakte akzeptabel sind, kann stattdessen {menuselection}`Datei --&gt; Speichern unter... --&gt; Jpeg...` verwendet werden. Die Qualität des JPEGs kann über {menuselection}`Bearbeiten --&gt; Optionen --&gt; Eingabe/Ausgabe...` angepasst werden: Eine Erhöhung der JPEG-Qualität führt zu (etwas) größeren Dateien, aber weniger offensichtlichen Artefakten.
es: Si el tamaño del archivo sigue siendo un problema, y los artefactos son aceptables, entonces {menuselection}`Archivo --&gt; Guardar como... --&gt; Jpeg...` puede utilizarse en su lugar. La calidad del JPEG puede ajustarse a través de {menuselection}`Edición --&gt; Opciones --&gt; Entrada/Salida...`: aumentando la calidad del JPEG se obtendrán archivos (ligeramente) más grandes, pero con menos artefactos obvios.

source: Using Bio-Formats
de: Verwendung von Bio-Formaten
es: Uso de bioformatos

source: Bio-Formats is extremely useful when working with scientific images generally -- and pretty much indispensable when it comes to microscopy. It provides support for reading a wide range of formats, and writing a somewhat smaller (but still important) range.
de: Bio-Formats ist äußerst nützlich bei der Arbeit mit wissenschaftlichen Bildern im Allgemeinen - und so gut wie unverzichtbar, wenn es um Mikroskopie geht. Es bietet Unterstützung für das Lesen einer breiten Palette von Formaten und das Schreiben einer etwas kleineren (aber immer noch wichtigen) Palette.
es: Bio-Formats es extremadamente útil cuando se trabaja con imágenes científicas en general -- y prácticamente indispensable cuando se trata de microscopía. Ofrece soporte para la lectura de una amplia gama de formatos, y la escritura de una gama algo menor (pero importante).

source: If you're using the Fiji distribution of ImageJ, then you should have Bio-Formats installed by default. Otherwise, you'll likely need to install *bioformats_package.jar* yourself. You can find it along with installation instructions at https://www.openmicroscopy.org/bio-formats/downloads/
de: Wenn Sie die Fiji-Distribution von ImageJ verwenden, dann sollten Sie Bio-Formats standardmäßig installiert haben. Andernfalls müssen Sie wahrscheinlich *bioformats_package.jar* selbst installieren. Sie finden es zusammen mit einer Installationsanleitung unter https://www.openmicroscopy.org/bio-formats/downloads/.
es: Si está utilizando la distribución Fiji de ImageJ, entonces debería tener Bio-Formats instalado por defecto. De lo contrario, es probable que tenga que instalar *bioformats_package.jar* usted mismo. Puedes encontrarlo junto con las instrucciones de instalación en https://www.openmicroscopy.org/bio-formats/downloads/

source: Once it's installed, Bio-Formats can do much of its work without you needing to think about it: if ImageJ cannot open a file by drag & drop, then it will usually let Bio-Formats have a go. You can tell when that has happened because the familiar *Bio-Formats Import Options* dialog will pop up:
de: Sobald es installiert ist, kann Bio-Formats einen Großteil seiner Arbeit erledigen, ohne dass Sie darüber nachdenken müssen: Wenn ImageJ eine Datei nicht per Drag &amp; Drop öffnen kann, lässt es normalerweise Bio-Formats den Vortritt. Sie können dies daran erkennen, dass der bekannte Dialog *Bio-Formats Import Options* erscheint:
es: Una vez instalado, Bio-Formats puede hacer gran parte de su trabajo sin que tengas que pensar en ello: si ImageJ no puede abrir un archivo arrastrándolo y soltándolo, normalmente dejará que Bio-Formats lo haga. Puede saber cuándo ha sucedido esto porque aparecerá el familiar diálogo *Bio-Formats Import Options* (Opciones de importación de Bio-Formats):

source: Sometimes -- but not always -- this is then followed by the *Bio-Formats Series Options* dialog. If the file contains multiple images, this gives an opportunity to select which images should be opened.
de: Manchmal - aber nicht immer - folgt dann das Dialogfeld *Bio-Formate Serienoptionen*. Wenn die Datei mehrere Bilder enthält, kann man hier auswählen, welche Bilder geöffnet werden sollen.
es: A veces, pero no siempre, aparece el cuadro de diálogo *Opciones de bioformatos*. Si el archivo contiene varias imágenes, puede seleccionar las que desea abrir.

source: Check out the import options
de: Prüfen Sie die Importoptionen
es: Consulta las opciones de importación

source: If you're anything like me, and have been using ImageJ for a while, there's a strong chance that the Bio-Formats import dialog has faded into the background noise of your life: something to be clicked away without another thought.
de: Wenn es Ihnen so geht wie mir und Sie ImageJ schon eine Weile benutzen, ist die Wahrscheinlichkeit groß, dass der Dialog zum Importieren von Bioformaten in der Hintergrundgeräuschkulisse Ihres Lebens verschwunden ist: etwas, das man einfach wegklickt, ohne weiter darüber nachzudenken.
es: Si eres como yo y llevas un tiempo utilizando ImageJ, es muy probable que el cuadro de diálogo de importación de bioformatos se haya desvanecido en el ruido de fondo de tu vida: algo en lo que hacer clic sin pensar más.

source: But it's worth occasionally checking out the options in detail, and hovering your mouse on top to see the useful explanations about what each option actually means. Lurking within the checkboxes and drop-down menus are options to do things like automatically setting the brightness and contrast or display modes. If you find yourself doing these tasks each time you open an image anyway, changing the import defaults could make life a little easier.
de: Es lohnt sich jedoch, die Optionen gelegentlich im Detail zu prüfen und mit der Maus darüber zu fahren, um die nützlichen Erklärungen zu sehen, was die einzelnen Optionen tatsächlich bedeuten. In den Kontrollkästchen und Dropdown-Menüs befinden sich Optionen, mit denen Sie z. B. automatisch Helligkeit und Kontrast oder den Anzeigemodus einstellen können. Wenn Sie diese Aufgaben ohnehin jedes Mal erledigen, wenn Sie ein Bild öffnen, könnte das Ändern der Importvorgaben das Leben ein wenig einfacher machen.
es: Pero merece la pena comprobar de vez en cuando las opciones en detalle y pasar el ratón por encima para ver las útiles explicaciones sobre el significado real de cada opción. Entre las casillas de verificación y los menús desplegables hay opciones para ajustar automáticamente el brillo y el contraste o los modos de visualización. Si tienes que hacer estas tareas cada vez que abres una imagen, cambiar los valores predeterminados de importación puede facilitarte las cosas.

source: Saving images
de: Speichern von Bildern
es: Guardar imágenes

source: To save a file, you can use {menuselection}`Plugins --> Bio-Formats --> Bio-Formats Exporter`.
de: Um eine Datei zu speichern, können Sie {menuselection}`Plugins --&gt; Bio-Formate --&gt; Bio-Formate Exporter` verwenden.
es: Para guardar un archivo, puede utilizar {menuselection}`Plugins --&gt; Bio-Formats --&gt; Bio-Formats Exporter`.

source: This is perhaps most useful if you want to save an OME-TIFF image. An OME-TIFF differs from a regular ImageJ TIFF in two main ways:
de: Dies ist vielleicht am nützlichsten, wenn Sie ein OME-TIFF-Bild speichern möchten. Ein OME-TIFF unterscheidet sich von einem normalen ImageJ-TIFF in zwei wesentlichen Punkten:
es: Esto puede ser muy útil si desea guardar una imagen OME-TIFF. Un OME-TIFF difiere de un TIFF normal de ImageJ en dos aspectos principales:

source: It stores a much more extensive collection of standardized metadata, as [OME-XML](https://docs.openmicroscopy.org/ome-model/latest/ome-xml/)
de: Es speichert eine viel umfangreichere Sammlung von standardisierten Metadaten, wie [OME-XML](https://docs.openmicroscopy.org/ome-model/latest/ome-xml/)
es: Almacena una colección mucho más amplia de metadatos normalizados, como [OME-XML](https://docs.openmicroscopy.org/ome-model/latest/ome-xml/)

source: It provides options to compress the data inside the TIFF, using either lossless (e.g. LZW) or lossy (e.g. JPEG) compression
de: Es bietet Optionen zur Komprimierung der Daten innerhalb des TIFFs, entweder mit verlustfreier (z.B. LZW) oder verlustbehafteter (z.B. JPEG) Kompression
es: Ofrece opciones para comprimir los datos dentro del TIFF, utilizando compresión sin pérdidas (por ejemplo, LZW) o con pérdidas (por ejemplo, JPEG).

source: You may also find that it works better at preserving key metadata when you want to move an image to another software application.
de: Sie werden auch feststellen, dass die wichtigsten Metadaten besser erhalten bleiben, wenn Sie ein Bild in eine andere Softwareanwendung verschieben möchten.
es: También puede que te resulte más útil para conservar los metadatos clave cuando quieras trasladar una imagen a otra aplicación de software.

source: Troubleshooting files
de: Dateien zur Fehlerbehebung
es: Solución de problemas
