Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/1-concepts/6-files/python.po
Languages: de, es, pt_br

source: Python: Files & file formats
de: Python: Dateien und Dateiformate
es: Python: archivos y formatos de archivo
pt_br: Python: arquivos e formatos de arquivo

source: When it comes to working with images in Python, there are various important packages. You might only need to use one - but it helps to know about the existence of the others.
de: Wenn es um die Arbeit mit Bildern in Python geht, gibt es verschiedene wichtige Pakete. Möglicherweise müssen Sie nur einen verwenden – es ist jedoch hilfreich, die Existenz der anderen zu kennen.
es: Cuando se trata de trabajar con imágenes en Python, existen varios paquetes importantes. Es posible que solo necesites utilizar uno, pero es útil conocer la existencia de los demás.
pt_br: Quando se trata de trabalhar com imagens em Python, existem vários pacotes importantes. Talvez você precise usar apenas um - mas ajuda saber sobre a existência dos outros.

source: To avoid adding lots of extra dependencies to this book, not all the packages are installed here.
de: Um zu vermeiden, dass diesem Buch viele zusätzliche Abhängigkeiten hinzugefügt werden, werden hier nicht alle Pakete installiert.
es: Para evitar agregar muchas dependencias adicionales a este libro, no todos los paquetes se instalan aquí.
pt_br: Para evitar adicionar muitas dependências extras a este livro, nem todos os pacotes estão instalados aqui.

source: Useful Python packages
de: Nützliche Python-Pakete
es: Paquetes útiles de Python
pt_br: Pacotes Python úteis

source: Pillow
de: Kissen
es: Almohada
pt_br: Travesseiro

source: [Pillow's authors describe it as 'the friendly PIL fork'](https://pillow.readthedocs.io/en/stable/), where **PIL** is the *Python Imaging Library*.
de: [Pillows Autoren beschreiben es als „die freundliche PIL-Gabel“](https://pillow.readthedocs.io/en/stable/), wobei **PIL** die *Python Imaging Library* ist.
es: [Los autores de Pillow lo describen como 'la bifurcación PIL amigable'](https://pillow.readthedocs.io/en/stable/), donde **PIL** es la *Biblioteca de imágenes de Python*.
pt_br: [Os autores do Pillow descrevem-no como 'o fork PIL amigável'](https://pillow.readthedocs.io/en/stable/), onde **PIL** é a *Python Imaging Library*.

source: It is indeed *quite* friendly, and it does much more than just reading and writing images - even supporting features to draw onto images.
de: Es ist in der Tat *ziemlich* benutzerfreundlich und kann viel mehr als nur Bilder lesen und schreiben – es unterstützt sogar Funktionen zum Zeichnen auf Bildern.
es: De hecho, es *bastante* amigable y hace mucho más que simplemente leer y escribir imágenes, incluso admite funciones para dibujar en imágenes.
pt_br: Na verdade, é *bastante* amigável e faz muito mais do que apenas ler e escrever imagens - até mesmo oferece suporte a recursos para desenhar em imagens.

source: The main disadvantage of Pillow is that it doesn't work directly with NumPy arrays. Therefore, if it's a NumPy array that you want then you'll need to add in a few extra lines of code to convert the images.
de: Der Hauptnachteil von Pillow besteht darin, dass es nicht direkt mit NumPy-Arrays funktioniert. Wenn Sie also ein NumPy-Array wünschen, müssen Sie ein paar zusätzliche Codezeilen hinzufügen, um die Bilder zu konvertieren.
es: La principal desventaja de Pillow es que no funciona directamente con matrices NumPy. Por lo tanto, si lo que desea es una matriz NumPy, deberá agregar algunas líneas adicionales de código para convertir las imágenes.
pt_br: A principal desvantagem do Pillow é que ele não funciona diretamente com arrays NumPy. Portanto, se você deseja um array NumPy, precisará adicionar algumas linhas extras de código para converter as imagens.

source: ImageIO
de: BildIO
es: ImagenIO
pt_br: ImagemIO

source: [imageio](https://imageio.readthedocs.io/en/stable/) is my preferred Python package for most straightforward image reading - and the main one I've used in this book.
de: [imageio](https://imageio.readthedocs.io/en/stable/) ist mein bevorzugtes Python-Paket für das unkomplizierteste Lesen von Bildern – und das wichtigste, das ich in diesem Buch verwendet habe.
es: [imageio](https://imageio.readthedocs.io/en/stable/) es mi paquete Python preferido para la lectura de imágenes más sencilla, y el principal que he usado en este libro.
pt_br: [imageio](https://imageio.readthedocs.io/en/stable/) é meu pacote Python preferido para leitura de imagens mais direta - e o principal que usei neste livro.

source: It's also the [recommended alternative to *SciPy*'s deprecated `imread` function](https://docs.scipy.org/doc/scipy-1.1.0/reference/generated/scipy.misc.imread.html#scipy.misc.imread).
de: Es ist auch die [empfohlene Alternative zur veralteten „imread“-Funktion von *SciPy*](https://docs.scipy.org/doc/scipy-1.1.0/reference/generated/scipy.misc.imread.html#scipy .misc.imread).
es: También es la [alternativa recomendada a la función `imread` obsoleta de *SciPy*](https://docs.scipy.org/doc/scipy-1.1.0/reference/generated/scipy.misc.imread.html#scipy .misc.imread).
pt_br: É também a [alternativa recomendada para a obsoleta função `imread` do *SciPy*](https://docs.scipy.org/doc/scipy-1.1.0/reference/generated/scipy.misc.imread.html#scipy .misc.imread).

source: `imageio.imread(path)` returns a NumPy array automatically. This makes it easy to use for straightforward things, especially when working with 2D images (single-channel or RGB).
de: „imageio.imread(path)“ gibt automatisch ein NumPy-Array zurück. Dies erleichtert die Verwendung für einfache Aufgaben, insbesondere bei der Arbeit mit 2D-Bildern (Einkanal oder RGB).
es: `imageio.imread(path)` devuelve una matriz NumPy automáticamente. Esto facilita su uso para cosas sencillas, especialmente cuando se trabaja con imágenes 2D (de un solo canal o RGB).
pt_br: `imageio.imread(path)` retorna um array NumPy automaticamente. Isso facilita o uso para tarefas simples, especialmente ao trabalhar com imagens 2D (canal único ou RGB).

source: imageio can use different backends, which includes [Pillow](https://imageio.readthedocs.io/en/stable/_autosummary/imageio.plugins.pillow.html) and [tifffile](https://imageio.readthedocs.io/en/stable/_autosummary/imageio.plugins.tifffile.html) - so you can potentially get the advantages of both through using imageio, while writing less code yourself.
de: imageio kann verschiedene Backends verwenden, darunter [Pillow](https://imageio.readthedocs.io/en/stable/_autosummary/imageio.plugins.pillow.html) und [tifffile](https://imageio.readthedocs.io). /en/stable/_autosummary/imageio.plugins.tifffile.html) – so können Sie durch die Verwendung von imageio potenziell die Vorteile beider nutzen und gleichzeitig weniger Code schreiben.
es: imageio puede usar diferentes backends, que incluyen [Pillow](https://imageio.readthedocs.io/en/stable/_autosummary/imageio.plugins.pillow.html) y [tifffile](https://imageio.readthedocs.io /en/stable/_autosummary/imageio.plugins.tifffile.html), por lo que potencialmente puede obtener las ventajas de ambos mediante el uso de imageio, mientras escribe menos código usted mismo.
pt_br: imageio pode usar backends diferentes, que incluem [Pillow](https://imageio.readthedocs.io/en/stable/_autosummary/imageio.plugins.pillow.html) e [tifffile](https://imageio.readthedocs.io /en/stable/_autosummary/imageio.plugins.tifffile.html) - para que você possa obter as vantagens de ambos usando o imageio, enquanto escreve menos código.

source: tifffile
de: TIFF-Datei
es: archivo tiff
pt_br: arquivo tiff

source: [tifffile](https://pypi.org/project/tifffile/) is a small package[^fn_tf] that is very handy if you need to get into the details of reading and writing TIFF images.
de: [tifffile](https://pypi.org/project/tifffile/) ist ein kleines Paket[^fn_tf], das sehr praktisch ist, wenn Sie sich mit den Details zum Lesen und Schreiben von TIFF-Bildern befassen müssen.
es: [tifffile](https://pypi.org/project/tifffile/) es un pequeño paquete[^fn_tf] que es muy útil si necesita entrar en detalles sobre la lectura y escritura de imágenes TIFF.
pt_br: [tifffile](https://pypi.org/project/tifffile/) é um pequeno pacote[^fn_tf] que é muito útil se você precisar entrar em detalhes sobre como ler e escrever imagens TIFF.

source: [AICSImageIO](https://github.com/AllenCellModeling/aicsimageio) is an excellent package for reading lots of image formats in Python - and is particularly strong when it comes to reading multidimensional images and metadata.
de: [AICSImageIO](https://github.com/AllenCellModeling/aicsimageio) ist ein hervorragendes Paket zum Lesen vieler Bildformate in Python – und ist besonders stark, wenn es um das Lesen mehrdimensionaler Bilder und Metadaten geht.
es: [AICSImageIO](https://github.com/AllenCellModeling/aicsimageio) es un paquete excelente para leer muchos formatos de imágenes en Python, y es particularmente sólido cuando se trata de leer imágenes y metadatos multidimensionales.
pt_br: [AICSImageIO](https://github.com/AllenCellModeling/aicsimageio) é um excelente pacote para leitura de vários formatos de imagem em Python - e é particularmente forte quando se trata de leitura de imagens multidimensionais e metadados.

source: It can even handle a variety of microscopy formats, and optionally use [Bio-Formats](https://www.openmicroscopy.org/bio-formats/).
de: Es kann sogar eine Vielzahl von Mikroskopieformaten verarbeiten und optional [Bio-Formate] (https://www.openmicroscopy.org/bio-formats/) verwenden.
es: Incluso puede manejar una variedad de formatos de microscopía y, opcionalmente, utilizar [Bio-Formats](https://www.openmicroscopy.org/bio-formats/).
pt_br: Ele pode até lidar com uma variedade de formatos de microscopia e, opcionalmente, usar [Bio-Formats](https://www.openmicroscopy.org/bio-formats/).

source: These features, alongside its consistent way of handling pixel sizes and dimensions, make it my main choice for scientific images.
de: Diese Funktionen sowie die konsistente Handhabung von Pixelgrößen und -dimensionen machen es zu meiner ersten Wahl für wissenschaftliche Bilder.
es: Estas características, junto con su forma consistente de manejar los tamaños y dimensiones de los píxeles, lo convierten en mi principal opción para imágenes científicas.
pt_br: Esses recursos, juntamente com sua maneira consistente de lidar com tamanhos e dimensões de pixels, fazem dele minha principal escolha para imagens científicas.

source: OpenSlide
es: Abrir diapositiva

source: [OpenSlide](https://openslide.org) is widely used in the world of digital pathology. It's limited to 2D RGB data, but its big benefit is that it supports a range of pyramidal whole slide images.
de: [OpenSlide](https://openslide.org) ist in der Welt der digitalen Pathologie weit verbreitet. Es ist auf 2D-RGB-Daten beschränkt, sein großer Vorteil besteht jedoch darin, dass es eine Reihe von Pyramidenbildern ganzer Dias unterstützt.
es: [OpenSlide](https://openslide.org) se utiliza ampliamente en el mundo de la patología digital. Está limitado a datos RGB 2D, pero su gran ventaja es que admite una variedad de imágenes de diapositivas completas piramidales.
pt_br: [OpenSlide](https://openslide.org) é amplamente utilizado no mundo da patologia digital. É limitado a dados RGB 2D, mas seu grande benefício é que ele suporta uma variedade de imagens de slides piramidais inteiras.

source: [Dask](https://dask.org) is a project you should know about if you're working with big datasets in Python.
de: [Dask](https://dask.org) ist ein Projekt, das Sie kennen sollten, wenn Sie mit großen Datenmengen in Python arbeiten.
es: [Dask](https://dask.org) es un proyecto que debes conocer si estás trabajando con grandes conjuntos de datos en Python.
pt_br: [Dask](https://dask.org) é um projeto que você deve conhecer se estiver trabalhando com grandes conjuntos de dados em Python.

source: Dask isn't an image reading package, but [dask-image](https://image.dask.org/) includes an `imread` function that can be used if you know you want your image to be in a dask array in the end.
de: Dask ist kein Bildlesepaket, aber [dask-image](https://image.dask.org/) enthält eine „imread“-Funktion, die verwendet werden kann, wenn Sie wissen, dass Ihr Bild in einem Dask-Array sein soll am Ende.
es: Dask no es un paquete de lectura de imágenes, pero [dask-image](https://image.dask.org/) incluye una función `imread` que puede usarse si sabes que quieres que tu imagen esté en una matriz dask al final.
pt_br: Dask não é um pacote de leitura de imagens, mas [dask-image](https://image.dask.org/) inclui uma função `imread` que pode ser usada se você quiser que sua imagem esteja em um array dask no fim.

source: Napari
es: Nápoles

source: Finally, [Napari](https://napari.org) isn't an image reading library either; rather, it's a fantastic open-source, extensible, multidimensional image viewer for Python.
de: Schließlich ist [Napari](https://napari.org) auch keine Bildlesebibliothek; Vielmehr handelt es sich um einen fantastischen, erweiterbaren, mehrdimensionalen Open-Source-Bildbetrachter für Python.
es: Finalmente, [Napari](https://napari.org) tampoco es una biblioteca de lectura de imágenes; más bien, es un fantástico visor de imágenes multidimensional, extensible y de código abierto para Python.
pt_br: Finalmente, [Napari](https://napari.org) também não é uma biblioteca de leitura de imagens; em vez disso, é um fantástico visualizador de imagens multidimensional, extensível e de código aberto para Python.

source: Napari can bring everything together - working with dask arrays and reading images with plugins, such as [napari-aicsimageio](https://github.com/AllenCellModeling/napari-aicsimageio) and [napari-lazy-openslide](https://github.com/manzt/napari-lazy-openslide).
de: Napari kann alles zusammenbringen – das Arbeiten mit Dask-Arrays und das Lesen von Bildern mit Plugins wie [napari-aicsimageio](https://github.com/AllenCellModeling/napari-aicsimageio) und [napari-lazy-openslide](https:/ /github.com/manzt/napari-lazy-openslide).
es: Napari puede unir todo: trabajar con matrices de datos y leer imágenes con complementos, como [napari-aicsimageio](https://github.com/AllenCellModeling/napari-aicsimageio) y [napari-lazy-openslide](https:/ /github.com/manzt/napari-lazy-openslide).
pt_br: O Napari pode reunir tudo - trabalhando com matrizes dask e lendo imagens com plug-ins, como [napari-aicsimageio](https://github.com/AllenCellModeling/napari-aicsimageio) e [napari-lazy-openslide](https:/ /github.com/manzt/napari-lazy-openslide).

source: Small in that its code is mostly just one file. But it's [a pretty epic file](https://github.com/cgohlke/tifffile/blob/master/tifffile/tifffile.py).
de: Klein, da der Code größtenteils nur aus einer Datei besteht. Aber es ist [eine ziemlich epische Datei](https://github.com/cgohlke/tifffile/blob/master/tifffile/tifffile.py).
es: Pequeño porque su código es principalmente un solo archivo. Pero es [un archivo bastante épico](https://github.com/cgohlke/tifffile/blob/master/tifffile/tifffile.py).
pt_br: Pequeno porque seu código é basicamente apenas um arquivo. Mas é [um arquivo bastante épico](https://github.com/cgohlke/tifffile/blob/master/tifffile/tifffile.py).
