Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/5-morph/imagej.po
Languages: de, es, pt_br

source: ImageJ: Morphological operations
de: ImageJ: Morphologische Operationen
es: ImageJ: Operaciones morfológicas
pt_br: ImageJ: Operações morfológicas

source: Introduction
de: Einführung
es: Introducción
pt_br: Introdução

source: ImageJ's {menuselection}`Process --> Binary` submenu contains various useful commands for working with binary images, including some of the morphological operations we've looked at.
de: ImageJ's {menuselection}`Process --&gt; Binary` Untermenü enthält verschiedene nützliche Befehle für die Arbeit mit binären Bildern, einschließlich einiger der morphologischen Operationen, die wir uns angesehen haben.
es: El submenú `Process --&gt; Binary` de ImageJ {menuselection} contiene varios comandos útiles para trabajar con imágenes binarias, incluyendo algunas de las operaciones morfológicas que hemos visto.
pt_br: O submenu {menuselection}`Process --> Binary` do ImageJ contém vários comandos úteis para trabalhar com imagens binárias, incluindo algumas das operações morfológicas que vimos.

source: However, there are other useful morphological operations lurking elsewhere -- although most require extra plugins, or switching to Fiji.
de: Es gibt jedoch noch weitere nützliche morphologische Operationen, die anderswo lauern - die meisten erfordern jedoch zusätzliche Plugins oder den Wechsel zu Fiji.
es: Sin embargo, hay otras operaciones morfológicas útiles al acecho en otros lugares - aunque la mayoría requieren plugins adicionales, o cambiar a Fiji.
pt_br: No entanto, existem outras operações morfológicas úteis escondidas em outros lugares - embora a maioria exija plug-ins extras ou mude para Fiji.

source: Erosion, dilation, opening & closing
de: Erosion, Dilatation, Öffnen und Schließen
es: Erosión, dilatación, apertura y cierre
pt_br: Erosão, dilatação, abertura e fechamento

source: {menuselection}`Process --> Binary` contains the commands {menuselection}`Erode`, {menuselection}`Dilate`, {menuselection}`Open` and {menuselection}`Close-` commands.
de: {menuselection}Prozess --&gt; Binär" enthält die Befehle {menuselection}"Erweitern", {menuselection}"Dilatieren", {menuselection}"Öffnen" und {menuselection}"Schließen".
es: {menuselection}`Process --&gt; Binary` contiene los comandos {menuselection}`Erode`, {menuselection}`Dilate`, {menuselection}`Open` y {menuselection}`Close-`.
pt_br: {menuselection}`Process --> Binary` contém os comandos {menuselection}`Erode`, {menuselection}`Dilate`, {menuselection}`Open` e {menuselection}`Close-` comandos.

source: These are relevant here, but my advice is to avoid them. By default they work with fixed 3×3 pixel neighborhoods, but they *could* do something different if someone has been messing about with the {guilabel}`Iterations (1-100)` or {guilabel}`Count (1-8)` options under {menuselection}`Process --> Binary --> Options...` -- and this unpredictability could well cause trouble.
de: Diese sind hier relevant, aber mein Rat ist, sie zu vermeiden. Standardmäßig arbeiten sie mit festen 3×3-Pixel-Umgebungen, aber sie *könnten* etwas anderes tun, wenn jemand mit den Optionen {guilabel}`Iterations (1-100)` oder {guilabel}`Count (1-8)` unter {menuselection}`Process --&gt; Binary --&gt; Options...` herumgespielt hat, und diese Unvorhersehbarkeit könnte durchaus Probleme verursachen.
es: Estos son relevantes aquí, pero mi consejo es evitarlos. Por defecto trabajan con vecindarios fijos de 3×3 píxeles, pero *podrían* hacer algo diferente si alguien ha estado jugando con las opciones {guilabel}`Iterations (1-100)` o {guilabel}`Count (1-8)` en {menuselection}`Process --&gt; Binary --&gt; Options...` -- y esta imprevisibilidad podría causar problemas.
pt_br: Eles são relevantes aqui, mas meu conselho é evitá-los. Por padrão, eles trabalham com vizinhanças fixas de 3×3 pixels, mas *poderiam* fazer algo diferente se alguém estiver mexendo nas {guilabel}`Iterações (1-100)` ou {guilabel}`Contar (1-8)` opções em {menuselection}`Processo --> Binário --> Opções...` – e esta imprevisibilidade pode muito bem causar problemas.

source: To perform erosion, dilation, opening and closing with more control and possibly larger neighborhoods, I strongly prefer to use the {menuselection}`Process --> Filters --> Maximum...` and {menuselection}`Process --> Filters --> Minimum...` commands, combining them if necessary.
de: Um Erosion, Dilatation, Öffnen und Schließen mit mehr Kontrolle und möglicherweise größeren Bereichen durchzuführen, ziehe ich es vor, die Befehle {menuselection}`Process --&gt; Filters --&gt; Maximum...` und {menuselection}`Process --&gt; Filters --&gt; Minimum...` zu verwenden und sie gegebenenfalls zu kombinieren.
es: Para realizar erosiones, dilataciones, aperturas y cierres con más control y posiblemente vecindarios más grandes, prefiero utilizar los comandos {menuselection}`Proceso --&gt; Filtros --&gt; Máximo...` y {menuselection}`Proceso --&gt; Filtros --&gt; Mínimo...`, combinándolos si es necesario.
pt_br: Para realizar erosão, dilatação, abertura e fechamento com mais controle e possivelmente vizinhanças maiores, eu prefiro fortemente usar o {menuselection}`Process --> Filters --> Maximum...` e {menuselection}`Processo --> Filtros --> Mínimo...`, combinando-os se necessário.

source: Morphological operations in Fiji
de: Morphologische Operationen in Fidschi
es: Operaciones morfológicas en Fiyi
pt_br: Operações morfológicas em Fiji

source: Fiji contains {menuselection}`Process --> Morphology --> Gray Morphology`, which provides a more flexible implementation of erosion, dilation, opening and closing using a variety of shapes for both grayscale and binary images.
de: Fiji enthält {menuselection}`Process --&gt; Morphology --&gt; Gray Morphology`, das eine flexiblere Implementierung von Erosion, Dilatation, Öffnen und Schließen unter Verwendung einer Vielzahl von Formen sowohl für Graustufen- als auch für Binärbilder bietet.
es: Fiji contiene {menuselection}`Process --&gt; Morphology --&gt; Gray Morphology`, que proporciona una implementación más flexible de erosión, dilatación, apertura y cierre utilizando una variedad de formas tanto para imágenes en escala de grises como binarias.
pt_br: Fiji contém {menuselection}`Process --> Morphology --> Gray Morphology`, que fornece uma implementação mais flexível de erosão, dilatação, abertura e fechamento usando uma variedade de formas para tons de cinza e imagens binárias.

source: You can also find the plugin for ImageJ at https://imagej.nih.gov/ij/plugins/gray-morphology.html
de: Sie können das Plugin für ImageJ auch unter https://imagej.nih.gov/ij/plugins/gray-morphology.html finden.
es: También puede encontrar el plugin para ImageJ en https://imagej.nih.gov/ij/plugins/gray-morphology.html
pt_br: Você também pode encontrar o plugin para ImageJ em https://imagej.nih.gov/ij/plugins/gray-morphology.html

source: Outlines, holes & skeletonization
de: Umrisse, Löcher und Skelettierung
es: Esquemas, agujeros y esqueletización
pt_br: Contornos, furos e esqueletização

source: The {menuselection}`Process --> Binary --> Outline` command, predictably, removes all the interior pixels from 2D binary objects, leaving only the perimeters ({numref}`fig-outline_fill_skeleton`A).
de: Der Befehl {menuselection}`Process --&gt; Binary --&gt; Outline` entfernt vorhersehbar alle inneren Pixel von binären 2D-Objekten und lässt nur die Umrisse übrig ({numref}`fig-outline_fill_skeleton`A).
es: El comando {menuselection}`Process --&gt; Binary --&gt; Outline`, como era de esperar, elimina todos los píxeles interiores de los objetos binarios 2D, dejando sólo los perímetros ({numref}`fig-outline_fill_skeleton`A).
pt_br: O comando {menuselection}`Process --> Binary --> Outline`, previsivelmente, remove todos os pixels internos de objetos binários 2D, deixando apenas os perímetros ({numref}`fig-outline_fill_skeleton`A).

source: {menuselection}`Process --> Binary --> Fill Holes` would then fill these interior pixels in again, or indeed fill in any background pixels that are completely surrounded by foreground pixels ({numref}`fig-outline_fill_skeleton`B).
de: {menuselection}Process --&gt; Binary --&gt; Fill Holes` würde dann diese inneren Pixel wieder auffüllen, oder auch alle Hintergrundpixel, die komplett von Vordergrundpixeln umgeben sind ({numref}`fig-outline_fill_skeleton`B).
es: {menuselection}`Process --&gt; Binary --&gt; Fill Holes` volvería a rellenar estos píxeles interiores, o incluso rellenaría cualquier píxel de fondo que esté completamente rodeado por píxeles de primer plano ({numref}`fig-outline_fill_skeleton`B).
pt_br: {menuselection}`Process --> Binary --> Fill Holes` preencheria esses pixels internos novamente, ou mesmo preencheria quaisquer pixels de fundo que estejam completamente cercados por pixels de primeiro plano ({numref}`fig-outline_fill_skeleton`B).

source: {menuselection}`Process --> Binary --> Skeletonize` shaves off all the outer pixels of an object until only a connected central line remains ({numref}`fig-outline_fill_skeleton`C).
de: {menuselection}Process --&gt; Binary --&gt; Skeletonize" rasiert alle äußeren Pixel eines Objekts ab, bis nur noch eine zusammenhängende zentrale Linie übrig bleibt ({numref}`fig-outline_fill_skeleton`C).
es: {menuselection}`Process --&gt; Binary --&gt; Skeletonize` recorta todos los píxeles exteriores de un objeto hasta que sólo quede una línea central conectada ({numref}`fig-outline_fill_skeleton`C).
pt_br: {menuselection}`Process --> Binary --> Skeletonize` elimina todos os pixels externos de um objeto até que apenas uma linha central conectada permaneça ({numref} `fig-outline_fill_skeleton`C).

source: Analyzing skeletons
de: Analyse der Skelette
es: Análisis de esqueletos
pt_br: Analisando esqueletos

source: If you are analyzing linear structures (e.g. blood vessels, neurons), then this command or those in Fiji's {menuselection}`Plugins --> Skeleton -->` submenu may be helpful.
de: Wenn Sie lineare Strukturen (z.B. Blutgefäße, Neuronen) analysieren, dann kann dieser Befehl oder die Befehle im Untermenü "Plugins --&gt; Skelett --&gt;" von Fiji {menuselection} hilfreich sein.
es: Si está analizando estructuras lineales (por ejemplo, vasos sanguíneos, neuronas), entonces este comando o los del submenú `Plugins --&gt; Skeleton --&gt;` de Fiji {menuselection} pueden ser útiles.
pt_br: Se você estiver analisando estruturas lineares (por exemplo, vasos sanguíneos, neurônios), então este comando ou aqueles no submenu {menuselection}`Plugins --> Skeleton -->` de Fiji podem ser úteis.

source: The effects of the {menuselection}`Outline`, {menuselection}`Fill holes` and {menuselection}`Skeletonize` commands.
de: Die Auswirkungen der Befehle {menuselection}`Outline`, {menuselection}`Fill holes` und {menuselection}`Skeletonize`.
es: Los efectos de los comandos {menuselection}`Outline`, {menuselection}`Fill holes` y {menuselection}`Skeletonize`.
pt_br: Os efeitos do {menuselection}`Contorno`, {menuselection}`Preencher buracos` e {menuselection} comandos `Esqueletizar`.

source: Question
de: Frage
es: Pregunta
pt_br: Pergunta

source: The outline of an object in a binary image can also be determined by applying one other morphological operation to a duplicate of the image, and then using the {menuselection}`Image Calculator`. How?
de: Der Umriss eines Objekts in einem Binärbild kann auch bestimmt werden, indem man eine andere morphologische Operation auf ein Duplikat des Bildes anwendet und dann den {menuselection}`Image Calculator` benutzt. Wie geht das?
es: El contorno de un objeto en una imagen binaria también puede determinarse aplicando otra operación morfológica a un duplicado de la imagen y utilizando después la `Image Calculator` de {menuselection}. ¿Cómo?
pt_br: O contorno de um objeto em uma imagem binária também pode ser determinado aplicando outra operação morfológica a uma duplicata da imagem e, em seguida, usando a {menuselection}`Calculadora de imagem`. Como?

source: Answer
de: Antwort
es: Respuesta
pt_br: Responder

source: To outline the objects in a binary image, you can simply calculate the difference between the original image and an eroded (or dilated, if you want the pixels just beyond the objects) duplicate of the image.
de: Um die Objekte in einem Binärbild zu umreißen, können Sie einfach die Differenz zwischen dem Originalbild und einem erodierten (oder dilatierten, wenn Sie die Pixel direkt hinter den Objekten haben wollen) Duplikat des Bildes berechnen.
es: Para contornear los objetos de una imagen binaria, basta con calcular la diferencia entre la imagen original y un duplicado erosionado (o dilatado, si se quieren los píxeles situados justo más allá de los objetos) de la imagen.
pt_br: Para delinear os objetos em uma imagem binária, você pode simplesmente calcular a diferença entre a imagem original e uma duplicata erodida (ou dilatada, se desejar os pixels logo além dos objetos) da imagem.

source: Other morphological operations
de: Andere morphologische Operationen
es: Otras operaciones morfológicas
pt_br: Outras operações morfológicas

source: ImageJ doesn't contain an implementation of morphological reconstruction, and therefore doesn't support all the extra operations that derive from it.
de: ImageJ enthält keine Implementierung der morphologischen Rekonstruktion und unterstützt daher nicht alle zusätzlichen Operationen, die sich daraus ableiten.
es: ImageJ no contiene una implementación de la reconstrucción morfológica y, por lo tanto, no admite todas las operaciones adicionales que se derivan de ella.
pt_br: ImageJ não contém uma implementação de reconstrução morfológica e, portanto, não suporta todas as operações extras que dele derivam.

source: However, there's an extremely library called [**MorphoLibJ**](https://imagej.net/plugins/morpholibj) that can be added to ImageJ or Fiji, which contains morphological reconstruction and much more.
de: Es gibt jedoch eine hervorragende Bibliothek namens [**MorphoLibJ**] (https://imagej.net/plugins/morpholibj), die zu ImageJ oder Fiji hinzugefügt werden kann und die morphologische Rekonstruktion und vieles mehr enthält.
es: Sin embargo, existe una biblioteca llamada [**MorphoLibJ**](https://imagej.net/plugins/morpholibj) que puede añadirse a ImageJ o Fiji, que contiene reconstrucción morfológica y mucho más.
pt_br: No entanto, existe uma biblioteca extremamente chamada [**MorphoLibJ**](https://imagej.net/plugins/morpholibj) que pode ser adicionada ao ImageJ ou Fiji, que contém reconstrução morfológica e muito mais.

source: Check out the excellent documentation at https://imagej.net/plugins/morpholibj for more details.
de: Weitere Informationen finden Sie in der hervorragenden Dokumentation unter https://imagej.net/plugins/morpholibj.
es: Consulte la excelente documentación en https://imagej.net/plugins/morpholibj para más detalles.
pt_br: Confira a excelente documentação em https://imagej.net/plugins/morpholibj para mais detalhes.
