Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/5-morph/morph.po
Languages: es, pt_br

source: As before, opening alone removes structures that are smaller than the structuring element, while slightly affecting the shapes of everything else. Opening by reconstruction essentially adds some further (constrained) dilations so that the structures that were *not* removed are more similar to how they were originally. This can make opening by reconstruction more attractive for generating background images that will be used for subtraction.
es: Como antes, la apertura por sí sola elimina estructuras que son más pequeñas que el elemento estructurante, mientras afecta ligeramente las formas de todo lo demás. La apertura por reconstrucción esencialmente agrega algunas dilataciones adicionales (restringidas) para que las estructuras que *no* fueron eliminadas sean más similares a como eran originalmente. Esto puede hacer que la apertura por reconstrucción sea más atractiva para generar imágenes de fondo que se utilizarán para la resta.
pt_br: Como antes, a abertura por si só remove estruturas menores que o elemento estruturante, ao mesmo tempo que afeta ligeiramente as formas de todo o resto. A abertura por reconstrução essencialmente adiciona algumas dilatações adicionais (restringidas), de modo que as estruturas que *não* foram removidas sejam mais semelhantes ao que eram originalmente. Isso pode tornar a abertura por reconstrução mais atrativa para a geração de imagens de fundo que serão utilizadas para subtração.

source: Opening by reconstruction can also be applied to binary images as an alternative to *opening* and *area opening*. Like area opening, opening by reconstruction is able to remove some objects while retaining the shapes of larger objects exactly.
es: La apertura por reconstrucción también se puede aplicar a imágenes binarias como una alternativa a la *apertura* y la *apertura de área*. Al igual que la apertura de área, la apertura por reconstrucción puede eliminar algunos objetos manteniendo exactamente las formas de objetos más grandes.
pt_br: A abertura por reconstrução também pode ser aplicada a imagens binárias como uma alternativa à *abertura* e à *abertura de área*. Assim como a abertura de área, a abertura por reconstrução é capaz de remover alguns objetos, mantendo exatamente as formas de objetos maiores.

source: Using opening by reconstruction to remove small (and thin) objects from a binary image, while retaining the original shape of everything that remains.
es: Utilizar la apertura por reconstrucción para eliminar objetos pequeños (y delgados) de una imagen binaria, conservando al mismo tiempo la forma original de todo lo que queda.
pt_br: Utilizar a abertura por reconstrução para remover objetos pequenos (e finos) de uma imagem binária, mantendo a forma original de tudo o que resta.
