Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/5-morph/morph.po
Languages: es, pt_br

source: Identifying local maxima with the help of a larger dilation (here, 7×7 pixels) can sometimes give better results than using a smaller dilation {numref}`fig-morph_simple_maxima`.
es: Identificar máximos locales con la ayuda de una dilatación mayor (aquí, 7 × 7 píxeles) a veces puede dar mejores resultados que usar una dilatación más pequeña {numref}`fig-morph_simple_maxima`.
pt_br: Identificar máximos locais com a ajuda de uma dilatação maior (aqui, 7×7 pixels) às vezes pode dar melhores resultados do que usar uma dilatação menor {numref}`fig-morph_simple_maxima`.

source: More morphological operations
es: Más operaciones morfológicas
pt_br: Mais operações morfológicas

source: Area opening
es: Apertura de área
pt_br: Abertura de área

source: **Area opening** is similar to *opening*, except it avoids the need for any kind of maximum or minimum filtering.
es: **Apertura de área** es similar a *apertura*, excepto que evita la necesidad de cualquier tipo de filtrado máximo o mínimo.
pt_br: **Abertura de área** é semelhante à *abertura*, exceto que evita a necessidade de qualquer tipo de filtragem máxima ou mínima.

source: It works by identifying [**connected components** in the binary image](sec_binary_labeled), which are contiguous regions of foreground pixels. For each connected component, the number of pixels is counted to give an area in px². If the area of a component falls below a specified area threshold, the pixels for that component are set to the background, i.e. the component is removed.
es: Funciona identificando [**componentes conectados** en la imagen binaria](sec_binary_labeled), que son regiones contiguas de píxeles de primer plano. Para cada componente conectado, se cuenta el número de píxeles para obtener un área en px². Si el área de un componente cae por debajo de un umbral de área específico, los píxeles de ese componente se colocan en el fondo, es decir, el componente se elimina.
pt_br: Ele funciona identificando [**componentes conectados** na imagem binária](sec_binary_labeled), que são regiões contíguas de pixels de primeiro plano. Para cada componente conectado, o número de pixels é contado para fornecer uma área em px². Se a área de um componente cair abaixo de um limite de área especificado, os pixels desse componente serão colocados no plano de fundo, ou seja, o componente será removido.

source: *Area opening* is often preferable to *opening*, because it has *no impact* on the shape of any structures larger than the area threshold. It simply applies a minimum area threshold, removing everything smaller.
es: La *apertura del área* es a menudo preferible a la *apertura*, porque *no tiene ningún impacto* en la forma de cualquier estructura mayor que el umbral del área. Simplemente aplica un umbral de área mínimo, eliminando todo lo más pequeño.
pt_br: A *abertura de área* é muitas vezes preferível à *abertura*, porque não tem *nenhum impacto* na forma de quaisquer estruturas maiores que o limite da área. Ele simplesmente aplica um limite mínimo de área, removendo tudo que for menor.

source: Using area opening to remove small objects.
es: Utilizar la apertura del área para retirar objetos pequeños.
pt_br: Usando a abertura da área para remover pequenos objetos.

source: Filling holes
es: Relleno de agujeros
pt_br: Preenchendo buracos

source: **Filling holes** involves identifying connected components of *background pixels* that are entirely surrounded by foreground pixels. These components are then 'flipped' to become foreground pixels instead.
es: **Rellenar huecos** implica identificar componentes conectados de *píxeles de fondo* que están completamente rodeados por píxeles de primer plano. Luego, estos componentes se "invierten" para convertirse en píxeles de primer plano.
pt_br: **Preencher lacunas** envolve a identificação de componentes conectados de *pixels de fundo* que estão inteiramente cercados por pixels de primeiro plano. Esses componentes são então 'invertidos' para se tornarem pixels de primeiro plano.

source: Should we then want to identify the holes themselves, we can subtract the original image from the filled image.
es: Si luego queremos identificar los agujeros, podemos restar la imagen original de la imagen rellena.
pt_br: Se quisermos então identificar os próprios buracos, podemos subtrair a imagem original da imagem preenchida.

source: Filling holes in a binary image. Image subtraction makes it possible to extract the holes themselves.
es: Rellenar agujeros en una imagen binaria. La sustracción de imágenes permite extraer los propios agujeros.
pt_br: Preenchendo buracos em uma imagem binária. A subtração de imagens permite extrair os próprios furos.

source: Small holes filled.
es: Pequeños agujeros llenos.
pt_br: Pequenos buracos preenchidos.

source: Question
es: Pregunta
pt_br: Pergunta

source: We don't always want to fill *all* the holes within a binary image, but rather only the smaller ones. Can you think of a way to fill *only holes smaller than 1000 px²*, using area opening?
es: No siempre queremos llenar *todos* los huecos dentro de una imagen binaria, sino sólo los más pequeños. ¿Se te ocurre una forma de rellenar *sólo agujeros de menos de 1000 px²*, utilizando la apertura de área?
pt_br: Nem sempre queremos preencher *todos* os buracos em uma imagem binária, mas apenas os menores. Você consegue pensar em uma maneira de preencher *apenas buracos menores que 1000 px²*, usando abertura de área?

source: You'll need at least one operation described in previous chapter.
es: Necesitará al menos una operación descrita en el capítulo anterior.
pt_br: Você precisará de pelo menos uma operação descrita no capítulo anterior.

source: Answer
es: Respuesta
pt_br: Responder

source: One way to fill holes below a fixed size:
es: Una forma de rellenar agujeros por debajo de un tamaño fijo:
pt_br: Uma maneira de preencher buracos abaixo de um tamanho fixo:

source: Invert the binary image
es: Invertir la imagen binaria
pt_br: Inverta a imagem binária

source: Perform area opening with an area threshold of 1000 px²
es: Realizar apertura de área con un umbral de área de 1000 px²
pt_br: Execute a abertura de área com um limite de área de 1000 px²

source: Invert the result
es: invertir el resultado
pt_br: Inverta o resultado

source: Thinning & skeletonization
es: Adelgazamiento y esqueletización
pt_br: Desbaste e esqueletização

source: **Thinning** and **skeletonization** are related operations that aim to 'thin down' objects in a binary image to just their centerlines. They are particularly useful with filamental or tube-like structures, such as axons or blood vessels.
es: **Adelgazamiento** y **esqueletoización** son operaciones relacionadas que tienen como objetivo "adelgazar" objetos en una imagen binaria solo hasta sus líneas centrales. Son particularmente útiles con estructuras filamentosas o tubulares, como axones o vasos sanguíneos.
pt_br: **Afinamento** e **esqueletização** são operações relacionadas que visam "diminuir" objetos em uma imagem binária apenas até suas linhas centrais. Eles são particularmente úteis com estruturas filamentares ou tubulares, como axônios ou vasos sanguíneos.

source: The effects of thinning and skeletonization on a binary image.
es: Los efectos del adelgazamiento y la esqueletización en una imagen binaria.
pt_br: Os efeitos do desbaste e da esqueletização em uma imagem binária.

source: What's the difference between thinning & skeletonization?
es: ¿Cuál es la diferencia entre adelgazamiento y esqueletización?
pt_br: Qual é a diferença entre desbaste e esqueletização?

source: The truth is: I'm not entirely sure. There is quite a bit of overlap in the literature, and I've seen the same algorithm referred to by both names. Furthermore, there are different thinning algorithms that give different results; the situation is similar for skeletonization algorithms.
es: La verdad es que no estoy del todo seguro. Hay bastante superposición en la literatura y he visto el mismo algoritmo al que se hace referencia con ambos nombres. Además, existen diferentes algoritmos de adelgazamiento que dan diferentes resultados; la situación es similar para los algoritmos de esqueletización.
pt_br: A verdade é: não tenho certeza absoluta. Há bastante sobreposição na literatura e vi o mesmo algoritmo referido por ambos os nomes. Além disso, existem diferentes algoritmos de desbaste que fornecem resultados diferentes; a situação é semelhante para algoritmos de esqueletização.

source: Software occasionally offers both thinning and skeletonization, but often just offers one or the other. It's worth trying any thinning/skeletonization methods available to see which performs best for any particular application.
es: En ocasiones, el software ofrece tanto adelgazamiento como esqueletización, pero a menudo sólo ofrece uno u otro. Vale la pena probar cualquier método de adelgazamiento/esqueleto disponible para ver cuál funciona mejor para una aplicación en particular.
pt_br: Ocasionalmente, o software oferece desbaste e esqueletização, mas muitas vezes oferece apenas um ou outro. Vale a pena tentar qualquer método de desbaste/esqueletização disponível para ver qual funciona melhor para qualquer aplicação específica.

source: Morphological reconstruction
es: Reconstrucción morfológica
pt_br: Reconstrução morfológica

source: **Morphological reconstruction** is a somewhat advanced technique that underpins several powerful image processing operations. It's useful with both grayscale and binary images.
es: **La reconstrucción morfológica** es una técnica algo avanzada que sustenta varias operaciones poderosas de procesamiento de imágenes. Es útil tanto con imágenes binarias como en escala de grises.
pt_br: A **reconstrução morfológica** é uma técnica um tanto avançada que sustenta várias operações poderosas de processamento de imagens. É útil com imagens em tons de cinza e binárias.

source: Morphological reconstruction requires two images of the same size: a **marker** image and a **mask** image. The pixel in the *mask* image should all have values greater than or equal to the corresponding pixels in the *marker* image.
es: La reconstrucción morfológica requiere dos imágenes del mismo tamaño: una imagen de **marcador** y una imagen de **máscara**. Todos los píxeles de la imagen de *máscara* deben tener valores mayores o iguales a los píxeles correspondientes de la imagen de *marcador*.
pt_br: A reconstrução morfológica requer duas imagens do mesmo tamanho: uma imagem de **marcador** e uma imagem de **máscara**. Todos os pixels na imagem *máscara* devem ter valores maiores ou iguais aos pixels correspondentes na imagem *marcador*.

source: The reconstruction algorithm progressively *dilates* the marker image (e.g. applies a 3×3 maximum filter), while constraining the marker to remain 'within' the mask; that is, the pixel values in the marker are never allowed to exceed the values in the mask. This dilation is repeated iteratively until the marker cannot change any further without exceeding the mask. The output is the new marker image, after all the dilations have been performed.
es: El algoritmo de reconstrucción *dilata* progresivamente la imagen del marcador (por ejemplo, aplica un filtro máximo de 3 × 3), mientras restringe el marcador para que permanezca "dentro" de la máscara; es decir, nunca se permite que los valores de píxeles del marcador excedan los valores de la máscara. Esta dilatación se repite iterativamente hasta que el marcador no puede cambiar más sin exceder la máscara. El resultado es la nueva imagen del marcador, después de que se hayan realizado todas las dilataciones.
pt_br: O algoritmo de reconstrução *dilata* progressivamente a imagem do marcador (por exemplo, aplica um filtro máximo de 3×3), enquanto restringe o marcador a permanecer “dentro” da máscara; isto é, os valores de pixel no marcador nunca podem exceder os valores na máscara. Esta dilatação é repetida iterativamente até que o marcador não possa mais mudar sem exceder a máscara. A saída é a nova imagem do marcador, após todas as dilatações terem sido realizadas.

source: Some examples will help demonstrate how this works and why it's useful. The crucial difference in the methods below is how the marker and mask images are created.
es: Algunos ejemplos ayudarán a demostrar cómo funciona esto y por qué es útil. La diferencia crucial en los métodos siguientes es cómo se crean las imágenes de marcador y máscara.
pt_br: Alguns exemplos ajudarão a demonstrar como isso funciona e por que é útil. A diferença crucial nos métodos abaixo é como as imagens do marcador e da máscara são criadas.

source: Hysteresis thresholding
es: Umbral de histéresis
pt_br: Limiar de histerese

source: One use of morphological reconstruction is to implement a **double threshold**, also known as **hysteresis thresholding**.
es: Un uso de la reconstrucción morfológica es implementar un **umbral doble**, también conocido como **umbral de histéresis**.
pt_br: Um uso da reconstrução morfológica é implementar um **limiar duplo**, também conhecido como **limiar de histerese**.

source: For *low threshold* and *high threshold*, I assume we're detecting light structures on a dark background.
es: Para *umbral bajo* y *umbral alto*, supongo que estamos detectando estructuras claras sobre un fondo oscuro.
pt_br: Para *limiar baixo* e *limiar alto*, presumo que estamos detectando estruturas claras em um fundo escuro.

source: This involves defining both a **low threshold** and a **high threshold.** The low threshold operates like any [global threshold](chap_thresholding) to identify regions. However, a region is discarded from the binary image if it does not also contain at least one pixel that exceeds the high threshold.
es: Esto implica definir un **umbral bajo** y un **umbral alto.** El umbral bajo funciona como cualquier [umbral global](chap_thresholding) para identificar regiones. Sin embargo, una región se descarta de la imagen binaria si no contiene también al menos un píxel que supere el umbral alto.
pt_br: Isso envolve definir um **limiar baixo** e um **limiar alto.** O limite baixo funciona como qualquer [limiar global](chap_thresholding) para identificar regiões. Entretanto, uma região é descartada da imagem binária se ela também não contiver pelo menos um pixel que exceda o limite alto.

source: This is achieved using morphological reconstruction by defining the *marker* as all pixels exceeding the high threshold, and the *mask* as all pixels exceeding the low threshold. The markers will expand to fill the mask regions that contain them. But any mask regions that don't contain marker pixels are simply ignored.
es: Esto se logra mediante la reconstrucción morfológica definiendo el *marcador* como todos los píxeles que exceden el umbral alto y la *máscara* como todos los píxeles que exceden el umbral bajo. Los marcadores se expandirán para llenar las regiones de máscara que los contienen. Pero cualquier región de máscara que no contenga píxeles marcadores simplemente se ignora.
pt_br: Isto é conseguido usando a reconstrução morfológica, definindo o *marcador* como todos os pixels que excedem o limite alto, e a *máscara* como todos os pixels que excedem o limite baixo. Os marcadores serão expandidos para preencher as regiões da máscara que os contêm. Mas quaisquer regiões de máscara que não contenham pixels marcadores são simplesmente ignoradas.

source: Applying a hysteresis threshold to an image. The size and area of the objects detected by this method are determined by the low threshold, but at least one of the pixel values within the object must exceed the high threshold. This slightly mitigates the problem of a single global threshold having [a huge impact on analysis results](chap_thresholding), by the same threshold simultaneously influencing both what is detected and its size.
es: Aplicar un umbral de histéresis a una imagen. El tamaño y el área de los objetos detectados por este método están determinados por el umbral bajo, pero al menos uno de los valores de píxel dentro del objeto debe exceder el umbral alto. Esto mitiga ligeramente el problema de que un único umbral global tenga [un gran impacto en los resultados del análisis] (chap_thresholding), ya que el mismo umbral influye simultáneamente tanto en lo que se detecta como en su tamaño.
pt_br: Aplicando um limite de histerese a uma imagem. O tamanho e a área dos objetos detectados por este método são determinados pelo limite baixo, mas pelo menos um dos valores de pixel dentro do objeto deve exceder o limite alto. Isto atenua ligeiramente o problema de um único limite global ter [um enorme impacto nos resultados da análise] (chap_thresholding), pois o mesmo limite influencia simultaneamente tanto o que é detectado como o seu tamanho.

source: H-Maxima & H-Minima
es: H-Máxima y H-Mínima
pt_br: H-Máximo e H-Mínimo

source: We [saw previously](fig-morph_simple_maxima) that we could (kind of) identify local maxima in a very simple way using an image dilation, but the results are often too inaccurate to be useful.
es: [Vimos anteriormente](fig-morph_simple_maxima) que podríamos (más o menos) identificar máximos locales de una manera muy simple usando una dilatación de imagen, pero los resultados a menudo son demasiado inexactos para ser útiles.
pt_br: Nós [vimos anteriormente](fig-morph_simple_maxima) que poderíamos (mais ou menos) identificar os máximos locais de uma maneira muito simples usando uma dilatação de imagem, mas os resultados geralmente são muito imprecisos para serem úteis.

source: **H-Maxima** and **H-Minima** can help us overcome this. These operations both require only one intuitive parameter: they enable us to identify maxima or minima using a local intensity threshold *H*.
es: **H-Maxima** y **H-Minima** pueden ayudarnos a superar esto. Ambas operaciones requieren solo un parámetro intuitivo: nos permiten identificar máximos o mínimos utilizando un umbral de intensidad local *H*.
pt_br: **H-Maxima** e **H-Minima** podem nos ajudar a superar isso. Ambas as operações requerem apenas um parâmetro intuitivo: elas nos permitem identificar máximos ou mínimos usando um limite de intensidade local *H*.

source: This is achieved using morphological reconstruction. For H-maxima, the process is:
es: Esto se logra mediante la reconstrucción morfológica. Para H-maxima, el proceso es:
pt_br: Isto é conseguido através da reconstrução morfológica. Para H-máximos, o processo é:

source: Set the original grayscale image as the *mask*
es: Establece la imagen original en escala de grises como *máscara*
pt_br: Defina a imagem original em tons de cinza como a *máscara*

source: Subtract *H* from the mask to create the *markers*
es: Resta *H* de la máscara para crear los *marcadores*
pt_br: Subtraia *H* da máscara para criar os *marcadores*

source: Apply morphological reconstruction using the markers and mask
es: Aplicar reconstrucción morfológica utilizando los marcadores y la máscara.
pt_br: Aplique a reconstrução morfológica usando os marcadores e a máscara

source: Subtract the reconstruction result from the *mask*
es: Resta el resultado de la reconstrucción de la *máscara*
pt_br: Subtraia o resultado da reconstrução da *máscara*

source: Threshold the subtracted image with a global threshold of *H*
es: Umbral de la imagen sustraída con un umbral global de *H*
pt_br: Limite a imagem subtraída com um limite global de *H*

source: The main steps are illustrated in {numref}`fig-morph_h_maxima`. We can apply the same process to an inverted image to find *H-minima*.
es: Los pasos principales se ilustran en {numref}`fig-morph_h_maxima`. Podemos aplicar el mismo proceso a una imagen invertida para encontrar *H-mínimo*.
pt_br: As etapas principais são ilustradas em {numref}`fig-morph_h_maxima`. Podemos aplicar o mesmo processo a uma imagem invertida para encontrar *H-mínimos*.

source: Calculating H-maxima using morphological reconstruction. Here, *H* is set (arbitrarily) to be the image standard deviation.
es: Cálculo de H-máximos mediante reconstrucción morfológica. Aquí, *H* se establece (arbitrariamente) como la desviación estándar de la imagen.
pt_br: Cálculo de H-máximos usando reconstrução morfológica. Aqui, *H* é definido (arbitrariamente) como o desvio padrão da imagem.

source: Opening & closing by reconstruction
es: Apertura y cierre por reconstrucción.
pt_br: Abertura e fechamento por reconstrução

source: H-maxima and H-minima use morphological reconstruction to effectively generate a background image that can be subtracted from the original. We do this by subtracting a constant *H*, which acts as a local intensity threshold.
es: H-maxima y H-minima utilizan la reconstrucción morfológica para generar eficazmente una imagen de fondo que se puede restar del original. Hacemos esto restando una constante *H*, que actúa como un umbral de intensidad local.
pt_br: H-máximos e H-mínimos usam reconstrução morfológica para gerar efetivamente uma imagem de fundo que pode ser subtraída do original. Fazemos isso subtraindo uma constante *H*, que atua como um limite de intensidade local.

source: We can also use morphological reconstruction to generate a background image based upon spatial information, rather than an intensity threshold *H*, by using **opening by reconstruction**. This effectively introduces a size component into our local threshold. **Closing by reconstruction** is an analogous operation that can be defined using morphological closing.
es: También podemos usar la reconstrucción morfológica para generar una imagen de fondo basada en información espacial, en lugar de un umbral de intensidad *H*, usando **apertura por reconstrucción**. Esto efectivamente introduce un componente de tamaño en nuestro umbral local. **El cierre por reconstrucción** es una operación análoga que se puede definir mediante el cierre morfológico.
pt_br: Também podemos usar a reconstrução morfológica para gerar uma imagem de fundo baseada em informações espaciais, em vez de um limite de intensidade *H*, usando **abertura por reconstrução**. Isso efetivamente introduz um componente de tamanho em nosso limite local. **Fecho por reconstrução** é uma operação análoga que pode ser definida por meio do fechamento morfológico.

source: The starting point for opening by reconstruction is a *morphological opening* [as defined above](sec_morph_opening_closing), i.e. an erosion followed by a dilation. This defines the marker image. The original image is used as the mask.
es: El punto de partida para la apertura por reconstrucción es una *apertura morfológica* [como se define anteriormente] (sec_morph_opening_closing), es decir, una erosión seguida de una dilatación. Esto define la imagen del marcador. La imagen original se utiliza como máscara.
pt_br: O ponto de partida para a abertura por reconstrução é uma *abertura morfológica* [conforme definido acima](sec_morph_opening_closing), ou seja, uma erosão seguida por uma dilatação. Isso define a imagem do marcador. A imagem original é usada como máscara.

source: Using opening by reconstruction to obtain a background estimate. The estimate can be subtracted from an image before applying a global threshold.
es: Utilizar apertura por reconstrucción para obtener una estimación de fondo. La estimación se puede restar de una imagen antes de aplicar un umbral global.
pt_br: Usando abertura por reconstrução para obter uma estimativa de fundo. A estimativa pode ser subtraída de uma imagem antes de aplicar um limite global.
