Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/5-morph/morph.po
Languages: es, pt_br

source: Default Caption
es: Título predeterminado
pt_br: Legenda padrão

source: Morphological operations
es: Operaciones morfológicas
pt_br: Operações morfológicas

source: Chapter outline
es: Bosquejo del capítulo
pt_br: Esboço do capítulo

source: **Morphological operations** can be used to refine or modify the shapes of objects in images
es: **Las operaciones morfológicas** se pueden utilizar para refinar o modificar las formas de los objetos en las imágenes.
pt_br: **Operações morfológicas** podem ser usadas para refinar ou modificar as formas de objetos em imagens

source: Many morphological operations can be applied to **binary images** to improve an image segmentation
es: Se pueden aplicar muchas operaciones morfológicas a **imágenes binarias** para mejorar la segmentación de una imagen.
pt_br: Muitas operações morfológicas podem ser aplicadas a **imagens binárias** para melhorar a segmentação de uma imagem

source: **Grayscale morphological operations** can also be used as processing steps before binarization, or to help identify regional maxima and minima
es: **Las operaciones morfológicas en escala de grises** también se pueden utilizar como pasos de procesamiento antes de la binarización o para ayudar a identificar máximos y mínimos regionales.
pt_br: **Operações morfológicas em escala de cinza** também podem ser usadas como etapas de processamento antes da binarização ou para ajudar a identificar máximos e mínimos regionais

source: Introduction
es: Introducción
pt_br: Introdução

source: Image filters and thresholds enable us to detect structures of various shapes and sizes for different applications. Nevertheless, despite our best efforts, the binary images produced by our thresholds often still contain inaccurate or undesirable detected regions. They could benefit from some extra cleaning up.
es: Los filtros y umbrales de imagen nos permiten detectar estructuras de diversas formas y tamaños para diferentes aplicaciones. Sin embargo, a pesar de nuestros mejores esfuerzos, las imágenes binarias producidas por nuestros umbrales a menudo todavía contienen regiones detectadas inexactas o indeseables. Podrían beneficiarse de una limpieza adicional.
pt_br: Filtros e limites de imagem nos permitem detectar estruturas de vários formatos e tamanhos para diferentes aplicações. No entanto, apesar dos nossos melhores esforços, as imagens binárias produzidas pelos nossos limites muitas vezes ainda contêm regiões detectadas imprecisas ou indesejáveis. Eles poderiam se beneficiar de alguma limpeza extra.

source: At this stage, we are primarily working with shapes -- morphology -- so most of the techniques we describe here are often called **morphological operations**.
es: En esta etapa, estamos trabajando principalmente con formas (morfología), por lo que la mayoría de las técnicas que describimos aquí a menudo se denominan **operaciones morfológicas**.
pt_br: Neste estágio, estamos trabalhando principalmente com formas – morfologia – então a maioria das técnicas que descrevemos aqui são frequentemente chamadas de **operações morfológicas**.

source: Morphological operations using rank filters
es: Operaciones morfológicas utilizando filtros de clasificación.
pt_br: Operações morfológicas usando filtros de classificação

source: Overview of erosion, dilation, opening and closing. The original image is shown at the top, while the processed part is at the bottom in each case.
es: Panorama general de la erosión, dilatación, apertura y cierre. La imagen original se muestra en la parte superior, mientras que la parte procesada se muestra en la parte inferior en cada caso.
pt_br: Visão geral da erosão, dilatação, abertura e fechamento. A imagem original é mostrada na parte superior, enquanto a parte processada está na parte inferior em cada caso.

source: Erosion & dilation
es: Erosión y dilatación
pt_br: Erosão e dilatação

source: Our first two morphological operations, **erosion** and **dilation**, are actually identical to minimum and maximum filtering respectively, described [in the previous chapter](sec_filters_rank). The names erosion and dilation are used more often when speaking of binary images, but the operations are the same irrespective of the kind of image.
es: Nuestras dos primeras operaciones morfológicas, **erosión** y **dilatación**, son en realidad idénticas al filtrado mínimo y máximo respectivamente, descrito [en el capítulo anterior](sec_filters_rank). Los nombres erosión y dilatación se utilizan con más frecuencia cuando se habla de imágenes binarias, pero las operaciones son las mismas independientemente del tipo de imagen.
pt_br: Nossas duas primeiras operações morfológicas, **erosão** e **dilatação**, são na verdade idênticas à filtragem mínima e máxima respectivamente, descritas [no capítulo anterior](sec_filters_rank). Os nomes erosão e dilatação são usados com mais frequência quando se fala de imagens binárias, mas as operações são as mesmas, independentemente do tipo de imagem.

source: Structuring elements
es: Elementos estructurantes
pt_br: Elementos estruturantes

source: The neighborhood used to calculate the result for each pixel is defined by a **structuring element**. This is similar to a [filter kernel](sec_filters_linear), except that it only has values 0 and 1 (for ignoring or including the neighborhood pixel, respectively).
es: La vecindad utilizada para calcular el resultado de cada píxel se define mediante un **elemento estructurante**. Esto es similar a un [núcleo de filtro](sec_filters_linear), excepto que solo tiene valores 0 y 1 (para ignorar o incluir el píxel vecino, respectivamente).
pt_br: A vizinhança utilizada para calcular o resultado de cada pixel é definida por um **elemento estruturante**. Isso é semelhante a um [filter kernel](sec_filters_linear), exceto que possui apenas valores 0 e 1 (para ignorar ou incluir o pixel da vizinhança, respectivamente).

source: Here, we assume the background value in our binary image is 0 (black) and foreground is 1 (white).
es: Aquí, asumimos que el valor de fondo en nuestra imagen binaria es 0 (negro) y el valor de primer plano es 1 (blanco).
pt_br: Aqui, assumimos que o valor do plano de fundo em nossa imagem binária é 0 (preto) e o valor do primeiro plano é 1 (branco).

source: **Erosion** will make objects in the binary image smaller, because a pixel will be set to the background value if _any_ other pixels in the neighborhood are background. This can split single objects into multiple pieces.
es: **La erosión** hará que los objetos en la imagen binaria sean más pequeños, porque un píxel se establecerá en el valor de fondo si _cualquier_ otro píxel en el vecindario está en el fondo. Esto puede dividir objetos individuales en varias partes.
pt_br: **Erosão** tornará os objetos na imagem binária menores, porque um pixel será definido como o valor de fundo se _quaisquer_ outros pixels na vizinhança forem de fundo. Isso pode dividir objetos únicos em várias partes.

source: Conversely, **dilation** makes objects bigger, since the presence of a single foreground pixel anywhere in the neighborhood will result in a foreground output. This can also cause objects to merge.
es: Por el contrario, la **dilatación** hace que los objetos sean más grandes, ya que la presencia de un solo píxel en primer plano en cualquier lugar del vecindario dará como resultado una salida en primer plano. Esto también puede hacer que los objetos se fusionen.
pt_br: Por outro lado, a **dilatação** torna os objetos maiores, já que a presença de um único pixel de primeiro plano em qualquer lugar da vizinhança resultará em uma saída de primeiro plano. Isso também pode fazer com que os objetos sejam mesclados.

source: The effects of erosion and dilation on a binary image of small structures.
es: Los efectos de la erosión y la dilatación en una imagen binaria de estructuras pequeñas.
pt_br: Os efeitos da erosão e dilatação em uma imagem binária de pequenas estruturas.

source: Opening & closing
es: Apertura y cierre
pt_br: Abertura e fechamento

source: The fact that erosion and dilation alone affect sizes can be a problem: we may like their abilities to merge, separate or remove objects, but prefer that they had less impact upon areas and volumes. Combining both operations helps achieve this.
es: El hecho de que la erosión y la dilatación por sí solas afecten los tamaños puede ser un problema: puede que nos gusten sus capacidades para fusionar, separar o eliminar objetos, pero preferimos que tengan menos impacto sobre áreas y volúmenes. Combinar ambas operaciones ayuda a lograrlo.
pt_br: O facto de a erosão e a dilatação por si só afectarem os tamanhos pode ser um problema: podemos gostar da sua capacidade de fundir, separar ou remover objectos, mas preferimos que tenham menos impacto sobre áreas e volumes. Combinar as duas operações ajuda a conseguir isso.

source: **Opening** consists of an erosion followed by a dilation. It therefore first shrinks objects, and then expands whatever remains to _approximately_ its original size.
es: **Apertura** consiste en una erosión seguida de una dilatación. Por lo tanto, primero reduce los objetos y luego expande lo que queda hasta aproximadamente su tamaño original.
pt_br: **Abertura** consiste em uma erosão seguida de uma dilatação. Portanto, primeiro reduz os objetos e depois expande o que resta até _aproximadamente_ seu tamanho original.

source: Such a process is not as pointless as it may first sound. If erosion causes very small objects to completely disappear, clearly the dilation cannot make them reappear: they are gone for good. Barely-connected objects separated by erosion are also not reconnected by the dilation step.
es: Un proceso así no es tan inútil como podría parecer a primera vista. Si la erosión hace que objetos muy pequeños desaparezcan por completo, es evidente que la dilatación no puede hacerlos reaparecer: han desaparecido para siempre. Los objetos apenas conectados y separados por la erosión tampoco se vuelven a conectar mediante el paso de dilatación.
pt_br: Tal processo não é tão inútil como pode parecer à primeira vista. Se a erosão faz com que objetos muito pequenos desapareçam completamente, é evidente que a dilatação não pode fazê-los reaparecer: eles desaparecem para sempre. Objetos mal conectados separados pela erosão também não são reconectados pela etapa de dilatação.

source: **Closing** is the opposite of opening, i.e. a dilation followed by an erosion, and similarly changes the shapes of objects. The dilation can cause almost-connected objects to merge, and these often then remain merged after the erosion step. If you wish to count objects, but they are wrongly subdivided in the segmentation, closing may help make the counts more accurate.
es: **Cerrar** es lo opuesto a abrir, es decir, una dilatación seguida de una erosión, y de manera similar cambia las formas de los objetos. La dilatación puede provocar que objetos casi conectados se fusionen y, a menudo, estos permanecen fusionados después del paso de erosión. Si desea contar objetos, pero están mal subdivididos en la segmentación, cerrar puede ayudar a que los recuentos sean más precisos.
pt_br: **Fechar** é o oposto de abrir, ou seja, uma dilatação seguida de uma erosão, e da mesma forma altera as formas dos objetos. A dilatação pode fazer com que objetos quase conectados se fundam, e estes muitas vezes permanecem mesclados após a etapa de erosão. Se você deseja contar objetos, mas eles estão subdivididos incorretamente na segmentação, o fechamento pode ajudar a tornar a contagem mais precisa.

source: The effects of opening and closing on a binary image of small structures. Unlike when using erosion or dilation alone, the sizes of objects are largely preserved although the contours are modified. Opening has the effect of completely removing the smallest or thinnest objects.
es: Los efectos de apertura y cierre en una imagen binaria de pequeñas estructuras. A diferencia de cuando se utiliza únicamente la erosión o la dilatación, los tamaños de los objetos se conservan en gran medida aunque se modifican los contornos. La apertura tiene el efecto de eliminar completamente los objetos más pequeños o delgados.
pt_br: Os efeitos de abertura e fechamento em uma imagem binária de pequenas estruturas. Ao contrário de quando se usa apenas erosão ou dilatação, os tamanhos dos objetos são amplamente preservados, embora os contornos sejam modificados. A abertura tem o efeito de remover completamente os objetos menores ou mais finos.

source: Boundaries & outlines
es: Límites y contornos
pt_br: Limites e contornos

source: We can make use of the operations above to identify outlines in a binary image. To do this, we first need a clear definition of what we mean by 'outline'.
es: Podemos hacer uso de las operaciones anteriores para identificar contornos en una imagen binaria. Para hacer esto, primero necesitamos una definición clara de lo que entendemos por "esquema".
pt_br: Podemos utilizar as operações acima para identificar contornos em uma imagem binária. Para fazer isso, primeiro precisamos de uma definição clara do que queremos dizer com “esboço”.

source: The **inner boundary** may be defined as *the foreground pixels that are adjacent to background pixels*. We can determine the inner boundary by
es: El **límite interior** se puede definir como *los píxeles de primer plano que son adyacentes a los píxeles de fondo*. Podemos determinar el límite interior mediante
pt_br: O **limite interno** pode ser definido como *os pixels de primeiro plano que são adjacentes aos pixels de fundo*. Podemos determinar o limite interno por

source: Duplicating the binary image
es: Duplicar la imagen binaria
pt_br: Duplicando a imagem binária

source: Eroding with a 3×3 structuring element
es: Erosión con elemento estructurante 3×3
pt_br: Erosão com elemento estruturante 3×3

source: Subtracting the eroded image from the original
es: Restando la imagen erosionada del original
pt_br: Subtraindo a imagem erodida do original

source: The **outer boundary** may be defined as *the background pixels that are adjacent to foreground pixels*. We can determine the outer boundary by
es: El **límite exterior** puede definirse como *los píxeles de fondo que son adyacentes a los píxeles de primer plano*. Podemos determinar el límite exterior mediante
pt_br: O **limite externo** pode ser definido como *os pixels de fundo adjacentes aos pixels de primeiro plano*. Podemos determinar o limite externo por

source: Dilating with a 3×3 structuring element
es: Dilatando con un elemento estructurante 3×3
pt_br: Dilatando com elemento estruturante 3×3

source: Subtracting the original image from the dilated image
es: Restando la imagen original de la imagen dilatada
pt_br: Subtraindo a imagem original da imagem dilatada

source: Thicker boundaries
es: Límites más gruesos
pt_br: Limites mais grossos

source: There's no reason to limit outlines to being 1 pixel thick. Choosing a larger structuring element makes it possible create thicker outlines. We might also subtract an eroded image from a dilated image to identify a thicker boundary that contains both inner and outer pixels.
es: No hay razón para limitar los contornos a un grosor de 1 píxel. La elección de un elemento estructurante de mayor tamaño permite crear contornos más gruesos. También podríamos restar una imagen erosionada de una imagen dilatada para identificar un límite más grueso que contenga píxeles tanto internos como externos.
pt_br: Não há razão para limitar os contornos a 1 pixel de espessura. A escolha de um elemento estruturante maior permite criar contornos mais grossos. Também podemos subtrair uma imagem erodida de uma imagem dilatada para identificar um limite mais espesso que contém pixels internos e externos.

source: One application of creating thick boundaries in microscopy images of cells is to generate a binary image of the nuclei, and then a second binary image representing a ring around the nucleus. This makes it possible to make measurements that are likely to be within the cytoplasm, just outside the nucleus, without the task of identifying the full area of the cell -- which is often difficult if the cell or membrane are not clearly visible.
es: Una aplicación de la creación de límites gruesos en imágenes microscópicas de células es generar una imagen binaria de los núcleos y luego una segunda imagen binaria que represente un anillo alrededor del núcleo. Esto hace posible realizar mediciones que probablemente se realicen dentro del citoplasma, justo fuera del núcleo, sin la tarea de identificar el área completa de la célula, lo que a menudo resulta difícil si la célula o la membrana no son claramente visibles.
pt_br: Uma aplicação da criação de limites espessos em imagens microscópicas de células é gerar uma imagem binária dos núcleos e, em seguida, uma segunda imagem binária representando um anel ao redor do núcleo. Isto torna possível fazer medições que provavelmente estarão dentro do citoplasma, logo fora do núcleo, sem a tarefa de identificar toda a área da célula - o que muitas vezes é difícil se a célula ou a membrana não estiverem claramente visíveis.

source: Calculating inner and outer boundaries, using erosion or dilation. The radius of the structuring element can be used to tune the boundary thickness.
es: Calcular límites interiores y exteriores, mediante erosión o dilatación. El radio del elemento estructurante se puede utilizar para ajustar el espesor del límite.
pt_br: Cálculo de limites internos e externos, usando erosão ou dilatação. O raio do elemento estruturante pode ser usado para ajustar a espessura do limite.

source: Finding local minima & maxima
es: Encontrar mínimos y máximos locales
pt_br: Encontrando mínimos e máximos locais

source: Erosion and dilation can be used to find pixels that are **local maxima** or **local minima** very easily, with the caveat that the results are inexact and often unusable. Nevertheless, the trick works 'well enough' sufficiently often to be worth knowing.
es: La erosión y la dilatación se pueden utilizar para encontrar píxeles que son **máximos locales** o **mínimos locales** muy fácilmente, con la salvedad de que los resultados son inexactos y, a menudo, inutilizables. Sin embargo, el truco funciona "lo suficientemente bien" con suficiente frecuencia como para que valga la pena conocerlo.
pt_br: A erosão e a dilatação podem ser usadas para encontrar pixels que são **máximos locais** ou **mínimos locais** com muita facilidade, com a ressalva de que os resultados são inexatos e muitas vezes inutilizáveis. No entanto, o truque funciona “suficientemente bem” com frequência suficiente para valer a pena conhecê-lo.

source: Here, we focus on maxima; the process for detecting local minima is identical, except that either the image should be inverted or erosion used instead of dilation.
es: Aquí nos centramos en los máximos; El proceso para detectar mínimos locales es idéntico, excepto que la imagen debe invertirse o usarse erosión en lugar de dilatación.
pt_br: Aqui, nos concentramos nos máximos; o processo de detecção de mínimos locais é idêntico, exceto que a imagem deve ser invertida ou a erosão usada em vez da dilatação.

source: A local maximum can be defined as a pixel with a value greater than all its neighbors, or a connected group of pixels with the same higher value than the surrounding pixels. An easy way to detect these pixels is to dilate the image with 3×3 maximum filter, and check for pixel values that are unchanged (i.e. where the pixel was already a maximum within its neighborhood).
es: Un máximo local se puede definir como un píxel con un valor mayor que todos sus vecinos, o un grupo conectado de píxeles con el mismo valor mayor que los píxeles circundantes. Una manera fácil de detectar estos píxeles es dilatar la imagen con un filtro máximo de 3×3 y verificar los valores de píxeles que no han cambiado (es decir, donde el píxel ya era un máximo dentro de su vecindad).
pt_br: Um máximo local pode ser definido como um pixel com um valor maior que todos os seus vizinhos, ou um grupo conectado de pixels com o mesmo valor mais alto que os pixels circundantes. Uma maneira fácil de detectar esses pixels é dilatar a imagem com filtro máximo 3×3 e verificar se há valores de pixel inalterados (ou seja, onde o pixel já era máximo dentro de sua vizinhança).

source: This is inexact because it does not *only* identify maxima; it also detections some 'plateaus' where pixels have identical values to their neighbors. In practice, this is not always a problem because noise can make plateaus virtually non-existent for many real-world images (at least ones that haven't been clipped).
es: Esto es inexacto porque no *sólo* identifica los máximos; también detecta algunas "mesetas" donde los píxeles tienen valores idénticos a los de sus vecinos. En la práctica, esto no siempre es un problema porque el ruido puede hacer que las mesetas sean prácticamente inexistentes en muchas imágenes del mundo real (al menos en aquellas que no han sido recortadas).
pt_br: Isso é inexato porque não identifica *apenas* os máximos; ele também detecta alguns 'platôs' onde os pixels têm valores idênticos aos de seus vizinhos. Na prática, isso nem sempre é um problema porque o ruído pode tornar os platôs praticamente inexistentes para muitas imagens do mundo real (pelo menos aquelas que não foram cortadas).

source: A bigger problem is that the approach often identifies far too many maxima to be useful ({numref}`fig-morph_simple_maxima`).
es: Un problema mayor es que el enfoque a menudo identifica demasiados máximos para ser útil ({numref}`fig-morph_simple_maxima`).
pt_br: Um problema maior é que a abordagem muitas vezes identifica muitos máximos para serem úteis ({numref}`fig-morph_simple_maxima`).

source: Identifying local maxima with the help of a 3×3 dilation tends to find too many maxima to be useful.
es: La identificación de máximos locales con la ayuda de una dilatación de 3 × 3 tiende a encontrar demasiados máximos para ser útil.
pt_br: Identificar máximos locais com a ajuda de uma dilatação 3×3 tende a encontrar muitos máximos para serem úteis.

source: We can reduce these by either increasing the size of the maximum filter (therefore requiring pixels to be maximal across a larger region), or by pre-smoothing the image (usually with a [Gaussian filter](sec_filters_gaussian)). However, tuning the parameters becomes difficult.
es: Podemos reducirlos aumentando el tamaño del filtro máximo (por lo tanto, requiriendo que los píxeles sean máximos en una región más grande) o suavizando previamente la imagen (generalmente con un [filtro gaussiano] (sec_filters_gaussian)). Sin embargo, ajustar los parámetros resulta difícil.
pt_br: Podemos reduzi-los aumentando o tamanho do filtro máximo (exigindo, portanto, que os pixels sejam máximos em uma região maior) ou suavizando previamente a imagem (geralmente com um [filtro gaussiano](sec_filters_gaussian)). No entanto, ajustar os parâmetros torna-se difícil.

source: We will see an alternative approach that is often more intuitive in {ref}`sec_h_extrema`.
es: Veremos un enfoque alternativo que suele ser más intuitivo en {ref}`sec_h_extrema`.
pt_br: Veremos uma abordagem alternativa que geralmente é mais intuitiva em {ref}`sec_h_extrema`.
