Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/2-point_operations/imagej.po
Languages: es

source: ImageJ: Point operations
es: ImageJ: operaciones puntuales

source: Introduction
es: Introducción

source: This section introduces image processing with ImageJ. It shows where to find the main point operations, including some tips (and warnings) about their use, along with a few exercises to try them out.
es: Esta sección presenta el procesamiento de imágenes con ImageJ. Muestra dónde encontrar las operaciones principales, incluyendo algunos consejos (y advertencias) sobre su uso, junto con algunos ejercicios para probarlas.

source: Before we begin
es: Antes de comenzar

source: Before we embark on processing pixels, there are a couple of things we need to know how to do in preparation.
es: Antes de embarcarnos en el procesamiento de píxeles, hay un par de cosas que debemos saber hacer como preparación.

source: Duplicating images
es: Duplicar imágenes

source: One of the most important ImageJ shortcuts to learn is {kbd}`Shift+D` to **duplicate the image**. This applies the command {menuselection}`Image --> Duplicate...`.
es: Uno de los atajos de ImageJ más importantes que debes aprender es {kbd}`Shift+D` para **duplicar la imagen**. Esto aplica el comando {menuselection}`Image --> Duplicate...`.

source: Being able to quickly duplicate an image matters for two main reasons:
es: Poder duplicar rápidamente una imagen es importante por dos razones principales:

source: We often want to process duplicates of an image in different ways, and then combine or compare the results.
es: A menudo queremos procesar duplicados de una imagen de diferentes maneras y luego combinar o comparar los resultados.

source: Mistakes happen, and {menuselection}`Edit --> Undo` is rather limited; it can undo *some* processing steps applied to a single image slice, but not always... and it can't undo operations applied to image stacks
es: Los errores pasan y {menuselection}`Edit --> Undo` es bastante limitado; puede deshacer *algunos* pasos de procesamiento aplicados a una imagen, pero no siempre... y no puede deshacer operaciones aplicadas a pilas de imágenes

source: When working with an image in ImageJ, I almost always have at least one duplicate lingering around for when when things inevitably go wrong.
es: Cuando trabajo con una imagen en ImageJ, casi siempre tengo al menos un duplicado disponible para cuando las cosas inevitablemente salgan mal.

source: But {menuselection}`Image --> Duplicate...` has an extra, hidden bonus: it's supports extracting just a part of the image. This is controlled both by any ROI and by selecting subsets of channels, z-slices or time points where relevant. I frequently use duplication as a way to extract the channel from an image, as a more convenient alternative to {menuselection}`Image --> Color --> Split Channels`.
es: Pero {menuselection}`Image --> Duplicate...` tiene una ventaja adicional oculta: admite la extracción solo de una parte de la imagen. Esto se controla tanto mediante cualquier ROI como mediante la selección de subconjuntos de canales, cortes z o punto de tiempo cuando sea relevante. Con frecuencia uso la duplicación como una forma de extraer el canal de una imagen, como una alternativa más conveniente a {menuselection}`Image --> Color --> Split Channels`.

source: Why can't ImageJ's 'Undo' undo much?
es: ¿Por qué 'Undo' de ImageJ no puede deshacer mucho?

source: Implementing 'undo' in software is quite tricky. Especially in flexible software that enables the user to do a lot of different things.
es: Implementar 'deshacer' en el software es bastante complicado. Especialmente en software flexible que permite al usuario hacer muchas cosas diferentes.

source: When it comes to image processing, undo effectively requires the software to quietly duplicate the pixel values of an image before any processing step, so that they can be recovered later if needed. For a small image, that can work fine. But for big images (say, 1 GB or more), duplicating that much data could *significantly* slow down the software and potentially result in lots of out-of-memory errors.
es: Cuando se trata de procesamiento de imágenes, deshacer (undo) efectivamente requiere que el software duplique silenciosamente los valores de píxeles de una imagen antes de cualquier paso de procesamiento, para que puedan recuperarse más tarde si es necesario. Para una imagen pequeña, eso puede funcionar bien. Pero para imágenes grandes (digamos, 1 GB o más), duplicar esa cantidad de datos podría ralentizar *significativamente* el software y probablemente provocar muchos errores de falta de memoria.

source: ImageJ provides some very limited undo support for 2D slices, but it's best not to rely on it. In general, it's left up to the user to decide when duplicating is necessary. If you suspect you might regret a processing step, then it's best to always duplicate the image beforehand with {kbd}`Shift+D`.
es: ImageJ proporciona soporte muy limitado para "undo" para cortes 2D, pero es mejor no confiar en él. En general, queda en manos del usuario decidir cuándo es necesario realizar la duplicación. Si sospecha que podría arrepentirse de un paso de procesamiento, lo mejor es siempre duplicar la imagen de antemano con {kbd}`Shift+D`.

source: Converting to 32-bit
es: Conversión a 32 bits

source: The second thing I often do when processing an image in ImageJ is to [convert it to 32-bit floating point](sec_bits_type), using {menuselection}`Image --> Type --> 32-bit`.
es: El segundo paso que hago a menudo cuando proceso una imagen en ImageJ es [convertirla a punto flotante de 32 bits](sec_bits_type), usando {menuselection}`Image --> Type -- > 32 bit`.

source: This isn't *always* essential, but we will soon see examples where the type of the image makes a difference to the result. So you should always at least consider converting.
es: Esto no *siempre* es esencial, pero pronto veremos ejemplos en los que el tipo de imagen marca la diferencia en el resultado. Por lo tanto, al menos siempre deberías considerar la posibilidad de realizar la conversión.

source: Point operations for single images
es: Operaciones puntuales para imágenes individuales.

source: Many point operations for single images are found in the {menuselection}`Process --> Math -->` submenu. At the top of the list come the arithmetic operations: {menuselection}`Add...`, {menuselection}`Subtract...`, {menuselection}`Multiply...` and {menuselection}`Divide...`.
es: Muchas operaciones de puntos para imágenes individuales se encuentran en el submenú {menuselection}`Process --> Math -->`. En la parte superior de la lista están las operaciones aritméticas: {menuselection}`Add...`, {menuselection}`Subtract...` , {menuselection}`Multiply...` y {menuselection}`Divide...`que se refieren a las operaciones Sumar, Restar, Multiplicar y Dividir, respectivamente.

source: Practical
es: Práctica

source: Open the image *Spooked_16-bit.tif*, and apply *only* the following steps:
es: Abra la imagen *Spooked_16-bit.tif* y aplique *solo* los siguientes pasos:

source: Measure the mean pixel value of the image
es: Mide el valor medio de píxeles de la imagen.

source: Subtract 600 from all pixel values
es: Resta 600 de todos los valores de píxeles

source: Add 600 to all pixel values
es: Agrega 600 a todos los valores de píxeles

source: *Mathematically*, you should get the same mean measurements. Can you explain the result?
es: *Matemáticamente*, deberías obtener las mismas medidas medias. ¿Puedes explicar el resultado?

source: launch ImageJ.JS
es: lanzar ImageJ.JS

source: Solution
es: Solución

source: Firstly, the commands you need to run are:
es: En primer lugar, los comandos que debes ejecutar son:

source: {menuselection}`Analyze --> Measure`, or press {kbd}`M`
es: {menuselection}`Analyze --> Measure`, o presiona {kbd}`M`

source: {menuselection}`Process --> Math --> Subtract...` with the value 600
es: {menuselection}`Process --> Math --> Subtract...` con el valor 600

source: {menuselection}`Process --> Math --> Add...` with the value 600
es: {menuselection}`Process --> Math --> Add...` con el valor 600

source: When I do this, I get the following results table:
es: Cuando hago esto, obtengo la siguiente tabla de resultados:

source: The reason the mean values differ is because we have a 16-bit image. After subtraction, any values that were less than 600 become clipped to zero. All these become 600 after the addition, pushing up the overall mean.
es: La razón por la que los valores medios difieren es porque tenemos una imagen de 16 bits. Después de la resta, cualquier valor inferior a 600 se recorta a cero. Todos estos se convierten en 600 después de la suma, lo que eleva la media general.

source: If you didn't see this effect, then I would guess you had the foresight to run {menuselection}`Image --> Type --> 32-bit`. If you do this, the mean values match after all.
es: Si no viste este efecto, supongo que tuviste la previsión de ejecutar {menuselection}`Imagen --> Type --> 32 bit`. Si haces esto, los valores medios coincidirán después de todo.

source: The {menuselection}`Process --> Math --> Log...` and {menuselection}`Process --> Math --> Gamma...` commands implement the log and gamma transforms respectively. The gamma transform is more common, since it contains an adjustable gamma parameter that can be used to tune the effect.
es: Los comandos {menuselection}`Process --> Math --> Log...` y {menuselection}`Process --> Math-- > Gamma...` implementan las transformaciones log y gamma respectivamente. La transformación gamma es más común porque contiene un parámetro gamma ajustable que se puede utilizar para ajustar el efecto.

source: Beware of the bit-depth with nonlinear transforms!
es: ¡Cuidado con la profundidad de bits con transformaciones no lineales!

source: When applying gamma or log transforms to 8-bit or 16-bit images, ImageJ applies some additional (linear) rescaling to the result so that the output falls within the range supported by the image.
es: Al aplicar transformaciones gamma o logarítmicas a imágenes de 8 o 16 bits, ImageJ aplica un cambio de escala adicional (lineal) al resultado para que el output esté dentro del rango admitido por la imagen.

source: This rescaling isn't needed for 32-bit images. This means that if you apply either command to a 32-bit image then it can seem that the image disappears. You'll need to follow up by using {menuselection}`Image --> Adjust --> Brightness/Contrast...` to reset the LUT display range to see the output properly.
es: Este cambio de escala no es necesario para imágenes de 32 bits. Esto significa que si aplicas cualquiera de los comandos a una imagen de 32 bits, puede parecer que la imagen desaparece. Deberás realizar un seguimiento usando {menuselection}`Image --> Adjust --> Brightness/Contrast...` para re-establecer el rango de visualización de LUT y ver el output correctamente.

source: Explore the use of {menuselection}`Process --> Math --> Gamma...` for enhancing the contrast of *Spooked_16-bit.tif*.
es: Explore el uso de {menuselection}`Process --> Math --> Gamma...` para mejorar el contraste de *Spooked_16-bit.tif*.

source: If you want to see both the human and the ghost, should the gamma value be less than 1, equal to 1, or greater than 1?
es: Si desea ver tanto al humano como al fantasma, ¿el valor gamma debería ser menor que 1, igual a 1 o mayor que 1?

source: **Tip:** To get a feeling for how the values are changing, create a histogram of the image first and press the {guilabel}`Live` button on the histogram. Then run the gamma command, turn on the {guilabel}`Preview` option and adjust the slider. You should now see a live update of how changing the gamma affects the pixel values.
es: **Consejo:** Para tener una idea de cómo cambian los valores, primero crea un histograma de la imagen y presiona el botón {guilabel}`Live` en el histograma. Luego ejecuta el comando gamma, activa la opción {guilabel}`Preview` y ajusta el control deslizante. Ahora deberías ver una actualización en vivo de cómo el cambio de gamma afecta los valores de píxeles.

source: The gamma needs to be less than 1.
es: La gamma debe ser menor que 1.

source: When the gamma is equal to 1, it isn't doing anything at all. When it is greater than 1, it's applying a non-linear adjustment -- but not one that really helps in this case.
es: Cuando la gamma es igual a 1, no hace nada en absoluto. Cuando es mayor que 1, se aplica un ajuste no lineal, pero no es uno que realmente ayude en este caso.

source: Image inversion
es: Inversión de imagen

source: The {menuselection}`Edit --> Invert` command implements image inversion.
es: El comando {menuselection}`Edit --> Invert` implementa la inversión de la imagen.

source: Inverting images or inverting LUTs?
es: ¿Invertir imágenes o invertir LUT?

source: {menuselection}`Edit --> Invert` should not be confused with the {menuselection}`Image --> Lookup Tables --> Invert LUT` command, which inverts the LUT but *does nothing to the pixel values!*
es: {menuselection}`Edit --> Invert` no debe confundirse con {menuselection}`Image --> Lookup Tables --> Invert LUT`, que invierte la LUT pero *¡no hace nada con los valores de píxeles!*

source: Moreover, whether the LUT is inverted can be saved inside the file -- and so you could potentially open an image and find its LUT was inverted before you even started to do anything, and thereby misjudge whether structures are really brighter or darker than everything else.
es: Además, si la LUT está invertida se puede guardar dentro del archivo, por lo que potencialmente podrías abrir una imagen y descubrir que tu LUT se invirtió incluso antes de comenzar a hacer algo y, por lo tanto, juzgar mal si las estructuras son realmente más brillantes o más oscuras que todo lo demás.

source: {menuselection}`File --> Open samples --> Blobs` is an example of this. It took a long time before I realized that the pixel values inside the blobs are higher than the background, because of the sneaky inverted LUT. As is often the case, the signs of an inverted LUT are evident in the text at the top of an image window.
es: {menuselection}`File --> Open samples --> Blobs` es un ejemplo de esto. Pasó mucho tiempo antes de que me diera cuenta de que los valores de píxeles dentro de las manchas son más altos que los del fondo, debido al astuto LUT invertido. Como suele ser el caso, los signos de una LUT invertida son evidentes en el texto en la parte superior de una ventana de imagen.

source: {menuselection}`Edit --> Invert` works differently when applied to different image types. Like in the 8-bit case, pixel values are always subtracted from some 'maximum'.
es: {menuselection}`Edit --> Invert` funciona de manera diferente cuando se aplica a diferentes tipos de imágenes. Como en el caso de 8 bits, los valores de píxeles siempre se restan de algún "máximo".

source: How this maximum is determined for 16 and 32-bit images in ImageJ?
es: ¿Cómo se determina este máximo para imágenes de 16 y 32 bits en ImageJ?

source: **Note:** the methods used for 16 and 32-bit images are different from one another!
es: **Nota:** ¡los métodos utilizados para imágenes de 16 y 32 bits son diferentes entre sí!

source: When I first wrote this question, to invert a 16-bit image pixel were subtracted from *the maximum value within the original image*. This is also true for stacks: the maximum value in the entire stack is found.
es: Cuando escribí esta pregunta por primera vez, para invertir una imagen de 16 bits se restaban píxeles de *el valor máximo dentro de la imagen original*. Esto también es válido para las pilas de imagenes (z-stacks): se encuentra el valor máximo en toda la pila.

source: Since ImageJ v1.53k, the maximum value of 65535 is used... unless you happen to have a different {guilabel}`Unsigned 6-bit range` value specified via the {guilabel}`Set` button via the *Brightness & Contrast* dialog. I only know about this sneaky alternative option through the [ImageJ release notes](https://imagej.nih.gov/ij/notes.html).
es: Desde ImageJ v1.53k, se utiliza el valor máximo de 65535... a menos que tenga un valor {guilabel}`Unsigned 6-bit range` diferente especificado a través de {guilabel}botón `Establecer` a través del cuadro de diálogo *Brightness and Contrast*. Solo conozco esta opción alternativa furtiva a través de las [notas de la versión de ImageJ] (https://imagej.nih.gov/ij/notes.html).

source: For 32-bit image inversion, the pixels are subtracted from the *display maximum*, i.e. whatever maximum is set in the {menuselection}`Image --> Adjust --> Brightness/Contrast...` dialog box. Consequently, *inverting a 32-bit image can give different results each time it is applied if the contrast settings are not kept the same!*
es: Para la inversión de imágenes de 32 bits, los píxeles se restan del *máximo de visualización*, es decir, cualquier máximo establecido en el cuadro de dialogo {menuselection}`Image --> Adjust --> Brightness/Contrast ...`. Por lo tanto, *invertir una imagen de 32 bits puede dar resultados diferentes cada vez que se aplica si la configuración de contraste no se mantiene igual.*

source: I personally dislike this unpredictable weirdness. I would happily apply {menuselection}`Edit --> Invert` to an 8-bit image. For anything else, I'd generally rather convert to 32-bit and multiply by -1 -- so that I know the results should be repeatable, regardless of brightess & contrast settings.
es: Personalmente no me gusta esta rareza impredecible. Con mucho gusto aplicaría {menuselection}`Edit --> Invert` a una imagen de 8 bits. Para cualquier otra cosa, generalmente prefiero convertir a 32 bits y multiplicar por -1, para saber que los resultados son reproducibles, independientemente de las configuraciones de brillo y contraste.

source: The Image Calculator
es: La calculadora de imágenes

source: {menuselection}`Process --> Math --> Image Calculator...` is used to combine two images in various ways. It is one of ImageJ's most indispensable commands.
es: {menuselection}`Process --> Math --> Image Calculator...` se utiliza para combinar dos imágenes de varias maneras. Es uno de los comandos más indispensables de ImageJ.

source: The *Image Calculator...* dialog
es: El cuadro de diálogo *Image Calculator...*

source: But beware of the bit-depth and type! If any of the original images are 8 or 16-bit, then the result might require clipping or rounding, in which case selecting the option to create a {guilabel}`32-bit (float) result` may be necessary to get the expected output.
es: ¡Pero cuidado con la profundidad de bits y el tipo! Si alguna de las imágenes originales es de 8 o 16 bits, es posible que sea necesario recortar o redondear el resultado, en cuyo caso debes seleccionar la opción para crear un resultado de {guilabel}`32 bits (float) ` puede ser necesario para obtener el output esperado.

source: {menuselection}`Process --> Math --> Image Calculator...` finally makes it possible for us to check whether the pixel values of two images are all identical -- without relying on summary measurements or histograms.
es: {menuselection}`Process --> Math --> Image Calculator...` finalmente nos permite verificar si los valores de píxeles de dos imágenes son todos idénticos, sin depender de mediciones resumidas o histogramas.

source: Use it to determine which two of the images *Same_1.tif*, *Same_2.tif* and *Same_3.tif* are identical in terms of pixel values.
es: Úsalo para determinar cuáles dos de las imágenes *Same_1.tif*, *Same_2.tif* y *Same_3.tif* son idénticas en términos de valores de píxeles.

source: Answer
es: Respuesta

source: My preferred way to check this is to subtract the images from one another, making sure that the result is 32-bit (in case there are negative values). Doing this should reveal something hidden in the image *Same_2.tif*. Note that the contrast settings differ between *Same_1.tif* and *Same_3.tif*, so they may _look_ different.
es: Mi forma preferida de comprobar esto es restar las imágenes entre sí, asegurándome de que el resultado sea de 32 bits (en caso de que haya valores negativos). Hacer esto debería revelar algo oculto en la imagen *Same_2.tif*. Ten en cuenta que la configuración de contraste difiere entre *Same_1.tif* y *Same_3.tif*, por lo que pueden verse diferentes.

source: (Note that the calculator's {guilabel}`Difference` or {guilabel}`Divide` commands could also be used. {guilabel}`XOR` would work as well, but its output is harder to interpret since it involves comparing individual bits used to store each pixel value and gives an output where all matching bits are 0 and all non-matching bits are 1. When converted back into actual decimal values and then to colors for us to look at, this can appear strange. But at least if the resulting image is not completely black then we know that the original input images were not identical.)
es: (Tenga en cuenta que también se pueden utilizar los comandos {guilabel}`Differnce` o {guilabel}`Divide` de la calculadora. {guilabel}`XOR` también funcionaría, pero su output es más difícil de interpretar ya que implica comparar bits individuales utilizados para almacenar cada valor de píxel y proporciona un output donde todos los bits coincidentes son 0 y todos los bits no coincidentes son 1. Cuando se vuelven a convertir a valores decimales reales y luego a colores para que podamos verlos, esto puede parecer extraño, pero al menos si la imagen resultante no es completamente negra, entonces sabemos que las imágenes de input originales no eran idénticas).
