Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/2-point_operations/point_operations.po
Languages: de, es

source: Common nonlinear transforms are to take the logarithm of the pixel value ({numref}`fig-nonlinear_contrast`B), or replace each value $p$ with $p^\gamma$ where $\gamma$ is the *gamma* parameter that can be adjusted depending upon the desired outcome ({numref}`fig-nonlinear_contrast`B-D).
de: Gängige nichtlineare Transformationen bestehen darin, den Logarithmus des Pixelwerts zu nehmen ({numref}`fig-nonlinear_contrast`B), oder jeden Wert $p$ durch $p^\gamma$ zu ersetzen, wobei $\gamma$ der *gamma*-Parameter ist, der je nach gewünschtem Ergebnis angepasst werden kann ({numref}`fig-nonlinear_contrast`B-D).
es: Las transformaciones no lineales más comunes son tomar el logaritmo del valor del píxel ({numref}`fig-nonlinear_contrast`B), o sustituir cada valor $p$ por $p^\gamma$ donde $\gamma$ es el parámetro *gamma* que puede ajustarse dependiendo del resultado deseado ({numref}`fig-nonlinear_contrast`B-D).

source: Nonlinear transforms applied to a simple 'ramp' image, consisting of linearly increasing pixel values. Replacing each pixel with its log or gamma-adjusted value has the effect of compressing either the lower or higher intensities closer together to free up more gray levels for the others. Note that, here we assume an 8-bit input image and have incorporated some necessary rescaling for an 8-bit output (based on the approach used by ImageJ).
de: Nichtlineare Transformationen, die auf ein einfaches "Rampen"-Bild angewendet werden, das aus linear ansteigenden Pixelwerten besteht. Das Ersetzen jedes Pixels durch seinen logarithmischen oder gamma-angepassten Wert hat den Effekt, dass entweder die niedrigeren oder die höheren Intensitäten enger zusammengedrückt werden, um mehr Graustufen für die anderen freizugeben. Beachten Sie, dass wir hier von einem 8-Bit-Eingabebild ausgehen und die für eine 8-Bit-Ausgabe erforderliche Skalierung vorgenommen haben (basierend auf dem von ImageJ verwendeten Ansatz).
es: Transformación no lineal aplicada a una imagen simple en "rampa", formada por valores de píxeles que aumentan linealmente. La sustitución de cada píxel por su valor logarítmico o gamma ajustado tiene el efecto de comprimir las intensidades más bajas o más altas para liberar más niveles de gris para las demás. Tenga en cuenta que aquí suponemos una imagen de entrada de 8 bits y hemos incorporado algunos cambios de escala necesarios para una salida de 8 bits (basándonos en el enfoque utilizado por ImageJ).

source: If all this sounds a dubious and awkward, be assured that it is: nonlinear transforms are best avoided whenever possible.
de: Wenn sich das alles dubios und umständlich anhört, sei versichert, dass es so ist: Nichtlineare Transformationen werden am besten vermieden, wann immer es möglich ist.
es: Si todo esto suena dudoso e incómodo, ten por seguro que lo es: es mejor evitar las transformaciones no lineales siempre que sea posible.

source: However, there is once scenario when they can really help: displaying an image with a **high dynamic range**, i.e. a big difference between the largest and smallest pixel values.
de: Es gibt jedoch ein Szenario, in dem sie wirklich helfen können: die Darstellung eines Bildes mit einem **hohen Dynamikbereich**, d. h. einem großen Unterschied zwischen dem größten und dem kleinsten Pixelwert.
es: Sin embargo, hay una situación en la que pueden ser realmente útiles: la visualización de una imagen con un **alto rango dinámico**, es decir, una gran diferencia entre los valores de píxel mayor y menor.

source: {numref}`fig-point_gamma_spooked` shows this in action. Here, the pixel values associated with the main character are all quite high. However, the values associated with the ghostly figure are all very low. There are no linear contrast settings with a standard grayscale LUT that make it possible to see both figures with any detail simultaneously. However, log or gamma transforms make this possible.
de: {numref}Das Beispiel `fig-point_gamma_spooked` zeigt dies in Aktion. Hier sind die Pixelwerte, die mit der Hauptfigur verbunden sind, alle recht hoch. Die Werte, die mit der Geisterfigur verbunden sind, sind jedoch alle sehr niedrig. Es gibt keine linearen Kontrasteinstellungen mit einer Standard-Graustufen-LUT, die es ermöglichen, beide Figuren gleichzeitig mit allen Details zu sehen. Mit Log- oder Gamma-Transformationen ist dies jedoch möglich.
es: {numref}Fig-point_gamma_spooked` muestra esto en acción. Aquí, los valores de los píxeles asociados al personaje principal son bastante altos. Sin embargo, los valores asociados a la figura fantasmal son todos muy bajos. No hay ajustes de contraste lineal con una LUT de escala de grises estándar que permitan ver ambas figuras con algún detalle simultáneamente. Sin embargo, las transformaciones logarítmicas o gamma lo hacen posible.

source: The application of nonlinear contrast enhancement to an image with a wide range of values. *(Top row)* In the original image, it's not possible to see details in both the foreground and background simultaneously. *(Bottom row)* Two examples of nonlinear techniques that make details visible throughout the image.
de: Die Anwendung der nichtlinearen Kontrastverstärkung auf ein Bild mit einem breiten Wertebereich. *(Obere Reihe)* Im Originalbild ist es nicht möglich, Details im Vorder- und Hintergrund gleichzeitig zu sehen. *(Untere Reihe)* Zwei Beispiele für nichtlineare Techniken, die Details im gesamten Bild sichtbar machen.
es: Aplicación del realce de contraste no lineal a una imagen con una amplia gama de valores. *(Fila superior)* En la imagen original, no es posible ver simultáneamente los detalles del primer plano y del fondo. *(Fila inferior)* Dos ejemplos de técnicas no lineales que hacen visibles los detalles en toda la imagen.

source: Avoid image manipulation!
de: Vermeiden Sie Bildmanipulationen!
es: Evite la manipulación de imágenes

source: When creating figures for publication, changing the contrast in some linear manner is normally considered fine (assuming that it has not been done mischievously to make some inconvenient, research-undermining details impossible to discern).
de: Bei der Erstellung von Abbildungen für die Veröffentlichung wird eine lineare Veränderung des Kontrasts normalerweise als in Ordnung angesehen (vorausgesetzt, sie wurde nicht in böser Absicht vorgenommen, um einige unbequeme, die Forschung untergrabende Details unkenntlich zu machen).
es: Cuando se crean figuras para su publicación, normalmente se considera correcto cambiar el contraste de forma lineal (suponiendo que no se haya hecho maliciosamente para que no se puedan discernir algunos detalles inconvenientes que socavan la investigación).

source: **But if any nonlinear operations are used, these should always be noted in the figure legend!**
de: **Wenn jedoch nichtlineare Operationen verwendet werden, sollten diese immer in der Abbildungslegende vermerkt werden!**
es: **Pero si se utilizan operaciones no lineales, deben indicarse siempre en la leyenda de la figura.

source: This is because, although nonlinear operations can be very helpful when used with care, they can also easily mislead -- exaggerating or underplaying differences in brightness.
de: Denn obwohl nichtlineare Operationen bei sorgfältiger Anwendung sehr hilfreich sein können, können sie auch leicht in die Irre führen, indem sie Helligkeitsunterschiede übertreiben oder unterbewerten.
es: Esto se debe a que, aunque las operaciones no lineales pueden ser muy útiles si se utilizan con cuidado, también pueden inducir fácilmente a error, exagerando o restando importancia a las diferencias de brillo.

source: Point operations & multiple images
de: Punktoperationen und mehrere Bilder
es: Operaciones puntuales e imágenes múltiples

source: Instead of applying arithmetic using an image and a constant, we could also use two images of the same size. These can readily be added, subtracted, multiplied or divided by applying the operations to the corresponding pixels.
de: Anstatt mit einem Bild und einer Konstante zu rechnen, könnte man auch zwei gleich große Bilder verwenden. Diese können leicht addiert, subtrahiert, multipliziert oder dividiert werden, indem man die Operationen auf die entsprechenden Pixel anwendet.
es: En lugar de aplicar la aritmética utilizando una imagen y una constante, también podríamos utilizar dos imágenes del mismo tamaño. Éstas pueden sumarse, restarse, multiplicarse o dividirse fácilmente aplicando las operaciones a los píxeles correspondientes.

source: This is a technique that is used *all the time* in image processing. Applications include:
de: Dies ist eine Technik, die in der Bildverarbeitung *immer* zum Einsatz kommt. Zu den Anwendungen gehören:
es: Se trata de una técnica que se utiliza *todo el tiempo* en el tratamiento de imágenes. Entre sus aplicaciones se incluyen:

source: subtracting varying backgrounds
de: Subtrahieren unterschiedlicher Hintergründe
es: sustracción de fondos variables

source: computing intensity ratios
de: Berechnung von Intensitätsverhältnissen
es: cálculo de los coeficientes de intensidad

source: masking out regions
de: Ausblenden von Regionen
es: enmascarar regiones

source: **and much more...**
de: **und vieles mehr...**
es: **y mucho más...**

source: We will combine images in this way throughout the rest of the handbook.
de: Wir werden im weiteren Verlauf des Handbuchs Bilder auf diese Weise kombinieren.
es: Combinaremos imágenes de este modo a lo largo del resto del manual.

source: In the two 32-bit images shown here, white pixels have values of one and black pixels have values of zero (gray pixels have values somewhere in between).
de: In den beiden hier gezeigten 32-Bit-Bildern haben weiße Pixel den Wert eins und schwarze Pixel den Wert null (graue Pixel haben Werte irgendwo dazwischen).
es: En las dos imágenes de 32 bits que se muestran aquí, los píxeles blancos tienen valores de uno y los píxeles negros tienen valores de cero (los píxeles grises tienen valores intermedios).

source: What would be the result of multiplying the images together? And what would be the result of dividing the left image by the right image?
de: Was wäre das Ergebnis, wenn man die Bilder miteinander multiplizieren würde? Und was wäre das Ergebnis, wenn man das linke Bild durch das rechte Bild dividieren würde?
es: ¿Cuál sería el resultado de multiplicar las imágenes entre sí? ¿Y cuál sería el resultado de dividir la imagen izquierda por la imagen derecha?

source: Multiplying the images effectively results in everything outside the white region in the right image being removed from the left image (i.e. set to zero).
de: Die Multiplikation der Bilder führt dazu, dass alles, was außerhalb des weißen Bereichs im rechten Bild liegt, aus dem linken Bild entfernt (d. h. auf Null gesetzt) wird.
es: Al multiplicar las imágenes, todo lo que queda fuera de la región blanca de la imagen derecha se elimina de la imagen izquierda (es decir, se pone a cero).

source: Dividing has a similar effect, except that instead of becoming zero the masked-out pixels will take one of three results, depending upon the original pixel's value in the left image:
de: Dividieren hat einen ähnlichen Effekt, nur dass die maskierten Pixel nicht Null werden, sondern eines von drei Ergebnissen annehmen, je nach dem Wert des ursprünglichen Pixels im linken Bild:
es: Dividir tiene un efecto similar, excepto que en lugar de convertirse en cero, los píxeles enmascarados tomarán uno de los tres resultados, dependiendo del valor del píxel original en la imagen izquierda:

source: if it was _positive_, the result is $+\infty$ (shown here as yellow)
de: wenn es _positiv_ war, ist das Ergebnis $+\infty$ (hier gelb dargestellt)
es: si era _positivo_, el resultado es $+\infty$ (mostrado aquí en amarillo)

source: if it was _negative_, the result is $-\infty$
de: wenn sie _negativ_ war, ist das Ergebnis $-\infty$
es: si era _negativo_, el resultado es $-\infty$

source: if it was zero, the result is `NaN` ('not a number' -– indicating 0/0 is undefined; shown here as red)
de: wenn es Null war, ist das Ergebnis `NaN` ('not a number' -- was bedeutet, dass 0/0 undefiniert ist; hier als rot dargestellt)
es: si era cero, el resultado es `NaN` ('no es un número' -- indicando que 0/0 es indefinido; mostrado aquí en rojo)

source: These are special values that can be contained in floating point images, but not images with integer types.
de: Dies sind spezielle Werte, die in Fließkommabildern enthalten sein können, nicht aber in Bildern mit ganzzahligen Typen.
es: Se trata de valores especiales que pueden contener las imágenes de coma flotante, pero no las imágenes de tipo entero.

source: Adding noise
de: Hinzufügen von Lärm
es: Añadir ruido

source: Fluorescence images are invariably noisy. The noise appears as a graininess throughout the image, which can be seen as arising from a random noise value (positive or negative) being added to every pixel.
de: Fluoreszenzbilder sind unweigerlich verrauscht. Das Rauschen zeigt sich als Körnigkeit im gesamten Bild, die auf einen zufälligen Rauschwert (positiv oder negativ) zurückzuführen ist, der zu jedem Pixel hinzugefügt wird.
es: Las imágenes de fluorescencia son siempre ruidosas. El ruido aparece en forma de grano en toda la imagen, que puede considerarse el resultado de añadir un valor de ruido aleatorio (positivo o negativo) a cada píxel.

source: This is equivalent to adding a separate 'noise image' to the non-existent cleaner image that we would prefer to have recorded. If we knew the pixels in the noise image then we could simply subtract it to get the clean result -- but, in practice, their randomness means that we do not.
de: Dies ist gleichbedeutend mit dem Hinzufügen eines separaten "Rauschbildes" zu dem nicht vorhandenen sauberen Bild, das wir lieber aufgenommen hätten. Wenn wir die Pixel des Rauschbildes kennen würden, könnten wir sie einfach subtrahieren, um das saubere Ergebnis zu erhalten - aber in der Praxis bedeutet ihre Zufälligkeit, dass wir das nicht wissen.
es: Esto equivale a añadir una "imagen de ruido" separada a la imagen limpia inexistente que preferiríamos haber grabado. Si conociéramos los píxeles de la imagen de ruido, podríamos restarlos para obtener el resultado limpio, pero, en la práctica, su aleatoriedad hace que no los conozcamos.

source: Simulating imperfect image acquisition by adding noise to an 'ideal' image.
de: Simulation einer unvollkommenen Bildaufnahme durch Hinzufügen von Rauschen zu einem "idealen" Bild.
es: Simulación de adquisición imperfecta de imágenes añadiendo ruido a una imagen "ideal".

source: Despite the fact that noise is undesirable, adding noise images can be extremely useful when developing and validating image analysis methods.
de: Obwohl Rauschen unerwünscht ist, kann das Hinzufügen von Rauschbildern bei der Entwicklung und Validierung von Bildanalyseverfahren äußerst nützlich sein.
es: A pesar de que el ruido es indeseable, añadir imágenes con ruido puede ser extremadamente útil a la hora de desarrollar y validar métodos de análisis de imágenes.

source: We can use it to create simulations in which the noise behaves statistically just like real noise, and add it to clean images. Using these simulations we can figure out things like how processing steps or changes during acquisition will affect or reduce the noise, or how sensitive our measurement strategies are to changes in image quality (see {ref}`chap_filters`, {ref}`chap_formation_noise` and {ref}`chap_macro_simulating`).
de: Wir können damit Simulationen erstellen, in denen sich das Rauschen statistisch genauso verhält wie echtes Rauschen, und es zu sauberen Bildern hinzufügen. Mithilfe dieser Simulationen können wir herausfinden, wie sich Verarbeitungsschritte oder Änderungen während der Erfassung auf das Rauschen auswirken oder es verringern, oder wie empfindlich unsere Messstrategien auf Änderungen der Bildqualität reagieren (siehe {ref}`chap_filters`, {ref}`chap_formation_noise` und {ref}`chap_macro_simulating`).
es: Podemos utilizarlo para crear simulaciones en las que el ruido se comporta estadísticamente igual que el ruido real, y añadirlo a imágenes limpias. Con estas simulaciones podemos averiguar, por ejemplo, cómo afectan o reducen el ruido los pasos de procesamiento o los cambios durante la adquisición, o hasta qué punto son sensibles nuestras estrategias de medición a los cambios en la calidad de la imagen (véase {ref}`chap_filters`, {ref}`chap_formation_noise` y {ref}`chap_macro_simulating`).
