Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/2-point_operations/point_operations.po
Languages: de, es

source: Default Caption
de: Standard-Beschriftung
es: Leyenda por defecto

source: Point operations
de: Punktuelle Operationen
es: Operaciones puntuales

source: Chapter outline
de: Gliederung des Kapitels
es: Esquema del capítulo

source: **Point operations** are mathematical operations applied to individual pixel values
de: **Punktoperationen** sind mathematische Operationen, die auf einzelne Pixelwerte angewendet werden
es: Las **operaciones de punto** son operaciones matemáticas aplicadas a valores de píxeles individuales

source: Point operations can be performed using a **single image**, an **image and a constant**, or **two images of the same size**
de: Punktoperationen können mit einem **Einzelbild**, einem **Bild und einer Konstante** oder **zwei gleich großen Bildern** durchgeführt werden.
es: Las operaciones puntuales pueden realizarse utilizando una **imagen única**, una **imagen y una constante**, o **dos imágenes del mismo tamaño**.

source: Some **nonlinear** point operations change the relationships between pixels in a way that can be useful to enhance contrast -- but should be used with caution
de: Einige **nichtlineare** Punktoperationen verändern die Beziehungen zwischen Pixeln in einer Weise, die zur Verbesserung des Kontrasts nützlich sein kann - sie sollten jedoch mit Vorsicht verwendet werden
es: Algunas operaciones puntuales **no lineales** cambian las relaciones entre píxeles de forma que pueden ser útiles para mejorar el contraste, pero deben utilizarse con precaución.

source: Introduction
de: Einführung
es: Introducción

source: A step used to process an image in some way can be called an **operation**.
de: Ein Schritt, mit dem ein Bild auf irgendeine Weise verarbeitet wird, kann als **Operation** bezeichnet werden.
es: Un paso utilizado para procesar una imagen de alguna manera puede llamarse una **operación**.

source: The simplest operations are **point operations**, which act on individual pixels. Point operations change each pixel in a way that depends upon its own value, but not upon where it is in the image nor upon the values of other pixels. This is in contrast to **neighborhood operations**, which calculate new pixel values based upon the values of pixels nearby.
de: Die einfachsten Operationen sind **Punktoperationen**, die auf einzelne Pixel wirken. Punktoperationen verändern jedes Pixel auf eine Art und Weise, die von seinem eigenen Wert abhängt, aber nicht davon, wo es sich im Bild befindet oder von den Werten der anderen Pixel. Dies steht im Gegensatz zu **Nachbarschaftsoperationen**, die neue Pixelwerte auf der Grundlage der Werte von Pixeln in der Nähe berechnen.
es: Las operaciones más sencillas son las **operaciones de punto**, que actúan sobre píxeles individuales. Las operaciones de punto cambian cada píxel de una forma que depende de su propio valor, pero no de su posición en la imagen ni de los valores de otros píxeles. Esto contrasta con las **operaciones de vecindad**, que calculan los nuevos valores de los píxeles basándose en los valores de los píxeles cercanos.

source: While not immediately very glamorous, point operations often have indispensable roles in more interesting contexts -- and so it's essential to know how they are used, and what complications to look out for.
de: Obwohl sie auf den ersten Blick nicht sehr glamourös sind, spielen Punktoperationen in interessanteren Zusammenhängen oft eine unverzichtbare Rolle - und deshalb ist es wichtig zu wissen, wie sie eingesetzt werden und auf welche Komplikationen man achten muss.
es: Aunque no tienen mucho glamour a primera vista, las operaciones puntuales suelen desempeñar papeles indispensables en contextos más interesantes, por lo que es esencial saber cómo se utilizan y qué complicaciones hay que tener en cuenta.

source: Isn't modifying pixels bad?
de: Ist das Verändern von Pixeln nicht schlecht?
es: ¿Modificar píxeles no es malo?

source: Part I stressed repeatedly that modifying pixels is a bad thing. Since image processing is all about changing pixel values, it's time to add a bit more nuance:
de: In Teil I wurde wiederholt betont, dass die Veränderung von Pixeln eine schlechte Sache ist. Da sich bei der Bildverarbeitung alles um die Änderung von Pixelwerten dreht, ist es an der Zeit, ein wenig mehr Nuancen hinzuzufügen:
es: En la Parte I se insistió repetidamente en que modificar píxeles es algo malo. Dado que el procesamiento de imágenes consiste en modificar los valores de los píxeles, es hora de matizar un poco más:

source: **Modifying pixel values is bad -- unless you have a good reason**.
de: **Das Ändern von Pixelwerten ist schlecht - es sei denn, Sie haben einen guten Grund**.
es: **Modificar los valores de los píxeles es malo - a menos que tengas una buena razón**.

source: A 'good reason' is something you can justify based upon the image data. Something you could confidently include in a journal article describing how you analyzed your image, and convince a reviewer was sensible.
de: Ein "guter Grund" ist etwas, das Sie anhand der Bilddaten begründen können. Etwas, das Sie getrost in einen Zeitschriftenartikel aufnehmen können, in dem Sie beschreiben, wie Sie Ihr Bild analysiert haben, und das einen Gutachter davon überzeugt, dass es sinnvoll war.
es: Una "buena razón" es algo que se puede justificar basándose en los datos de la imagen. Algo que podrías incluir con confianza en un artículo de revista describiendo cómo analizaste tu imagen, y convencer a un revisor de que era sensato.

source: You should also make sure to apply the processing to a **duplicate** of the image, and keep the original file. That way you can always return to the original data if you need to.
de: Sie sollten auch darauf achten, dass Sie die Verarbeitung auf ein **Duplikat** des Bildes anwenden und die Originaldatei behalten. Auf diese Weise können Sie bei Bedarf jederzeit zu den Originaldaten zurückkehren.
es: También debes asegurarte de aplicar el tratamiento a un **duplicado** de la imagen, y conservar el archivo original. Así siempre podrás volver a los datos originales si lo necesitas.

source: Point operations for single images
de: Punktoperationen für Einzelbilder
es: Operaciones puntuales para imágenes individuales

source: Arithmetic
de: Arithmetik
es: Aritmética

source: Pixel values are just numbers. When we have numbers, we can do arithmetic.
de: Pixelwerte sind einfach nur Zahlen. Wenn wir Zahlen haben, können wir arithmetische Berechnungen durchführen.
es: Los valores de los píxeles son sólo números. Cuando tenemos números, podemos hacer operaciones aritméticas.

source: It should therefore come as no surprise that we can take our pixel values and change them by adding, subtracting, multiplying or dividing by some other value. These are the simplest point operations.
de: Es sollte daher nicht überraschen, dass wir unsere Pixelwerte nehmen und sie durch Addition, Subtraktion, Multiplikation oder Division durch einen anderen Wert ändern können. Dies sind die einfachsten Punktoperationen.
es: Por tanto, no debería sorprendernos que podamos tomar los valores de nuestros píxeles y cambiarlos sumando, restando, multiplicando o dividiendo por algún otro valor. Éstas son las operaciones puntuales más sencillas.

source: We encountered this idea earlier when we saw that multiplying our pixel values could [increase the brightness](sec_images_luts). I argued that this was a *very bad thing* because it changes our data. Our better alternative was to change the LUT instead.
de: Wir sind schon früher auf diese Idee gestoßen, als wir gesehen haben, dass die Multiplikation unserer Pixelwerte die Helligkeit [erhöhen] kann (sec_images_luts). Ich argumentierte, dass dies eine *sehr schlechte Sache* sei, weil es unsere Daten verändert. Unsere bessere Alternative war, stattdessen die LUT zu ändern.
es: Nos encontramos con esta idea antes, cuando vimos que multiplicar nuestros valores de píxel podría [aumentar el brillo](sec_images_luts). Argumenté que esto era *muy malo* porque cambia nuestros datos. Nuestra mejor alternativa era cambiar la LUT en su lugar.

source: Nevertheless, there are sometimes 'good reasons' to apply arithmetic to pixel values -- better than simply brightening the appearance. Examples include:
de: Dennoch gibt es manchmal "gute Gründe" für die Anwendung von Arithmetik auf Pixelwerte - besser als eine einfache Aufhellung des Erscheinungsbildes. Beispiele hierfür sind:
es: No obstante, a veces hay "buenas razones" para aplicar la aritmética a los valores de los píxeles, mejor que simplemente dar brillo a la apariencia. Algunos ejemplos son:

source: Subtracting a constant offset added by a microscope before quantifying intensities
de: Subtraktion eines konstanten Offsets, der von einem Mikroskop vor der Quantifizierung der Intensitäten hinzugefügt wird
es: Restar un desplazamiento constante añadido por un microscopio antes de cuantificar las intensidades

source: See {ref}`chap_macro_simulating`
de: Siehe {ref}`chap_macro_simulating`
es: Véase {ref}`chap_macro_simulating`

source: Dividing by a constant so that you can convert bit-depth without clipping
de: Dividieren durch eine Konstante, damit Sie die Bittiefe ohne Clipping konvertieren können
es: Dividir por una constante para poder convertir la profundidad de bits sin recortes.

source: See {ref}`chap_bit_depths`
de: Siehe {ref}`chap_bit_depths`
es: Véase {ref}`chap_bit_depths`

source: **However**, we need to keep in mind that we're not dealing with abtract maths but rather bits and bytes. Which makes the next question particularly important.
de: **Allerdings** müssen wir bedenken, dass wir es nicht mit abstrakter Mathematik zu tun haben, sondern mit Bits und Bytes. Deshalb ist die nächste Frage besonders wichtig.
es: **Sin embargo**, hay que tener en cuenta que no se trata de matemáticas abstractas, sino de bits y bytes. De ahí la importancia de la siguiente pregunta.

source: Question
de: Frage
es: Pregunta

source: Suppose you add a constant to every pixel in the image. Why might subtracting the same constant from the result not give you back the image you started with?
de: Angenommen, Sie addieren zu jedem Pixel des Bildes eine Konstante. Warum könnte die Subtraktion der gleichen Konstante vom Ergebnis nicht wieder das ursprüngliche Bild ergeben?
es: Supongamos que añades una constante a cada píxel de la imagen. ¿Por qué restar la misma constante del resultado no te devuelve la imagen con la que empezaste?

source: Answer
de: Antwort
es: Respuesta

source: If you add a constant that pushes pixel values outside the range supported by the bit-depth (e.g. 0–255 for 8-bit), then the result cannot fit in the image. It's likely to be clipped to the closest possible value instead. Subtracting the constant again does not restore the original value.
de: Wenn Sie eine Konstante hinzufügen, die die Pixelwerte über den von der Bittiefe unterstützten Bereich hinausschiebt (z. B. 0-255 für 8-Bit), dann kann das Ergebnis nicht in das Bild passen. Stattdessen wird es wahrscheinlich auf den nächstmöglichen Wert abgeschnitten. Wenn Sie die Konstante erneut subtrahieren, wird der ursprüngliche Wert nicht wiederhergestellt.
es: Si añades una constante que empuja los valores de los píxeles fuera del rango soportado por la profundidad de bits (por ejemplo, 0-255 para 8 bits), entonces el resultado no puede caber en la imagen. En su lugar, es probable que se recorte al valor más cercano posible. Restar la constante de nuevo no restaura el valor original.

source: For example: 200 *(original value)* + 100 *(constant)* &rarr; 255 *(closest valid value)*. <br/> But then 255 - 100 &rarr; 155.
de: Zum Beispiel: 200 *(ursprünglicher Wert)* + 100 *(Konstante)* &rarr; 255 *(nächstgelegener gültiger Wert)*. <br/> Aber dann 255 - 100 &rarr; 155.
es: Por ejemplo: 200 *(valor original)* + 100 *(constante)* &rarr; 255 *(valor válido más próximo)*. <br/> Pero entonces 255 - 100 &rarr; 155.

source: Based upon this, an important tip for image processing is:
de: Daraus ergibt sich ein wichtiger Tipp für die Bildverarbeitung:
es: Basándonos en esto, un consejo importante para el procesamiento de imágenes es:

source: Convert integer images to floating point before manipulating pixels
de: Ganzzahlige Bilder vor der Bearbeitung von Pixeln in Fließkommabilder umwandeln
es: Convertir imágenes enteras a coma flotante antes de manipular los píxeles

source: A 32-bit (or even 64-bit) floating point image is much less likely to suffer errors due to clipping and rounding. Therefore the first step of any image processing is often to convert the image to a floating point format.
de: Bei einem 32-Bit- (oder sogar 64-Bit-) Fließkommabild ist die Wahrscheinlichkeit, dass es zu Fehlern aufgrund von Beschneidung und Rundung kommt, wesentlich geringer. Daher besteht der erste Schritt einer jeden Bildverarbeitung häufig darin, das Bild in ein Fließkommaformat zu konvertieren.
es: Una imagen en coma flotante de 32 bits (o incluso de 64 bits) tiene muchas menos probabilidades de sufrir errores por recorte y redondeo. Por eso, el primer paso de cualquier tratamiento de imágenes suele ser convertir la imagen a un formato de coma flotante.

source: See {ref}`chap_bit_depths` for details.
de: Siehe {ref}`chap_bit_depths` für Einzelheiten.
es: Véase {ref}`chap_bit_depths` para más detalles.

source: Image inversion
de: Bildumkehrung
es: Inversión de imágenes

source: Inverting an image effectively involves 'flipping' the intensities: making the higher values lower, and the lower values higher.
de: Beim Invertieren eines Bildes werden die Intensitäten "gespiegelt", d. h. die höheren Werte werden niedriger und die niedrigeren Werte höher.
es: Invertir una imagen consiste en "voltear" las intensidades: los valores más altos son más bajos y los más bajos, más altos.

source: In the case of 8-bit images, inverted pixel values can be easily computed simply by subtracting the original values from the maximum possible -- i.e. from 255.
de: Bei 8-Bit-Bildern können die invertierten Pixelwerte einfach berechnet werden, indem man die Originalwerte vom maximal möglichen Wert subtrahiert, d. h. von 255.
es: En el caso de las imágenes de 8 bits, los valores invertidos de los píxeles pueden calcularse fácilmente restando los valores originales del máximo posible, es decir, de 255.

source: Why is inversion useful?
de: Warum ist die Inversion sinnvoll?
es: ¿Por qué es útil la inversión?

source: Suppose you have a good strategy designed to detect bright structures, but it doesn't work for you because your images contain dark structures. If you invert your images first, then the structures become bright -- and your detection strategy might now succeed.
de: Angenommen, Sie haben eine gute Strategie zur Erkennung heller Strukturen entwickelt, aber sie funktioniert nicht, weil Ihre Bilder dunkle Strukturen enthalten. Wenn Sie Ihre Bilder zunächst invertieren, werden die Strukturen hell - und Ihre Erkennungsstrategie könnte nun erfolgreich sein.
es: Supongamos que tiene una buena estrategia diseñada para detectar estructuras brillantes, pero no le funciona porque sus imágenes contienen estructuras oscuras. Si primero invierte las imágenes, las estructuras se vuelven brillantes y su estrategia de detección podría tener éxito.

source: The effect of image and LUT inversion. Note that each histogram appears to be a mirror image of the other. Also, the image is clipped (sorry).
de: Die Wirkung der Bild- und LUT-Invertierung. Beachten Sie, dass jedes Histogramm ein Spiegelbild des anderen zu sein scheint. Außerdem ist das Bild beschnitten (sorry).
es: Efecto de la inversión de la imagen y la LUT. Observe que cada histograma parece ser una imagen especular del otro. Además, la imagen está recortada (lo siento).

source: Defining the 'maximum' when inverting an image
de: Festlegen des "Maximums" beim Invertieren eines Bildes
es: Definir el "máximo" al invertir una imagen

source: Inverting an 8-bit (unsigned integer) image generally means subtracting all pixel values from 255, because 255 is the maximum supported by the image type and bit-depth.
de: Die Invertierung eines 8-Bit-Bildes (Ganzzahl ohne Vorzeichen) bedeutet im Allgemeinen, dass alle Pixelwerte von 255 subtrahiert werden, da 255 das Maximum ist, das vom Bildtyp und der Bittiefe unterstützt wird.
es: Invertir una imagen de 8 bits (entero sin signo) generalmente significa restar todos los valores de píxel de 255, porque 255 es el máximo soportado por el tipo de imagen y la profundidad de bits.

source: The 'maximum' is not always defined in this way. For a 32-bit or 64-bit image (either integer or floating point), the maximum possible value is *huge*, and using that would result in exceedingly large pixel values. Therefore the 'maximum' is usually defined in some other way rather than based on the image type, such as by taking the maximum pixel value found within the image.
de: Das "Maximum" ist nicht immer auf diese Weise definiert. Bei einem 32-Bit- oder 64-Bit-Bild (entweder Ganzzahl oder Fließkomma) ist der maximal mögliche Wert *groß*, und die Verwendung dieses Wertes würde zu sehr großen Pixelwerten führen. Daher wird das "Maximum" in der Regel auf eine andere Art und Weise als auf der Grundlage des Bildtyps definiert, z. B. durch Verwendung des maximalen Pixelwerts innerhalb des Bildes.
es: El "máximo" no siempre se define así. Para una imagen de 32 o 64 bits (ya sea entera o de coma flotante), el valor máximo posible es *enorme*, y utilizarlo daría como resultado valores de píxel excesivamente grandes. Por lo tanto, el "máximo" suele definirse de alguna otra manera en lugar de basarse en el tipo de imagen, como por ejemplo tomando el valor máximo de píxel que se encuentra dentro de la imagen.

source: Because I don't like letting the software decide what maximum to use, I often cheat: I multiply the pixels by -1 (ensuring the image is floating point). This retains the key properties of image inversion: it flips the high and low values, while retaining all the relative diffences between values.
de: Da ich es nicht mag, die Software entscheiden zu lassen, welchen Maximalwert ich verwende, schummle ich oft: Ich multipliziere die Pixel mit -1 (und stelle sicher, dass das Bild ein Fließkommabild ist). Dadurch bleiben die wichtigsten Eigenschaften der Bildinversion erhalten: Die hohen und niedrigen Werte werden gespiegelt, während alle relativen Unterschiede zwischen den Werten erhalten bleiben.
es: Como no me gusta dejar que el programa decida qué máximo utilizar, suelo hacer trampas: multiplico los píxeles por -1 (asegurándome de que la imagen es de coma flotante). Esto conserva las propiedades clave de la inversión de la imagen: invierte los valores altos y bajos, al tiempo que conserva todas las diferencias relativas entre los valores.

source: Nonlinear contrast enhancement
de: Nichtlineare Kontrastverstärkung
es: Aumento no lineal del contraste

source: With arithmetic operations we change the pixel values, usefully or otherwise, but (assuming we have not clipped our image in the process) we have done so in a **linear** way. At most it would take another multiplication and/or addition to get us back to where we were. Because a similar relationship between pixel values exists, we could also adjust the brightness and contrast LUT so that it does not *look* like we have done anything at all.
de: Mit arithmetischen Operationen ändern wir die Pixelwerte, ob sinnvoll oder nicht, aber (vorausgesetzt, wir haben unser Bild dabei nicht beschnitten) wir haben dies auf **lineare** Weise getan. Es wäre höchstens eine weitere Multiplikation und/oder Addition erforderlich, um wieder zum Ausgangswert zurückzukehren. Da eine ähnliche Beziehung zwischen den Pixelwerten besteht, könnten wir auch die Helligkeits- und Kontrast-LUT so anpassen, dass es nicht so aussieht, als hätten wir überhaupt etwas getan.
es: Con las operaciones aritméticas cambiamos los valores de los píxeles, de forma útil o no, pero (suponiendo que no hayamos recortado nuestra imagen en el proceso) lo hemos hecho de forma **lineal**. Como mucho, necesitaríamos otra multiplicación y/o suma para volver al punto en el que estábamos. Dado que existe una relación similar entre los valores de los píxeles, también podríamos ajustar la LUT de brillo y contraste para que no *parezca* que hemos hecho nada en absoluto.

source: **Nonlinear** point operations differ in that they affect relative values differently depending upon what they were in the first place. These are particularly useful for contrast enhancement.
de: **Nichtlineare** Punktoperationen unterscheiden sich dadurch, dass sie die relativen Werte unterschiedlich beeinflussen, je nachdem, was sie ursprünglich waren. Diese sind besonders nützlich für die Kontrastverbesserung.
es: Las operaciones de punto **no lineales** se diferencian en que afectan a los valores relativos de forma diferente dependiendo de lo que fueran en primer lugar. Son especialmente útiles para mejorar el contraste.

source: When we changed the brightness and contrast in {ref}`sec_images_luts`, we were making linear adjustments. For a grayscale LUT, this meant we chose the pixel value to display as black and the pixel value to display as white, with each value in between mapped to a shade of gray along a straight line ({numref}`fig-nonlinear_contrast`A).
de: Als wir die Helligkeit und den Kontrast in {ref}`sec_images_luts` geändert haben, haben wir lineare Anpassungen vorgenommen. Für eine Graustufen-LUT bedeutete dies, dass wir den Pixelwert wählten, der als Schwarz angezeigt werden sollte, und den Pixelwert, der als Weiß angezeigt werden sollte, wobei jeder dazwischen liegende Wert einer Grauschattierung entlang einer geraden Linie zugeordnet wurde ({numref}`fig-nonlinear_contrast`A).
es: Cuando cambiamos el brillo y el contraste en {ref}`sec_images_luts`, estábamos haciendo ajustes lineales. Para una LUT de escala de grises, esto significa que elegimos el valor del píxel que se mostrará como negro y el valor del píxel que se mostrará como blanco, con cada valor intermedio asignado a un tono de gris a lo largo de una línea recta ({numref}`fig-nonlinear_contrast`A).

source: We could optionally use a nonlinear mapping values between values and shades of gray, but most software doesn't make it straightforward to change LUTs in sufficiently complicated ways. An easier approach is to duplicate the image and apply any non-linear adjustments to the pixel values themselves, and then map them to shades of gray in the usual (linear) way.
de: Wir könnten optional eine nichtlineare Zuordnung zwischen Werten und Graustufen verwenden, aber die meisten Programme machen es nicht gerade einfach, LUTs auf ausreichend komplizierte Weise zu ändern. Eine einfachere Methode besteht darin, das Bild zu duplizieren und nichtlineare Anpassungen an den Pixelwerten selbst vorzunehmen und sie dann auf die übliche (lineare) Weise auf Graustufen abzubilden.
es: Podríamos utilizar opcionalmente un mapeado no lineal de valores entre valores y tonos de gris, pero la mayoría del software no permite cambiar las LUT de forma suficientemente complicada. Un enfoque más fácil es duplicar la imagen y aplicar los ajustes no lineales a los valores de píxeles en sí, y luego asignarlos a tonos de gris en la forma habitual (lineal).
