Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/4-filters/filters.po
Languages: de, es

source: The effects of various filters upon a noisy image of a fixed cell.
de: Die Auswirkungen verschiedener Filter auf ein verrauschtes Bild einer festen Zelle.
es: Los efectos de varios filtros sobre una imagen ruidosa de una célula fija.

source: Filters of varying sizes
de: Filter in verschiedenen Größen
es: Filtros de diferentes tamaños.

source: Gaussian filters have useful properties that make them generally preferable to mean filters, some of which will be mentioned in {ref}`chap_formation_spatial` (others require a trip into Fourier space, beyond the scope of this book). Therefore if you're not sure which filter to use for smoothing, Gaussian is likely to be a safer choice than mean -- particularly if the filter is large. Nevertheless, your decisions are not at an end since the precise size of the filter still needs to be chosen.
de: Gaußsche Filter haben nützliche Eigenschaften, die sie im Allgemeinen Mittelwertfiltern vorzuziehen machen, von denen einige in {ref}`chap_formation_spatial` erwähnt werden (andere erfordern einen Ausflug in den Fourier-Raum, der über den Rahmen von hinausgeht dieses Buch). Wenn Sie sich also nicht sicher sind, welchen Filter Sie zum Glätten verwenden sollen, ist Gaußscher Wert wahrscheinlich die sicherere Wahl als Mittelwert – insbesondere, wenn der Filter groß ist. Dennoch sind Ihre Entscheidungen noch nicht abgeschlossen, da noch die genaue Größe des Filters ausgewählt werden muss.
es: Los filtros Gaussianos tienen propiedades útiles que los hacen generalmente preferibles a los filtros medios, algunos de los cuales se mencionarán en {ref}`chap_formation_spatial` (otros requieren un viaje al espacio de Fourier, más allá del alcance de este libro). Por lo tanto, si no estás seguro de qué filtro usar para suavizar, es probable que el Gaussiano sea una opción más segura que la media, especialmente si el filtro es grande. Sin embargo, tus decisiones no han terminado, ya que aún es necesario elegir el tamaño preciso del filtro.

source: A small filter will mostly suppress noise, because noise masquerades as tiny random fluctuations at individual pixels. As the filter size increases, Gaussian filtering starts to suppress larger structures occupying multiple pixels -- reducing their intensities and increasing their sizes, until eventually they would be smoothed into surrounding regions ({numref}`fig-gaussian_effects`). By varying the filter size, we can then decide the **scale** at which the processing and analysis should happen.
de: Ein kleiner Filter unterdrückt das Rauschen größtenteils, da sich Rauschen als winzige zufällige Schwankungen an einzelnen Pixeln tarnt. Mit zunehmender Filtergröße beginnt die Gaußsche Filterung, größere Strukturen zu unterdrücken, die mehrere Pixel belegen, wodurch ihre Intensität verringert und ihre Größe erhöht wird, bis sie schließlich in die umliegenden Regionen geglättet werden ({numref}`). fig-gaussian_effects`). Durch Variieren der Filtergröße können wir dann den **Maßstab** festlegen, in dem die Verarbeitung und Analyse erfolgen soll.
es: Un filtro pequeño suprimirá principalmente el ruido, porque el ruido se disfraza como pequeñas fluctuaciones aleatorias en píxeles individuales. A medida que aumenta el tamaño del filtro, el filtrado gaussiano comienza a suprimir estructuras más grandes que ocupan múltiples píxeles, reduciendo sus intensidades y aumentando sus tamaños, hasta que finalmente se suavizan en las regiones circundantes ({numref}` fig-gaussian_effects`). Al variar el tamaño del filtro, podemos decidir la **escala** en la que debe realizarse el procesamiento y el análisis.

source: The effect of Gaussian filtering on the size and intensity of structures.
de: Die Auswirkung der Gaußschen Filterung auf die Größe und Intensität von Strukturen.
es: El efecto del filtrado Gaussiano sobre el tamaño y la intensidad de las estructuras.

source: {numref}`fig-edge_sigma` shows an example of when this is useful. Here, gradient magnitude images are computed, similar to what was shown in {numref}`fig-processing_filters_gradient`, but because the original image is now noisy the initial result is not very useful -- with even strong edges being buried amid noise (B). Applying a small Gaussian filter prior to computing the gradient magnitude gives much better results \(C). If we only want the very strongest edges, then apply a larger filter would be better (D).
de: {numref}`fig-edge_sigma` zeigt ein Beispiel dafür, wann dies nützlich ist. Hier werden Gradientengrößenbilder berechnet, ähnlich wie in {numref}`fig-processing_filters_gradient` gezeigt, aber da das Originalbild jetzt verrauscht ist, ist das erste Ergebnis nicht sehr nützlich – wobei selbst starke Kanten im Lärm versinken (B). Die Anwendung eines kleinen Gaußschen Filters vor der Berechnung der Gradientengröße liefert viel bessere Ergebnisse \(C). Wenn wir nur die stärksten Kanten wollen, wäre es besser, einen größeren Filter anzuwenden (D).
es: {numref}`fig-edge_sigma` muestra un ejemplo de cuándo esto es útil. Aquí, se calculan imágenes de magnitud de gradiente, similar a lo que se mostró en {numref}`fig-processing_filters_gradient`, pero debido a que la imagen original ahora tiene ruido, el resultado inicial no es muy útil. incluso los bordes más fuertes quedan enterrados en medio del ruido (B). La aplicación de un pequeño filtro Gaussiano antes de calcular la magnitud del gradiente da resultados mucho mejores \(C). Si solo queremos los bordes más fuertes, sería mejor aplicar un filtro más grande (D).

source: Applying Gaussian filters before computing the gradient magnitude changes the scale at which edges are enhanced.
de: Durch die Anwendung von Gaußschen Filtern vor der Berechnung der Gradientengröße ändert sich der Maßstab, in dem Kanten verstärkt werden.
es: La aplicación de filtros gaussianos antes de calcular la magnitud del gradiente cambia la escala en la que se mejoran los bordes.

source: Difference of Gaussians filtering
de: Unterschied der Gaußschen Filterung
es: Diferencia de filtrado Gaussiano

source: So Gaussian filters can be chosen to suppress small structures. But what if we also wish to suppress large structures -- so that we can concentrate on detecting or measuring structures with sizes inside a particular range?
de: So können Gaußfilter zur Unterdrückung kleiner Strukturen gewählt werden. Was aber, wenn wir auch große Strukturen unterdrücken wollen, um uns auf die Erkennung oder Messung von Strukturen mit Größen innerhalb eines bestimmten Bereichs konzentrieren zu können?
es: Por tanto, se pueden elegir filtros Gaussianos para suprimir estructuras pequeñas. Pero ¿qué pasa si también deseamos suprimir estructuras grandes, para poder concentrarnos en detectar o medir estructuras con tamaños dentro de un rango particular?

source: We already have the pieces necessary to construct one solution.
de: Wir verfügen bereits über die notwendigen Teile, um eine Lösung zu konstruieren.
es: Ya tenemos las piezas necesarias para construir una solución.

source: Suppose we apply one Gaussian filter to reduce small structures. Then we apply a *second* Gaussian filter, bigger than the first, to a duplicate of the original image. This will remove even more structures, while still preserving the largest features in the image.
de: Angenommen, wir wenden einen Gaußschen Filter an, um kleine Strukturen zu reduzieren. Dann wenden wir einen *zweiten* Gaußschen Filter, der größer als der erste ist, auf ein Duplikat des Originalbildes an. Dadurch werden noch mehr Strukturen entfernt, während die größten Merkmale im Bild erhalten bleiben.
es: Supongamos que aplicamos un filtro Gaussiano para reducir estructuras pequeñas. Luego aplicamos un *segundo* filtro Gaussiano, más grande que el primero, a un duplicado de la imagen original. Esto eliminará aún más estructuras y, al mismo tiempo, conservará las características más grandes de la imagen.

source: The trick is that, if we subtract this second filtered image from the first, we are left with an image that contains the information that 'falls between' the two smoothing scales we used.
de: Der Trick besteht darin, dass wir, wenn wir dieses zweite gefilterte Bild vom ersten subtrahieren, ein Bild erhalten, das die Informationen enthält, die „zwischen“ den beiden von uns verwendeten Glättungsskalen liegen.
es: El truco es que, si restamos esta segunda imagen filtrada de la primera, nos queda una imagen que contiene la información que "se encuentra entre" las dos escalas de suavizado que utilizamos.

source: This process is called **difference of Gaussians (DoG) filtering**, and it is a technique that I use *all the time*. It is especially useful for detecting small structures, or as an alternative to the gradient magnitude for enhancing edges ({numref}`fig-dog_red_hela`).
de: Dieser Prozess wird **Differenz-Gauß-Filterung (DoG)** genannt und ist eine Technik, die ich *ständig* verwende. Es ist besonders nützlich zum Erkennen kleiner Strukturen oder als Alternative zur Gradientengröße zum Hervorheben von Kanten ({numref}`fig-dog_red_hela`).
es: Este proceso se llama **filtrado por diferencia de Gaussianos (DoG)** y es una técnica que uso *todo el tiempo*. Es especialmente útil para detectar estructuras pequeñas o como alternativa a la magnitud del gradiente para mejorar bordes ({numref}`fig-dog_red_hela`).

source: Difference of Gaussian filtering of the same image at various scales.
de: Unterschied der Gaußschen Filterung desselben Bildes in verschiedenen Maßstäben.
es: Diferencia del filtrado Gaussiano de la misma imagen en varias escalas.

source: DoG filters
de: DoG-Filter
es: Filtrado por Diferencia de Gaussianos (DoG)

source: In fact, to get the result of DoG filtering it's not necessary to filter the image twice and subtract the results. We could equally well subtract the coefficients of the larger filter from the smaller first (after making sure both filters are the same size by adding zeros to the edges as required), then apply the resulting filter to the image only once ({numref}`fig-dog_plots`).
de: Um das Ergebnis der DoG-Filterung zu erhalten, ist es tatsächlich nicht notwendig, das Bild zweimal zu filtern und die Ergebnisse zu subtrahieren. Wir könnten genauso gut zuerst die Koeffizienten des größeren Filters vom kleineren subtrahieren (nachdem wir sichergestellt haben, dass beide Filter die gleiche Größe haben, indem wir bei Bedarf Nullen an den Kanten hinzufügen) und dann den resultierenden Filter nur einmal auf das Bild anwenden ({numref}`fig-dog_plots`).
es: De hecho, para obtener el resultado del filtrado DoG no es necesario filtrar la imagen dos veces y restar los resultados. También podríamos restar primero los coeficientes del filtro más grande del más pequeño (después de asegurarnos de que ambos filtros tengan el mismo tamaño agregando ceros a los bordes según sea necesario), luego aplicamos el filtro resultante a la imagen solo una vez ({numref}`fig-dog_plots`).

source: Surface plots of two Gaussian filters with small and large $\sigma$, and the result of subtracting the latter from the former. The sum of the coefficients for (A) and (B) is one in each case, while the coefficients of (C) add to zero.
de: Oberflächendiagramme zweier Gauß-Filter mit kleinem und großem $\sigma$ und das Ergebnis der Subtraktion des letzteren vom ersteren. Die Summe der Koeffizienten für (A) und (B) ist jeweils eins, während sich die Koeffizienten von (C) zu Null addieren.
es: Gráficos de superficie de dos filtros Gaussianos con $\sigma$ pequeño y grande, y el resultado de restar el último del primero. La suma de los coeficientes de (A) y (B) es uno en cada caso, mientras que los coeficientes de (C) suman cero.

source: Laplacian of Gaussian filtering
de: Laplace-Operator der Gaußschen Filterung
es: Laplaciano de filtrado Gaussiano

source: One minor complication with DoG filtering is the need to select two different values of $\sigma$. A similar operation, which requires only a single $\sigma$ and a single filter, is **Laplacian of Gaussian (LoG) filtering**.
de: Eine kleine Komplikation bei der DoG-Filterung ist die Notwendigkeit, zwei verschiedene Werte von $\sigma$ auszuwählen. Eine ähnliche Operation, die nur ein einziges $\sigma$ und einen einzigen Filter erfordert, ist die **Laplace- oder Gaußsche (LoG)-Filterung**.
es: Una complicación menor con el filtrado DoG es la necesidad de seleccionar dos valores diferentes de $\sigma$. Una operación similar, que requiere solo un único $\sigma$ y un solo filtro, es el **filtrado Laplaciano de Gaussiano (LoG)**.

source: The appearance of a LoG filter is like an upside-down DoG filter ({numref}`fig-log_plots`), but if the resulting image is [inverted](sec_points_inversion) then the results are comparable [^fn_4].
de: Das Erscheinungsbild eines LoG-Filters ähnelt einem umgedrehten DoG-Filter ({numref}`fig-log_plots`), aber wenn das resultierende Bild [invertiert](sec_points_inversion) ist, dann sind die Ergebnisse sind vergleichbar [^fn_4].
es: La apariencia de un filtro LoG es como un filtro DoG al revés ({numref}`fig-log_plots`), pero si la imagen resultante está [invertida](sec_points_inversion), entonces los resultados son comparables [^fn_4].

source: Surface plot of a LoG filter. This closely resembles {numref}`fig-dog_plots`, but inverted so that the negative values are found in the filter center.
de: Oberflächendiagramm eines LoG-Filters. Dies ähnelt stark {numref}`fig-dog_plots`, ist jedoch invertiert, sodass die negativen Werte in der Filtermitte gefunden werden.
es: Gráfico de superficie de un filtro LoG. Esto se parece mucho a {numref}`fig-dog_plots`, pero invertido para que los valores negativos se encuentren en el centro del filtro.

source: Application of DoG and LoG filtering to an image. Both methods enhance the appearance of spot-like structures, and (to a lesser extent) edges, and result in an image containing both positive and negative values with an overall mean of zero. In the case of LoG filtering, inversion is involved: darker points become bright after filtering.
de: Anwendung der DoG- und LoG-Filterung auf ein Bild. Beide Methoden verstärken das Erscheinungsbild punktförmiger Strukturen und (in geringerem Maße) Kanten und führen zu einem Bild, das sowohl positive als auch negative Werte mit einem Gesamtmittelwert von Null enthält. Bei der LoG-Filterung kommt es zu einer Invertierung: Dunklere Punkte werden nach der Filterung hell.
es: Aplicación de filtrado DoG y LoG a una imagen. Ambos métodos mejoran la apariencia de estructuras tipo manchas y (en menor medida) de los bordes, y dan como resultado una imagen que contiene valores positivos y negativos con una media general de cero. En el caso del filtrado LoG, se produce una inversión: los puntos más oscuros se vuelven brillantes después del filtrado.

source: Unsharp masking
de: Unscharfe Maskierung
es: Enmascaramiento de desenfoque

source: Finally, a related technique widely-used to enhance the visibility of details in images -- although certainly _not_ advisable for quantitative analysis -- is **unsharp masking**.
de: Schließlich ist eine verwandte Technik, die weit verbreitet ist, um die Sichtbarkeit von Details in Bildern zu verbessern – obwohl sie für quantitative Analysen sicherlich nicht empfehlenswert ist – die **Unscharfmaskierung**.
es: Finalmente, una técnica relacionada ampliamente utilizada para mejorar la visibilidad de los detalles en las imágenes (aunque ciertamente _no_ aconsejable para el análisis cuantitativo) es el **enmascaramiento de desenfoque**.

source: This uses a Gaussian filter first to blur the edges of an image, and then subtracts it from the original. But rather than stop there, the subtracted image is multiplied by some weighting factor and _added back_ to the original. This gives an image that looks much the same as the original, but with edges sharpened by an amount dependent upon the chosen weight.
de: Dabei wird zunächst ein Gaußscher Filter verwendet, um die Ränder eines Bildes unscharf zu machen, und dann wird es vom Original subtrahiert. Aber anstatt damit aufzuhören, wird das subtrahierte Bild mit einem Gewichtungsfaktor multipliziert und dem Original wieder hinzugefügt. Dadurch entsteht ein Bild, das dem Original weitgehend ähnelt, die Kanten jedoch um einen Betrag geschärft sind, der von der gewählten Stärke abhängt.
es: Esto utiliza un filtro Gaussiano primero para difuminar los bordes de una imagen y luego los resta del original. Pero en lugar de detenerse allí, la imagen restada se multiplica por algún factor de ponderación y se vuelve a agregar al original. Esto da una imagen que se parece mucho a la original, pero con bordes afilados en una cantidad que depende del peso elegido.

source: The application of unsharp masking to a blurred image. First a Gaussian-smoothed version of the image ($\sigma = 1$) is subtracted from the original, scaled ($weight = 0.7$) and added back to the original.
de: Die Anwendung einer unscharfen Maskierung auf ein unscharfes Bild. Zunächst wird eine Gauß-geglättete Version des Bildes ($\sigma = 1$) vom Original subtrahiert, skaliert ($weight = 0,7$) und wieder zum Original addiert.
es: La aplicación de máscara de desenfoque a una imagen borrosa. Primero, se resta una versión suavizada Gaussiana de la imagen ($\sigma = 1$) del original, se escala ($peso = 0,7$) y se vuelve a agregar al original.

source: Unsharp masking can improve the visual appearance of an image, but it's important to remember that it modifies the image content in a way that might well be considered suspicious in scientific circles. Therefore, if you apply unsharp masking to any image you intend to share with the world you should have a good justification and certainly admit what you have done. The technique is included here not as a recommendation that you use it, but rather to show how Gaussian filters can be combined with point operations in creative ways.
de: Unscharfe Maskierung kann das visuelle Erscheinungsbild eines Bildes verbessern, es ist jedoch wichtig zu bedenken, dass dadurch der Bildinhalt auf eine Weise verändert wird, die in wissenschaftlichen Kreisen durchaus als verdächtig gelten könnte. Wenn Sie also ein Bild, das Sie mit der Welt teilen möchten, unscharf maskieren, sollten Sie eine gute Begründung haben und auf jeden Fall zugeben, was Sie getan haben. Die Technik wird hier nicht als Empfehlung zur Verwendung aufgeführt, sondern um zu zeigen, wie Gaußsche Filter auf kreative Weise mit Punktoperationen kombiniert werden können.
es: El enmascaramiento de desenfoque puede mejorar la apariencia visual de una imagen, pero es importante recordar que modifica el contenido de la imagen de una manera que bien podría considerarse sospechosa en los círculos científicos. Por lo tanto, si aplicas una máscara de desenfoque a cualquier imagen que desees compartir con el mundo, debes tener una buena justificación y ciertamente admitir lo que has hecho. La técnica se incluye aquí no como una recomendación para su uso, sino más bien para mostrar cómo se pueden combinar los filtros Gaussianos con operaciones puntuales de manera creativa.

source: If you want a more theoretically justified method to improve image sharpness in microscopy, it may be worth looking into *'(maximum likelihood) deconvolution'* algorithms.
de: Wenn Sie eine theoretisch fundiertere Methode zur Verbesserung der Bildschärfe in der Mikroskopie suchen, lohnt es sich möglicherweise, einen Blick auf die Algorithmen „(Maximum Likelihood)-Entfaltung“* zu werfen.
es: Si deseas un método más justificado teóricamente para mejorar la nitidez de la imagen en microscopía, puede que valga la pena investigar los algoritmos de *'(máxima probabilidad) deconvolución'*.

source: I feel obliged to admit that there *is* a subtle difference between convolution and correlation: the kernel is rotated 180° for convolution. This is something we almost never need to care about for two reasons:
de: Ich fühle mich gezwungen zuzugeben, dass es einen subtilen Unterschied zwischen Faltung und Korrelation gibt: Der Kernel wird für die Faltung um 180° gedreht. Das ist etwas, worüber wir uns aus zwei Gründen fast nie kümmern müssen:
es: Me siento obligado a admitir que *hay* una sutil diferencia entre convolución y correlación: el núcleo (kernel) se gira 180° para la convolución. Esto es algo de lo que casi nunca debemos preocuparnos por dos razones:

source: Convolution and correlation end up the same if the filter is symmetric -- and most filters we care about are symmetric
de: Faltung und Korrelation sind am Ende gleich, wenn der Filter symmetrisch ist – und die meisten Filter, die uns wichtig sind, sind symmetrisch
es: La convolución y la correlación terminan igual si el filtro es simétrico, y la mayoría de los filtros que nos interesan son simétricos.

source: The distinction is often ignored in practice anyway. For example, ImageJ has a {menuselection}`Process --> Filters --> Convolve...` command that (last time I checked) actually implements correlation.
de: Die Unterscheidung wird in der Praxis ohnehin oft ignoriert. Beispielsweise verfügt ImageJ über einen {menuselection}`Process --> Filters --> Convolve...`-Befehl, der (das letzte Mal, als ich nachgesehen habe) tatsächlich die Korrelation implementiert.
es: De todos modos, la distinción a menudo se ignora en la práctica. Por ejemplo, ImageJ tiene un comando {menuselection}`Process --> Filters --> Convolve...` que (la última vez que verifiqué) en realidad implementa la correlación.

source: The equation then looks like Pythagoras' theorem: $G_{mag} = \sqrt{G_x^2 + G_y^2}$
de: Die Gleichung sieht dann wie der Satz des Pythagoras aus: $G_{mag} = \sqrt{G_x^2 + G_y^2}$
es: La ecuación entonces se parece al teorema de Pitágoras: $G_{mag} = \sqrt{G_x^2 + G_y^2}$

source: A LoG filter is also often referred to as a _mexican-hat filter_, although clearly the filter (or the hat-wearer) should be inverted for the name to make more sense
de: Ein LoG-Filter wird oft auch als „Mexikaner-Hut-Filter“ bezeichnet, obwohl der Filter (oder der Hutträger) eindeutig invertiert werden sollte, damit der Name mehr Sinn ergibt
es: Un filtro LoG también suele denominarse _filtro de sombrero mexicano_, aunque claramente el filtro (o el usuario del sombrero) debe invertirse para que el nombre tenga más sentido.
