Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/4-filters/filters.po
Languages: de, es

source: Often, we want to detect structures in an image that are distinguishable from the background because of their edges. Being able to detect the edges could therefore be useful. Because an edge is usually characterized by a relatively sharp transition in pixel values -- i.e. by a steep increase or decrease in the profile across the image -- **gradient filters** can be used to help.
de: Oftmals geht es darum, Strukturen in einem Bild zu erkennen, die sich aufgrund ihrer Kanten vom Hintergrund abheben. Daher könnte es nützlich sein, die Kanten erkennen zu können. Da eine Kante normalerweise durch einen relativ scharfen Übergang der Pixelwerte gekennzeichnet ist – d. h. durch einen steilen Anstieg oder Abfall des Profils über das Bild hinweg – können **Verlaufsfilter** zur Abhilfe verwendet werden.
es: A menudo queremos detectar estructuras en una imagen que se distinguen del fondo por sus bordes. Por lo tanto, poder detectar los bordes podría resultar útil. Debido a que un borde generalmente se caracteriza por una transición relativamente nítida en los valores de píxeles, es decir, por un aumento o disminución pronunciados en el perfil en la imagen, se pueden utilizar **filtros de gradiente** para ayudar.

source: A very simple gradient filter has the coefficients *-1, 0, 1*. Applied to an image, this replaces every pixel with the difference between the pixel to the right and the pixel to the left. The output is positive whenever the pixel values are increasing horizontally, negative when the pixel values are decreasing, and zero if the values are constant -- _no matter what the original constant value was_, so that flat areas are zero in the gradient image irrespective of their original brightness. We can also rotate the filter by 90 and get a vertical gradient image ({numref}`fig-processing_filters_gradient`).
de: Ein sehr einfacher Gradientenfilter hat die Koeffizienten *-1, 0, 1*. Auf ein Bild angewendet ersetzt dies jedes Pixel durch die Differenz zwischen dem Pixel rechts und dem Pixel links. Die Ausgabe ist immer dann positiv, wenn die Pixelwerte horizontal zunehmen, negativ, wenn die Pixelwerte abnehmen, und Null, wenn die Werte konstant sind – _unabhängig vom ursprünglichen konstanten Wert_, sodass flache Bereiche im Verlaufsbild unabhängig davon Null sind ihre ursprüngliche Helligkeit. Wir können den Filter auch um 90 drehen und ein Bild mit vertikalem Farbverlauf erhalten ({numref}`fig-processing_filters_gradient`).
es: Un filtro de gradiente muy simple tiene los coeficientes *-1, 0, 1*. Aplicado a una imagen, esto reemplaza cada píxel con la diferencia entre el píxel de la derecha y el píxel de la izquierda. El output es positivo siempre que los valores de los píxeles aumentan horizontalmente, negativo cuando los valores de los píxeles disminuyen y cero si los valores son constantes, _sin importar cuál era el valor constante original_, de modo que las áreas planas son cero en la imagen de gradiente independientemente de su brillo original. También podemos rotar el filtro 90 grados y obtener una imagen con gradiente vertical ({numref}`fig-processing_filters_gradient`).

source: Using gradient filters and the gradient magnitude for edge enhancement.
de: Verwendung von Verlaufsfiltern und der Verlaufsgröße zur Kantenverstärkung.
es: Uso de filtros de gradiente y la magnitud del gradiente para mejorar los bordes.

source: Having two gradient images with positive and negative values can be somewhat hard to work with. We can combine filtering with [point operations](chap_point_operations) to generate a single image representing the __gradient magnitude__ [^fn_3]. The gradient magnitude has high values around edges (regardless of their orientation), and low values everywhere else.
de: Es kann etwas schwierig sein, mit zwei Verlaufsbildern mit positiven und negativen Werten zu arbeiten. Wir können Filterung mit [Punktoperationen](chap_point_operations) kombinieren, um ein einzelnes Bild zu erzeugen, das die __Gradientengröße__ [^fn_3] darstellt. Die Gradientengröße hat an Kanten hohe Werte (unabhängig von ihrer Ausrichtung) und überall sonst niedrige Werte.
es: Puede resultar algo difícil trabajar con dos imágenes con gradientes, con valores positivos y negativos. Podemos combinar el filtrado con [operaciones puntuales] (chap_point_operations) para generar una única imagen que represente la __magnitud del gradiente__ [^fn_3]. La magnitud del gradiente tiene valores altos alrededor de los bordes (independientemente de su orientación) y valores bajos en el resto.

source: The process of calculating the gradient magnitude is:
de: Der Prozess zur Berechnung der Gradientengröße ist:
es: El proceso de calcular la magnitud del gradiente es:

source: Apply linear filters to produce the horizontal and vertical gradient images
de: Wenden Sie lineare Filter an, um horizontale und vertikale Verlaufsbilder zu erzeugen
es: Aplica filtros lineales para producir imágenes de gradiente horizontal y vertical.

source: *Square* all the pixel values in both gradient images
de: *Quadriere* alle Pixelwerte in beiden Verlaufsbildern
es: *Eleva al cuadrado* todos los valores de píxeles en ambas imágenes de gradiente

source: Add the squared images together
de: Fügen Sie die quadratischen Bilder zusammen
es: Suma las imágenes cuadradas juntas

source: Take the square root of the result
de: Ziehen Sie die Quadratwurzel aus dem Ergebnis
es: Saca la raíz cuadrada del resultado.

source: Suppose the mean pixel value of an image is 100. What will the mean value be after applying a horizontal gradient filter?
de: Angenommen, der mittlere Pixelwert eines Bildes beträgt 100. Wie hoch wird der Mittelwert nach Anwendung eines horizontalen Verlaufsfilters sein?
es: Supongamos que el valor medio de píxeles de una imagen es 100. ¿Cuál será el valor medio después de aplicar un filtro de gradiente horizontal?

source: Solution
de: Lösung
es: Solución

source: After applying a gradient filter, the image mean will be 0: every pixel is added once and subtracted once when calculating the result.
de: Nach der Anwendung eines Verlaufsfilters beträgt der Bildmittelwert 0: Bei der Berechnung des Ergebnisses wird jedes Pixel einmal addiert und einmal subtrahiert.
es: Después de aplicar un filtro de gradiente, la media de la imagen será 0: cada píxel se suma una vez y se resta una vez al calcular el resultado.

source: (Note that the mean value of a *gradient magnitude* image will be ≥ 0, because all pixels have either positive values or are equal to zero.)
de: (Beachten Sie, dass der Mittelwert eines *Gradientenmagnitude*-Bildes ≥ 0 sein wird, da alle Pixel entweder positive Werte haben oder gleich Null sind.)
es: (Ten en cuenta que el valor medio de una imagen de *magnitud de gradiente* será ≥ 0, porque todos los píxeles tienen valores positivos o son iguales a cero).

source: Filtering at image boundaries
de: Filterung an Bildgrenzen
es: Filtrado en los límites de la imagen

source: If a filter consists of more than one coefficient, the neighborhood will extend beyond the image boundaries when filtering some pixels nearby. We need to handle this somehow. There are several common approaches.
de: Wenn ein Filter aus mehr als einem Koeffizienten besteht, erstreckt sich die Nachbarschaft über die Bildgrenzen hinaus, wenn einige Pixel in der Nähe gefiltert werden. Wir müssen das irgendwie in den Griff bekommen. Es gibt mehrere gängige Ansätze.
es: Si un filtro consta de más de un coeficiente, la vecindad se extenderá más allá de los límites de la imagen al filtrar algunos píxeles cercanos. Necesitamos manejar esto de alguna manera. Hay varias formas de hacerlo.

source: The boundary pixels could simply be ignored and left with their original values, but for large neighborhoods this would result in much of the image being unfiltered. Alternative options include treating every pixel beyond the boundary as zero, replicating the closest valid pixel, treating the image as if it is part of a periodic tiling, or mirroring the internal values ({numref}`fig-filter_boundaries`).
de: Die Grenzpixel könnten einfach ignoriert und bei ihren ursprünglichen Werten belassen werden, aber bei großen Nachbarschaften würde dies dazu führen, dass ein Großteil des Bildes ungefiltert wäre. Zu den alternativen Optionen gehören die Behandlung jedes Pixels jenseits der Grenze als Null, die Replikation des nächstgelegenen gültigen Pixels, die Behandlung des Bildes als Teil einer periodischen Kachelung oder die Spiegelung der internen Werte ({numref}). `fig-filter_boundaries`).
es: Los píxeles de los límites podrían simplemente ignorarse y dejarse con sus valores originales, pero en vecindarios grandes esto daría como resultado que gran parte de la imagen no estuviera filtrada. Las opciones alternativas incluyen tratar cada píxel más allá del límite como cero, replicar el píxel válido más cercano, tratar la imagen como si fuera parte de un mosaico periódico o reflejar los valores internos ({numref} `fig-filter_boundaries`).

source: Methods for determining suitable values for pixels beyond image boundaries when filtering.
de: Methoden zur Ermittlung geeigneter Werte für Pixel außerhalb der Bildgrenzen beim Filtern.
es: Métodos para determinar valores adecuados para píxeles más allá de los límites de la imagen al filtrar.

source: Different software can handle boundaries in different ways. Often, if you are using an image processing library to code your own filtering operation you will be able to specify the boundary operation.
de: Unterschiedliche Software kann Grenzen auf unterschiedliche Weise handhaben. Wenn Sie eine Bildverarbeitungsbibliothek zum Codieren Ihrer eigenen Filteroperation verwenden, können Sie häufig die Grenzoperation angeben.
es: Cada software puede manejar los límites de diferentes maneras. A menudo, si utiliza una biblioteca de procesamiento de imágenes para codificar su propia operación de filtrado, podrá especificar la operación de límite.

source: Nonlinear filters
de: Nichtlineare Filter
es: Filtros no lineales

source: Linear filters involve taking neighborhoods of pixels, scaling them by the filter coefficients, and adding the results to get new pixel values. **Nonlinear filters** also make use of neighborhoods of pixels, but can use any other type of calculation to obtain the output. Here we'll consider one especially important family of nonlinear filters.
de: Bei linearen Filtern werden Nachbarschaften von Pixeln genommen, mit den Filterkoeffizienten skaliert und die Ergebnisse addiert, um neue Pixelwerte zu erhalten. **Nichtlineare Filter** nutzen ebenfalls Nachbarschaften von Pixeln, können jedoch jede andere Art von Berechnung verwenden, um die Ausgabe zu erhalten. Hier betrachten wir eine besonders wichtige Familie nichtlinearer Filter.
es: Los filtros lineales implican tomar vecindades de píxeles, escalarlos según los coeficientes del filtro y sumar los resultados para obtener nuevos valores de píxeles. **Los filtros no lineales** también utilizan vecindades de píxeles, pero pueden utilizar cualquier otro tipo de cálculo para obtener el resultado. Aquí consideraremos una familia especialmente importante de filtros no lineales.

source: Rank filters
de: Rangfilter
es: Filtros de clasificación

source: **Rank filters** effectively sort the values of all the neighboring pixels in ascending order, and then choose the output based upon this ordered list.
de: **Rangfilter** sortieren effektiv die Werte aller benachbarten Pixel in aufsteigender Reihenfolge und wählen dann die Ausgabe basierend auf dieser geordneten Liste aus.
es: **Clasificar filtros** clasifica efectivamente los valores de todos los píxeles vecinos en orden ascendente y luego elige el output según esta lista ordenada.

source: Perhaps the most common example is the **median filter**, in which the pixel value at the center of the list is used for the filtered output.
de: Das vielleicht häufigste Beispiel ist der **Medianfilter**, bei dem der Pixelwert in der Mitte der Liste für die gefilterte Ausgabe verwendet wird.
es: Quizás el ejemplo más común sea el **filtro mediano**, en el que el valor de píxel en el centro de la lista se utiliza para el output filtrado.

source: Results of different 3×3 rank filters when processing a single neighborhood in an image. The output of a 3×3 mean filter in this case would also be 15.
de: Ergebnisse verschiedener 3×3-Rangfilter bei der Verarbeitung einer einzelnen Nachbarschaft in einem Bild. Die Ausgabe eines 3×3-Mittelwertfilters wäre in diesem Fall ebenfalls 15.
es: Resultados de diferentes filtros de rango 3×3 al procesar un solo vecindario en una imagen. La salida de un filtro medio de 3×3 en este caso también sería 15.

source: The result of applying a median filter is often similar to that of applying a mean filter, but has the major advantage of removing isolated extreme values completely, _without allowing them to have an impact upon surrounding pixels_. This is in contrast to a mean filter, which cannot ignore extreme pixels but rather will smooth them out into occupying larger regions ({numref}`fig-processing_filters_speckled`).
de: Das Ergebnis der Anwendung eines Medianfilters ähnelt häufig dem der Anwendung eines Mittelwertfilters, hat jedoch den großen Vorteil, dass isolierte Extremwerte vollständig entfernt werden, ohne dass diese einen Einfluss auf die umgebenden Pixel haben. Dies steht im Gegensatz zu einem Mittelwertfilter, der extreme Pixel nicht ignorieren kann, sondern sie eher glättet, sodass sie größere Bereiche belegen ({numref}`fig-processing_filters_spektled`).
es: El resultado de aplicar un filtro de mediana suele ser similar al de aplicar un filtro de media, pero tiene la principal ventaja de eliminar por completo los valores extremos aislados, _sin permitir que tengan un impacto en los píxeles circundantes_. Esto contrasta con un filtro medio o promedio, que no puede ignorar los píxeles extremos, sino que los suaviza para ocupar regiones más grandes ({numref}`fig-processing_filters_speckled`).

source: However, a disadvantage of a median filter is that it can seem to introduce patterns or textures that were not present in the original image, at least whenever the size of the filter increases (see {numref}`fig-processing_filters`D below). Another disadvantage is that large median filters tend to be slow.
de: Ein Nachteil eines Medianfilters besteht jedoch darin, dass er anscheinend Muster oder Texturen einführt, die im Originalbild nicht vorhanden waren, zumindest wenn die Größe des Filters zunimmt (siehe <span class='notranslate'>{numref}</span). >`fig-processing_filters`D unten). Ein weiterer Nachteil besteht darin, dass große Medianfilter tendenziell langsam sind.
es: Sin embargo, una desventaja de un filtro mediano es que puede parecer que introduce patrones o texturas que no estaban presentes en la imagen original, al menos cada vez que aumenta el tamaño del filtro (ver {numref}`fig-processing_filters`D a continuación). Otra desventaja es que los filtros medianos grandes tienden a ser lentos.

source: Applying 3×3 mean and median filters to an image containing isolated extreme values (known as _salt and pepper noise_). A mean filter reduces the intensity of the extreme values but spreads out their influence. A small median filter is capable of removing the outliers completely, with a minimal effect upon the rest of the image.
de: Anwenden von 3×3-Mittelwert- und Medianfiltern auf ein Bild, das isolierte Extremwerte enthält (bekannt als _Salz- und Pfefferrauschen_). Ein Mittelwertfilter reduziert die Intensität der Extremwerte, verteilt aber deren Einfluss. Ein kleiner Medianfilter ist in der Lage, die Ausreißer vollständig zu entfernen, mit minimalen Auswirkungen auf den Rest des Bildes.
es: Aplicar filtros de media y mediana de 3 × 3 a una imagen que contiene valores extremos aislados (conocido como _ruido de sal y pimienta_). Un filtro medio reduce la intensidad de los valores extremos pero extiende su influencia. Un pequeño filtro mediano es capaz de eliminar los valores atípicos por completo, con un efecto mínimo sobre el resto de la imagen.

source: Other rank filters include the **minimum** and **maximum filters**, which replace each pixel value with the minimum or maximum value in the surrounding neighborhood respectively ({numref}`fig-processing_filters_rank`). They will become more important when we discuss [morphological operations](chap_morph).
de: Zu den weiteren Rangfiltern gehören die Filter **Minimum** und **Maximum**, die jeden Pixelwert durch den Minimal- bzw. Maximalwert in der umgebenden Nachbarschaft ersetzen ({numref}`fig -processing_filters_rank`). Sie werden wichtiger, wenn wir [morphologische Operationen] (chap_morph) diskutieren.
es: Otros filtros de clasificación incluyen los filtros **mínimo** y **máximo**, que reemplazan cada valor de píxel con el valor mínimo o máximo en el vecindario circundante respectivamente ({numref}`fig-processing_filters_rank`). Se volverán más importantes cuando analicemos [operaciones morfológicas] (chap_morph).

source: The result of applying 3×3 rank filters. The original noise-free image is shown below in {numref}`fig-processing_filters`A.
de: Das Ergebnis der Anwendung von 3×3-Rangfiltern. Das ursprüngliche rauschfreie Bild wird unten in {numref}`fig-processing_filters`A angezeigt.
es: El resultado de aplicar filtros de rango 3×3. La imagen original sin ruido se muestra a continuación en {numref}`fig-processing_filters`A.

source: What would happen if you subtract a minimum filtered image (e.g. {numref}`fig-processing_filters_rank`C) from a maximum filtered image (Figure {numref}`fig-processing_filters_rank`B)?
de: Was würde passieren, wenn Sie ein minimal gefiltertes Bild (z. B. {numref}`fig-processing_filters_rank`C) von einem maximal gefilterten Bild (Abbildung <span class='notranslate'>{numref}</) subtrahieren würden? span>`fig-processing_filters_rank`B)?
es: ¿Qué pasaría si restas una imagen filtrada mínima (por ejemplo, {numref}`fig-processing_filters_rank`C) de una imagen filtrada máxima (Figura {numref}`fig-processing_filters_rank`B)?

source: Subtracting a minimum from a maximum filtered image would be another way to accent the edges:
de: Das Subtrahieren eines Minimums von einem maximal gefilterten Bild wäre eine weitere Möglichkeit, die Kanten hervorzuheben:
es: Restar un mínimo de una imagen filtrada máxima sería otra forma de acentuar los bordes:

source: Gaussian filters
de: Gaußsche Filter
es: Filtros Gaussianos

source: Filters from Gaussian functions
de: Filter aus Gaußschen Funktionen
es: Filtros de funciones Gaussianas

source: We conclude this chapter with one fantastically important linear filter, and some variants based upon it.
de: Wir schließen dieses Kapitel mit einem fantastisch wichtigen linearen Filter und einigen darauf basierenden Varianten ab.
es: Concluimos este capítulo con un filtro lineal increíblemente importante y algunas variantes basadas en él.

source: A **Gaussian filter** is a linear filter that also smooths an image and reduces noise. However, unlike a mean filter -- for which even the furthest away pixels in the neighborhood influence the result by the same amount as the closest pixels -- the smoothing of a Gaussian filter is weighted so that the influence of a pixel decreases with its distance from the filter center. This tends to give a better result in many cases ({numref}`fig-filt_smoothing`).
de: Ein **Gaußfilter** ist ein linearer Filter, der außerdem ein Bild glättet und Rauschen reduziert. Anders als bei einem Mittelwertfilter, bei dem selbst die am weitesten entfernten Pixel in der Nachbarschaft das Ergebnis in gleichem Maße beeinflussen wie die nächstgelegenen Pixel, ist die Glättung eines Gauß-Filters jedoch so gewichtet, dass der Einfluss eines Pixels mit seiner Entfernung abnimmt vom Filterzentrum. Dies führt in vielen Fällen tendenziell zu einem besseren Ergebnis ({numref}`fig-filt_smoothing`).
es: Un **filtro Gaussiano** es un filtro lineal que también suaviza una imagen y reduce el ruido. Sin embargo, a diferencia de un filtro medio, en el que incluso los píxeles más alejados de la vecindad influyen en el resultado en la misma medida que los píxeles más cercanos, el suavizado de un filtro Gaussiano se pondera de modo que la influencia de un píxel disminuye con su distancia. del centro de filtrado. Esto tiende a dar un mejor resultado en muchos casos ({numref}`fig-filt_smoothing`).

source: Comparing a mean and Gaussian filter. The mean filter can introduce patterns and maxima where previously there were none. For example, the brightest region in (B) is one such maximum – _but the values of all pixels in the same region in (A) were zero!_ By contrast, the Gaussian filter produces a smoother, more visually pleasing result, somewhat less prone to this effect \(C).
de: Vergleich eines Mittelwert- und eines Gauß-Filters. Der Mittelwertfilter kann Muster und Maxima einführen, wo zuvor keine vorhanden waren. Beispielsweise ist die hellste Region in (B) ein solches Maximum – _aber die Werte aller Pixel in derselben Region in (A) waren Null!_ Im Gegensatz dazu erzeugt der Gauß-Filter ein glatteres, optisch ansprechenderes Ergebnis, etwas weniger anfällig für diesen Effekt \(C).
es: Comparación de un filtro medio y gaussiano. El filtro medio (promedio) puede introducir patrones y máximos donde antes no los había. Por ejemplo, la región más brillante en (B) es uno de esos máximos – _¡pero los valores de todos los píxeles en la misma región en (A) eran cero!_ Por el contrario, el filtro Gaussiano produce un resultado más suave y visualmente más agradable, algo menos propenso a este efecto \(C).

source: The coefficients of a Gaussian filter are determined from a Gaussian function ({numref}`fig-gaussian_2d`)
de: Die Koeffizienten eines Gaußschen Filters werden aus einer Gaußschen Funktion ({numref}`fig-gaussian_2d`) bestimmt.
es: Los coeficientes de un filtro Gaussiano se determinan a partir de una función Gaussiana ({numref}`fig-gaussian_2d`)

source: The scaling factor $A$ is used to make the entire volume under the surface equal to 1. In terms of filtering, this means that the coefficients add to 1 and the image will not be unexpectedly scaled. The size of the function is controlled by $\sigma$, rather than a filter radius. $\sigma$ is equivalent to the standard deviation of a normal (i.e. Gaussian) distribution.
de: Der Skalierungsfaktor $A$ wird verwendet, um das gesamte Volumen unter der Oberfläche gleich 1 zu machen. In Bezug auf die Filterung bedeutet dies, dass sich die Koeffizienten zu 1 addieren und das Bild nicht unerwartet skaliert wird. Die Größe der Funktion wird durch $\sigma$ und nicht durch einen Filterradius gesteuert. $\sigma$ entspricht der Standardabweichung einer Normalverteilung (d. h. einer Gaußschen Verteilung).
es: El factor de escala $A$ se utiliza para hacer que todo el volumen debajo de la superficie sea igual a 1. En términos de filtrado, esto significa que los coeficientes suman 1 y la imagen no se escalará inesperadamente. El tamaño de la función está controlado por $\sigma$, en lugar de un radio de filtro. $\sigma$ es equivalente a la desviación estándar de una distribución normal (es decir, Gaussiana).

source: Surface plot of a 2D Gaussian function.
de: Oberflächendiagramm einer 2D-Gaußschen Funktion.
es: Gráfico de superficie de una función Gaussiana 2D.

source: A comparison of several filters is shown in {numref}`fig-processing_filters`.
de: Ein Vergleich mehrerer Filter ist in {numref}`fig-processing_filters` dargestellt.
es: Se muestra una comparación de varios filtros en {numref}`fig-processing_filters`.
