Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/4-filters/filters.po
Languages: de, es

source: Default Caption
de: Standardbeschriftung
es: Leyenda predeterminada

source: Filters
de: Filter
es: Filtros

source: Chapter outline
de: Kapitelüberblick
es: Outline del capítulo

source: **Filtering** can make segmentation much easier by **enhancing features** and **reducing noise**
de: **Filterung** kann die Segmentierung viel einfacher machen, indem es **Funktionen verbessert** und **Rauschen reduziert**
es: **El filtrado** puede facilitar mucho la segmentación al **mejorar las funciones** y **reducir el ruido**

source: **Linear filters** replace each pixel by a weighted sum of surrounding pixels
de: **Lineare Filter** ersetzen jedes Pixel durch eine gewichtete Summe der umgebenden Pixel
es: **Filtros lineales** reemplazan cada píxel por una suma ponderada de los píxeles circundantes

source: **Nonlinear filters** replace each pixel with the result of another computation using surrounding pixels
de: **Nichtlineare Filter** ersetzen jedes Pixel durch das Ergebnis einer anderen Berechnung unter Verwendung umgebender Pixel
es: **Filtros no lineales** reemplazan cada píxel con el resultado de otro cálculo utilizando los píxeles circundantes

source: **Gaussian filters** are linear filters with particularly useful properties, making them a good choice for many applications
de: **Gaußfilter** sind lineare Filter mit besonders nützlichen Eigenschaften, was sie für viele Anwendungen zu einer guten Wahl macht
es: **Los filtros Gaussianos** son filtros lineales con propiedades particularmente útiles, lo que los convierte en una buena opción para muchas aplicaciones.

source: Introduction
de: Einführung
es: Introducción

source: Filters are phenomenally useful. Almost all interesting image analysis involves filtering in some way at some stage. In fact, the analysis of a difficult image can sometimes become (almost) trivial once a suitable filter has been applied to it. It's therefore no surprise that much of the image processing literature is devoted to the topic of designing and testing filters.
de: Filter sind phänomenal nützlich. Fast jede interessante Bildanalyse beinhaltet irgendwann einmal eine Filterung. Tatsächlich kann die Analyse eines schwierigen Bildes manchmal (fast) trivial werden, sobald ein geeigneter Filter darauf angewendet wurde. Es ist daher nicht verwunderlich, dass sich ein Großteil der Bildverarbeitungsliteratur dem Thema Design und Test von Filtern widmet.
es: Los filtros son fenomenalmente útiles. Casi todos los análisis de imágenes interesantes implican filtrar de alguna manera en algún momento. De hecho, el análisis de una imagen difícil a veces puede volverse (casi) trivial una vez que se le ha aplicado un filtro adecuado. Por lo tanto, no sorprende que gran parte de la literatura sobre procesamiento de imágenes esté dedicada al tema del diseño y prueba de filtros.

source: The basic idea of filtering here is that each pixel in an image is assigned a new value depending upon the values of other pixels within some defined region (the pixel's **neighborhood**). Different filters work by applying different calculations to the neighborhood to get their output. Although the plethora of available filters can be intimidating at first, knowing only a few of the most useful filters is already a huge advantage.
de: Die Grundidee des Filterns besteht hier darin, dass jedem Pixel in einem Bild ein neuer Wert zugewiesen wird, abhängig von den Werten anderer Pixel innerhalb eines definierten Bereichs (der **Nachbarschaft** des Pixels). Verschiedene Filter funktionieren, indem sie unterschiedliche Berechnungen auf die Nachbarschaft anwenden, um ihre Ausgabe zu erhalten. Obwohl die Fülle an verfügbaren Filtern zunächst einschüchternd sein kann, ist es bereits ein großer Vorteil, nur einige der nützlichsten Filter zu kennen.
es: La idea básica del filtrado aquí es que a cada píxel de una imagen se le asigna un nuevo valor dependiendo de los valores de otros píxeles dentro de una región definida (el **vecindario** del píxel). Los diferentes filtros funcionan aplicando diferentes cálculos a la vecindad para obtener su resultado. Aunque la gran cantidad de filtros disponibles puede resultar intimidante al principio, conocer sólo algunos de los filtros más útiles ya es una gran ventaja.

source: This chapter begins by introducing several extremely common **linear** and **nonlinear filters** for image processing. It ends by considering in detail some techniques based on one particularly important linear filter.
de: Dieses Kapitel beginnt mit der Einführung mehrerer äußerst gebräuchlicher **linearer** und **nichtlinearer Filter** für die Bildverarbeitung. Abschließend werden einige Techniken im Detail betrachtet, die auf einem besonders wichtigen linearen Filter basieren.
es: Este capítulo comienza presentando varios filtros **lineales** y **no lineales** extremadamente comunes para el procesamiento de imágenes. El capítulo termina considerando en detalle algunas técnicas basadas en un filtro lineal particularmente importante.

source: Linear filters
de: Lineare Filter
es: Filtros lineales

source: Linear filters replace each pixel with a **linear combination** ('sum of products') of other pixels. Therefore the only mathematical background they require is the ability to add and multiply.
de: Lineare Filter ersetzen jedes Pixel durch eine **lineare Kombination** („Summe der Produkte“) anderer Pixel. Daher ist der einzige mathematische Hintergrund, den sie benötigen, die Fähigkeit zum Addieren und Multiplizieren.
es: Los filtros lineales reemplazan cada píxel con una **combinación lineal** ("suma de productos") de otros píxeles. Por lo tanto, la única base matemática que necesitan es la capacidad de sumar y multiplicar.

source: A linear filter is defined using a **filter kernel**, which is like a tiny image in which the pixels are called **filter coefficients**. To filter an image, we center the kernel over each pixel of the input image. We then multiply each filter coefficient by the input image pixel that it overlaps, summing the result to give our filtered pixel value. Some examples should make this clearer.
de: Ein linearer Filter wird mithilfe eines **Filterkerns** definiert, der einem winzigen Bild ähnelt, in dem die Pixel **Filterkoeffizienten** genannt werden. Um ein Bild zu filtern, zentrieren wir den Kernel über jedem Pixel des Eingabebildes. Anschließend multiplizieren wir jeden Filterkoeffizienten mit dem überlappenden Eingabebildpixel und summieren das Ergebnis, um unseren gefilterten Pixelwert zu erhalten. Einige Beispiele sollen dies verdeutlichen.
es: Un filtro lineal se define utilizando un **núcleo (kernel) de filtro**, que es como una imagen pequeña en la que los píxeles se denominan **coeficientes de filtro**. Para filtrar una imagen, centramos el núcleo sobre cada píxel de la imagen de input. Luego multiplicamos cada coeficiente de filtro por el píxel de la imagen de entrada que se superpone, sumando el resultado para obtener nuestro valor de píxel filtrado. Algunos ejemplos deberían aclarar esto.

source: Mean filters
de: Mittlere Filter
es: Filtros medios

source: Arguably the simplest linear filter is the **mean filter**. Each pixel value is simply replaced by the average (mean) of itself and its neighbors within a defined area.
de: Der wohl einfachste lineare Filter ist der **Mittelwertfilter**. Jeder Pixelwert wird einfach durch den Durchschnitt (Mittelwert) von sich selbst und seinen Nachbarn innerhalb eines definierten Bereichs ersetzt.
es: Podría decirse que el filtro lineal más simple es el **filtro medio**. Cada valor de píxel simplemente se reemplaza por el promedio (media) de sí mismo y de sus vecinos dentro de un área definida.

source: A simple **3×3 mean filter** averages each pixel with its 8 immediate neighbors (above, below, left, right and diagonals). The filter kernel contains 9 values, arranged as a 3×3 square. Each coefficient is 1/9, meaning that together all coefficients sum to 1.
de: Ein einfacher **3×3-Mittelwertfilter** mittelt jedes Pixel mit seinen 8 unmittelbaren Nachbarn (oben, unten, links, rechts und diagonal). Der Filterkern enthält 9 Werte, angeordnet als 3×3-Quadrat. Jeder Koeffizient beträgt 1/9, was bedeutet, dass die Summe aller Koeffizienten 1 ergibt.
es: Un simple **filtro de media 3×3** promedia cada píxel con sus 8 vecinos inmediatos (arriba, abajo, izquierda, derecha y diagonales). El núcleo del filtro contiene 9 valores, dispuestos como un cuadrado de 3×3. Cada coeficiente es 1/9, lo que significa que juntos todos los coeficientes suman 1.

source: The process of filtering with a 3×3 mean filter kernel is demonstrated below:
de: Der Filtervorgang mit einem 3×3-Mittelwertfilterkernel wird unten demonstriert:
es: El proceso de filtrado con un núcleo de filtro medio de 3×3 se demuestra a continuación:

source: One of the main uses of a 3×3 mean filter is to reduce some common types of image noise, including Gaussian noise and Poisson noise.
de: Eine der Hauptanwendungen eines 3×3-Mittelwertfilters besteht darin, einige gängige Arten von Bildrauschen zu reduzieren, darunter Gaußsches Rauschen und Poisson-Rauschen.
es: Uno de los usos principales de un filtro medio de 3×3 es reducir algunos tipos comunes de ruido de imagen, incluyendo el ruido Gaussiano y el ruido de Poisson.

source: We'll discuss the subject of noise in much more detail in a later chapter, {ref}`chap_formation_noise`, and demonstrate *why* a mean filter works to reduce it. At this point, all we need to know about noise is that it acts like a random (positive or negative) error added to each pixel value, which obscures detail, messes with the histogram, and makes the image look grainy.
de: Wir werden das Thema Rauschen in einem späteren Kapitel, {ref}`chap_formation_noise`, ausführlicher besprechen und zeigen, *warum* ein Mittelwertfilter funktioniert, um es zu reduzieren. An dieser Stelle müssen wir über Rauschen nur wissen, dass es sich wie ein zufälliger (positiver oder negativer) Fehler verhält, der jedem Pixelwert hinzugefügt wird, wodurch Details verdeckt werden, das Histogramm durcheinander gebracht wird und das Bild körnig aussieht.
es: Discutiremos el tema del ruido con mucho más detalle en un capítulo posterior, {ref}`chap_formation_noise`, y demostraremos *por qué* un filtro medio funciona para reducirlo. En este punto, todo lo que necesitamos saber sobre el ruido es que actúa como un error aleatorio (positivo o negativo) agregado a cada valor de píxel, lo que oscurece los detalles, altera el histograma y hace que la imagen parezca granulada.

source: {numref}`fig-filt_reduce_noise` provides an illustration of how effectively the 3×3 filter can reduce Gaussian noise in an image.
de: {numref}`fig-filt_reduce_noise` veranschaulicht, wie effektiv der 3×3-Filter Gaußsches Rauschen in einem Bild reduzieren kann.
es: {numref}`fig-filt_reduce_noise` proporciona un ejemplo de la eficacia con la que el filtro 3×3 puede reducir el ruido Gaussiano en una imagen.

source: Filters can be used to reduce noise. Applying a 3×3 mean filter makes the image smoother, as is particularly evident in the fluorescence plot made through the image center. Computing the difference between images shows what the filter removed, which was mostly random noise (with a little bit of image detail as well).
de: Zur Geräuschreduzierung können Filter eingesetzt werden. Durch die Anwendung eines 3×3-Mittelwertfilters wird das Bild glatter, was insbesondere im Fluoreszenzdiagramm durch die Bildmitte deutlich wird. Die Berechnung des Unterschieds zwischen Bildern zeigt, was der Filter entfernt hat, nämlich größtenteils zufälliges Rauschen (mit ein wenig Bilddetails).
es: Se pueden utilizar filtros para reducir el ruido. La aplicación de un filtro medio de 3 × 3 hace que la imagen sea más suave, como es particularmente evidente en el gráfico de fluorescencia realizado a través del centro de la imagen. Calcular la diferencia entre imágenes muestra lo que eliminó el filtro, que fue principalmente ruido aleatorio (con un poco de detalle de la imagen también).

source: Our simple 3×3 mean filter could be easily modified in at least two ways:
de: Unser einfacher 3×3-Mittelwertfilter könnte auf mindestens zwei Arten leicht modifiziert werden:
es: Nuestro sencillo filtro medio de 3×3 podría modificarse fácilmente de al menos dos maneras:

source: Its size could be increased. For example, instead of using just the pixels immediately adjacent to the one we are interested in, a 5×5 mean filter replaces each pixel by the average of a square containing 25 pixels, still centered on the main pixel of interest.
de: Seine Größe könnte vergrößert werden. Anstatt beispielsweise nur die Pixel zu verwenden, die unmittelbar an das Pixel angrenzen, an dem wir interessiert sind, ersetzt ein 5×5-Mittelwertfilter jedes Pixel durch den Durchschnitt eines Quadrats mit 25 Pixeln, das immer noch auf dem interessierenden Hauptpixel zentriert ist.
es: Se podría aumentar su tamaño. Por ejemplo, en lugar de utilizar sólo los píxeles inmediatamente adyacentes al que nos interesa, un filtro medio de 5×5 reemplaza cada píxel por el promedio de un cuadrado que contiene 25 píxeles, todavía centrado en el píxel principal de interés.

source: The average of the pixels in some other shape of region could be computed, not just an _n×n_ square.
de: Der Durchschnitt der Pixel in einer anderen Regionsform könnte berechnet werden, nicht nur ein _n×n_-Quadrat.
es: Se podría calcular el promedio de los píxeles en algun otro formato de región, no solo un cuadrado _n×n_.

source: Both of these adjustments can be achieved by changing the size of the filter kernel and its coefficients.
de: Beide Anpassungen können durch Ändern der Größe des Filterkerns und seiner Koeffizienten erreicht werden.
es: Ambos ajustes se pueden lograr cambiando el tamaño del núcleo (kernel) del filtro y sus coeficientes.

source: One common change is to make a 'circular' mean filter. We can do this by defining the kernel in such a way that coefficients we want to ignore are set to 0, and the non-zero pixels approximate a circle. The size of the filter is then defined in terms of a radius value ({numref}`fig-filter_shapes`).
de: Eine häufige Änderung besteht darin, einen „zirkulären“ Mittelwertfilter zu erstellen. Wir können dies erreichen, indem wir den Kernel so definieren, dass Koeffizienten, die wir ignorieren möchten, auf 0 gesetzt werden und die Pixel ungleich Null einen Kreis annähern. Die Größe des Filters wird dann als Radiuswert definiert ({numref}`fig-filter_shapes`).
es: Un cambio común es hacer un filtro promedio "circular". Podemos hacer esto definiendo el núcleo de tal manera que los coeficientes que queremos ignorar tengan el valor de 0 y los píxeles distintos de cero se aproximen a un círculo. Luego, el tamaño del filtro se define en términos de un valor de radio ({numref}`fig-filter_shapes`).

source: The kernels used with several mean filters. Note that there's no clearly 'right' way to approximate a circle within a pixel grid, and as a result different software can create circular filters that are slightly different. Here, \(B) and (C) match the 'circular' filters used by ImageJ's {menuselection}`Process --> Filters --> Mean...` command.
de: Die Kernel werden mit mehreren Mittelwertfiltern verwendet. Beachten Sie, dass es keinen eindeutig „richtigen“ Weg gibt, einen Kreis innerhalb eines Pixelrasters anzunähern, und dass daher verschiedene Software leicht unterschiedliche Kreisfilter erstellen kann. Hier stimmen \(B) und (C) mit den „zirkulären“ Filtern überein, die vom {menuselection}`Process --> Filters --> Mean...`-Befehl von ImageJ verwendet werden.
es: Los nucleos (kernels) se utilizan con varios filtros promedio. Ten en cuenta que no existe una forma claramente "correcta" de aproximar un círculo dentro de una cuadrícula de píxeles y, como resultado, diferentes programas pueden crear filtros circulares que son ligeramente diferentes. Aquí, \(B) y (C) coinciden con los filtros 'circulares' utilizados por el comando {menuselection}`Process --> Filters --> Mean...` de ImageJ.

source: Different names for (almost) the same thing
de: Verschiedene Namen für (fast) dasselbe
es: Diferentes nombres para (casi) lo mismo

source: The world of filtering is full of concepts with multiple names, all meaning pretty much the same thing. For example:
de: Die Welt des Filterns ist voll von Konzepten mit mehreren Namen, die alle so ziemlich dasselbe bedeuten. Zum Beispiel:
es: El mundo del filtrado está lleno de conceptos con múltiples nombres, y todos significan prácticamente lo mismo. Por ejemplo:

source: **linear filtering** may be called **convolution** (very common) or **correlation**[^fn_conv] (less common)
de: **lineare Filterung** kann als **Faltung** (sehr häufig) oder **Korrelation**[^fn_conv] (seltener) bezeichnet werden.
es: El **filtrado lineal** puede denominarse **convolución** (muy común) o **correlación**[^fn_conv] (menos común)

source: a **filter kernel** might be called a **filter mask**
de: Ein **Filterkernel** könnte als **Filtermaske** bezeichnet werden.
es: un **núcleo (kernel) de filtro** podría denominarse **máscara de filtro**

source: **mean filters** are sometimes referred to as **arithmetic mean filters**, **averaging filters** or **boxcar filters**
de: **Mittelwertfilter** werden manchmal als **arithmetische Mittelwertfilter**, **Mittelungsfilter** oder **Boxcar-Filter** bezeichnet.
es: Los **filtros de media** a veces se denominan **filtros de media aritmética**, **filtros de promedio** o **filtros de furgón**

source: Take your pick. It's worth knowing the equivalence to avoid being confused by the literature. In particular, 'convolve' is used often enough as a synonym for 'filter' (with a linear filter) that it's important to remember.
de: Treffen Sie Ihre Wahl. Es lohnt sich, die Äquivalenz zu kennen, um Verwirrung durch die Literatur zu vermeiden. Insbesondere wird „konvolvieren“ oft genug als Synonym für „Filter“ (mit einem linearen Filter) verwendet, dass es wichtig ist, sich daran zu erinnern.
es: Elige tu opción. Vale la pena conocer la equivalencia para evitar confundirse con la literatura. En particular, 'convolve' se utiliza con tanta frecuencia como sinónimo de 'filtro' (con un filtro lineal) que es importante recordar.

source: Increasing the size of a mean filter increases its impact. This is not only in terms of reducing noise, but also in terms of reducing detail, i.e. making the image more blurry ({numref}`fig-mean_filter_sizes`). If noise reduction is the primary goal, it's therefore best to avoid unnecessary blurring by using the smallest filter that gives acceptable results.
de: Durch Erhöhen der Größe eines Mittelwertfilters erhöht sich seine Wirkung. Dabei geht es nicht nur um die Reduzierung von Rauschen, sondern auch um die Reduzierung von Details, d. h. darum, das Bild unschärfer zu machen ({numref}`fig-mean_filter_sizes`). Wenn die Rauschunterdrückung das primäre Ziel ist, ist es daher am besten, unnötige Unschärfe zu vermeiden, indem man den kleinsten Filter verwendet, der akzeptable Ergebnisse liefert.
es: Aumentar el tamaño de un filtro medio aumenta su impacto. Esto no es solo en términos de reducir el ruido, sino también en términos de reducir los detalles, es decir, hacer que la imagen sea más borrosa ({numref}`fig-mean_filter_sizes`). Si el objetivo principal es la reducción de ruido, es mejor evitar la borrosidad innecesaria utilizando el filtro más pequeño que proporcione resultados aceptables.

source: Smoothing an image using circular mean filters with different radii.
de: Glätten eines Bildes mithilfe kreisförmiger Mittelwertfilter mit unterschiedlichen Radien.
es: Suavizar una imagen usando filtros medios circulares con diferentes radios.

source: Question
de: Frage
es: Pregunta

source: In ImageJ, creating a mean filter with *Radius = 6* results in a circular filter that replaces each pixel with the mean of 121 pixels. Using a square 11×11 filter would also replace each pixel with the mean of 121 pixels.
de: In ImageJ führt die Erstellung eines Mittelwertfilters mit *Radius = 6* zu einem kreisförmigen Filter, der jedes Pixel durch den Mittelwert von 121 Pixel ersetzt. Die Verwendung eines quadratischen 11×11-Filters würde auch jedes Pixel durch den Mittelwert von 121 Pixeln ersetzen.
es: En ImageJ, crear un filtro medio con *Radio = 6* da como resultado un filtro circular que reemplaza cada píxel con la media de 121 píxeles. El uso de un filtro cuadrado de 11 × 11 también reemplazaría cada píxel con la media de 121 píxeles.

source: Can you think of any advantages in using the circular filter rather than the square filter?
de: Können Sie sich Vorteile bei der Verwendung des kreisförmigen Filters gegenüber dem quadratischen Filter vorstellen?
es: ¿Se te ocurre alguna ventaja al utilizar el filtro circular en lugar del filtro cuadrado?

source: Answer
de: Antwort
es: Respuesta

source: Circles are more 'compact'. Every point on the perimeter of a circle is the same distance from the center. Therefore using a circular filter involves calculating the mean of all pixels a distance of $\leq$ *Radius* pixels away from the center.
de: Kreise sind „kompakter“. Jeder Punkt auf dem Umfang eines Kreises hat den gleichen Abstand vom Mittelpunkt. Daher erfordert die Verwendung eines kreisförmigen Filters die Berechnung des Mittelwerts aller Pixel in einem Abstand von $\leq$ *Radius* Pixeln vom Zentrum entfernt.
es: Los círculos son más "compactos". Cada punto del perímetro de un círculo está a la misma distancia del centro. Por lo tanto, usar un filtro circular implica calcular la media de todos los píxeles a una distancia de $\leq$ *Radius* píxeles del centro.

source: For a square filter, pixels that are further away in diagonal directions than horizontal or vertical directions are allowed to influence the results. If a pixel is further away, it's more likely to have a very different value because it is part of some other structure. Averaging across structures can blur them into one another, so is best avoided.
de: Bei einem quadratischen Filter dürfen Pixel, die in diagonaler Richtung weiter entfernt sind als in horizontaler oder vertikaler Richtung, die Ergebnisse beeinflussen. Wenn ein Pixel weiter entfernt ist, hat es mit größerer Wahrscheinlichkeit einen ganz anderen Wert, da es Teil einer anderen Struktur ist. Eine Mittelung über Strukturen hinweg kann dazu führen, dass sie miteinander verschwimmen, und sollte daher am besten vermieden werden.
es: Para un filtro cuadrado, los píxeles que están más alejados en direcciones diagonales que en direcciones horizontales o verticales pueden influir en los resultados. Si un píxel está más lejos, es más probable que tenga un valor muy diferente porque forma parte de alguna otra estructura. Promediar las estructuras puede difuminarlas entre sí, por lo que es mejor evitarlo.

source: Gradient filters
de: Verlaufsfilter
es: Filtros de gradiente

source: Linear filters can do much more than simply compute local averages. We only need to define a new filter kernel with different coefficients.
de: Lineare Filter können viel mehr als nur lokale Durchschnittswerte berechnen. Wir müssen lediglich einen neuen Filterkern mit unterschiedlichen Koeffizienten definieren.
es: Los filtros lineales pueden hacer mucho más que simplemente calcular promedios locales. Solo necesitamos definir un nuevo núcleo de filtro con diferentes coeficientes.
