Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/2-processing/4-filters/imagej.po
Languages: de

source: ImageJ: Filters
de: ImageJ: Filter

source: Introduction
de: Einführung

source: Most of the filters we've considered are available through the {menuselection}`Process --> Filters` submenu. This section adds a little more information about their implementation in ImageJ, and asks a few questions.
de: Die meisten der von uns in Betracht gezogenen Filter sind über das Untermenü {menuselection}`Prozess --> Filter` verfügbar. In diesem Abschnitt werden einige weitere Informationen zu ihrer Implementierung in ImageJ hinzugefügt und einige Fragen gestellt.

source: Linear filters
de: Lineare Filter

source: Mean filters
de: Mittlere Filter

source: The easiest way to apply a 3×3 mean filter in ImageJ is through the {menuselection}`Process --> Smooth` command. The fact that the shortcut is {kbd}`Shift+S` can almost make this *too* easy, as I find myself accidentally smoothing when I really wanted to save my image. Take care.
de: Der einfachste Weg, einen 3×3-Mittelwertfilter in ImageJ anzuwenden, ist der Befehl {menuselection}`Process --> Smooth`. Die Tatsache, dass die Tastenkombination {kbd}„Umschalt+S“ lautet, kann dies fast *zu* einfach machen, da ich versehentlich glätte, obwohl ich mein Bild eigentlich speichern wollte. Aufpassen.

source: To apply larger mean filters, the command is {menuselection}`Process --> Filters --> Mean...`. It uses approximately circular neighborhoods, and the neighborhood size is adjusted by choosing a {guilabel}`Radius` value. The {menuselection}`Process --> Filters --> Show Circular Masks` command displays the neighborhoods used for different values of {guilabel}`Radius`. If you happen to choose *Radius = 1*, you get a 3×3 filter -- and the same results as using {menuselection}`Smooth`.
de: Um größere Mittelwertfilter anzuwenden, lautet der Befehl {menuselection}`Process --> Filters --> Mean...`. Es werden annähernd kreisförmige Nachbarschaften verwendet und die Nachbarschaftsgröße wird durch Auswahl eines {guilabel}`Radius`-Werts angepasst. Der Befehl {menuselection}`Process --> Filters --> Show Circular Masks` zeigt die Nachbarschaften an, die für verschiedene Werte von {guilabel} verwendet werden Radius`. Wenn Sie *Radius = 1* wählen, erhalten Sie einen 3×3-Filter – und die gleichen Ergebnisse wie bei Verwendung von {menuselection}`Smooth`.

source: Gaussian filters
de: Gaußsche Filter

source: {menuselection}`Process --> Filters --> Gaussian Blur...` is the command that implements a Gaussian filter.
de: {menuselection}`Process --> Filters --> Gaussian Blur...` ist der Befehl, der einen Gaußschen Filter implementiert.

source: In the event that you want a Gaussian filter that isn't isotropic (i.e. has a different size along different dimensions), {menuselection}`Process --> Filters --> Gaussian Blur 3D...` can be used.
de: Für den Fall, dass Sie einen Gaußschen Filter wünschen, der nicht isotrop ist (d. h. in verschiedenen Dimensionen eine unterschiedliche Größe hat), {menuselection}`Prozess --> Filter --> Gaussian Blur 3D ...` kann verwendet werden.

source: Although not *really* recommended, unsharp masking is available through {menuselection}`Process --> Filters --> Unsharp mask...`.
de: Obwohl dies nicht *wirklich* empfohlen wird, ist die Unscharfmaskierung über {menuselection}`Prozess --> Filter --> Unscharfmaskierung...“ verfügbar.

source: Difference of Gaussians
de: Unterschied der Gauß-Funktionen

source: There's currently no direct command in ImageJ to implement difference of Gaussians filtering, rather the steps need to be pieced together with image duplication and subtraction. However {ref}`chap_macro_dog` describes how to generate a macro for DoG filtering.
de: Derzeit gibt es in ImageJ keinen direkten Befehl zum Implementieren der unterschiedlichen Gaußschen Filterung, vielmehr müssen die Schritte durch Bildduplizierung und -subtraktion zusammengesetzt werden. Allerdings beschreibt {ref}`chap_macro_dog`, wie man ein Makro für die DoG-Filterung generiert.

source: Custom linear filters
de: Benutzerdefinierte lineare Filter

source: {menuselection}`Process --> Filters --> Convolve...` makes it possible to define any custom linear filter by entering the values of the desired coefficients, separated by spaces and arranged in rows and columns. If you {guilabel}`Normalize Kernel` is selected, then the coefficients are scaled so that they add to 1, by dividing by the sum of all the coefficients -- unless the sum is 0, in which case requesting normalizion does nothing.
de: {menuselection}`Process --> Filters --> Convolve...` ermöglicht die Definition eines beliebigen benutzerdefinierten linearen Filters durch Eingabe der Werte der gewünschten Koeffizienten, getrennt durch Leerzeichen und angeordnet in Zeilen und Spalten. Wenn Sie {guilabel}„Kernel normalisieren“ auswählen, werden die Koeffizienten so skaliert, dass sie sich zu 1 addieren, indem sie durch die Summe aller Koeffizienten dividiert werden – es sei denn, die Summe ist 0 , in diesem Fall führt die Anforderung einer Normalisierung zu nichts.

source: Question
de: Frage

source: When defining an _n_×_n_ filter kernel with {menuselection}`Convolve...`, ImageJ insists that __n__ is an odd number. Why?
de: Beim Definieren eines _n_×_n_ Filterkernels mit {menuselection}`Convolve...` besteht ImageJ darauf, dass __n__ eine ungerade Zahl ist. Warum?

source: Answer
de: Antwort

source: If *n* is an odd number, the filter has a clear central pixel. This makes it possible to center the filter kernel on a pixel on the image.
de: Wenn *n* eine ungerade Zahl ist, hat der Filter ein klares zentrales Pixel. Dadurch ist es möglich, den Filterkern auf einen Pixel im Bild zu zentrieren.

source: Predict what happens when you convolve an image using a filter that consists of a single coefficient with a value -1 in the following cases:
de: Sagen Sie voraus, was passiert, wenn Sie ein Bild mit einem Filter falten, der in den folgenden Fällen aus einem einzelnen Koeffizienten mit dem Wert -1 besteht:

source: {guilabel}`Normalize Kernel` is checked
de: {guilabel}„Kernel normalisieren“ ist aktiviert

source: You have a 32-bit image, {guilabel}`Normalize Kernel` is unchecked
de: Sie haben ein 32-Bit-Image, {guilabel}„Kernel normalisieren“ ist deaktiviert

source: You have an 8-bit image, {guilabel}`Normalize Kernel` is unchecked
de: Sie haben ein 8-Bit-Image, {guilabel}„Kernel normalisieren“ ist deaktiviert

source: The results of convolving with a single -1 coefficient in different circumstances:
de: Die Ergebnisse der Faltung mit einem einzelnen -1-Koeffizienten unter verschiedenen Umständen:

source: _{guilabel}`Normalize Kernel` is checked_: Nothing at all happens. The normalization makes the filter just a single 1... and convolving with a single 1 leaves the image unchanged.
de: _{guilabel}„Kernel normalisieren“ ist aktiviert_: Es passiert überhaupt nichts. Durch die Normalisierung wird der Filter nur zu einer einzelnen 1 ... und die Faltung mit einer einzelnen 1 lässt das Bild unverändert.

source: _You have a 32-bit image ({guilabel}`Normalize Kernel` unchecked)_: The pixel values become negative, and the image looks inverted.
de: _Sie haben ein 32-Bit-Bild ({guilabel}„Kernel normalisieren“ deaktiviert)_: Die Pixelwerte werden negativ und das Bild sieht invertiert aus.

source: _You have an 8-bit image ({guilabel}`Normalize Kernel` unchecked)_: The pixel values would become negative, but then cannot be stored in an 8-bit unsigned integer form. Therefore, all pixels simply become clipped to zero.
de: _Sie haben ein 8-Bit-Bild ({guilabel}„Kernel normalisieren“ deaktiviert)_: Die Pixelwerte würden negativ werden, können dann aber nicht in einer 8-Bit-Ganzzahlform ohne Vorzeichen gespeichert werden. Daher werden alle Pixel einfach auf Null abgeschnitten.

source: Practical
de: Praktisch

source: Using any image, work out which of the methods for dealing with boundaries shown in {numref}`fig-filter_boundaries` is used by ImageJ's {menuselection}`Convolve...` command.
de: Ermitteln Sie anhand eines beliebigen Bildes, welche der in {numref}`fig-filter_boundaries` gezeigten Methoden zum Umgang mit Grenzen von ImageJs <span class='notranslate'>{menuselection}</span verwendet wird >Befehl „Konvolvieren...“.

source: **Note:** This requires a bit of creativity. It will certainly help to use an image with some variation at the image boundary. I used {menuselection}`File --> Open Samples --> Blobs`.
de: **Hinweis:** Dies erfordert ein wenig Kreativität. Es wird sicherlich hilfreich sein, ein Bild mit einer gewissen Variation an der Bildgrenze zu verwenden. Ich habe {menuselection}`File --> Open Samples --> Blobs` verwendet.

source: [![launch ImageJ.JS](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https://gist.github.com/petebankhead/cbbb6f210d173c8488247799efc3b970)
de: [![ImageJ.JS starten](https://ij.imjoy.io/assets/badge/launch-imagej-js-badge.svg)](https://ij.imjoy.io?run=https:/ /gist.github.com/petebankhead/cbbb6f210d173c8488247799efc3b970)

source: launch ImageJ.JS
de: Starten Sie ImageJ.JS

source: Solution
de: Lösung

source: Replication of boundary pixels is the default method used by {menuselection}`Process --> Filters --> Convolve...` in ImageJ (although other filtering plugins by different authors might use different methods).
de: Die Replikation von Grenzpixeln ist die Standardmethode, die von {menuselection}`Process --> Filters --> Convolve...` in ImageJ verwendet wird (obwohl andere Filter-Plugins von anderen Autoren möglicherweise andere verwenden Methoden).

source: My approach to test this involved using {menuselection}`Convolve...` with a filter that consisting of a 1 followed by a lot of zeros (e.g. `1 0 0 0 0 0 0 0 0 0 0 0 0...`). This basically shifts the image to the right, bringing whatever is outside the image boundary into view.
de: Mein Ansatz, dies zu testen, bestand darin, {menuselection}„Convolve...“ mit einem Filter zu verwenden, der aus einer 1 gefolgt von vielen Nullen besteht (z. B. „1 0 0 0 0 0 0“) 0 0 0 0 0 0...`). Dadurch wird das Bild grundsätzlich nach rechts verschoben, sodass alles, was sich außerhalb der Bildgrenze befindet, sichtbar wird.

source: Gradient magnitude
de: Gradientengröße

source: Practice using the commands we've met so far by determining the **gradient magnitude** of an image, as described [here](sec_filters_gradient).
de: Üben Sie die Verwendung der Befehle, die wir bisher kennengelernt haben, indem Sie die **Gradientengröße** eines Bildes bestimmen, wie [hier](sec_filters_gradient) beschrieben.

source: You will need to use
de: Sie müssen verwenden

source: {menuselection}`Image --> Duplicate...`
de: {menuselection}`Bild --> Duplizieren...`

source: {menuselection}`Process --> Filters --> Convolve...`
de: {menuselection}`Prozess --> Filter --> Convolve...`

source: {menuselection}`Process --> Image Calculator...`
de: {menuselection}`Prozess --> Bildrechner...`

source: Several commands in the {menuselection}`Process --> Math` submenu
de: Mehrere Befehle im Untermenü {menuselection}`Process --> Math`

source: Something else we've used before... possibly
de: Etwas anderes, das wir schon einmal verwendet haben ... möglicherweise

source: If you need a sample image, you can use {menuselection}`File --> Open samples --> Blobs (25K)`. _(Be sure to pay attention to the bit-depth!)_
de: Wenn Sie ein Beispielbild benötigen, können Sie {menuselection}`Datei --> Beispiele öffnen --> Blobs (25K)" verwenden. _(Achten Sie unbedingt auf die Bittiefe!)_

source: The process to calculate the gradient magnitude is:
de: Der Prozess zur Berechnung der Gradientengröße ist:

source: Convert the image to 32-bit (if it isn't already 32-bit)
de: Konvertieren Sie das Bild in 32-Bit (falls es nicht bereits 32-Bit ist)

source: Duplicate the image
de: Duplizieren Sie das Bild

source: Convolve one copy of the image with the horizontal gradient filter, and one with the vertical (i.e. coefficients `-1 0 1` arranged as a row or column)
de: Falten Sie eine Kopie des Bildes mit dem horizontalen Verlaufsfilter und eine mit dem vertikalen (d. h. Koeffizienten „-1 0 1“, angeordnet als Zeile oder Spalte).

source: Compute the square of both images ({menuselection}`Process --> Math --> Square`)
de: Berechnen Sie das Quadrat beider Bilder ({menuselection}`Prozess --> Mathematik --> Quadrat`)

source: Use the image calculator to add the images together
de: Verwenden Sie den Bildrechner, um die Bilder zusammenzurechnen

source: Compute the square root of the resulting image ({menuselection}`Process --> Math --> Square Root`)
de: Berechnen Sie die Quadratwurzel des resultierenden Bildes ({menuselection}`Prozess --> Mathematik --> Quadratwurzel")

source: Here's a macro that implements these steps:
de: Hier ist ein Makro, das diese Schritte implementiert:

source: The convolution results in negative values, which is why the 32-bit conversion is needed.
de: Die Faltung führt zu negativen Werten, weshalb die 32-Bit-Konvertierung erforderlich ist.

source: **Note:** This is (almost) what is done by the command {menuselection}`Process --> Find Edges`, except the gradient filters are slightly different.
de: **Hinweis:** Das ist (fast) das, was mit dem Befehl {menuselection}`Process --> Find Edges` erledigt wird, außer dass die Verlaufsfilter etwas anders sind.

source: The 'Edges' LUT
de: Die „Edges“-LUT

source: ImageJ has a LUT called **edges** under {menuselection}`Image --> Lookup Tables --> Edges`. Applied to {menuselection}`File --> Open samples --> Blobs (25K)`, it does a rather good job of highlighting edges -- without actually changing the pixels at all.
de: ImageJ hat eine LUT namens **edges** unter {menuselection}`Image --> Lookup Tables --> Edges`. Angewendet auf {menuselection}`File --> Open Samples --> Blobs (25K)` gelingt die Hervorhebung von Kanten ziemlich gut – ohne die Pixel tatsächlich zu verändern.

source: How does it work? Does it apply a filter?
de: Wie funktioniert es? Wendet es einen Filter an?

source: The {menuselection}`edges` LUT shows most low and high pixel values as black -- and uses lighter shades of gray only for a small range of values in between (see {menuselection}`Image --> Color --> Edit LUT...`). In any image with a good separation of background and foreground pixels, but which still has a somewhat smooth transition between them, this means everything but the edges can appear black.
de: Die {menuselection}`edges`-LUT zeigt die meisten niedrigen und hohen Pixelwerte als Schwarz an – und verwendet hellere Grautöne nur für einen kleinen Wertebereich dazwischen (siehe {menuselection}`Bild --> Farbe --> LUT bearbeiten...`). In jedem Bild mit einer guten Trennung von Hintergrund- und Vordergrundpixeln, aber dennoch einem einigermaßen fließenden Übergang zwischen ihnen, bedeutet dies, dass alles außer den Rändern schwarz erscheinen kann.

source: All this is achieved by a LUT: no pixels were harmed, there was no filtering applied.
de: All dies wird durch eine LUT erreicht: Es wurden keine Pixel beschädigt, es wurde keine Filterung angewendet.

source: Nonlinear filters
de: Nichtlineare Filter

source: Rank filters
de: Rangfilter

source: The main rank filters are to be found exactly where you might expect them:
de: Die wichtigsten Rangfilter sind genau dort zu finden, wo Sie sie erwarten:

source: {menuselection}`Process --> Filters --> Median...`
de: {menuselection}`Prozess --> Filter --> Median...`

source: {menuselection}`Process --> Filters --> Minimum...`
de: {menuselection}`Prozess --> Filter --> Minimum...`

source: {menuselection}`Process --> Filters --> Maximum...`
de: {menuselection}`Prozess --> Filter --> Maximum...`

source: ImageJ uses circular neighborhoods with its built-in rank filters, similar to how mean filters are implemented. We will meet these filters again in {ref}`chap_morph`.
de: ImageJ verwendet kreisförmige Nachbarschaften mit seinen integrierten Rangfiltern, ähnlich wie Mittelwertfilter implementiert werden. Wir werden diese Filter in {ref}`chap_morph` wieder treffen.

source: Removing outliers
de: Ausreißer entfernen

source: {numref}`fig-processing_filters_speckled` shows that median filtering is much better than mean filtering for removing outliers. We might encounter this if something in the microscope is not quite functioning as expected or if dark noise is a problem, but otherwise we expect the noise in fluorescence microscopy images to produce few really extreme values (see {ref}`chap_formation_noise`).
de: {numref}`fig-processing_filters_spektled` zeigt, dass die Medianfilterung zum Entfernen von Ausreißern viel besser ist als die Mittelwertfilterung. Dies kann auftreten, wenn etwas im Mikroskop nicht ganz wie erwartet funktioniert oder wenn dunkles Rauschen ein Problem darstellt. Ansonsten gehen wir jedoch davon aus, dass das Rauschen in Fluoreszenzmikroskopiebildern nur wenige wirklich extreme Werte erzeugt (siehe {ref} `chap_formation_noise`).

source: Nevertheless, {menuselection}`Process --> Noise --> Remove Outliers...` provides an alternative if isolated bright values are present. This is a nonlinear filter that inserts median values _only whenever a pixel is found that is further away from the local median than some adjustable threshold_.
de: Dennoch bietet {menuselection}`Process --> Noise --> Remove Outliers...` eine Alternative, wenn isolierte helle Werte vorhanden sind. Dies ist ein nichtlinearer Filter, der Medianwerte nur dann einfügt, wenn ein Pixel gefunden wird, das weiter vom lokalen Median entfernt ist als ein einstellbarer Schwellenwert.

source: It's therefore like a more selective median filter that will only modify the image at pixels where it is considered really necessary.
de: Es handelt sich also um einen selektiveren Medianfilter, der das Bild nur an den Pixeln ändert, bei denen dies als wirklich notwendig erachtet wird.
