Repository: bioimage-book/bioimage-book.github.io
Catalog: locales/*/LC_MESSAGES/chapters/0-preamble/preface/preface.po
Languages: de, es

source: Preface
de: Vorwort
es: Prefacio

source: **I find bioimage analysis hard.**
de: **Ich finde die Bioimage-Analyse schwierig.**
es: **Se me hace difícil el análisis de bioimágenes.**

source: After working in the field for over 15 years, developing algorithms, software and workshops, I feel like I *should* have amassed some level of expertise -- but I still find pretty much every new project I attempt to be difficult. It remains common to find me wandering around the house, mumbling and grumbling to myself, while grappling with some tricky analysis problem whose solution eludes me.
de: Nachdem ich über 15 Jahre in diesem Bereich gearbeitet habe und Algorithmen, Software und Workshops entwickelt habe, habe ich das Gefühl, dass ich ein gewisses Maß an Fachwissen hätte ansammeln sollen – aber ich finde immer noch so ziemlich jedes neue Projekt, das ich versuche, schwierig. Es kommt immer noch häufig vor, dass ich im Haus herumlaufe, vor mich hin murmele und grummele, während ich mich mit einer kniffligen Analyseaufgabe auseinandersetze, deren Lösung mir entgeht.
es: Después de trabajar en este campo durante más de 15 años, desarrollando algoritmos, software y talleres, siento que *debería* haber acumulado cierto nivel de experiencia, pero todavía siento que casi todos los nuevos proyectos que intento son difíciles. Sigue siendo común encontrarme deambulando por la casa, murmurando y refunfuñando para mis adentros, mientras lidio con algún problema de análisis complicado cuya solución se me escapa.

source: If you want to read a book by someone who is pretty confident in their ability to quantitatively analyse whatever images come their way, this isn't the one for you.
de: Wenn Sie ein Buch von jemandem lesen möchten, der ziemlich sicher ist, dass er alle Bilder, die ihm in den Weg kommen, quantitativ analysieren kann, ist dies nicht das Richtige für Sie.
es: Si deseas leer un libro de alguien que confía bastante en su capacidad para analizar cuantitativamente cualquier imagen que se le presente, este no es el indicado para ti.

source: I'm self-reflective enough to recognize that I might just not be very good at what I (try to) do. Perhaps I'm ill-suited to a career that I tumbled into almost entirely by accident. However, I take some comfort in the fact that, as I get to know more and more image analysts, it seems that most (if not all?) of us find many aspects of our work pretty difficult.
de: Ich bin selbstreflexiv genug, um zu erkennen, dass ich vielleicht einfach nicht sehr gut in dem bin, was ich tue (versuche). Vielleicht bin ich für einen Beruf, in den ich fast rein zufällig geraten bin, nicht geeignet. Allerdings tröstet mich die Tatsache, dass die meisten (wenn nicht alle?) von uns, je mehr ich Bildanalysten kennenlerne, viele Aspekte unserer Arbeit als ziemlich schwierig empfinden.
es: Soy lo suficientemente autorreflexivo como para reconocer que tal vez no sea muy bueno en lo que (trato de) hacer. Quizás no soy apto para una carrera en la que comencé casi por accidente. Sin embargo, me consuela un poco el hecho de que, a medida que conozco a más y más analistas de imagen, parece que la mayoría (¿si no todos?) de nosotros encontramos muchos aspectos de nuestro trabajo bastante difíciles.

source: This isn't to say that *no one* finds analysing biological and biomedical images easy. I've encountered plenty of people who believe it's really quite simple: you can see the stuff in the image, now just detect it and quantify it. With ImageJ. Or AI. Or something. Set a threshold? Do whatever they did in that paper. Just have the summary plots for the group meeting next week, ok?
de: Das soll nicht heißen, dass *niemand* die Analyse biologischer und biomedizinischer Bilder einfach findet. Ich habe viele Leute getroffen, die glauben, dass es eigentlich ganz einfach ist: Man kann das Zeug auf dem Bild sehen, jetzt muss man es nur noch erkennen und quantifizieren. Mit ImageJ. Oder KI. Oder so. Einen Schwellenwert festlegen? Tun Sie, was auch immer sie in dieser Zeitung getan haben. Ich habe nur die zusammenfassenden Pläne für das Gruppentreffen nächste Woche, ok?
es: Esto no quiere decir que *a nadie* le resulte fácil analizar imágenes biológicas y biomédicas. Me he encontrado con mucha gente que cree que en realidad es bastante simple: puedes ver las cosas en la imagen, ahora solo detectalas y cuantifícalas. Con ImagenJ. O IA. O algo. ¿Establecer un umbral? Haz lo que hicieron en ese periódico. Sólo ten las graficas de resumen para la reunión del grupo la próxima semana, ¿vale?

source: The trouble is that, in my experience at least, this attitude tends to be found exclusively among people who are either too early or too late in their careers to actually have to sit in front of a computer and wrestle meaningful information from a billion uncooperative pixels. Those of us who *do* need to sit at the computer know that it's not that straightforward.
de: Das Problem ist, dass diese Einstellung, zumindest meiner Erfahrung nach, ausschließlich bei Menschen anzutreffen ist, die entweder zu früh oder zu spät in ihrer Karriere sind, um tatsächlich vor einem Computer sitzen zu müssen und einer Milliarde unkooperativer Pixel sinnvolle Informationen abzuringen . Diejenigen von uns, die am Computer sitzen müssen, wissen, dass das nicht so einfach ist.
es: El problema es que, al menos en mi experiencia, esta actitud tiende a encontrarse exclusivamente entre personas que están demasiado temprano o demasiado tarde en sus carreras para tener que sentarse frente a una computadora y extraer información significativa de mil millones de píxeles que no cooperan. Aquellos de nosotros que *necesitamos* sentarnos frente a la computadora sabemos que no es tan sencillo.

source: But I don't want to get too gloomy. Image analysis is hard, but there are good reasons not to give up.
de: Aber ich möchte nicht zu düster werden. Die Bildanalyse ist schwierig, aber es gibt gute Gründe, nicht aufzugeben.
es: Pero no quiero ponerme demasiado triste. El análisis de imágenes es difícil, pero hay buenas razones para no darse por vencido.

source: I would argue that the problem is *not* that the concepts are difficult. In fact, the most important ones are remarkably straightforward -- once you know about them. A lot of the maths is basic arithmetic.
de: Ich würde behaupten, dass das Problem *nicht* darin besteht, dass die Konzepte schwierig sind. Tatsächlich sind die wichtigsten davon bemerkenswert einfach – wenn man sie erst einmal kennt. Ein Großteil der Mathematik besteht aus Grundrechenarten.
es: Yo diría que el problema *no* es que los conceptos sean difíciles. De hecho, los más importantes son notablemente sencillos, una vez que los conoces. Muchas de las matemáticas son aritmética básica.

source: Rather, I'd say that image analysis is hard for two main reasons:
de: Ich würde eher sagen, dass die Bildanalyse aus zwei Hauptgründen schwierig ist:
es: Más bien, diría que el análisis de imágenes es difícil por dos razones principales:

source: **Images in biology are *enormously* varied.** Almost nothing 'just works'. I might find a paper describing a marvellous method to detect, classify and track cells -- but there is no guarantee the method will work to detect, classify and track *my* cells. Maybe I have a different type of cell. Imaged on a different kind of microscope. At a different spatial and temporal resolution. To answer a different question. In short, I have a very different computational challenge from the one described in the paper -- even if the shared theme of 'tracking cells' initially made it sound similar.
de: **Bilder in der Biologie sind *enorm* vielfältig.** Fast nichts „funktioniert einfach“. Vielleicht finde ich einen Artikel, der eine wunderbare Methode zum Erkennen, Klassifizieren und Verfolgen von Zellen beschreibt – aber es gibt keine Garantie dafür, dass die Methode zum Erkennen, Klassifizieren und Verfolgen *meiner* Zellen funktioniert. Vielleicht habe ich einen anderen Zelltyp. Abgebildet mit einem anderen Mikroskop. Mit einer anderen räumlichen und zeitlichen Auflösung. Um eine andere Frage zu beantworten. Kurz gesagt, ich habe eine ganz andere Rechenaufgabe als die, die in der Arbeit beschrieben wird – auch wenn das gemeinsame Thema der „Verfolgung von Zellen“ zunächst ähnlich klingen ließ.
es: **Las imágenes en biología son *enormemente* variadas.** Casi nada "simplemente funciona". Podría yo encontrar un artículo que describa un método maravilloso para detectar, clasificar y rastrear células, pero no hay garantía de que el método funcione para detectar, clasificar y rastrear *mis* células. Quizás tenga un tipo diferente de celula, tomada con otro tipo de microscopio. A diferente resolución espacial y temporal. Para responder a una pregunta diferente. En resumen, tengo un desafío computacional muy diferente al descrito en el artículo, incluso si el tema del "seguimiento de células" inicialmente lo hizo parecer similar.

source: **Bioimage analysis involves a lot of disciplines**. Analysing images in a scientifically justifiable way typically requires (at least a bit of) knowledge across a lot of domains. Of course it's necessary to know about the scientific question, e.g. the biology. But to really understand the data, you also need to know about the experimental setup, the imaging hardware, fundamental limits like noise and diffraction, and also how digital images are represented, stored and (sometimes) compressed. Then there are a plethora of image processing techniques that might help answer your scientific questions. You need to know not only what these are, but also how to assemble them together into a sequence of steps that work reliably and with minimal bias -- either using existing software or by writing new computer code. And finally statistics to bring it all together. It's a lot.
de: **Bioimage-Analyse umfasst viele Disziplinen**. Die wissenschaftlich fundierte Analyse von Bildern erfordert in der Regel (zumindest ein wenig) Wissen über viele Bereiche hinweg. Natürlich ist es notwendig, die wissenschaftliche Fragestellung zu kennen, z.B. die Biologie. Aber um die Daten wirklich zu verstehen, muss man auch den Versuchsaufbau, die Bildgebungshardware, grundlegende Grenzen wie Rauschen und Beugung kennen und auch wissen, wie digitale Bilder dargestellt, gespeichert und (manchmal) komprimiert werden. Dann gibt es eine Vielzahl von Bildverarbeitungstechniken, die Ihnen bei der Beantwortung Ihrer wissenschaftlichen Fragen helfen können. Sie müssen nicht nur wissen, was das ist, sondern auch, wie Sie sie zu einer Abfolge von Schritten zusammenfügen, die zuverlässig und mit minimaler Verzerrung funktionieren – entweder unter Verwendung bestehender Software oder durch das Schreiben von neuem Computercode. Und schließlich Statistiken, um alles zusammenzuführen. Das ist viel.
es: **El análisis de bioimágenes involucra muchas disciplinas**. Analizar imágenes de una manera científicamente justificable normalmente requiere (al menos un poco) de conocimiento en muchos dominios. Por supuesto, es necesario conocer la cuestión científica, p. la biología. Pero para comprender realmente los datos, también es necesario conocer la configuración experimental, el hardware de imágenes, los límites fundamentales como el ruido y la difracción, y también cómo se representan, almacenan y (a veces) comprimen las imágenes digitales. Luego existe una gran cantidad de técnicas de procesamiento de imágenes que podrían ayudar a responder sus preguntas científicas. Necesitas saber no sólo cuáles son, sino también cómo ensamblarlos en una secuencia de pasos que funcione de manera confiable y con un sesgo mínimo, ya sea usando software existente o escribiendo un nuevo código. Y finalmente estadísticas para unirlo todo. Es mucho.

source: But amidst all this variety lurk some of the positive things about image analysis: it's **creative**, it's **challenging** (most of the time in a good way), and -- because it's rare for any individual to be an expert in all the related domains -- it's usually **collaborative** (or at least it should be).
de: Aber inmitten all dieser Vielfalt lauern auch einige positive Aspekte der Bildanalyse: Sie ist **kreativ**, sie ist **herausfordernd** (meistens im positiven Sinne) und – weil dies bei einem Einzelnen selten der Fall ist ein Experte in allen verwandten Bereichen – es ist normalerweise **kollaborativ** (oder sollte es zumindest sein).
es: Pero en medio de toda esta variedad se esconden algunas de las cosas positivas del análisis de imágenes: es **creativo**, es **desafiante** (la mayoría de las veces en el buen sentido) y, porque es raro que un individuo sea un experto en todos los dominios relacionados; generalmente es **colaborativo** (o al menos debería serlo).

source: The fact that bioimage analysis is so cross-disciplinary means that pretty much everyone can have valuable insights to contribute.
de: Die Tatsache, dass die Bioimage-Analyse so interdisziplinär ist, bedeutet, dass praktisch jeder wertvolle Erkenntnisse einbringen kann.
es: El hecho de que el análisis de bioimágenes sea tan interdisciplinario significa que prácticamente todo el mundo puede tener conocimientos valiosos que aportar.

source: This underpins my motivation in writing this book: I want to explain the concepts I use every day as an image analyst to people who spend their days differently. No matter who you are, you know a huge amount of stuff I don't know. My hope is that if we put the stuff we know together, we'll do better research, faster.
de: Dies untermauert meine Motivation, dieses Buch zu schreiben: Ich möchte die Konzepte, die ich jeden Tag als Bildanalytiker verwende, Menschen erklären, die ihre Tage anders verbringen. Egal wer du bist, du weißt eine Menge Dinge, die ich nicht weiß. Ich hoffe, dass wir schneller und besser recherchieren können, wenn wir das, was wir wissen, zusammenfassen.
es: Esto sustenta mi motivación al escribir este libro: quiero explicar los conceptos que uso todos los días como analista de imagen a personas que pasan sus días de manera diferente. No importa quién seas, sabes una gran cantidad de cosas que yo no sé. Mi esperanza es que si reunimos todo lo que sabemos, podamos investigar mejor y más rápido.

source: The one instruction is: **be prepared to think hard.**
de: Die einzige Anweisung lautet: **Seien Sie bereit, intensiv nachzudenken.**
es: La única instrucción es: **prepárate para pensar mucho.**

source: When I'm confronted by an image analysis problem, my goal is never really to find the *right* way to do the analysis. That generally doesn't exist.
de: Wenn ich mit einem Bildanalyseproblem konfrontiert werde, besteht mein Ziel nie wirklich darin, den *richtigen* Weg für die Analyse zu finden. Das gibt es im Allgemeinen nicht.
es: Cuando me enfrento a un problema de análisis de imágenes, mi objetivo nunca es realmente encontrar la forma *correcta* de realizar el análisis. Eso generalmente no existe.

source: Instead, my goal is to find the *least wrong* way to do the analysis -- and to be able to understand and explain whatever lingering limitations and biases can't be entirely overcome. It can be frustrating, I still don't feel terribly good at it, but it is -- in its own strange way -- kind of *enjoyable*. There's always something new to learn, and some new angle from which to look at the problem. And each new angle can help us wring more drops of knowledge out of our data.
de: Stattdessen besteht mein Ziel darin, den *am wenigsten falschen* Weg für die Analyse zu finden – und in der Lage zu sein, alle verbleibenden Einschränkungen und Vorurteile zu verstehen und zu erklären, die nicht vollständig überwunden werden können. Es kann frustrierend sein, ich fühle mich immer noch nicht besonders gut darin, aber es ist – auf seine eigene seltsame Art – irgendwie *vergnüglich*. Es gibt immer etwas Neues zu lernen und einen neuen Blickwinkel, um das Problem zu betrachten. Und jeder neue Blickwinkel kann uns helfen, mehr Wissen aus unseren Daten herauszuholen.
es: En cambio, mi objetivo es encontrar la forma *menos errónea* de hacer el análisis y ser capaz de comprender y explicar cualquier limitación y sesgo persistente que no pueda superarse por completo. Puede ser frustrante, todavía no me siento muy bien haciéndolo, pero es, a su manera, algo *agradable*. Siempre hay algo nuevo que aprender y algún nuevo ángulo desde el cual mirar el problema. Y cada nuevo ángulo puede ayudarnos a extraer más conocimientos de nuestros datos.

source: My hope is that this book will help introduce others find the weird, frustrating pleasure of thinking more deeply about scientific images. Through this, I hope it might make a small contribution towards helping us do image analysis a bit better.
de: Ich hoffe, dass dieses Buch anderen dabei hilft, das seltsame, frustrierende Vergnügen zu entdecken, das tieferes Nachdenken über wissenschaftliche Bilder mit sich bringt. Ich hoffe, dass es dadurch einen kleinen Beitrag dazu leisten kann, dass wir die Bildanalyse etwas besser machen können.
es: Mi esperanza es que este libro ayude a que otros encuentren el extraño y frustrante placer de pensar más profundamente en las imágenes científicas. A través de esto, espero que pueda hacer una pequeña contribución para ayudarnos a realizar un análisis de imágenes un poco mejor.
